{
  "imDbId": "tt4786824",
  "title": "The Crown",
  "fullTitle": "The Crown (TV Series 2016–2023)",
  "type": "TVSeries",
  "year": "2016",
  "items": [
    {
      "username": "TouchTheGarlicProduction",
      "userUrl": "https://www.imdb.com/user/ur52832854",
      "reviewLink": "https://www.imdb.com/review/rw3574435",
      "warningSpoilers": false,
      "date": "4 November 2016",
      "rate": "7",
      "helpful": "629 out of 681 found this helpful.",
      "title": "Slick and well executed, the Crown is drama at its finest.",
      "content": "The Crown boasts no action sequences or big movie stars, and yet it is one of the most expensive shows of all time. Why? Because of the sheer attention to detail. Aside from the fully historically accurate costumes and locations, the show is just gorgeous to look at. The lighting, the cinematography, and everything else visual about it is on point. It's quite apparent none of that money went to waste.The show doesn't just look gorgeous, though. It is also compelling, well written, and well performed. In fact, almost every element is perfectly executed, which means that no single one stands out above the rest, but rather they work in harmony. And that is the show's greatest success; the fact that it all comes together smoothly into a neat, binge-able, high quality package.Mind you, the reason I enjoy the Crown so much is that I knew what to expect when I went into it. This is NOT a fast-paced, action-packed, edge-of-your-seat experience. It is a character drama about the royal family. It runs at a slow pace. Yet it is gripping all the same. That's why it is so good to know that Netflix made such a large investment in this series; they're taking chances and funding original and unusual things in an era when Hollywood is afraid to do anything that isn't already an existing intellectual property. I hope that the Crown blows up like Stranger Things. I hope it gets all the attention it deserves."
    },
    {
      "username": "jaimemedina-36288",
      "userUrl": "https://www.imdb.com/user/ur78124884",
      "reviewLink": "https://www.imdb.com/review/rw8557763",
      "warningSpoilers": false,
      "date": "20 September 2022",
      "rate": "9",
      "helpful": "57 out of 63 found this helpful.",
      "title": "Brilliant",
      "content": "I have to be honest. I had refused to watch this show from the moment it was released. Being no fan of monarchies in general, or of the House of Windsor in particular, I wrongly failed to see the potential.But history always is interesting, especially when left in the hands of able writers and an absolutely spectacular cast. To a person, word for spoken word, I was drawn into this series headlong and found myself taken by this expertly crafted story.I love that the flaws and tensions that existed are exposed and leveraged. And I find myself reaching for the shelf and pulling out a book or two to refamiliarize myself with some event.In short it won me over and taught me a lesson or two in the process. What more can one ask?"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw5746929",
      "warningSpoilers": false,
      "date": "17 May 2020",
      "rate": "9",
      "helpful": "71 out of 81 found this helpful.",
      "title": "Brilliant!",
      "content": "The Crown is simply a brilliant piece of television. It's one of the most expensive shows ever made and you can tell because the production and attention to detail is amazing. I originally put off watching this because I thought it was a show aimed from women but I couldn't have been more wrong. It is for everyone! Even when they changed the main characters in Season 3 because of the time jump it didn't lose a beat. Both Claire Foy and Olivia Colman both lead amazing casts who all deserve all the praise this show gets!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8576876",
      "warningSpoilers": false,
      "date": "30 September 2022",
      "rate": "9",
      "helpful": "48 out of 54 found this helpful.",
      "title": "Brilliant!!",
      "content": "What can I say about The Crown that hasn't already been said? It's incredible! There are some that don't like it because they take some liberties with the story but overall it's pretty accurate, especially the first few seasons. You can tell the amount of effort they put into this show from everything from the writing, acting, cinematography, production, etc. All being as good as it gets for a television show. It chronicles the life of Queen Elizabeth II and the royal family from the 1940's to modern times. It gives you an inside look at the personal lives of the royal family including their romances and political rivalries. There's a reason this show has won so many awards and that's because it's brilliant!"
    },
    {
      "username": "lisacarlson50",
      "userUrl": "https://www.imdb.com/user/ur62164515",
      "reviewLink": "https://www.imdb.com/review/rw3578519",
      "warningSpoilers": false,
      "date": "11 November 2016",
      "rate": "10",
      "helpful": "177 out of 213 found this helpful.",
      "title": "A Visual Stunner",
      "content": "Regardless of what you may think of the Royals Netflix has poured a ton of money into this exquisite production about the life of Queen Elizabeth. It is a show which requires fixed attention as things progress at a unhurried pace. The opening musical evolution is enchanting and never grows old. Actress Claire Foy is beautifully riveting in the role of Elizabeth; someone who wants to have a normal life and yet is made to feel her duty as Queen should be the highest priority. It has been suggested the Queen is warm, has a sense of humor, is compassionate and this portrayal conveys it. She is wise enough to realize she's going to have to forge her own way as those around her are stymied in their own limitations or ignorance. John Lithgow transforms into Winston Churchill and is equally stellar. Their scenes together are superb. If Peter Morgan's research is accurate I can fully appreciate how Princess Diana must have felt. The show is rounded out by a wonderful supporting cast. This show is my favorite Netflix production so far."
    },
    {
      "username": "magnoliacream",
      "userUrl": "https://www.imdb.com/user/ur118605093",
      "reviewLink": "https://www.imdb.com/review/rw8546080",
      "warningSpoilers": false,
      "date": "15 September 2022",
      "rate": "9",
      "helpful": "29 out of 33 found this helpful.",
      "title": "Engrossing highlights of Queen Elizabeth II's reign",
      "content": "The crown depicts the highlights of Elizabeth II's life from just before she became queen through the vicissitudes of being the symbolic head of one of the world's most powerful nations. Just a young married mother when she ascended the throne at age 25 in 1952, she survived one prime minister after another, family scandals that rocked the world and tragedies both national and personal. Her marriage with Phillip of Mountbatten, while rocky at first, became one of the pillars of strength which she leaned on.Through it all, Elizabeth remained ever aware of her divinely-anointed responsibility to put the well-being of the crown above everything on earth, even above her family and herself. And this is one aspect of the British monarchy that I find most admirable, even relevant - how monarchs like Victoria, Elizabeth I and Elizabeth II take their duty to the crown utterly seriously. One of the coronation rites mentioned in the drama was the anointing of Elizabeth as queen. This part of the ceremony is not shown to the public and was not shown onscreen. But it greatly intrigued me because of how powerfully it seemed to have affected the monarchs, making them faithful and dedicated to the crown. If only all heads of states around the world are as serious and dedicated to their duties!The drama is well directed and acted. It is reported to be among the most expensive TV series and it shows. The quality of production is top-notch."
    },
    {
      "username": "shoppsi",
      "userUrl": "https://www.imdb.com/user/ur59518683",
      "reviewLink": "https://www.imdb.com/review/rw8536354",
      "warningSpoilers": false,
      "date": "11 September 2022",
      "rate": "10",
      "helpful": "37 out of 43 found this helpful.",
      "title": "Binge Watching after the Death of Queen Elizabeth 2",
      "content": "Queen Elizabeth 2 just passed away and I have been binge watching almost all of Season one in the past 2 days since she died, may she rest in peace.This is so good. I don't know how I missed it when it came out back in 2016, but I'm so happy to get to watch it on Netflix now.It is riveting, beautiful, and moving, and I'm so looking forward to watching the rest.It was moving, watching the king die on the show and seeing young Queen Elizabeth first starting out, when now in real life she has passed and her son Charles is now King and taking over. Gives a real sense of time moving on and stopping for no one."
    },
    {
      "username": "linnet100",
      "userUrl": "https://www.imdb.com/user/ur2955288",
      "reviewLink": "https://www.imdb.com/review/rw3581132",
      "warningSpoilers": false,
      "date": "16 November 2016",
      "rate": "10",
      "helpful": "169 out of 197 found this helpful.",
      "title": "This is simply Outstanding",
      "content": "Every so often a drama comes along that takes away your breath. Sometimes that's subjective, other times objective. Dramas such as The Jewel in the Crown, The West Wing, Game of Thrones, House of Cards, Downton Abbey, House M.D. have all stood at the pinnacle of television drama.The Crown is right up there at the very top. It is outstanding in every way: faultless. From brilliant dramatisation to acting to score to cinematography: everywhere you look it commands.Watch it. You won't regret it. You will remember one of those television 'moments' that come along all too rarely."
    },
    {
      "username": "moviemom23",
      "userUrl": "https://www.imdb.com/user/ur67612591",
      "reviewLink": "https://www.imdb.com/review/rw5265074",
      "warningSpoilers": true,
      "date": "18 November 2019",
      "rate": "7",
      "helpful": "113 out of 150 found this helpful.",
      "title": "Season 3 Ep. 6 still not used to Colman",
      "content": "I almost didn't watch S. 3 at all when I heard Foy was out and Colman was in. Frankly, it's a different show. Colman is completely miscast. In a major way, it's her appearance but it's also her acting. You get the feeling there's a soulfulness she's fighting down deep, but with Foy you didn't have that and it was just more Right for a queen. I can't explain it she's just not good in this role. Foy had that royal stoicness was about her, Colman is too clunky. The overwrought Ep. 3, which could have been so powerful if not for Colman's performance. The beginning was excellent then the Queen appears and it's ruined. The ending of that episode was just plain bad- predictable and fake.The writing seems to have suffered some too.I adore Helena Bonham Carter but again her appearance also is so distracting. She's a completely different character. The previous Margaret was So Much Better and I keep comparing her to the old one as I watch. It honestly makes it difficult to concentrate on what's going on!All I can say is, yes, I'll see it to the end despite my extreme disappointment with the change of actresses.It's not as noticeable with Prince Phillip, but agewise all 3 previous actors could have been made up to age. It's 15 years later but this Queen and Margaret look 30+ years older! Colman looks nothing like Queen E 2 and in addition both Bonham Carter and Colman have deep-set dark brown eyes it's just not surmountable even if the acting was 1000 percent and it's just not. Just so terribly miscast. A shame. Every episode I watch I'm thinking: if only...."
    },
    {
      "username": "qais_kawar",
      "userUrl": "https://www.imdb.com/user/ur66562298",
      "reviewLink": "https://www.imdb.com/review/rw5269581",
      "warningSpoilers": false,
      "date": "20 November 2019",
      "rate": "10",
      "helpful": "61 out of 73 found this helpful.",
      "title": "A Majestic series",
      "content": "By season 3, the series has kept a high level of professionalism, acting, and story even when they changed every single actor !! Such an extraordinary series !!"
    },
    {
      "username": "Britinmiami",
      "userUrl": "https://www.imdb.com/user/ur6500157",
      "reviewLink": "https://www.imdb.com/review/rw5268760",
      "warningSpoilers": false,
      "date": "20 November 2019",
      "rate": "10",
      "helpful": "44 out of 54 found this helpful.",
      "title": "Brilliant TV",
      "content": "This is a great series, and for older Brits (Baby boomers), the historical significance is stunning. The first series of actors did an excellent job, and now we are into the second series, and the acting just got better and better!Olivia Coleman is brilliant, as usual. The episode on the Welsh disaster in Aberfan was so well done and very sad. I intend to watch this many times as it is of high quality. I wish all TV were this good and such a high standard.Binge it!"
    },
    {
      "username": "hyacintoblack",
      "userUrl": "https://www.imdb.com/user/ur25572191",
      "reviewLink": "https://www.imdb.com/review/rw5276545",
      "warningSpoilers": false,
      "date": "23 November 2019",
      "rate": "7",
      "helpful": "43 out of 54 found this helpful.",
      "title": "S3. Good but... what were they thinking",
      "content": "Olivia Colman as Queen Elizabeth, Helena Bonham Carter as Margaret? Such bad casting. Olivia has a rough face and looks angry most of the time throughout the episodes. Helena Bonham Carter, although a great actress, doesn't do Margaret any justice at all (she doesn't look anything like Margaret) The first two series were much better because of the actors. Series 3 has great topics but the actors were cast wrongly except the nun princess Alice and prince Charles. They were excellent."
    },
    {
      "username": "michelle_kummer",
      "userUrl": "https://www.imdb.com/user/ur63109475",
      "reviewLink": "https://www.imdb.com/review/rw8668098",
      "warningSpoilers": true,
      "date": "11 November 2022",
      "rate": "10",
      "helpful": "21 out of 26 found this helpful.",
      "title": "Season 5 disappoints",
      "content": "I had been looking so forward to season 5 only to be disappointed.It was so boring compared to the previous seasons, Claire Foy played the best queen and did the middle aged queen.Unfortunately season 5 the cast all but Diana don't look like the real life royals. Charles was miscast the actor is good, however they could have used some prosthetics for the big ears and nose. He was far too handsome compared to the real Charles, Camilla looks like Camilla, Philip doesn't resemble the real one either.The actress that plays Diana tries a little too hard always with those doe eyes Diana was charming, sweet and charismatic.It was interesting about the Tzars and seeing Diana visiting her brother and the breaks failing, knowing her phone was hacked.. they tackled some of the taboo subjects including Philips affair. I didn't know he called the Queen Cabbage she always did look so old even when young.Hopefully season 6 is better as this was way too boring I lost interest in every episode."
    },
    {
      "username": "Davalon-Davalon",
      "userUrl": "https://www.imdb.com/user/ur3656525",
      "reviewLink": "https://www.imdb.com/review/rw8766557",
      "warningSpoilers": true,
      "date": "30 December 2022",
      "rate": "3",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Season 5 Review",
      "content": "I, like many others, was riveted to Seasons 1-4 of \"The Crown.\" I thought both Claire Foy, as the young Queen, and Olivia Colman, as the middle-aged Queen, were stellar. Other key players did an outstanding job as well, and I felt swept up into the private world of \"The Royals.\"But then... Season 5. Elizabeth Debicki as Princess Diana offers an uncanny impersonation. There were times I felt I was looking at the real Diana. It was almost spooky. But as each episode of Season 5 passed, I felt like I was looking at mannerisms more than I was looking at acting skills.Imelda Staunton as the \"senior citizen\" Queen... I'm sorry, but, an absolute no. She is a superb actress and certainly deserved her Oscar nomination in \"Vera Drake.\"But in \"The Crown,\" at just 152cm, she didn't come close to the real Queen (160). No matter what kind of crowns or jewels or color-coordinated clothes and bags the costumers adorned her with, every time she made an entrance, she looked like the offspring of a Munchkin from the \"The Wizard of Oz\" and Zira from \"Planet of the Apes.\" It was so distracting that I could barely watch the show. Also, while Jonathan Pryce is a wonderful actor, he simply did not give off the great \"Prince Philip\" vibes that were evident with Tobias Menzies in Seasons 3 and 4. Menzies had Philip's voice and mannerisms down to a science, where as Pryce felt like he walked in from the set of a different show.As Season 5 plods along, I felt: what exactly is the point? It certainly wasn't about \"The Crown\" -- the part of Queen Elizabeth has been reduced to a dowdy senior who plays with her corgis, wears sensible shoes and drinks tea in fine china cups, all while wearing a helmet-like wig that would look great in a wax museum.Were we, as an audience, supposed to feel sympathy for this family? Were we supposed to care? Essentially the show is saying that the royal family was already obsolete. In fact, the only person that brought new life to it was Diana, but since Charles was absolutely obsessed with Camilla, and did not seem to have a moment of concern for Diana, her feelings, her future, anything about her... why would we care?Diana is portrayed as a very real, feeling, loving person who got swept up in this odd group of repressed individuals who were play-acting at life, their roles vaguely defined, their purposes questionable at best. And Season 5 really spent a lot of time focusing on Diana and Charles and the downfall of their relationship(s). Of course, Diana was in every horrid tabloid on earth, everyone speculating about her, everyone cashing in on her. It was unforgivable. And we get a sense of that in Season 5, no doubt.But in comparison to Seasons 1-4, Season 5 was muted, with a few startling moments, lots of great cinematography and fairly dull storylines, despite grand efforts to breathe life into them."
    },
    {
      "username": "muratpsy",
      "userUrl": "https://www.imdb.com/user/ur59922846",
      "reviewLink": "https://www.imdb.com/review/rw5267998",
      "warningSpoilers": true,
      "date": "19 November 2019",
      "rate": "10",
      "helpful": "90 out of 112 found this helpful.",
      "title": "s3 ep6 tywysog cymru",
      "content": "I never thought that I would feel sorry for Prince Charles until I watch s3 ep6"
    },
    {
      "username": "dsmithchesterfield",
      "userUrl": "https://www.imdb.com/user/ur56258534",
      "reviewLink": "https://www.imdb.com/review/rw3574911",
      "warningSpoilers": false,
      "date": "4 November 2016",
      "rate": "10",
      "helpful": "251 out of 293 found this helpful.",
      "title": "Acting at its finest",
      "content": "Where to start is very difficult when it comes to what I can only describe as an amazing feat of production and acting. The cast are absolutely outstanding and are nothing but professional.You can tell a lot of effort has been put into the research and accuracy of the story line. The attention to detail also has to be credited.I can't find a fault and believe me I've tried. Having watched previous biopics/Dramas regarding royalty I will have to put this at the Top and that is including The Queen which again I would rate at 10/10.In summery a must watch if you are looking for a great piece of production and a stimulating story line. I would recommend this to anyone."
    },
    {
      "username": "cala3",
      "userUrl": "https://www.imdb.com/user/ur4829482",
      "reviewLink": "https://www.imdb.com/review/rw5294699",
      "warningSpoilers": false,
      "date": "2 December 2019",
      "rate": "5",
      "helpful": "69 out of 87 found this helpful.",
      "title": "Season 3 is a huge disappointment",
      "content": "Claire Foy was absolutely on point as the Queen in Season 1 and 2. Why mess with that? They totally could have altered her appearance to age her. I love HBC but I don't see her as Princess Margaret.... This season is so dreadfully slow and lacking in any momentum.What a disappointment"
    },
    {
      "username": "elstrtv",
      "userUrl": "https://www.imdb.com/user/ur153298998",
      "reviewLink": "https://www.imdb.com/review/rw8550154",
      "warningSpoilers": false,
      "date": "17 September 2022",
      "rate": "8",
      "helpful": "21 out of 25 found this helpful.",
      "title": "Well-made!",
      "content": "Very stable show) it's quite interesting, well-made by all seasons. It has some prolonged episodes but there are so much ahead))I liked first season the most! I really annoyed 1-2 seasons cast but 3-4 seasons cast is not that bad) Partly it's really-really good!In 4 season I expected and wanted more of Diana but I suppose we will see it in the 5th.Decorations and costumes are just perfect.I can't say it's a perfect show but it's pretty good. It's not always so much interesting but interesting enough to watch 4 seasons and be waiting to next one))I would recommend it to people who really wants to know the history/politic history of Great Britain."
    },
    {
      "username": "mccann3010",
      "userUrl": "https://www.imdb.com/user/ur52948639",
      "reviewLink": "https://www.imdb.com/review/rw5269013",
      "warningSpoilers": false,
      "date": "20 November 2019",
      "rate": "10",
      "helpful": "68 out of 80 found this helpful.",
      "title": "Wow! Tremendous series and the period details are painstaking and luscious",
      "content": "I watched with bated breath as Olivia Coleman took over from Claire Foy. Coleman embodies a mature Elizabeth, one who is calcified into a Royal with a stoic countenance, dowdy wardrobe, and a hint of what the crown has given and cost her.What really blew me away was the lavish attention to detail and period. The public and private spaces are painted in luscious colors, the furniture upholstered with richly hued brocade (so are the women come to think of it). The salons and libraries decorated with massive wood furniture. It's not comfortable - you can almost feel the drafty cold circulating throughout the palace, but it is a showstopper. No wonder they wore wool sweaters and tartan wool suits while lounging about."
    },
    {
      "username": "shoshanim",
      "userUrl": "https://www.imdb.com/user/ur95733464",
      "reviewLink": "https://www.imdb.com/review/rw8669183",
      "warningSpoilers": true,
      "date": "11 November 2022",
      "rate": "7",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Season 5 Interesting",
      "content": "Wow! A lot of complaints about this season. Not sure what you were expecting, but hey folks, it's a TV show, with a lot of embellishment thrown into the facts of the time. That's pretty much the definition of drama.I Thought it was good, and had a lot of interesting insights into the characters, whether 100% accurate or not, it made you think. This time the Queen did appear more stoic than earlier seasons, but I found that to be completely understandable as the times depicted in this season the very monarchy itself was literally under siege - not a good time to get all emotional and wobbly. I imagine it was not the real Queen's favorite period either.Absolutely loved the episode involving the one time valet to the Duke of Windsor. Thought it was unique and touching. And I never knew that background of the Fayed family, and the fathers obsession with the royals.The episode involving Bashir's deceitful trickery to get Diana to do that disastrous BBC interview was really a shocker, and only recently been totally proven to be true, some 25 years later.As for Diana, if she was anything like the character portraying her in this season she was probably the most stupid and emotionally immature person imaginable. Good grief.I am not excusing Charles at all for duping her into marrying him when he new damn well he not only didn't love her but was in love with someone else. And blaming his parents for pressuring him is equally duplicitous as he had a hundred ways he could have ended that charade before ever walking down the aisle.Anyway, that's my two cents - and then some- but in all I enjoyed it. So relax and you will too."
    },
    {
      "username": "mhtannous",
      "userUrl": "https://www.imdb.com/user/ur74712170",
      "reviewLink": "https://www.imdb.com/review/rw8665144",
      "warningSpoilers": false,
      "date": "9 November 2022",
      "rate": "8",
      "helpful": "28 out of 33 found this helpful.",
      "title": "Huge fan, but season 5?",
      "content": "What happened in season five?I'm 5 episodes in and they seem to have abandoned their format.Before it was real life historical events in Britain jusxtosposed against how the royal family was effected or involved.This tension created the drama.Without the historical Britain piece I am just watching boring, spoiled characters.The show really suffered this season.I was so excited for it. And it's just not the same show this season.Characters are \"all right\". But their plots droll on.There isn't enough to fill ten episodes.I'm not British, but it does sort of feel like an agenda.Or they over edited it after the Queens death so as not to \"affect her legacy."
    },
    {
      "username": "martinrandall-36706",
      "userUrl": "https://www.imdb.com/user/ur135021243",
      "reviewLink": "https://www.imdb.com/review/rw8796940",
      "warningSpoilers": true,
      "date": "13 January 2023",
      "rate": "2",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Season 5 Tanked (Rating is for S5 Only)",
      "content": "After 4 seasons of brilliant acting and storytelling, season 5 was a bitter disappointment. I kept hoping that the mediocrity displayed in the first few episodes was the result of the new major cast members getting their bearings. Nope.Each S5 episode languished in needlessly long and tortured dialogue that left me bored, very bored. While some of the storylines promised excitement like Ipatiev House, the viewer's interest was soon extinguished, buried under a pile of pointless conversations that droned on incessantly.About the cast, Dominic West is the most un-Charles like actor imaginable. He is simply awful in the role and comes off as a complete idiot. Imelda Staunton as the Queen is also mis-cast. She is a fine actor but just so very wrong in this role. Her Elizabeth comes off as a moronic cold fish who needs her grandson to explain not all television comes from the BBC and how to change the channel on the royal TV.Two cast members were however absolutely brilliant. Jonathan Pryce as Philip actually makes the man likeable, which is not an easy task! Elizabeth Debicki as Diana is beyond brilliant, she so nails the part you can easily imagine you are watching old footage of the actual person. Well done, both!Let's all hope for a better Season 6 but I for one am not holding my breath."
    },
    {
      "username": "sarah_sle",
      "userUrl": "https://www.imdb.com/user/ur37872955",
      "reviewLink": "https://www.imdb.com/review/rw5419680",
      "warningSpoilers": false,
      "date": "19 January 2020",
      "rate": "5",
      "helpful": "102 out of 142 found this helpful.",
      "title": "Would have been a 10",
      "content": "Why, why, why did they think they needed to change the whole staff?! I was very invested in the actors from 1&2 and then everyone is gone! And these new ones don't even resemble the others at all!! Whoever thought this was a good idea is crazy! Lost another viewer!"
    },
    {
      "username": "koofasa",
      "userUrl": "https://www.imdb.com/user/ur6927864",
      "reviewLink": "https://www.imdb.com/review/rw6274921",
      "warningSpoilers": false,
      "date": "15 November 2020",
      "rate": "7",
      "helpful": "55 out of 80 found this helpful.",
      "title": "Like every other decent show...",
      "content": "This show was highjacked by that group of Hollywood ideologues that insists on rewriting history. Queen Elizabeth was never an activist and I don't think she hated Margaret Thatcher the way the show portrays in season 4. I really enjoyed the first 3 seasons of the show because it was so well presented in a more-or-less honest way. Delicate issues were handled carefully and much was left to our imagination. Not so in Season 4. Here QEII is a full on leftist activist. It is uncomfortable because it is so false. If the producers had to show us their contempt for Thatcher, there were so many honest ways to do that. Thrusting this belief system on the queen with no proof is like the fake news we see on BBC. So sad but definitely predictable. In the late 1970's the world was in a deep recession with inflation. We called it stagflation. Interest rates and unemployment were very high. There were long lines for gas in the US. That's when the world turned right and elected Reagan and Thatcher who pulled the western world out of the economic doldrums. The Crown is rewriting history for 2020 political purposes. I was there and this show is misrepresenting history."
    },
    {
      "username": "punchup",
      "userUrl": "https://www.imdb.com/user/ur0272121",
      "reviewLink": "https://www.imdb.com/review/rw8685633",
      "warningSpoilers": false,
      "date": "20 November 2022",
      "rate": "6",
      "helpful": "21 out of 23 found this helpful.",
      "title": "Season 5 Letdown",
      "content": "I loved every minute of the series until season five came along. The actor playing Prince Charles looks nothing like him physically, in demeanor, as well as body language, speech and movement. The woman playing Princess Diana is mugging in the worst possible way by straining her neck downward and pushing her eyes upward constantly. It is painful to watch! She also towers over all the other actors in every scene to a distracting level. How could such a fine show have such terrible casting choices? I've watched the first three episodes, and they all have stories that really go nowhere and seem to addresses side issues that barely pertain to the royal family at all as in past episodes. Previous seasons, placed the activities of the royal family in the context of larger historical movements in this season, seems to have a little interest in that. I'm sorry to say this series has \"jumped the shark\" as they say."
    }
  ],
  "errorMessage": ""
}