{
  "imDbId": "tt3398228",
  "title": "BoJack Horseman",
  "fullTitle": "BoJack Horseman (TV Series 2014–2020)",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "ahmedgorshy",
      "userUrl": "https://www.imdb.com/user/ur106582401",
      "reviewLink": "https://www.imdb.com/review/rw6064731",
      "warningSpoilers": false,
      "date": "5 September 2020",
      "rate": "10",
      "helpful": "244 out of 252 found this helpful.",
      "title": "The story of a horse that changed my life",
      "content": "The story of a horse that changed my life. Yes Bojack Horseman is simply something more than an animation series about animals and humans living together, not that it is much bigger than that. At first, I strongly objected to the evaluation of the first episode of Bojack, which scored 7.1, man. What is that? I watched it four times and laughed the same amount each time. Anyway, let's start the review. The first season was hugely funny and intelligent, but nothing was measured by the rest of the seasons. The series starts from the second season and reaches its climax in the third and continues to evolve until the last episode that will leave you feeling a great emptiness around you after you finish this great show Bojack is one of my top 10 so I won't talk more than that. One of the few offers that deserves a high rating. My rating 9.8"
    },
    {
      "username": "freemantle_uk",
      "userUrl": "https://www.imdb.com/user/ur17571044",
      "reviewLink": "https://www.imdb.com/review/rw5595920",
      "warningSpoilers": false,
      "date": "31 March 2020",
      "rate": "10",
      "helpful": "86 out of 89 found this helpful.",
      "title": "The best adult animated show",
      "content": "Who would have thought that a show about an anthropomorphic horse set in Hollywood would be one of the most human shows ever made. That was what Raphael Bob-Waksberg managed with BoJack Horseman. It's a show that's hilarious and dramatic, satirical and tragic as we follow BoJack Horseman and his friends through the trials of life. The show could be nilhilistic and the characters could be prophetic about their own destinies *couch* Sarah-Lynn *couch.* BoJack Horseman offers up on the best portraits on issues like mental health and addiction and doesn't sugarcoat anything. This makes the show so relatable and lets it stand out."
    },
    {
      "username": "Johnny-the-Film-Sentinel-2187",
      "userUrl": "https://www.imdb.com/user/ur24085266",
      "reviewLink": "https://www.imdb.com/review/rw4156021",
      "warningSpoilers": false,
      "date": "6 May 2018",
      "rate": "10",
      "helpful": "198 out of 210 found this helpful.",
      "title": "Netflix has made a cartoon for the ages!",
      "content": "BoJack Horseman is what modern Family Guy wishes it could be and then some; it's a black-comedy-drama show that looks into the life of a washed up television actor who's struggling to find happiness in his life and ultimately remains unsuccessful in achieving that. Who'd have thought a cartoon about an anthropomorphic horse would end up being one of the deepest things currently on television? I'm genuinely surprised by what this show had to offer for me the first time I watched it. The first season's initial half is a little slow, but from then on BoJack transcends into a wacky comedy-drama that is one of the bravest shows to confront the issues of depression, anxiety, loneliness and nostalgia.I love this show. I can hardly fault it for anything besides the initially-slow premiere episodes, which I still reckon are great entertainment in and of themselves. This is a show that rewards your patience and loyalty to it ten-fold.Netflix's animation achievement gets 5/5 stars."
    },
    {
      "username": "jwwalrath-227-85487",
      "userUrl": "https://www.imdb.com/user/ur29496881",
      "reviewLink": "https://www.imdb.com/review/rw5496568",
      "warningSpoilers": false,
      "date": "20 February 2020",
      "rate": "10",
      "helpful": "31 out of 31 found this helpful.",
      "title": "Superb dark comedy",
      "content": "In a world populated by both people and anthropomorphic animals, Bojack Horseman (voiced by Arrested Development and SNL's Will Arnett) follows the life of the titular horse, a former sitcom star. Bojack isn't the best person and has a lot of emotional and mental issues. I loved this show and consider it one of the best adult animated programs of all time.This dark comedy is an excellent analysis of human nature, mental health, and the question of redemption. Be prepared that Bojack really does some awful things, though the show wisely paces them out. Yet, the show also manages to make you feel for Bojack. To clarify, the show never validates his actions. In fact, there is self-criticism of the its own anti-hero genre. The writing, characterization, and use of continuity in this show is EXCELLENT.Though the last paragraph makes this sound super dramatic, there's plenty of comedy and it's really, really funny. There is some really cutting satire of Hollywood and showbusiness. The show does a good job of balancing the darker aspects with lighter stuff. Bojack's goofy, carefree longtime house guest Todd (Breaking Bad's Aaron Paul) is a great balance with his wacky misadventures.Also, this is that rare show that never drops a beat. All six seasons are quality, including the last one whose cancellation was sudden.I can't recommend this enough. This show is pure genius."
    },
    {
      "username": "doomedmac",
      "userUrl": "https://www.imdb.com/user/ur111092901",
      "reviewLink": "https://www.imdb.com/review/rw5370099",
      "warningSpoilers": false,
      "date": "31 December 2019",
      "rate": "9",
      "helpful": "41 out of 44 found this helpful.",
      "title": "Excellent",
      "content": "One of the best things to ever come from Netflix, BoJack Horseman is excellent. The characters feel extremely real. They are flawed, but learn and grow as the show progresses. More people need to watch this showz"
    },
    {
      "username": "madcaesars",
      "userUrl": "https://www.imdb.com/user/ur87625728",
      "reviewLink": "https://www.imdb.com/review/rw5450894",
      "warningSpoilers": false,
      "date": "1 February 2020",
      "rate": "10",
      "helpful": "208 out of 216 found this helpful.",
      "title": "After season 6 episode 15 this show is a 10 for me.",
      "content": "One of the best and most emotional episodes ive ever seen in a tv show. This is a masterpiece, this is an experience."
    },
    {
      "username": "Suicide_Saint",
      "userUrl": "https://www.imdb.com/user/ur3925693",
      "reviewLink": "https://www.imdb.com/review/rw3073922",
      "warningSpoilers": false,
      "date": "23 August 2014",
      "rate": "9",
      "helpful": "159 out of 175 found this helpful.",
      "title": "A Surprisingly Entertaining Series",
      "content": "Like the incessant influx of superhero films currently pervading Hollywood, \"adult\" animation has become a genre that borders upon an overstayed welcome. As a result, my personal expectations for the Netflix original series \"BoJack Horseman\" were not particularly high, but I do like to keep an open mind. Much to my delight, the series provides humor, drama, well-written and connected story lines as well as solid character development. BoJack is simultaneously a disdainful but overall likable character performed wonderfully by Will Arnett. He is joined by a fabulous cast of characters / voice actors that instantly bring this show to the level of other modern animated successes such as Bob's Burgers. In fact, I could absolutely have pictured H. Jon Benjamin as BoJack, but he already seems to lend his voice talents to so many different areas. The series also provides a fairly original artistic presentation as the characters almost resemble a painted portrayal at times. The show is not only humorous, but also covers subjects such as unrequited love, self-loathing, substance abuse, betrayal, and other more serious concerns that really serve to draw the viewer into the series. Overall, \"BoJack Horseman\" is an incredibly impressive entry into the burgeoning repertoire of successful Netflix original programming and I hope to see this series continue for years to come."
    },
    {
      "username": "stefstars",
      "userUrl": "https://www.imdb.com/user/ur81740206",
      "reviewLink": "https://www.imdb.com/review/rw6585053",
      "warningSpoilers": false,
      "date": "11 February 2021",
      "rate": "10",
      "helpful": "21 out of 22 found this helpful.",
      "title": "A Masterpiece",
      "content": "I don't know why I took so long to watch this one, it had been recommended to me to plenty of times for the last few years. This became my favorite adult animated show. Rick and Morty is good with the subjects of nihilism and it has it's depiction of self destructive depression but it doesn't get it quite as right as BoJack Horseman. Every form of depression is presented in this show and they're presented in such an accurate way, I had tears in my eyes watching a talking horse go through similar situations I have been in. In some ways I relate to BoJack but I saw myself more in the characters of Diane and Princess Caroline. That's the beauty of this show, every character is relatable in some way but the way they've been written is so natural, it's not a forced depiction of the various damaged type of folks that exist in society.The character development in this show is phenomenal. We see BoJack's ongoing struggle with depression, trying really hard to be a better person but falling back into his toxic patterns. Every season he digs himself into a deeper hole because he refuses to fix himself, because he believes he can't be fixed - this is present in the character of Diane as well but her forms of self sabotage are more subtle. Different forms of depression are shown from substance abuse to self delusion and they're all presented in the most accurate way. I love the episodes where we get into the heads of BoJack, Diane, and Princess Caroline. We see how BoJack has an ongoing battle in his head going from positives to absolute negatives, he tries to have self love but it immediately transitions to self hatred. Diane can't forget the hurt she faced in her early years, constantly hearing her father and school bullies talking her down. Princess Caroline helps herself feel better by imagining her grandchild talk about her successes in the future. The way these moments are shown, even the style of animation they choose to present these moments, it's just a brilliant work of art altogether.The show definitely has its many moments of humor, this is a comedy after all. Todd and Mr. Peanutbutter provide the comic relief although they have their deep moments as well, but the show does an incredible job of showing you that although these characters may appear stupid, they're actually the happiest people in the entire series. Both of them have their tough moments but they both rise out of their problems better than the other characters because they're happy. I love that they have BoJack admit to Mr. Peanutbutter that the main reason he does not like to be around him is because he envies him for his happiness, that was such a powerful moment. I hadn't seen a moment that powerful in a film or series in so long and I didn't expect to see it in a show about a talking depressed has-been horse.Honestly I can go on and on about how amazed I am with this show. I can even write an entire essay about how this show properly depicts mental illness. As someone who still battles with depression here and there, I felt completely understood with this show. Finally someone got it right and it was a show in a universe where talking animals cohabitate with humans. I will rewatch this many more times. It's a show that knew when it was time to end and connected every single story they told until the very end. The writing in this show, to all the writers out there that want to tell great stories on screen or even in a book, watch this show and take notes.I love BoJack Horseman, thank you the team that brought this show to life. I'm not exaggerating when I say I'm an eternally grateful to know this show exists and understood my pain in a way I never thought any form of media could completely understand - in a way I had not felt since Amy Winehouse released Back to Black. Highly recommend this show, you will not regret it. It's a masterpiece."
    },
    {
      "username": "kevin_robbins",
      "userUrl": "https://www.imdb.com/user/ur131783850",
      "reviewLink": "https://www.imdb.com/review/rw6966015",
      "warningSpoilers": false,
      "date": "25 May 2021",
      "rate": "10",
      "helpful": "29 out of 33 found this helpful.",
      "title": "The comedic content was a nice blend of dry and consistent awkwardness",
      "content": "BoJack Horseman is a series that came strongly recommended by my fiancée and is available on Netflix. The storyline focuses on a self indulged former sitcom star that has made some friends, some famous and some not so much, and follows his life as he makes bad investment, life, and friendship related decisions. This series was created by Raphael Bob-Waksberg (Undone) and includes voices from Will Arnett (Arrested Development), Amy Sedaris (Elf), Alison Brie (Glow), Paul F. Tompkins (There will be Blood) and Keith Olbermann (ESPN). The animation for this is fun in a Family Guy kind of way. The personalities and uniqueness of the characters is so good. Also, the concept of animals and humans living together was portrayed well. I really liked how they did it and the comedic content was a nice blend of dry and consistent awkwardness. Overall, this is a fun series for adults that I would score a solid 9/10."
    },
    {
      "username": "english-bill-34-910037",
      "userUrl": "https://www.imdb.com/user/ur53524262",
      "reviewLink": "https://www.imdb.com/review/rw3078432",
      "warningSpoilers": false,
      "date": "31 August 2014",
      "rate": "10",
      "helpful": "151 out of 162 found this helpful.",
      "title": "An animated show that feels more real than most live-action series.",
      "content": "Netflix, in their continuing mission to provide premium content to their subscribers, has another hit on their hands with BoJack Horseman. I had some reservations before watching the first episode, because there hasn't been a great new animated series in several years now. But with such a great cast on board, I figured it was worth a try. So glad I did, because it ended up being the best original comedy I have seen in a while, animated or otherwise. It does not take long at all to get wrapped up in the story of BoJack, a has-been actor known for his role as a single dad in a popular early '90s sitcom. Having not acted in the 18 years since the show was canceled, he agrees to pen a memoir in an effort to relaunch his career. When confronted with the reality of how he is perceived by others, BoJack becomes desperate for acceptance and redemption from both the public and his inner circle. For the most part, people from normal walks of life are portrayed as humans, while the elite class like actors and their agents are portrayed as animals. It's a surprisingly effective method to humanize these characters to whom the common person does not easily relate. Will Arnett, Kristen Schaaf, Aaron Paul, and Amy Sedaris all give their characters a 3-dimensional quality that is difficult to achieve in a 2D platform like animation. It helps that it is wonderfully drawn, with many subtleties that reinforce each character's persona.Instead of a loosely assembled pile of anecdotal stories with characters that are just given a reason to exist, all the events during each episode contribute to the progress of the plot over the course of the first season. With episodes picking up exactly where the last one left off, the show feels more like a 3-act mini series than a TV show. That said, there are plenty of crass jokes and innuendo that will satisfy viewers who are not vested in the overall story. I am delighted that the series has been picked up for a second season and to see in what direction the story of BoJack and his inner circle takes us."
    },
    {
      "username": "Avwillfan89",
      "userUrl": "https://www.imdb.com/user/ur22066568",
      "reviewLink": "https://www.imdb.com/review/rw8174376",
      "warningSpoilers": true,
      "date": "25 May 2022",
      "rate": "9",
      "helpful": "9 out of 9 found this helpful.",
      "title": "One of the best portrayals of depression and mental illness ever.",
      "content": "Who would have thought a cartoon about anthropomorphic animals would find the best way of depicting human errors, human psychology, depression and anxiety?When the first season hit, no one was impressed. Human like animals in Los Angels about celebrity depression and narcissism? No one was buying into it, myself included.That was until The Telescope episode happened. It mixed heavy themes such as cancer, betrayal, forgiveness and deep resentment. That was essentially the moment where it became more than a funny/sad satire on Hollywood culture.Bojack represents the most real, most complex and enriching portrayal of a character neglected and abused as a child, learned how to be good from television (which is not always the best teacher) became empowered through drugs and alcohol and entered Hollywood by starring in a popular 90s sitcom.The series examines what it means to be good person, the question of whether or not you can change your ways and how terrible behavior will eventually catch up to you. While shows featuring male anti-heroes such as The Sopranos, Breaking Bad and Mad Men, this one very much centers its women as empowered from the get go and are multifaceted. Despite sometimes being victims of the main character's sometimes awful deeds, their traumas are not forgotten about like they are in other shows, so that the flawed male character can move on with his life. In fact, the show makes it very clear that every terrible act caused by Bojack has lasting effects on those he hurts that will come back to bite him, celebrity or not.You can feel sympathy for Bojack while not condoning his actions - due to the flashbacks detailing his childhood before fame. The show also doesn't pull any punches when it comes to depicting truly heavy themes, as well as not offering any simple solutions by the end.Truly unique and riveting."
    },
    {
      "username": "Fiachy",
      "userUrl": "https://www.imdb.com/user/ur33479608",
      "reviewLink": "https://www.imdb.com/review/rw5509059",
      "warningSpoilers": false,
      "date": "25 February 2020",
      "rate": "10",
      "helpful": "29 out of 31 found this helpful.",
      "title": "Colourful psychedelic journey through the dark night of the soul.",
      "content": "I started watching Bo Jack when I was 17 years old. I am now 23. This show grew in depth and maturity as I did. The way that it captures the darkness and ugliness of life, while also celebrating in its wild crazy unpredictability, is like nothing else. While I struggled with purpose, meaning, mental health, drugs and the rich expanse of life that is sometimes so difficult, I felt I could relate to Bo Jack Horseman. It is a very honest portrayal of many things. And a very, very, gloriously silly way to do it. I grew with these characters. There is something profound about this. This piece of art, that I know will never be done again. The attention and care and genius that is here, is worth celebrating. Thank you for Bo Jack Horseman"
    },
    {
      "username": "andyrew670",
      "userUrl": "https://www.imdb.com/user/ur54431617",
      "reviewLink": "https://www.imdb.com/review/rw3561857",
      "warningSpoilers": false,
      "date": "14 October 2016",
      "rate": "10",
      "helpful": "80 out of 89 found this helpful.",
      "title": "One of the best adult animated shows I've ever seen.",
      "content": "While the first season wasn't fully developed in it's characters and situations, I still enjoyed it very much, and had developed a bit of an emotional attachment during the last 3-4 episodes. But nothing could have ever prepared me for seasons 2 and 3, which offered some of the most poignant insights into celebrity culture and the nature of depression for a multitude of characters, which had by the time become grounded in their own right, I have EVER witnessed. I can't even put my thoughts into words for this review because I love this show so much, which is very surprising, I try to stay as formal as possible. I won't spoil anything, but there was a few different episodes in the past 2 seasons that made me cry, scream, hate, love, everything. This is really one of the few animated shows I can think of that brings on pure, unaltered moments of absolute emotion from the deep dark places of my soul. I connected in ways I never would have thought possible to Bojack, as well as a few other characters in the show. This is a must watch for anybody and everybody, you just have to get past the first half of the first season to truly start to love it.Oh, and the show is also outstandingly funny. Worthwhile as a comedy alone."
    },
    {
      "username": "urgentneptune",
      "userUrl": "https://www.imdb.com/user/ur54260728",
      "reviewLink": "https://www.imdb.com/review/rw3074639",
      "warningSpoilers": true,
      "date": "24 August 2014",
      "rate": "9",
      "helpful": "43 out of 49 found this helpful.",
      "title": "BoJack Horseman: Fantastic",
      "content": "Bojack HorsemanLately, the streaming service Netflix has been putting out some popular original television shows. Netflix's latest original series is BoJack Horseman, a comedic adult cartoon chronicling the life of a horse-man of the same name. Unlike many other adult cartoons, BoJack Horseman has a very complex and clever plot that spans across an entire season.PlotThe main character of the series is a horse-man named, well, Bojack Horseman. Obviously. Bojack is a washed up actor who starred in a popular 90's sitcom called \"Horsin' Around.\" The show takes place in Hollywood twenty years after Horsin' Around's cancellation, when Bojack is both depressed and an alcoholic. The first season is about BoJack trying to publish a memoir.Bojack is not the only animal-man in the show. In fact, the series contains a fair amount of bestiality. There are many human and animal couples in the show. However, Bojack Horseman uses the cross species relationships in interestingly funny ways. Actually, that's how I would describe the entire show: interestingly funny. BoJack Horseman isn't a show for stupid people. That is to say, many of the best jokes are nonchalantly delivered and can be hard to pick up on. Don't get me wrong, there are a fair share of blatantly stupid \"jokes\" is the show, just like in any adult cartoon. Still, I found myself constantly rewinding to make sure I picked up on every joke. There are a couple of plot devices that I think BoJack Horseman uses very well, such as:The show makes references to real life actors, people, businesses, and cities. Everything that exists in our world exists in their world. Except for the movie Secretariat. All the directors from real life have been turned into animals. Ex: Quentin Tarantualtino. Instead of each episode being its own individual story, every event carries over into future episode, even some incredibly minor details are included in later episodes. Thus, the show is filled with many \"running jokes.\" Sometimes items in the background will randomly change.There are lots of other things that make BoJack Horseman's plot so great, but all you need to know is that the show's story has some of the most depth that I've ever seen in an adult cartoon.Voice ActingAlthough I am not a voice artist expert, I think that every actor connects well with their character. Most voices reflect on the animal's personality. Overall, the voices are good and each voice fits their respective character perfectly.Art StyleThe art style of this cartoon is very similar to Bob's Burgers. Most of the time it doesn't look very pretty, but I think the style is the most effective one for the show's tone and theme.Award Time!Best Overall Character: BoJack HorsemanBest Side Character: TodConclusionBoJack Horsman has something for everyone, whether you're looking for cheap laughs or a funny show that makes you think. Netflix has once again created an award winning series. I give BoJack Horseman a 9/10. I look forward to season two."
    },
    {
      "username": "annabaloo",
      "userUrl": "https://www.imdb.com/user/ur87401370",
      "reviewLink": "https://www.imdb.com/review/rw4129116",
      "warningSpoilers": false,
      "date": "14 April 2018",
      "rate": "10",
      "helpful": "532 out of 548 found this helpful.",
      "title": "This show! Is! Too much! Man!",
      "content": "Seriously though. Best show currently on television. At first, I thought it was another cartoon for adults only with poor drawings. But it's not. It's different. For one, the jokes are funnier and the sads are sadder. The first season starts out more of a plain funny show, but beware this show will break your heart if you stick with it. It is also a really clever show - I'm sure that I'm not smart enough to catch all the references but sometimes I get the jokes and that feels good. Also, this show may be one of the depictions of depression on TV and movies ever."
    },
    {
      "username": "viperr101",
      "userUrl": "https://www.imdb.com/user/ur54873660",
      "reviewLink": "https://www.imdb.com/review/rw3076196",
      "warningSpoilers": false,
      "date": "27 August 2014",
      "rate": "10",
      "helpful": "455 out of 492 found this helpful.",
      "title": "A Rare Experience",
      "content": "I don't usually write reviews for shows, nor have I ever written about anything on IMDb before, but I felt as if I should after watching this show.It's hard to put into words the way I felt about watching BoJack Horseman. Sure, it starts out as a comedy with seemingly no real plot. Sometimes it just seems stupid, yet still comes off as possibly a new, interesting yet also run-of-the-mill animated series, but it starts to develop into something more. Something that I think a lot of people may or may not fully see to the end of the first season because they decided the show wasn't for them. And that might still be true. But I can't help but feel some form of disappointment. Why? I don't really know. I guess I just foolishly want everyone to get something out of it.I don't think anything, whether it's a book, a movie, a game, or even a show deserves a 10. But sometimes, for just a brief instant, you stop caring about how you want to quantify how much you like something and just want to express how much you enjoyed it. That to me is the only way I can really describe BoJack Horseman. I can't say it's good, or bad, or even average. It's just a show that wants to get its point across, whether it's original or not. And it does it in a way that's hard to look at critically.And at the risk of sounding like I'm contradicting everything I've already tried to say, I almost don't want the show to have a new season. Not because I hate it or think it's \"too good\" to continue on, but because it already feels complete. I obviously don't feel bad that the series has already been renewed for a second season. And even if it happened to only be a two season series, I'd still be thrilled. It's just that in some way, I hope it doesn't change.So even though most likely no one will be reading this review (which is actually more like a reflection of how I felt about the show rather than a genuine examination), I at least hope that more people will try watching it and get some enjoyment out of it. Even if it's only for one episode. Who knows? I might even look back at it and wonder what I was thinking, or why I wrote a frankly pointless review about it.But that's alright. Because in the moment, it was something memorable."
    },
    {
      "username": "ansharora-12638",
      "userUrl": "https://www.imdb.com/user/ur68630637",
      "reviewLink": "https://www.imdb.com/review/rw5457185",
      "warningSpoilers": false,
      "date": "3 February 2020",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "You know what? Let's keep it short.",
      "content": "This show gave me goosebumps in almost every episode. That's it's power. Bong Joon Ho told you all to overcome the one inch distance of subtitles to be introduced to a whole new cinema, well I'm saying you all to get over your fear or repulsion of watching a \"cartoon\" show and just watch this one. Coz it's not a mere \"cartoon\", perhaps a greater show than most of the real ones. Not going to say anything else."
    },
    {
      "username": "Okonh0wp",
      "userUrl": "https://www.imdb.com/user/ur0204528",
      "reviewLink": "https://www.imdb.com/review/rw3076410",
      "warningSpoilers": false,
      "date": "27 August 2014",
      "rate": "10",
      "helpful": "25 out of 31 found this helpful.",
      "title": "Gets off to a rough start but rewarding in the end",
      "content": "Several reviews I've read on BoJack Horseman indicated the show was out of date. The show fits in more with the height of the Adult Swim reign of animation and not the intelligent output of American Dad or Archer.The show's primary problem is that the first two or three episodes were unforgivably substandard and that is generally all the time a critic can give a show in a TVscape as crowded as this one. The pilot episode, heavy with exposition (which is understandable) zeroes in on protagonist BoJack Horseman in his pre-development state and he's as uninteresting as can be. The second episode tries to mine humor out of a taboo topic-- Political correctness and how we regard the military as heroes -- and not only fails, but paints BoJack as somewhat of a buzzkill a la one of the Crane brothers (from the Frasier era) at a tiki bar (or pick whatever non-Aristocratic setting you choose to complete this analogy).The show's primary gimmick-- anthropomorphizing many of the characters in subtly clever ways and mixing those into the human world-- is enough to pique one's interest during the early episodes but if one quits the series early, that's all they'll find: An only occasionally funny Hollywood satire that's been done before.\"BoJack Horseman\" isn't particularly easy to get into, but a few episodes in, the show's pathos and interesting character dynamics shines through. Like Will Arnett's previous work, \"Arrested Development,\" the show features characters who aim to be dynamic and get out of their ruts in life. Unlike \"Arrested Development\" however, the show dares to give them, and us hope, at actual improvement and toys around with the idea of whether the characters are going anywhere at all. Either way, there's a definite investment to the characters by season's end that gives the show life. The satire also starts getting sharper once the hidden jokes and the parallels to ABC's TGIF line-up of the 1990's start to reveal themselves."
    },
    {
      "username": "MovieJunkie5",
      "userUrl": "https://www.imdb.com/user/ur53318196",
      "reviewLink": "https://www.imdb.com/review/rw5490875",
      "warningSpoilers": false,
      "date": "17 February 2020",
      "rate": "9",
      "helpful": "11 out of 12 found this helpful.",
      "title": "The show we didn't know we needed",
      "content": "When I began watching in 2014 I was not expecting to be witnessing one of the best tv series, not only animated, on the making. It has everything for everyone, comedy, dark humor, drama, plot twists, a bunch of smart references that anyone gets to a certain point, philosophical messages, life lessons and so much more. Its truly one of the most complete and unique tv shows ever produced. Aaron Paul was one of my favorite characters, I couldn't possibly imagine Todd without his voice and character. The same could be said about Diane, Princess Carolyn, Mr. Peanutbutter and the horse himself, Bojack. A wonderful cast with such brilliant performances due to not only but also the fantastic and deep script by Raphael. Even though it was not their decision, I'm glad they ended BJH. This last season if one of the best I've seen, everyone got closure, including us. Its a masterpiece for the ages and a tv show to repeat several times, I bet it only gets better."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8574009",
      "warningSpoilers": false,
      "date": "28 September 2022",
      "rate": "8",
      "helpful": "10 out of 11 found this helpful.",
      "title": "So Underrated!",
      "content": "BoJack Horseman is easily one of the best animated shows ever created. It's about an self-loathing alcoholic horse named BoJack Horseman, who was once a sitcom star in the 90's and now wants to make a comeback 18 years after his show was canceled and he lost his dignity. I just started watching it after hearing so many great things about it and I'm so glad I did because it's amazing! It's absolutely an animated show for adults though! I can't really say anything that hasn't already been said. Just read through the reviews and see how loved this show really is. If you haven't seen this incredible show yet then stop what you're doing right now and go watch it!"
    },
    {
      "username": "fanofmoststuff",
      "userUrl": "https://www.imdb.com/user/ur66198965",
      "reviewLink": "https://www.imdb.com/review/rw4116165",
      "warningSpoilers": false,
      "date": "4 April 2018",
      "rate": "9",
      "helpful": "33 out of 38 found this helpful.",
      "title": "#211 in Top Rated TV shows on this site but is much better than that.",
      "content": "If you can get past the first three episodes will be witnessing a hell of a show. As they say with mental issues, \"It gets better\". And it sure does. This show is funny and emotional. They make you feel bad for characters out of your species, gender, and age range. Watching this made me relatable to characters I'd never expect to relate since they're so grounded. It's a bit over the top at times but it IS an animated show. Watch it and you'll get amazing fleshed out characters and stories that will make you think about life and your choices."
    },
    {
      "username": "LowlifeBinge",
      "userUrl": "https://www.imdb.com/user/ur111063519",
      "reviewLink": "https://www.imdb.com/review/rw5483779",
      "warningSpoilers": false,
      "date": "14 February 2020",
      "rate": "10",
      "helpful": "34 out of 36 found this helpful.",
      "title": "Not only the best cartoon ever, but one of the best TV shows ever created",
      "content": "When I began this series, I had absolutely no clue how incredible it would prove to be. I was a fan of adult cartoons before seeing BoJack, I initially expected it to be one of those shows with some funny moments and occasional good messages, however upon viewing, my mind was completely blown. It was first recommended to me by a friend and I saw a few episodes, I thought it was okay but not amazing, but later on the new season (at the time) came out and he recommended it to me again, I picked up where I left off and after a couple more episodes, I was entirely hooked. Never before had I seen such hard-hitting, heartbreaking, emotional topics handled so elegantly, whilst still consistently achieving hilarious humor. In my opinion, BoJack is the second best TV show ever to exist (the first being Breaking Bad) and I 100% stand by BoJack as being the best show on Netflix, way better than the pathetic excuses for shows like 'Paradise PD' and 'Big Mouth'. I recommend this show to the moon and back, but get the tissues at the ready."
    },
    {
      "username": "taichihan",
      "userUrl": "https://www.imdb.com/user/ur108625865",
      "reviewLink": "https://www.imdb.com/review/rw5450472",
      "warningSpoilers": false,
      "date": "31 January 2020",
      "rate": "10",
      "helpful": "54 out of 58 found this helpful.",
      "title": "Wow.",
      "content": "Now that the show is over, I need to shout a big thank you to the it and all the people that made it happen. Just, just that. Thank you."
    },
    {
      "username": "Mttdolson-134-791727",
      "userUrl": "https://www.imdb.com/user/ur27615606",
      "reviewLink": "https://www.imdb.com/review/rw3076321",
      "warningSpoilers": true,
      "date": "27 August 2014",
      "rate": "9",
      "helpful": "337 out of 351 found this helpful.",
      "title": "Unexpetcted Depth",
      "content": "At a glance, this show looks like your run of the mill wacky, raunchy adult cartoon comedy. And yes, it has plenty of that with the titular character's rude and obscene behavior, and a saturated slew of animal puns. There are wacky characters and absurd plots to be sure, but all of that eventually takes a backseat to the fact that Bojack Horseman is, at heart, a nuanced and overtly depressing show about pain and self-loathing.This season really has more in common with Jody Hill's Eastbound and Down than it does any of the cartoons it's often being compared to, not just in the sense that it's a dark character study but also in the aspect that it's not episodic at all. Continuity plays a huge role in the show, and many of the episodes start exactly where the last one left off (evidence that the writers were catering to the \"binging\" crowd). A lot of the funniest jokes come from references to past episodes (such as the wonderful moment where Bojack assumes that on his last drinking binge he must have become obsessed with David Boreanaz for some reason.) As depressing and serious as the shows ultimate arc really is, the absurdist icing that comes from immersion in this world where anthropomorphic animals are taken for granted helps make this bitter pill an enjoyable meal. Great comedic performances from Amy Sedaris, Paul F. Tompkins, and Aaron Paul don't hurt either. But overall, Bojack Horseman is a thoughtful, witty feel-bad comedy in the best way."
    },
    {
      "username": "tmfc-65132",
      "userUrl": "https://www.imdb.com/user/ur64611614",
      "reviewLink": "https://www.imdb.com/review/rw3740506",
      "warningSpoilers": false,
      "date": "27 June 2017",
      "rate": "10",
      "helpful": "30 out of 34 found this helpful.",
      "title": "Very underrated",
      "content": "Bojack Horseman is not another family guy or Simpsons because it actually tells a story that feels real. This is a funny and wacky cartoon but is actually has emotion unlike family guy. In family guy you get the same repetitive episodes pumped out with less emotion as the show goes on. Bojack Horseman manages to be really entertaining and funny but also makes you feel for the characters in the show. All the voice acting and animation is really well done and the writing is very clever at times. This is mostly because it finds a way to make fun of modern society and Bojack is the one who points it out to the audience most of the time. This is one of the best cartoon comedies I've seen and I would highly recommend you watch it."
    }
  ],
  "errorMessage": ""
}