{
  "imDbId": "tt3581920",
  "title": "The Last of Us",
  "fullTitle": "The Last of Us (TV Series 2023– )",
  "type": "TVSeries",
  "year": "2023",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw9088950",
      "warningSpoilers": true,
      "date": "30 May 2023",
      "rate": "8",
      "helpful": "26 out of 29 found this helpful.",
      "title": "Pedro Pascal is such an underrated actor",
      "content": "I was blown away by how much I enjoyed The Last of Us. It's based off a video game of the same name. It follows Joel (Pedro Pascal) and Elle (Bella Ramsey) as they have to trek across the country as they try to survive killers and monsters after an outbreak has taken over the world. It's one of the best reviewed shows by both critics and fans alike, it currently has a 100% rating on RT. I know it's early but I'm absolutely hooked. I hate that I have to wait a week between episodes as this is a perfect show to binge. If you're looking for a new show to get into then give this a try, you won't be disappointed. This is definitely going to be HBO's next big hit."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw9107358",
      "warningSpoilers": false,
      "date": "8 June 2023",
      "rate": "9",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Entertaining",
      "content": "I actually understand why some people love the show and some people don't like it. For me...I thought The Last of Us was one of the best new shows of the year. I never played the game so I wasn't really sure what to expect going in. I then saw the trailer and read all the great reviews so my expectations rose even more. Well, it not only met those expectations but surpassed them in every way. Pedro Pascal has to be one of the most underrated actors on the planet. He's terrific in everything he's ever done and this is no different. He carries the show again. The rest of the cast is great as well, Bella Ramsey, who play the girl Ellie, has a bright future ahead of her. I can't wait to see where this show goes."
    },
    {
      "username": "jrarichards",
      "userUrl": "https://www.imdb.com/user/ur20250079",
      "reviewLink": "https://www.imdb.com/review/rw9089749",
      "warningSpoilers": true,
      "date": "30 May 2023",
      "rate": "9",
      "helpful": "22 out of 26 found this helpful.",
      "title": "In some ways a step forward from other dystopias, but with some disappointments",
      "content": "Leaving aside all other aspects, if acting is your thing you're probably going to admire Britain's Bella Ramsey in the starring role of Ellie. Even if she is 18 playing 14, what she does is still a great achievement. Ellie will make you laugh, earn your sympathy, shock you and have you open-mouthed in admiration. She's just the right mix of kid and not-kid.If \"Fear the Walking Dead\" does show us the apocalypse on its way (while the original TWD did not), TLOU does offer us something pretty great in the first episode. Nobody can really buy the world breaking down in literally days, but still if it did happen, it might look a bit like what we see, and its sad, dramatic, scary, and also pithy (given COVID).Probably your going to get a sinking feeling in the second half of E1, thouh, when you find \"careworn, grizzled stop-at-nothing rebels fighting against an authoritarian regime\" (for the millionth time), but fear not, as this is just a phase...The guiltiest pleasure - accessible since the BBC first made \"The Survivors\" in the 1970s - is that we as the audience will imagine ourselves among those said survivors (as opposed to among the absolute mountains of dead), and we will imagine the birds singing and the sun shining and us growing stuff, and life going on somehow (even if we are unlikely to pause and think what, say, the consequences would be of a cancer diagnosis (not that anybody WOULD be there to diagnose)). Of course in \"The Road\" that was the fate that befel Viggo's character.Here much of America is now in essence empty, but not at all in the ruination envisaged by Cormac McCarthy ... to the extent that one wonders why anyone would linger in urban Quarantine Zones. One reason is the rural starvation scenario depicted in E8 - but that episode is joined by E9 as mostly a bit of a dud, at least in the sense that we see what we have seen before (though not herds of giraffes roaming in Salt Lake City - which is a beautiful and real-looking moment).Indeed, TLOU goes even further than FTWD (Season 4 Episode\"Laura\") in suggesting that, for periods, for a very few lucky and well-organised people, post-apocalypse life might be rich and even beautiful. The episode in question is Number 3 here (\"Long, Long Time\") and it breaks new ground in a host of ways, and also explains why we need to have this pandemic break out in 2003, in order to have 20 years behind us by 2023 (also necessitating a great 1960s Prelude of a scientist (John Hannah) forecasting in a gobsmacking way what a fungal pandemic might be able to do).To cut to the chase here, E1 is good, E2 likewise (especially the beginning), E3 is amazing, E4 and 5 are good, and E7 is fine. This then looks like an above average series for its profile. Indeed, at the best moments, a series even of this genre is able to look fresh and innovative.The rebel bits aforesaid look over-familiar, though, and the idea that an ostensibly God-fearing community is actually run by a psychotic fake-preacher is just plain insulting.The Infected here are indeed scary, but (just as with TWD) the series would never work if we over-focused on them. Key character Joel (Pedro Pascal), though of course essential to the whole series, does not ultimately look like a cohesive person. While his gradual shift over to a fatherly role is understandable enough (if a bit unlikely-looking), his insistence on killing absolutely everybody goes beyond what we can accept in the latter part of the series (especially E8 and 9). Desperate as the situation may look, we cannot really maintain sympathy for someone so utterly ruthless and without mercy. His multiple-slayings to keep Ellie safe do indeed look \"comic-book\" in the worst sense of that phrase, and are a million miles away from the most innovative and triumphant moments of the series, of which there are more than a handful."
    },
    {
      "username": "Leungzy",
      "userUrl": "https://www.imdb.com/user/ur34632605",
      "reviewLink": "https://www.imdb.com/review/rw8926565",
      "warningSpoilers": true,
      "date": "13 March 2023",
      "rate": "7",
      "helpful": "418 out of 568 found this helpful.",
      "title": "Peaked too soon, then felt rushed and dropped in quality",
      "content": "I'll start with the negatives:My opinion after Episode 8 was that you cannot tell the story of TLOU in such short episodes, that was after a 50 min episode.For the finale, it was unforgivably the shortest episode of the season at 44 mins?Overall, the show started off really really good. In the first few episodes I was recommending this to everyone I talked to, telling them that this was one of my favourite shows I'd ever watched.Unfortunately, that opinion changed after Episode 6.From 7 onwards, I felt the show just shifted from being too slow at times to needlessly rushing through specific plots, character relationships and action sequences that took place in the game that enriched the story, added suspense and drama, and gave depth to character relationships.The pacing from the majority of the first half of the season just didn't match up with the second half.Also characters being introduced at the start of an episode and then being killed off at the end felt too quick and rushed. Had they split the season up or made episodes longer, I think that may have made it seem less rushed.In hindsight, I wish they had skipped certain things they added to the show that were not in the game, and stuck to the original storyline.I thought the casting of David and Riley was poor.In David's case, I didn't feel the actor was an accurate on-screen version of him or that they did a good enough job of portraying how creepy he was.This was also largely due to the fact that they skipped over his whole storyline of helping Ellie fight a swarm of infected, in which he gains her trust, before revealing that he knew who she was all along.I had really been looking forward to his encounter with Ellie and unfortunately was left very disappointed when they rushed through his story in 50 mins.I also would have liked to see Joel have to fight his way through David's survivor group to get to Ellie.Instead it was a rather easy process for him to find her, and for them to escape a whole resort of people that were hungry for revenge for what he had done in Colorado.In the case of Riley, I just didn't feel like her relationship with Ellie was authentic or believable. When compared to Bill and Frank, who I felt an emotional connection with, I felt nothing when watching Ellie and Riley together. It was rather bland and felt rushed.In general, I found that episode mostly boring, and thought that they ruined it by showing the infected person so early on that would attack them at the end of the episode.To me, this completely removed the element of surprise, and I found myself sitting there bored during the episode just waiting for him to attack Ellie and Riley.I thought the finale should have been much longer, as it felt rushed and basically like the show's producers had run out of time and needed to cram the rest of the story in.I would have liked to seen the hospital scene more drawn out, although I will say that I liked how it was done so artistically and with the music in the background.Although Joel cares for Ellie, this doesn't necessarily make him a good person.It felt like the show rushed through scenes where we see him be ruthless to get what he needs/wants, and would have liked to have seen his character development fleshed out a bit more, along with his relationship with Ellie.Now for the positives:I loved Bill and Frank's episode.I was a bit disappointed that we never got to see Ellie meet Bill as their encounters in the game are hilarious, but I loved what the producers did in writing a story that had me really caring for 2 people who were not main characters in the game and whose story wasn't explored originally.I thought Bill/Frank's episode (Episode 3) did a really great job of portraying post-apocalyptic life with someone you loved and cared about, and how you wouldn't want to go on living without them. Max Richter's \"On the Nature of Daylight\" was used beautifully in their final moments together.In fact, overall, the soundtrack for the show was really good in my opinion. It was great that they brought back Gustavo Santaolalla to do it.Episode 3 ran at 1 hr and 16 mins, which to me was perfect. I don't know why the producers didn't make all the episodes as long as this or as the season premiere's.I also enjoyed the other added backstories which weren't featured in the game, as I felt that these really enriched the story. These included: the origin of the outbreakEllie's birth and her immunityKathleen and her insatiable hunger for revengeThere were some nods to fans of the game as well that were a nice touch such as Ashley Johnson (Ellie's voice actor from the game) play Ellie's motherTroy Baker (Joel's voice actor) play JamesJeffrey Pierce (Tommy's voice actor) be killed by a bloater exactly in a manner that happens in the game.It was also great hearing the original music from the game used so heavily as it really brought me back to playing it years ago for the first time. Hearing that music and Ellie tell her pun jokes was very nostalgic.In terms of acting, I thought Pedro Pascal was very good, as was Bella Ramsey.They both did a great job of portraying Joel and Ellie with the scenes they were given.Although this show had a lot of good things about it, overall it left me thinking it could have been much better, and that they could have done a lot more with the story, and not rushed certain scenes or character storylines.I'll summarise this show with a quote from a friend:\"My wife hates zombies, but she doesn't mind watching TLOU because there is never really any of them in it\".Overall, I think that has been a huge downside to a show that started off so well, from Episode 1 showing how terrifying a day one outbreak can be, to Episode 5 showing a evolved swarm attacking a group of armed survivors.While we didn't need \"The Walking Dead\" level of zombies in every episode, this show, in my opinion, just skipped too many scenes that should have featured them a bit more, and largely for that reason, it just doesn't live up to the real drama, suspense and terror of the game."
    },
    {
      "username": "matthewreinink",
      "userUrl": "https://www.imdb.com/user/ur153546693",
      "reviewLink": "https://www.imdb.com/review/rw8924686",
      "warningSpoilers": false,
      "date": "13 March 2023",
      "rate": "7",
      "helpful": "392 out of 576 found this helpful.",
      "title": "Doesn't quite live up to the perfection of the game",
      "content": "Season 1:While I may feel disappointment by this television adaptation. I am grateful that it introduced the greatest story gaming has ever told to a wider audience, an audience that never would have experienced or connected with it in its previous form.The biggest problem that this series has is the pacing. With only nine episodes a lot of the story feels rushed, and certain important scenes or entire segments needed more time. Although to be fair, that may be the fault of HBO for not believing in Druckmann's stellar work.Committing an entire episode to both the left behind dlc and Bill and Frank seems like a mistake in hindsight. While both episodes are great, they really take you out of the main story. We don't get as much quality Joel and Ellie time because of it. Part of why the game works so well is because you spend nearly 20 hours with these characters in the game. You connect with them, you feel as if you know them personally, you deeply care about them. All the small talk about movies, goals, and shared tragedy as you traverse desolate wastelands is what makes that game so incredible, and it's why the characters feel so real. In the show you spend less than half that time with these characters. This significantly takes a lot of the emotional oomph out of the story in my opinion.Even some of the dialogue feels rushed. There are important and impactful lines that aren't allowed to breathe and sit in. A example of this was the dirty magazine scene where it sounds like Bella Ramsey is reading a checklist of lines from the game. The scene is funny, but also feels unnatural and a little stiff. Not to throw shade at Bella Ramsey, she has some truly great moments in this show.If only this series got another one or two episodes, maybe then it could have fully done the game justice."
    },
    {
      "username": "MVictorPjinsiste",
      "userUrl": "https://www.imdb.com/user/ur7102706",
      "reviewLink": "https://www.imdb.com/review/rw9014658",
      "warningSpoilers": false,
      "date": "24 April 2023",
      "rate": "7",
      "helpful": "35 out of 48 found this helpful.",
      "title": "One of the Best Game Adaptation",
      "content": "Not too crazy on zombie stuff, and I never played the titular game. Which makes me a true neutral viewer here, and yet the immersion was fast. Good, good.The first 2 episodes were IMO the best: The pilot in particular, was rich, fast and multilayered in terms of emotions. After that, it becomes more episodic, and deals much more with the various bands of survivors encountered on the journey than the infected themselves, some of which were typical video games contraptions.The tone is personal as the two main characters slowly unveil themselves to the other, but there are a couple of episodes where they focus elsewhere, both of them with homosexual overtones (which by now are mandatory I suppose). Remove these flashback episodes, plus the pilot which sets the terrain, and that's what, 6 episodes, all of them under an hour?That's not much but it is enjoyable, for the good dialogues, excellent cinematography and great acting. It isn't an action-packed zombie flick (althought there are some good action scenes here and there), but more like a road movie. I will probably watch again."
    },
    {
      "username": "gallagherkellie",
      "userUrl": "https://www.imdb.com/user/ur75340345",
      "reviewLink": "https://www.imdb.com/review/rw8929880",
      "warningSpoilers": false,
      "date": "15 March 2023",
      "rate": "7",
      "helpful": "108 out of 169 found this helpful.",
      "title": "Good but didn't grab me",
      "content": "I know everyone is obsessed with this show, and I can see why. The acting is really good, not only by the main actors but all supporting actors.I didn't play the game so can't compare, but I have heard it's exactly the same.The storyline is decent, but I'd say that I enjoy every second episode. It starts off well and gripped me. But some episodes are just too slow for me. I can do slow if it's gripping, like True Detective or Breaking Bad at times (amazing shows). But for some reason this just didn't do it for me. That's not to say it's a bad show - it's well made and shot, but I didn't get super excited each week when the episodes came out.To the people bagging episode 3 - it was the most beautiful piece of television I've seen. And I'm a straight female. You need to get a life if you're disgusted by it."
    },
    {
      "username": "inc-133-70013",
      "userUrl": "https://www.imdb.com/user/ur27600271",
      "reviewLink": "https://www.imdb.com/review/rw8973840",
      "warningSpoilers": false,
      "date": "5 April 2023",
      "rate": "4",
      "helpful": "81 out of 119 found this helpful.",
      "title": "Disappointing",
      "content": "\"You come at the king, you best not miss\", a line from HBO's \"The Wire\" was what's repeating in my head while I watched this.As a TV show in itself, It's not exactly bad. It's probably quite a bit better than usual gruel we get from streaming platforms.But it went after a bar that's way too high for it. It follows the story of the game pretty closely, even re-enacting memorable scenes down to camera angles, such as when protagonists first saw the overtaken city and such. It changes story here and there, but often it works quite well. I don't mind Sarah being... different. I don't mind re-imagining how things went here or there. I actually quite like little flashbacks/whatever scenes about stuff that builds the story or explains the lore, but wasn't in the game. It's all good.As long as the core premise holds. But it doesn't. I do buy Pedro Pascal, he looks like Joel, pretty much walks and talks like Joel, and feels right. But Bella Ramsey can't deliver Ellie. And it's not even her fault. Sure, she looks quite... off... and doesn't really come off or feel like a 14-year old (because she's not), but main problem is the aggressive, clueless script she's given.Story of \"Last of Us\", the game that won uncountable awards, was about a strong man coping with extreme loss, and a scared girl trying to get close to him, while slowly opening up and showing she's pretty capable on her own.Story of \"Last of US\", the HBO show, I'm not sure. Ellie in this one isn't a scared, suspicious, lonely girl trying to survive. Her very first scenes are full of cursing and gritting of teeth, she's a total badass with zero explanation to this, and goes more aggressive by every episode. The main theme just never comes through. Rather than someone Joel grows to love and care for as his own child, I keep wondering when he's going to dump her in the wilderness.Or to put it simply, they tried to add girl power where none was needed (because game had more than enough), and totally overdid it, killing the main premise.Which makes this entire show waste of time, because highly superior medium, telling that story times better, already exists.Play the game. Skip this show."
    },
    {
      "username": "SPZMaxinema",
      "userUrl": "https://www.imdb.com/user/ur132395489",
      "reviewLink": "https://www.imdb.com/review/rw9015679",
      "warningSpoilers": false,
      "date": "25 April 2023",
      "rate": "8",
      "helpful": "41 out of 60 found this helpful.",
      "title": "Suspenseful, good character development, and good story.",
      "content": "I will say that it took me an episode or two to get entirely into it and there are some episodes that are better crafted/executed than others. However, this is one of the best new shows I've seen in quite some time and I'm glad I checked it out. Bella Ramsey and Pedro Pascal have great chemistry, great backstories with their characters, and perform epically. The directing and production are very impressive as well. There are quite a few unexpected twists and turns that come up and the way things unfold really kept me engaged, even emotionally too! I've never played the video game but I know for a fact that the show is quality in many ways! It makes you think like what things would be like in a post-apocalyptic world with people, means of survival, precautions, etc. Bring on more!!"
    },
    {
      "username": "TakeUpReel",
      "userUrl": "https://www.imdb.com/user/ur15932214",
      "reviewLink": "https://www.imdb.com/review/rw9004914",
      "warningSpoilers": true,
      "date": "19 April 2023",
      "rate": "5",
      "helpful": "33 out of 46 found this helpful.",
      "title": "MEH! Does not live up to the hype!",
      "content": "The over-exaggerated hype of this show is through the roof. I purchased a subscription to HBO just to watch \"The Last of Us\" and I was disappointed. Maybe because my expectations was set too high for the show.I do not know anything about the game, so I can only judge the TV show.I liked Pedro Pascal and Bella Ramsey in the Game of Thrones. I like Pascal in the Mandalorian (even though we don't actually see him much). However, I didn't like the two main characters in The Last of Us. Either of them could have died along the way and I wouldn't have cared.A few of the episodes seemed to be filler, yet various details could have been explored further.At the end of the final episode, I said, \"Really?! That's how the season ended?\" Ughhh! I doubt I'll pay attention to the hype of season 2 when it comes out. That's too bad because the show could have been very good."
    },
    {
      "username": "eve_dolluk",
      "userUrl": "https://www.imdb.com/user/ur17402378",
      "reviewLink": "https://www.imdb.com/review/rw8805498",
      "warningSpoilers": false,
      "date": "16 January 2023",
      "rate": "8",
      "helpful": "579 out of 970 found this helpful.",
      "title": "Great first episode",
      "content": "***\" Update after watching the full series ****Well I think overall Id give this a 7 or 8, the opening episode was definitely a 9 the rest of the show would be getting either 7 or 8s depending on how appealing they were to me.Everything was well made, well acted, well shot etc. The brutality of it all was maintained throughout. I watched some of the game footage on you tube and there is a lot here that is identical to the game so thats a plus for fans of the game plus it works for a TV show so kudos to the game makers.The story and overlying themes are very simple and relate to parenting and how we protect our children or the young.It could have had more Cordyceps and more action in places but this was more of a drama surrounding the struggles of a broken world.Overall ill give it an 8 out of 10 a very good Tv Show that stays loyal to its source and was very well produced.**** Update *******Ill start by saying I've never played the games, I've no idea how true to the source it is.The first episode was very impressive, they told hold back here and emotionally you are involved quite early on.The prologue was informative but understated, The opening was brilliant and as good as anything you would see in a movie.The middle section is good and paced well to provide enough information going forward as to the objective the players and whats happened to the world outside.The episode ends at the start of an adventure.... I hope this quality remains throughout the show so the adventure is as good as the opening ( a hard act to follow ).Ive enjoyed the characters so far, not all likeable but our lead Pedro Pascal is familiar and trustworthy and does a good job. Bella Ramsey of Game of Thrones fame plays the female lead, I really hated her in Game of Thrones, her acting is a bit less wooden here so I hope I don't end up hating her in this. So far she has been fine.Its only 1 episode but its probably a 9 out of 10. I would be shocked if they can keep up this sort of standard and narrative throughout the series. Having said that there is plenty of scope for some interesting scenes. Im not a big fan of Zombie films or shows but can find them entertaining. ( I found Black Summer S2 brilliant )I hope this doesn't turn out to be just another zombie show.9/10 ( Ep1)"
    },
    {
      "username": "MamadNobari97",
      "userUrl": "https://www.imdb.com/user/ur45507551",
      "reviewLink": "https://www.imdb.com/review/rw8924843",
      "warningSpoilers": false,
      "date": "13 March 2023",
      "rate": "9",
      "helpful": "44 out of 66 found this helpful.",
      "title": "The Problem with the Show",
      "content": "So first of all, this is a fantastic show and one of the better new shows of the past couple of years. If you couldn't already tell by my rating for some reason, I really enjoyed the show through and through. It is just unfortunate that some choices held back this show from perfection.But I will first do the praises and talk about what's so good about the show and then I'll get to the problem I have with it.So first of all, obviously, the acting in this show from everyone (except maybe for Kathleen) is fantastic and Pedro Pascal and Bella Ramsey are the stars of the show. Bella Ramsey got a lot of unwarranted backlash for her being cast as Ellie just because she didn't look as close to the character. But she definitely proved why she was a really good choice for it.The show's premise and story are nothing you've never seen before. It would've been fairly original and fresh in 2013, especially for video games, but it still tries to make itself more unique and more distant from your average zombie story which I thought worked out really well. But there are still tropes and stories here you already know, so nothing that groundbreaking and original here. (Though not that this show has to be groundbreaking or anything,)But this show does a great job as a live-action video game adaptation and I think it's safe to say that this is the best video game adaptation to date.The production is just top-notch and aside from the occasional obvious green screens (and that's only if you're really zooming on it to find a flaw), the visual, CGI, and makeup are just top-notch and I really enjoyed this aspect of the show that they didn't cut corners on the set design and makeup for the zombies and the special effects for the rundown post-apocalyptic world of this show. The production value is really high and the visuals are just fantastic and they don't cheap out on not showing the run-down cities and ruins.The music is mostly the same pieces from the game, especially the intro music, which I have zero problems with and I'm actually glad that they kept it for the show too because it's a fantastic piece. But the rest are mostly licensed music which are really good choices too for the show, but I don't think I noticed that much original new music for the show itself other than the finale. But still, no problem with it, just an observation.They didn't screw this video game adaptation like dozen others by ruining the world, the characters, and the story. This show is mostly shot-for-shot recreation of the game, at least for the more iconic scenes, and I have zero problems with it. They do a really great job of keeping what best worked in the game and adapting to the live-action and adding and changing things to improve and maybe a little worsen it.Though I must say I've never played the game, but I have watched a full walkthrough of it many years ago, but my recollection of the story only extends to the intro and the ending of it. So I'm not really reviewing this show from the perspective of someone who has played the game and knows the story well or trying to compare it.Overall, I think everything in this show, apart from the writing which I'll get to it in a second, is top-notch and I really enjoyed watching it, and made me excited to play the remake when it comes to PC. I just wish I binged this show instead of watching it weekly though, because of the problem I'm gonna talk about now. And also, if you binge the show, you'll notice these problems and the rushedness of the story.So the praising and the goods aside, let's get into what I have a problem with in this show and what I think hinders the show from being greater.First, the second biggest problem in my opinion is Neil Druckmann's boner for flashbacks. This guy loves his flashbacks so much that he dedicated two full episodes of this show to them. He would make a whole movie and series that is just 99% flashbacks if you gave him full control. I just don't understand this guy's fascination with flashbacks and why he thinks it's a really good storytelling tool. I don't really have much against flashbacks, I don't care for them, but I don't hate hate them either. But when there are such big amounts of flashbacks in your story that it hurts the main storyline, then I have a beef with it.If you're telling a story, you characterize your characters and develop them through your main storyline and plot. You don't flashback every 5 minutes so we could see what they did a couple of years ago. Sometimes flashbacks are a necessary tool to give your character more depth and I definitely prefer flashbacks to \"tell don't show\". But having entire 1-hour episodes dedicated to flashbacks, and then your main plotline getting 40 minutes is not it.Now I think they did a great job with episode 3 and the only problem I had with it was that it wasn't more connected to the present plotline that makes one think what was even the point and it was a filler.But comparing episode 3 to episode 7, you can see that they actually had something in episode 3 that they didn't have for episode 7. They actually told a really good story in episode 3 with good characters and great actors, and it was interesting enough to warrant a whole episode. But they didn't have enough material and also an interesting enough story to dedicate an entire episode to what we got in episode 7. I don't have a problem with them flashbacking to Left Behind which is a DLC of the game, I just think it would've worked better if the flashback and the main story moved side-by-side and the story didn't halt because we have to watch an hour of flashbacks now. That's the problem with these kinds of flashbacks, they halt the main story which is already barely developed to tell another story.This leads to my biggest problem with the show, which is how rushed the story is, and the flashback episodes might be culprits.Even though I don't remember much from the game, it is still obvious to me that they skipped a lot of plotlines to just do the main big events and be done with it. Most side characters don't even stay for two episodes, they are introduced in the episode, and they are killed at the end of that episode, apart from some other side characters that survive two or three episodes.But my point is, what's the rush, and what's the point of putting this much effort into the great production and set designs and makeup and all the effort they put into making the show, just to rush through the story and skip on actual development?This show would've been way better if we got more Joel and Ellie time and maybe not just jumping into the next plot point quickly without effective buildup and development. Hell, I even thought I skipped an episode when I started watching the finale since everything happened so fast and they don't really convey the sense of time. The last episode is so short that they could've skipped a little from the first part of it and attached the rest to the last episode to get a longer finale since they like skipping this much.And I think most of these decisions are most probably because of budget restraints and this is probably the best thing could've come up with to compromise. But then again, they still could've put all that effort and budget that went into episode 7 (which I guess was cheaper than other episodes anyway since it was all indoors), and developed the main storyline more.Another annoying thing they do is the fake-outs. Well, they're not technically fake-outs but I don't know what to call the trope. It's when they don't show someone getting bitten until after it happens. It's just a cheap trick for a \"twist\" and surprise that gets old really quickly.The first time it happens it's great and works well for the story and characters. It's a great emotional gut punch. The second time is whatever. But doing it again and again? What's the point of it if you're gonna show it 10 seconds later? And also characters not knowing they've got bitten for some reason as if they can't feel being bitten? And don't give me that adrenaline crap because they would definitely feel it if they were getting bitten in the middle of fighting.I don't have a problem if they do it once or twice, but doing it so much just cheapens the effect and becomes comical. They deliberately refuse to show them getting bitten or react to them until the reveal.It reminds of another example of this that was in Moon Knight, which they just actually skipped action and not showed what happened. Literallly skipped the action even in the finale. It's just baffling. Also reminds of the Uncharted movie where things just magically teleport into the thieves' pockets and you have to believe they \"stole\" because the script says so, even though the two people didn't even get close to each other.Another relatively small problem I had with the show is the character Kathleen and how the show's writers try to portray her and actually the actress they chose for it. Since I haven't seen her anywhere else before, I cannot say if her acting is bad or the casting director made a mistake, or she was intentionally miscast and misdirected on how to act as this character by the showrunner. But I won't get into it much, I think you can find many other reviews on the episodes she was in and see why people had a problem with her character.Other than these couple of issues, I don't think I had much of a problem with the show as a whole and I enjoyed it overall, and though I think with these storytelling and writing problems, it's probably an 8/10, I'm still giving it a generous 9/10 since they performed a miracle by not totally fking up a video game adaptation beyond recognition and actually delivered the best video game adaptation ever, which is an achievement in itself."
    },
    {
      "username": "alekspredator87",
      "userUrl": "https://www.imdb.com/user/ur52780913",
      "reviewLink": "https://www.imdb.com/review/rw9067069",
      "warningSpoilers": false,
      "date": "20 May 2023",
      "rate": "9",
      "helpful": "23 out of 32 found this helpful.",
      "title": "The last of us",
      "content": "The history of acquaintance with this amazing story began quite a long time ago. Once I managed to watch a walkthrough of the game in the format of cuts, which made up essentially a whole animated film. Here I will not deal with the analysis of the game itself, because we will talk further about the series, but I will just note that the story of the main characters, the setting of the game and the development of the plot really sunk into my soul. And when I accidentally found out that a serial adaptation of \"The Last of Us\" was being prepared, I was inspired, realizing that I would be able to see a new version of the beloved story on the screen.The series is an amazing creation that perfectly adapts the game and turns it into an exciting story about survival in a post-apocalyptic world. The main roles were played by Pedro Pascal and Bella Ramsey, who at first seemed to many (and to me in pritsnip) not very suitable candidates from the point of visual similarity with the game characters. However, as soon as I started watching the first season, all attempts to compare went away. The actors liked the game, and the characters of Joel and Ellie appeared in a slightly modified form, were perceived somewhat differently, but by the middle of the season they became as native as the characters from the game. The actors played their characters at the highest level and conveyed all the emotions and feelings that are inherent in this story.The series tells about a group of survivors in a world affected by a fungus that turns people into bloodthirsty monsters. The main characters must go through many trials, survive and find that distant place where fate leads them through vast territories.The story of the game is perfectly conveyed in the series, which allows the viewer to immerse themselves in the world created by the developers. You can see how the whole team tried to convey the atmosphere of the game, beautiful visual solutions were sometimes copied, but at the same time the directors did not abuse this, still showing a separate story. All viewers will be able to understand and get into it, not just those who somehow know the game. The series was created with an eye on the entire audience without the problems often encountered in such projects, where one or another reference, situation, characters will be understood only by those who have played the game before. Therefore, I urge you to boldly watch \"The Last of Us\" for everyone, not just gamers.There are a lot of characters in the project, which are represented by different actors. The characters are spelled out well, and every actor that meets on the way of Ellie and Joel teaches them and the audience something new and important: to be a good friend even in the society that has developed around, to be able to help even strangers in a difficult situation (although strangers are usually dangerous here), to be able, finally, to love and build a life with your loved ones, although it seems that this is impossible in the current events.Each episode will be able to show something new and interesting: the relationship between brothers Joel and Tommy, Henry and Sam, the unforgettable love between father Joel and his daughter Sarah, the friendship between Ellie and Riley, Joel and Tess, the love of a couple who have lived together for years, and, it seems, a lifetime, the relationship between groups of people. But of course the most interesting and central story will be the acquaintance of Ellie and Joel, which will turn everyone's life around. These two will distrust each other, learn to live in a single journey, and then completely protect each other from any danger. Each of them has lost too many in this world, and learning to acquire new loved ones is too difficult from a moral point of view. After all, the world of the series is too dangerous, it takes away those you love.The series is not only an exciting adventure, but also touches on important topics such as family, friendship, love and sacrifice. The main characters go through many trials, but they never lose hope and faith that they will be able to survive in this world. Despite the fact that the story tells about life in a post-apocalypse with peculiar monsters and zombies, the focus of this project is noticeably shifted to the relationship between people. And this is a clear gain against the background of the famous, say, \"The Walking Dead\" by Frank Darabont, who has passed 10 seasons and the good second half of the series focused on endless clashes with armies of zombies. No. This is not entirely bad, but for me personally, \"The Last of Us\" is significantly different from the usual zombie apocalypses. This is exactly the story of people in the world of monsters, not monsters in the world of people.Excellent directing and high-quality special effects create an atmosphere of reality, which allows the viewer to fully immerse themselves in the world of the series. In addition, the soundtrack, which was created by Gustav Santaolallo, adds additional depth and intensity to the series. Great sound, lingering melodies that evoke a certain sadness and even a sense of nostalgia for the past. According to the past of those people who have been living for two decades in this story after the outbreak of the plague, which depopulated almost the entire planet.One of the main features of the series is its relevance. The story of survival in a post-apocalyptic world affected by a virus may seem unreal, but it has a deep meaning for our modern society. The series shows that people should be prepared for any challenges that may arise in life, and what is important is to keep hope and faith in the future.\"The Last of Us\" is a strong creation, a series that touches the hearts of viewers. It conveys important emotions, makes you think about life and shows that love and hope can exist in any conditions.9 out of 10."
    },
    {
      "username": "cagdas-21-315073",
      "userUrl": "https://www.imdb.com/user/ur53242067",
      "reviewLink": "https://www.imdb.com/review/rw8951153",
      "warningSpoilers": false,
      "date": "26 March 2023",
      "rate": "6",
      "helpful": "118 out of 184 found this helpful.",
      "title": "Seriously IMDB 9+? Most overrated show ever!",
      "content": "I'm 44 and don't remember another show that was overrated as much as this is!! Based on its IMDB rating, I was under the impression that Last of Us is the next thing and I waited for weeks in order to watch the entire season. What I got in return was that another post-apocalyptic journey that was artificially extended just to tell a story which basically can be told merely in 2 episodes! I could notice nothing original, nothing untold or not done in the whole season! There are many shows streaming now that are -I'm not exaggerating- at least twice as better than this show. What a disappointment and letdown!"
    },
    {
      "username": "rockdude-68045",
      "userUrl": "https://www.imdb.com/user/ur127077588",
      "reviewLink": "https://www.imdb.com/review/rw8928151",
      "warningSpoilers": false,
      "date": "14 March 2023",
      "rate": "6",
      "helpful": "125 out of 197 found this helpful.",
      "title": "Great adaptation that loses focus",
      "content": "Let me start with saying this is one of the best video game adaptations. There's a lot to love in this series that thankfully stayed true to the game while creating space for the show to be it's own so that it wasn't just an exact copy paste. The production, acting, and everything included delivered like a big budget series. It was entertaining for majority of the series but it did have some issues.The main issue I noticed was the inconsistency of the episodes. Each episode felt like it truly had a different feel to it. Unfortunately that didn't always work out for me. Isolating the series by each episode is what ultimately caused me to not rate it overall higher because there were some episodes that just felt flat.In terms of casting and characters I felt that the decisions to switch it all up was actually part of what made this show separate from the game and allow it to be good on its own. Although, as much as I really wanted to like Bella Ramsey as Ellie I just for whatever the reason could not. She's really the only character from the show that for some reason didn't feel like the best fit. However, she did do a good job and my person preference/discrepancy aside was a different but good Ellie.There's a couple episodes that I felt didn't really contribute towards the overall development of the show. They might have been entertaining or were meant to add to the complexities of the show but unfortunately most of the time whatever they were supposed to do ultimately was erased by the end of that episode. My main example would be bill & frank. It was a great storyline but if you removed it from the show and think of it all as a whole did it really make a difference if it was included or not to the main storyline? No not really. However, it would have been an amazing spin-off or could have been a better episode by having more investment into their stories with Joel. Instead he basically just showed up at the end and was like oh - well at least he left me his car with that battery I've been looking for and then cue episode ending.Finally, the most important criticism of them all. The infected. Where were they? They were decently included for the first half of the series and then they basically disappeared in the second half of the series. It's starting to take some of the corner cutting of shows like the walking dead where the focus shifts away from the post-apocalyptic infected survivors facing them + bad people to just people wondering around until they inevitably find bad people and eventually overcome them. I'm not a fan of it. I think it's cheap and loses sight of the catalysts driving the narrative behind everything. I mean the game was mainly stealth because of how many infected there always was but in the show they just walk around openly no sweat about the infected but they were definitely worried about other people. To me that's an indicator that they lost a bit of focus for the show.People will complain because they would rather watch a post-apocalyptic neighborhood/high school style tv show than what the content really is which is supposed to be a post-apocalyptic survivorship filled with drama already in it. Yes I'm aware not every second has to be a thrilling action packed show, but that doesn't mean you erase the main fabric of the show either. They will be upset because personally I feel there may have been better options for who played Ellie even though she did do a good job and I just didn't care for her specifically. People will be upset because I'm critical of episodes that are shielded by what they represented or the statement they were trying to convey through storytelling but as a critic of the show I noticed they weren't pivotal to the main storylines progression or could have been accomplished without an entire episode to do it.People have a right to their own opinions and this is mine. I felt that this was one of the best video game adaptations that fortunately stayed very accurate to the games story while allowing it to develop its own identity. Unfortunately it also lost it's focus and struggled to establish a consistency in each episode & properly convey the main storyline without being sidetracked or ultimately rushed. I mean start to finish by the end it didn't have the same effect that the game did. There's a lot factoring into that but honestly it felt like the show played it a bit safe, conservative with infected, and underwhelmed the main plot by losing focus on it through out. I felt like I kept waiting for that moment where I went \"YES!\" and the whole series just took a leap into the right direction (like red wedding in GOT or similar) but it just never happened for me. 6/10 - Good not great but has potential to be so much better. I'm excited for the next season and I hope some of the criticisms and feedback will help to improve it."
    },
    {
      "username": "ziancara",
      "userUrl": "https://www.imdb.com/user/ur107200034",
      "reviewLink": "https://www.imdb.com/review/rw9018094",
      "warningSpoilers": false,
      "date": "26 April 2023",
      "rate": "9",
      "helpful": "40 out of 59 found this helpful.",
      "title": "Survival, Heartbreak, and Redemption: The Last of Us TV Series is a Must-Watch Adaptation",
      "content": "\"The Last of Us\" is a video game adaptation that has made its way onto television screens with a bang. The show follows Joel, a tough survivor, who is hired to smuggle Ellie, a 14-year-old girl, out of an oppressive quarantine zone, 20 years after modern civilization has been destroyed. What starts as a small job soon turns into a harrowing journey across the United States, as the duo relies on each other for survival.The show has only one season with nine episodes, but it has already garnered an impressive score of 8.8 on IMDb. And it's easy to see why. The acting, writing, and production are all top-notch, immersing the viewer in the gritty and dangerous world that Joel and Ellie must navigate.The dynamic between Joel and Ellie is the heart of the show. The way their relationship develops over the course of their journey is both heartwarming and heart-wrenching, and it's impossible not to become invested in their story.But \"The Last of Us\" is not just a character-driven drama. It also delivers tense action sequences and moments of intense horror, keeping the viewer on the edge of their seat. The show's use of flashbacks and its exploration of themes such as loss, grief, and morality only add to its depth.Overall, \"The Last of Us\" is a must-watch for fans of the video game and newcomers alike. It's a masterclass in storytelling and a prime example of how to adapt a beloved property for a new medium. With its outstanding performances, engaging characters, and expertly crafted world-building, I rate \"The Last of Us\" a 9/10."
    },
    {
      "username": "lucasalvescortegagna",
      "userUrl": "https://www.imdb.com/user/ur149537456",
      "reviewLink": "https://www.imdb.com/review/rw9045843",
      "warningSpoilers": false,
      "date": "10 May 2023",
      "rate": "10",
      "helpful": "31 out of 40 found this helpful.",
      "title": "\"The best game adaptation so far!\"",
      "content": "It was a beautiful experience to follow every episode of this series, from Sunday to Sunday. Being able to enjoy each episode at the right time.I find it incredible that in this series, both those who know the game and its story, as well as those who have never had contact with it, can identify with the characters (Joel and Ellie), the world created, the tension of the story, and how well it was directed.Of course, there were changes from the game that, for those who didn't know it, didn't matter much. For me, the changes fit well in the proposal they wanted to give to certain episodes.All nine episodes were necessary to adapt the entire first game, without cuts, except of course, for the action parts that are more necessary in a game than in a DRAMA series.The relationship between Joel and Ellie (also due to the actors) was very well explored and managed to convey the same emotion as the game, between a father and daughter.NOTE: Great series to watch with parents, yes! Even those who haven't seen the game can be amazed and connected enough to be interested in finishing the series."
    },
    {
      "username": "haddonfieldmech",
      "userUrl": "https://www.imdb.com/user/ur157178320",
      "reviewLink": "https://www.imdb.com/review/rw9071365",
      "warningSpoilers": true,
      "date": "22 May 2023",
      "rate": "9",
      "helpful": "19 out of 22 found this helpful.",
      "title": "Great Companion to the Game",
      "content": "It took me a long time to get around to playing the game, which I started because I was watching the show. I had heard massive praise for the show while its early episodes were airing and I decided to give it a shot. Being that I am a huge fan of The Walking Dead, it confused me as to why I wasn't that interested in the show following the pilot episode.However, once I started the game I began to see all of the great easter eggs and nods to the source material that the show contains. That is my first plus - fans of the game will have a different experience than those who haven't playing the game, and I was able to play both of those sides.Often times, modern media is so obsessed with insane action and over the top set pieces that take you right out of the media. TLOU never does that. Just about every scene is grounded in reality (save MAYBE the bloater attack in episode 5 and Ellie killing James in episode 8) and that makes you feel like this apocalypse is real and as dangerous as they all claim.Unfortunately, that is also what will bring the show down for many. The game has one of the best combat systems that I have ever played and the show does little to adapt that. There is not an eighth as much action as there is in the game, which makes the show more realistic, but not as entertaining. That's not to say it is absent, but very much toned down.What the action is replaced with is great character development, beautiful cinematography and landscapes, and brilliant performances from Pedro Pascal and Bella Ramsey. You believe that Pascal is a hardened survivor who has lost everything and that Ramsey is a spry and smart-mouthed teenager. Many of the supporting characters (Henry, Sam, and David especially) are played wonderfully as well.The CGI in scenes looks very good, which can't be said for many video game adaptions. The FX are great on the Infected (namely the Clickers and Bloaters) and when you see someone get murdered it looks like they are being murdered.I jumped on the Last of Us bandwagon way too late, but I'm glad I did at some point because in my mind, this show is worth the praise it gets. The season has some slow patches, but overall, it is a great adaption of the game and an even better companion for both fans of the game and non-gamers alike."
    },
    {
      "username": "hoernkeem",
      "userUrl": "https://www.imdb.com/user/ur44376731",
      "reviewLink": "https://www.imdb.com/review/rw8971729",
      "warningSpoilers": true,
      "date": "4 April 2023",
      "rate": "9",
      "helpful": "27 out of 40 found this helpful.",
      "title": "The Last of Us season 1 (2023, HBO) Despite a surprising lack of infected this still packs a punch as a stellar post apocalyptic human drama",
      "content": "'The Last of Us' is a post-apocalyptic drama that closely follows the events of the wildly popular 2013 video game developed by Naughty Dog. The series was created and written by Craig Mazin and Neil Druckmann. Mazin gained a lot of acclaim for developing the HBO mini-series 'Chernobyl'. Druckmann was a co-creator on 'The Last of Us' video game which is one of the most praised video games of all time. It is also intensely cinematic which allows for an interesting transition to an actual series. It gives show creators more to go on, but also more to live up to. The show stars Pedro Pascal in the role of Joel and Bella Ramsey as Ellie. The show premiered on January 15, 2023 and was released on an episode a week basis for a nine episode run. The show has been quite popular with fans and critics alike although hard core fans of the game are somewhat divided.'The Last of Us' takes place in a post-apocalyptic U. S. landscape following a fungal outbreak that has decimated society and government. The fungus (Cordyceps) ostensibly creates zombies by another name. Infection is spread similar to every zombie movie you have ever seen. Joel loses his daughter in the initial outbreak and has a brother that winds up out west while Joel earns whatever living he can in Boston QZ. The nation now has QZ's which are quarantine zones that are free of infected, and are run by military factions which is about the closest thing to government that remains. There is a revolutionary group known as the Fireflies who seek to overthrow the military rule in attempt to return life back to normal as best they can. Through the Fireflies Joel meets Ellie who is immune to the fungus. Joel is tasked with escorting Ellie to a medical facility out west to see if they can glean what makes her immune and thereby create some sort of vaccine which could save humanity from the inevitable end of the zombie apocalypse. While Joel begins the journey as a begrudging guardian, as they experience trials and tribulations, he and Ellie come to rely on one another and become their own little family unit who sacrifice and kill for one another in order to continue on their quest. Along the way we get glimpses of love amongst the ruins in two relatively stand alone episodes, and we also see a few areas where the QZ's have fallen and what rushes into that vacuum is not necessarily better. Ultimately Joel and Ellie reach their destination only for Joel to face a pivotal decision that could change the course of humanity as well as forever alter his relationship with the one person left on Earth who relies on him.This is is a very high level, high quality show from the acting and writing to the painstaking production design which mimics a lot of game locales. This is an extremely good TV show with only some slight down checks. While this is very popular there are those out there who take issue with it, and I feel like most of those criticisms come from game loyalists who cannot deal with any changes to their beloved source material. While this follows the game very faithfully there are some key departures which may rankle fans. To me one of the clearest differences comes in the performances of Joel and Ellie. They are not really Joel and Ellie from the game at least as far as I remember them. Pascal comes closer to hitting the mark with Joel, but I feel like Ellie is a decent departure from how she operated in the game. Some people will not be able to get over that, but I think if you can check those expectations at the door and just roll with the actors and performances in the show you can really have an amazing time with the show. My other down check is the fact that this is ultimately a zombie show that is almost devoid of zombies. They show up here and there, but the creators have deliberately concentrated on the more human aspects of this post apocalyptic story, and while what they do put on screen is very good without that constant threat of infected the show loses something. The entire society is framed by the fallout of this infection, but it loses meaning for the viewer when we don't constantly get the threat reinforced. When we get to the end of the show and the end of Joel & Ellie's journey, which is this quest to save humanity, I was thinking save it from what? It doesn't seem like there is that much infected going around so why bother? If they would have boosted random infected encounters and perhaps added a whole other episode where the primary focus was dealing with infected I feel they could have really captured that constant dread. That aside the things they did focus on were great. All the characters were complex and well layered with absolutely superb writing and acting. The kind of stand alone 3rd episode was completely random, but the most moving episode of the entire show, and the ending which is practically a carbon copy of the game contains decisions and moral dilemmas that will echo for as long as the show decides to continue. While I have some slight qualms this is an expertly crafted show that is stunning to behold.Eric's Grade: A-"
    },
    {
      "username": "darkreignn",
      "userUrl": "https://www.imdb.com/user/ur33659536",
      "reviewLink": "https://www.imdb.com/review/rw8998747",
      "warningSpoilers": false,
      "date": "16 April 2023",
      "rate": "5",
      "helpful": "24 out of 35 found this helpful.",
      "title": "Has a lot to like, but also leaves a lot to be desired",
      "content": "\"The Last of Us\" has so much good in it: The direction and cinematography, the performances, the production value, the plot - all of it is of an incredibly high quality, higher than one may expect from a seemingly typical post-apocalyptic television series. So what then garners a rating as low as the one I have given? Simply put, \"The Last of Us\" has some of the worst pacing I have ever seen in a mainstream TV show.God, how I wanted to love this series. There's no denying that Pedro Pascal and Bella Ramsey are giving their all here - both of them had me openly weeping at various moments due to the sheer emotional resonance of their performances. However, with all the quality and production value both in front of and behind the camera, \"The Last of Us\" suffers from a surprisingly rushed pace. The phrase \"too much but not enough\" comes to mind here, especially considering the amount of flashbacks that this series contains. I mean, two episodes are virtually nothing but flashbacks, and almost every single episode contains a flashback of some sort that grinds the current story to a halt. So, when a flashback isn't occurring, the writers need to catch the story up, leading to a two episode finale where the episodes are the two shortest of the entire show. I mean, what's up with that?In a show about a proxy father-daughter relationship, it's unfortunate that said relationship takes up as little screen time as it does - Joel and Ellie are the stars of the show, and yet it feels as if they are the ones who are seen the least in the series. And so, when their inevitable bonding occurs, it is unbelievable simply because the show devoted so little time to them. And that, to me, is this show's biggest downfall; I simply didn't believe the relationship between them because the series spends more time in flashbacks and with other characters than with the two people the audience cares most about.Truth be told, the show spends so much time in the past that it feels like the present is an afterthought; the reason the game series is beloved is because of the father-daughter relationship between Joel and Ellie - the show forgets that for two whole episodes, and ignores it for basically four to five episodes, leading to a climax that, while riveting, is unbelievable due to the lack of proper build up. And that's such a shame, because Pedro and Bella are phenomenal in their roles.Additionally, for a zombie series, the show barely features any zombies - the first few episodes have all the undead violence you can ask for, but that all gets put on the back-burner for the remaining episodes to focus on the true villains: the people. And while that's a novel idea, it rings hollow, especially during the last episode when it is finally revealed why the Fireflies want Ellie. Let's just say that \"The Walking Dead\" did it better.\"The Last of Us\" has a lot to like, but also leaves a lot to be desired. The production value and overall quality is through the roof, so it's a shame that the pacing is as rushed as it is; two or three more episodes would've worked wonders in building up the relationship between the two titular characters. What we got wasn't bad, per se, but it wasn't nearly as fantastic as it could've been."
    },
    {
      "username": "knifemagnet",
      "userUrl": "https://www.imdb.com/user/ur10017506",
      "reviewLink": "https://www.imdb.com/review/rw8936130",
      "warningSpoilers": false,
      "date": "18 March 2023",
      "rate": "6",
      "helpful": "157 out of 257 found this helpful.",
      "title": "Just OK",
      "content": "HBO, of course, deviates and inflates things at every change they get; dedicating an entire episode to a gay couple's love story (which wasn't in the game), or dedicating another entire episode to the girl's backstory (which could have been done in a fraction of that time). It seems HBO likes to grab on to stuff that they then have to fluff and stretch out to make a series - GOT was the same thing only in that case they outpaced the source material. This show is certainly better than that Walking Dead stuff but it is sorely overrated. Anything above an 8/10 in my book is absurd... There is absolutely no way this show is on the same level as Breaking Bad, The Sopranos, Band of Brothers, etc."
    },
    {
      "username": "d-papadakis",
      "userUrl": "https://www.imdb.com/user/ur51081525",
      "reviewLink": "https://www.imdb.com/review/rw9049035",
      "warningSpoilers": false,
      "date": "11 May 2023",
      "rate": "9",
      "helpful": "32 out of 46 found this helpful.",
      "title": "Not Just Another Zombie Show",
      "content": "I saw the series before I played the game. Both are true representations of each other. The series is way more than another zombie movie. The game is a masterpiece (not just me saying that, gamers with lots of cred think so).The actors selected in the series were perfectly cast, and the story reflections at the end of each episode make it all the more worthwhile to watch (just like the other Mazin masterpiece Chernobyl).I finally got what it is about after playing the game many times through and watching the series about 4 times.It is about being a parent, and all that comes with it. I don't have children because I was too frightened to have them, not because I didn't want them. This series and the game, both showed me how brave parents are, because once that kid pops out, it all really matters."
    },
    {
      "username": "catalinmarian-13885",
      "userUrl": "https://www.imdb.com/user/ur99233806",
      "reviewLink": "https://www.imdb.com/review/rw9020175",
      "warningSpoilers": false,
      "date": "27 April 2023",
      "rate": "9",
      "helpful": "32 out of 48 found this helpful.",
      "title": "It can be seen that it was made by HBO!",
      "content": "\"The Last of Us\" is a must see for those who want a good post-apocalyptic story. For someone who hasn't played the game, he can take it like any other series like I did. The acting, the writing, the production and the effects are at the highest possible level, which plunges the viewer into the dangerous world in which Joel and Ellie have to navigate. The relationship between the two is super well done and very emotional, both the main characters and those that appear along the way are very well constructed, you can't help but be invested in their story and NO, I don't care that Joel and Ellie don't look like they do in the game , Pedro Pascal and Bella Ramsey do an exceptional job. Maybe the only problem I saw is that towards the end it feels rushed, the last episode was a little disappointing but it didn't ruin the journey I had every week."
    },
    {
      "username": "lampreviews",
      "userUrl": "https://www.imdb.com/user/ur162650974",
      "reviewLink": "https://www.imdb.com/review/rw9032560",
      "warningSpoilers": true,
      "date": "4 May 2023",
      "rate": "8",
      "helpful": "26 out of 32 found this helpful.",
      "title": "An Adaptation That Captured The Same Light As The Original Game.",
      "content": "To begin, I'm just going to say it upfront, HBO's The Last Of Us is an incredible show. I won't be comparing the original game and the show very much throughout this review, only doing so when specific points are being made.First of all, I'd like to start off with the good, that mainly being the characters and world. The world of The Last Of Us will always be one of interest to me, a place that really brings out your true colors. A world that is so full of life, and yet it's one that takes it away before you could take in the first 30 minutes. The characters are written beautifully, the relationship between Ellie and Joel will always be one of complexity. They are two people who have many layers to them, and their interactions and past make it truly special how they are together. The side characters that appear in the show are just as well written, Henry and Sam being stand-outs. They were already amazing in the game, but in this show they felt almost better? The final scene with them in the original is better purely due to the fact you get more time with Henry and Sam, so you get a better connection with them. But that doesn't mean it wasn't good in the show, it was beyond good. The same depth and feeling could be felt as what happens goes down. And don't even get me started on David, he was already sick enough as it was in the game, but they managed to make him worse in the show, a feat that I applaud. 'There's also things such as the Cinematography, Score, Costume Design, and Sound Design that are also amazing. The score being the standout in the previous list, The Last Of Us will always have a fantastic score.Where I see most people's issues with the series come from are episodes 3, 7, 9, the lack of action, and the lack of Infected in the show. I actually really enjoyed 3 and 7, and thought they were excellently written. Although 7 is probably my least favorite of the series, it managed to feel the exact same as Left Behind did in the game. They also serve the same purposes, Bill in the original was Joel and Ellie's way of getting a car, and it works the exact same in the show. While they do divert off the main path in terms of plot, I believe 3 and 7 are great anyways. I loved episode 9, but I think that's because nearly everyone loves the climax of the original game. I believe it should've been longer, maybe the longest of the series or tied with When Your Lost In The Darkness. And even though they do the same thing done as the game, following nearly every plot point and major part perfectly, I do agree that it felt partially rushed. But I doubt it actually was rushed, more so it just fell behind the rest for whatever reason. Episode 9 is likely my favorite episode, only behind 1 and 8 by just a little bit.Although I do agree about the lack of infected. I do think that the infected should've been more active, and their lack of appearances in the show is the only reason I didn't rate this a 10. There are multiple places and scenes where I think having Infected would've benefited the show, like Bill's place after he died or in a house during Ellie's solo journey. It feels morose as just a post-apocalypse rather than the post-outbreak it's supposed to be. And of course with the lack of Infected, also comes the lack of action that stimulates some viewer's minds. I believe the show was perfectly fine in terms of action, maybe a few more scenes with the Infected would've helped, but I personally didn't find an issue with the action, as that's not what The Last Of Us is about. Nonetheless, it's still a great show and all the scenes with Infected in them are great.Overall, I think this show is amazing. It does nearly everything right, and perfectly captures the same light as the original game in terms of Story, Writing, and Character Depth. However, I'd much rather recommend the game.It's the perfect story, giving you enough time to connect with the characters before they die and feeling even more brutal and depressing than the show. There's a few things that aren't as good, such as Sarah's death or the Bill plotline. But that doesn't matter compared to the rest.Thank you for reading, and I'll definitely be re-watching this show in the future."
    },
    {
      "username": "arod_85",
      "userUrl": "https://www.imdb.com/user/ur26432148",
      "reviewLink": "https://www.imdb.com/review/rw9013144",
      "warningSpoilers": true,
      "date": "23 April 2023",
      "rate": "8",
      "helpful": "28 out of 43 found this helpful.",
      "title": "Really Good Series",
      "content": "This reminded me of an updated Will Smith's \"I am Legend\". Television in recent years has become so cinematic and this series is proof of that. It is overall a high quality series in all aspects: plot, graphics and special effects, acting, and cinematography. It was fun to see featured actors you have seen before in different episodes. The two leads are absolutely magic together. I've grown to really really like Pedro Pascal and he is just great in this series. There is not a weak link in terms of acting anywhere in this show. I didn't give this a perfect score because though all were strong episodes, some episodes were masterpieces (1, 5, 8) and a few kind of dragged in some areas (2, 4 and kind of an underwhelming season finale though the decision Joel has to make is such a fascinating ethical dilemma) but overall it is a very good series definitely worth watching. Episode 5 with the deaf child was some of the absolute best television I have seen. The deaf child actor was totally amazing and that episode was utterly heart breaking. I literally cried during that episode. Looking forward to season 2."
    }
  ],
  "errorMessage": ""
}