{
  "imDbId": "tt6763664",
  "title": "The Haunting of Hill House",
  "fullTitle": "The Haunting of Hill House (TV Series 2018–2018)",
  "type": "TVSeries",
  "year": "2018",
  "items": [
    {
      "username": "kay_rock",
      "userUrl": "https://www.imdb.com/user/ur3308181",
      "reviewLink": "https://www.imdb.com/review/rw4395624",
      "warningSpoilers": true,
      "date": "14 October 2018",
      "rate": "10",
      "helpful": "1,171 out of 1,393 found this helpful.",
      "title": "This isn't just great horror",
      "content": "This isn't just great horror - it's brilliant filmmaking.Everything from the writing to the cast to the cinematography to the editing is just amazing. I was immediately hooked in from the first episode and wasn't able to stop (thank goodness I started in the morning and have a cold... and therefor a good excuse to lounge in front of the TV all day!).By episode 3 I was texting family members who texted me hours later to tell me what episode they were on.It also scared the bejeezus out of me, and that's hard to do. I watch a lot of horror and am fairly jaded. It takes a lot to scare me. This isn't blood and guts and gore, and although there are several jump scares they aren't cheesy. Instead, they are well placed and appropriate and did the job. Mostly it is atmospheric and paced beautifully to make the most of every scary moment. It wasn't over-the-top with supernatural silliness, either (although it is definitely a supernatural story). They presented in a way that felt... well... possible, and the characters (for the most part) behaved in ways that made sense for their personalities. And those personalities evolve wonderfully. You really get a sense of what the family history has done to each person based on what they experienced. You can see how they developed their foibles and strengths. Such rich characters.The editing was well-crafted. You are jumping around a lot in time. For the first few episodes it was a little confusing, but pretty soon you adjust to the \"tells\" which let you know where you are in the story, and I loved how bits and pieces were revealed in snips and dribbles, until a full picture emerged. You are in a constant state of both anticipation and curiosity, waiting for scenes to be expanded upon. Every answer raised questions.I feel bad that people who don't enjoy horror will end up missing one of the finest new productions on the air right now. It's that good. It's horror, sure, but it's also a mystery, a family drama, and a psychological thriller."
    },
    {
      "username": "zack_gideon",
      "userUrl": "https://www.imdb.com/user/ur66094405",
      "reviewLink": "https://www.imdb.com/review/rw4396680",
      "warningSpoilers": true,
      "date": "14 October 2018",
      "rate": "10",
      "helpful": "510 out of 684 found this helpful.",
      "title": "Perfect",
      "content": "This show is about life and death, the two conditions we all know. Personally watching this show made me cry many times. I'm a guy who never cries. This show is directed perfectly. Acting is also perfect. The mother's soul is acted in a way where I've never been so moved ever. Carla gugino is so incredible that it brought me to tears. She might be the best actress on the planet right now.I feel different after watching this show. The child actors are amazing as well. Just watch it. Words can't really interpret it in a fair way. Feelings based on your own life experiences will let you experience it in your own way.I've watched many many tv series in my life and this one blew me away. Netflix is doing it, they're letting true artists control everything. This show makes me yearn for more seasons because every actor including the children make it so good. Enjoy. And be prepared to be jump scared one time really really good :)."
    },
    {
      "username": "sxxn_hotmd",
      "userUrl": "https://www.imdb.com/user/ur30617251",
      "reviewLink": "https://www.imdb.com/review/rw4393312",
      "warningSpoilers": true,
      "date": "12 October 2018",
      "rate": "10",
      "helpful": "1,800 out of 2,120 found this helpful.",
      "title": "I don't want to believe that a perfect horror series does exist. My first-ever review!",
      "content": "I have never written a review before. This series undoubtedly deserves my first. I have never watched a show that is perfectly written, cast, directed, and executed. This one will always be my favorite series of all time with companies like Chernobyl, Game of Thrones, and Black Mirror.Thank you, every single person involved in the making of this phenomenal series, which I want to binge-watch and also don't want to finish it without taking the time to truly appreciate it!I will definitely rewatch it soon. Can't wait for another season."
    },
    {
      "username": "kadenkgcampbell",
      "userUrl": "https://www.imdb.com/user/ur108113578",
      "reviewLink": "https://www.imdb.com/review/rw8560024",
      "warningSpoilers": true,
      "date": "22 September 2022",
      "rate": "10",
      "helpful": "19 out of 23 found this helpful.",
      "title": "utter perfection",
      "content": "Spectacular show. It is now one of my favourite shows ever. The acting, the story, the spectacle, the character development, the pace, the horror. It is truly a perfect show. I wanted to talk about everyone's character separately and explain how much they meant to me.Nellie aka Victoria Pedretti - Such a deep character. No one ever listened to her until she died. She was so kind and honest and other than Luke, her siblings didn't deserve her. Both Victoria and the actress who played the young Nellie were superb. The little girl was so cute and her acting is beyond amazing regardless of her age. Her main purpose was to bring her siblings together but its sad she could only do it by dying. Even when she tried bringing her siblings together for tea parties, they ignored her until they couldn't. She was the glue that brought them together to begin the process of self-improvement.Theo aka Kate Siegel - my God. I couldn't stand her character in the beginning but when we got to her specific episode and her dialogue about \"feeling nothing\" in episode 9 was otherworldly. Her emotion and grief and delivery was perfection. Her character was cold but strong, I loved every bit of her. Bravo.Shirley aka Elizabeth Reaser - her character was a necessary one, but for me, quite unlikeable. She was the biggest hypocrite and ignorant person in the show. Couldn't even give her husband and the father of her children a chance to speak up for himself for something he didn't even do, something that Shirley herself did. The constant scares and horrific demons she time and time again ignored, the lies, the guilt, the grudges, the cup finally overfilled (in the last episode) and I'm glad it all came out.Steve aka Michiel Huisman - again, another phenomenal actor. Played his character amazingly. I loved how he always begged his father for the truth but he was too ignorant and closed minded to accept it, or even give it a chance. The older brother who was never really the reliable \"big brother\". A shoulder to cry on. No. Someone the younger ones looked up to. No. But in the end, when it mattered most, he was did what was needed. Now, he is truly the big brother who will carry the all the burdens his father once did. In the end he was put into the shoes of his father, who he truly hated.Luke aka Oliver JC - misunderstood, unheard, and patronized. His addictions got the better of him. Most likely because of the method he used to cope with his childhood trauma and the passing of his mother. He truly did behave like the younger twin, the youngest sibling. Everyone around him always came to his call whenever he was down (which was plenty). He was the boy who cried wolf, until he decided to fight the wolf himself. How he turned out, 2 years after hill house, drug free, he made his mother, father and sister proud.Mr & Mrs Crain - Wow! These two had charisma that felt like a decade of marriage. Their soliloquies and monologues were so heart wrenching and emotional. I couldn't get enough of these two. They felt like true parents. Its so unfortunate that Hill House had misfortune for their fates.Everyone in this show progressed and evolved into the best versions of themselves by the end of the show. True progression. The director and writers of this story are truly talented and gifted. This show is by far one of my favourite shows of all time.I've never made such an in-depth review before but this show was astonishing. I needed something this.10/10."
    },
    {
      "username": "hlahorner",
      "userUrl": "https://www.imdb.com/user/ur65710333",
      "reviewLink": "https://www.imdb.com/review/rw4403263",
      "warningSpoilers": true,
      "date": "17 October 2018",
      "rate": "8",
      "helpful": "447 out of 634 found this helpful.",
      "title": "Outstanding Beginning, Disappointing Finish",
      "content": "Creepy, gothic, atmospheric drama/horror story about a family who briefly lived in a haunted house and the far reaching effects it has on each of their lives. There are a lot of really great elements to this show. The casting is excellent. The women all look like family to the point it takes a few episodes to keep them straight, The casting of Timothy Hutton as the elder Hugh was inspired. He easily passed as an older version of Henry Thomas . The acting was good and the character development was outstanding. Everyone was multidimensional and believable as real people. The story telling style of jumping between past and present is used very effectively and keeps you on your toes. There are several very well placed jump scares, but the majority of the horror comes from the building of anticipation and dread . I watched more than one scene with my hands covering my face and peeking through my fingers. The writers also liberally employed the use of fleeting images that you aren't quite sure you saw, but add to the overall atmosphere, This all hollds up rather well for the first eight episodes. Then the whole thing gets a little shakey, and finally collapses under the weight of itself in the final episode. Every character has a drawn out melodramatic monologue. The former restraint is abandoned and after 9 hours of detailed character development and story telling, all the storylines are neatly and happily wrapped up in the last 15 minutes.The series is absolutely worth watching, but for me the ending is what keeps it from being a perfect 10."
    },
    {
      "username": "pnathan28",
      "userUrl": "https://www.imdb.com/user/ur35151746",
      "reviewLink": "https://www.imdb.com/review/rw4392460",
      "warningSpoilers": false,
      "date": "12 October 2018",
      "rate": "10",
      "helpful": "372 out of 559 found this helpful.",
      "title": "Damn good Horror show.",
      "content": "Really well written and acted, with a good story and characters. Thos is everything AHS should have been."
    },
    {
      "username": "MadMadamMolly",
      "userUrl": "https://www.imdb.com/user/ur55808828",
      "reviewLink": "https://www.imdb.com/review/rw4396650",
      "warningSpoilers": true,
      "date": "14 October 2018",
      "rate": "10",
      "helpful": "657 out of 834 found this helpful.",
      "title": "Amazing!",
      "content": "I'm quite a horror junkie, and it's so rare to find such an engaging horror series. Fantastic atmosphere, the creepy bits weren't overdone so none of it seemed hokey, acting was spot on, and in the end I didn't feel cheated by the plot line (no holes or strings left dangling, I really hate when that happens). Usually I can tear apart horror movies because of inconsistencies or impractical things but I saw none when I binge watched this show. Just fantastic all around, and I really enjoyed the way it was told, the past and present and how it flowed so well. I recommend this 100%."
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw4404042",
      "warningSpoilers": true,
      "date": "17 October 2018",
      "rate": "9",
      "helpful": "279 out of 416 found this helpful.",
      "title": "Super creepy. Best horror I've seen in a long time.",
      "content": "So, Let me start by saying I would give this show an 8.5, however, I have bumped it to a 9 as I finished the show recently, and my impressions of the last two episodes may be negatively skewing it lower.Let's begin with the premise of the show, to which I will be lovingly comparing it to the hit 2004 TV show \"Lost\" and an incredible tour de force recent film \"Hereditary\". We begin by being introduced to the show's main characters. A family of seven, five children and two parents. The show starts in 2018 and we are introduced to a grown up version of the family. We instantly make our snap judgements of the characters, usually negative in most cases. And then in the style of lost, we experience the story of each character (with one episode being allocated to one member) in a double flashback fashion. First we are told the story of the children whom lived at Hill House many years ago. And then we are told a more recent story of the character that leads them to present day.I want to say that this version of story telling is not unique to \"The Haunting of Hill House\", however, it might be that it is the best implementation of it I have seen to date. Utterly gripping. I don't know if anyone reads the novel. I have had the opportunity to read years ago. I liked it. The show isn't exactly a novel. There are serious changes. Of course a good change. The show sells us this incredible multi-faceted mystery, that intertwines throughout the years, and where none of the family are on the same page. And it does a wonderful job of tying up all those narratives, all those moments that you just let go as a \"glitch in the system\" but then later it would call back to it and you would understand a mystery you didn't even know existed. With that, it is important to recognise the fantastic job the show did of revealing the \"How\" of the show. How everything tied together.A fan of black and white horror movies I am well acquainted with Robert Wise's 1963 \"The Haunting\", which to this day stands out to me as a classic of the haunted house horror genre. Netflix's \"The Haunting of Hill House\" retains a lot of what makes that movie so great while also branching out on its own and introducing diverse and interesting characters. Also child players and adults really look like each other. Cast selection successful. While there is a definite difference of rating and the show opted to go into the realm of color tv I consider both to be entertaining and chilling in what makes classic horror effective. There's even familiar nods to the movie- the iconic spiral staircase, a scene where two people are scared out of there minds by the walls seemingly coming alive and starting to shake, etc. This series falls more in the suspense than in horror and evidently if you are one of those who thinks that horror means gallons of blood and deaths every 20 minutes, forget it.The series focuses on the stories of different siblings in different episodes. And it shows the stunning points that individual stories touch. In fact, each time, we see that there are different points of events. We see the same event from other perspectives. Thus, the story of the family takes on a more intense dramatic structure, on the other hand it is becoming more and more complex thanks to the different details revealed. The funeral scene in episode 6 has a really good shooting technique. The camera enters the recording and the scene is shot in a single sequence. One of the most impressive scenes I've seen on TV. I mean, Mike Flanagan's giving a directing lecture.Where the Netflix series really stands out to me is by tying all of the horror elements to PTSD, making you question whether these horrors are really just confined to the house, the people who lived in it, or both. The characters are somehow trying to live out their lives to the fullest and keep their sanity after the history and tragic memories of living in a haunted house. Each character believes different things about what happened there, and each is damaged in their own way. It feels somewhat reminiscent to TV shows like Lost in a way. This show goes pretty deep into this reality and for some it could possibly hit a little too close to home. 9/10."
    },
    {
      "username": "zakkattackkkk",
      "userUrl": "https://www.imdb.com/user/ur26826564",
      "reviewLink": "https://www.imdb.com/review/rw4400057",
      "warningSpoilers": false,
      "date": "15 October 2018",
      "rate": "8",
      "helpful": "341 out of 478 found this helpful.",
      "title": "We need more horror like this!",
      "content": "The Haunting of Hill House is HANDS DOWN the best horror series I've ever seen. It's a meditation on death, grief and trauma. It is equal parts scary and engaging. The best character development I've seen in a long time and a huge leap forward for horror. We need more horror like this. It has disturbed me and moved me. It's portrayal of the supernatural as more of a human experience and less of a \"poltergeist\" type is revolutionary. It, to me, makes more sense to believe in ghosts than I ever thought was possible"
    },
    {
      "username": "TheVictoriousV",
      "userUrl": "https://www.imdb.com/user/ur19932818",
      "reviewLink": "https://www.imdb.com/review/rw6187192",
      "warningSpoilers": false,
      "date": "18 October 2020",
      "rate": "9",
      "helpful": "21 out of 29 found this helpful.",
      "title": "Getting horror right by cutting deep",
      "content": "With its wintry color schemes, outstanding performances (exemplifying casting that has kept both acting ability and actor-likeness in mind), and niftily nonlinear storytelling, The Haunting of Hill House adapts Shirley Jackson's gothic classic into the finest horror show of its era. Then again, as a multitude of critics have argued, the word to use might not be \"horror\" - the word is \"terror\".This is a series where the fears and connections among the characters are truly, wholeheartedly the focus; having finished it, I still can't be sure if the paranormal images we see are wholly real, or the result of in-universe coping mechanisms (some defy time and space in such a way that I doubt they're simple dreams). But with a show like this, the threat to our heroes (if that's even a good term for these damaged lifeforms) is real no matter what. At any second, the final straw could land.The show may not be for the faint of heart, nor the faint of attention. You won't be getting your jump scares and shrieking It clowns to hold your hand every few minutes in this one. This is decidedly more thoughtful and, once we've delved deep into the characters and their states of mind, more genuinely horrifying than what modern horror fans might think of as horror.Our main protagonists are the Crain family, last known owners of the ominous Hill House manor: father Hugh (Henry Thomas as an adult, Timothy Hutton as an elder), mother Olivia (an angelic Carla Gugino), and the five kiddies; author and ghost-debunker Steven (Michiel Huisman and Paxton Singleton), mortician Shirley (Elizabeth Reaser; Lulu Wilson), drug-addict Luke (Oliver Jackson-Cohen; Julian Hilliard), hedonist and psychic Theodora (Kate Siegel; McKenna Grace), and Nellie (Victoria Pedretti; Violet McGraw), possibly the most haunted of them all. These actors all do stupendously well, child actors included, during even the most lengthy and meticulously coordinated takes.In terms of convincing older-self casting, this show might rival Netflix's Dark (which cast dozens of crucial characters with a maximum of three performers each) - this one is especially careful to make sure the younger and older selves share similar body language and demeanor. And this is to say nothing of how the characters are written.Every episode, we alternate between the characters as children and them as grownups, with some additional flashbacks being had in the \"future\" story, recalling happier times for the characters' adult selves. Early on, the future plotline of each episode is typically leading up to a particular death within the Crain family, while the past plotline is leading up to the final night spent in Hill House - each episode follows a different character up to the two moments; both storylines are then reset for the succeeding episode with a new focal character. This is just the beginning of how the show plays with time.This choice may seem artsy at first glance, but it's anything but. It allows for some masterful tension-building and cleverly delivered revelations, with a few bits of recontextualization as we get to know more about these people. The aforementioned long takes also do wonders for the suspense and ambiance, heightened by the skillful use of sound, lighting, depth of field, and color.Alas, even with a horror show this well-made (its creator Mike Flanagan has an interesting track record with Gerald's Game, Ouija: Origin of Evil, and Doctor Sleep), some clichés and genre-inherent bits of cheese must persist. There are admittedly a few jump scares in this series, but they make sense in-universe; these people have every reason to get startled by their own shadows. One might also complaints about one of the child performances, though I would offer that it makes sense for the character to emote a bit strangely.In any event, I will certainly be investigating the Bly Manor follow-up as Halloween draws nearer. I might review that one separately (it's not strictly the same show, but a sequel), so for now, take this recommendation from my insignificant ass for what it's worth."
    },
    {
      "username": "davidm-14",
      "userUrl": "https://www.imdb.com/user/ur0700382",
      "reviewLink": "https://www.imdb.com/review/rw4393910",
      "warningSpoilers": false,
      "date": "13 October 2018",
      "rate": "8",
      "helpful": "79 out of 125 found this helpful.",
      "title": "reimagining of the shirley jackson book",
      "content": "Unlike other reviews have indicated, this is not a sequel, prequel or remake of any of the prior film versions or the classic novel. my personal favorite is the 1963 robert wise version, \"the haunting\". scared the crap out of me as a child - the doorknobs and the bending walls. russ tamblyn from that version even makes a cameo in this version as well, playing nell's therapist.anyway, what they did was take all the characters from the story and, instead of making them visiting researchers, made them a family (the crain family - yep, they kind of jettisoned the back story of the house as well). this family moves into the house in hopes of selling it after fixing it up. the story jumps back and forth between their time in the house and later, after the kids are grown up and still suffering from their time spent in the house that's haunted by.....well, something. their father takes them from the house in the middle of the night without explaining why, and they never go back. just like the book, it's not clear if the haunting is real and if the various members of the family have carried forward the traumas they experienced into their adulthoods. and they're all pretty messed up too. they did manage to fit in some of the more memorable events/scenes from the 1963 film into this one, putting them into the context of this version. the expansion that a 10 hour version gives is amazing, and each family member pretty much gets their own episode (some dovetail into other character scenes shown from the other character's point of view). i started out not liking the massive changes so much, but really settled into the story (ep 6 is amazing, in my opinion). highly recommended. it's well written and creepy. though it was played a bit for laughs in the 1963 version, you'll certainly never hear the phrase \"in the night. in the dark\" the same way again."
    },
    {
      "username": "junenwaller",
      "userUrl": "https://www.imdb.com/user/ur77150767",
      "reviewLink": "https://www.imdb.com/review/rw4394775",
      "warningSpoilers": true,
      "date": "13 October 2018",
      "rate": "9",
      "helpful": "461 out of 602 found this helpful.",
      "title": "Investment in the characters is an understatement",
      "content": "I don't usually invest my time in watching anything in the horror genre, as most are generally predictive and due to lack of music accompaniment I know when to cover my eyes so as not to end up on a defibrillator. The generic full of unnecessary gore and a lack of believability storyline was definitely missing from this well written and performed series. Nothing in this genre usually surprises me, but this was something very different.Looking at the reviews I thought I'd give the first episode at least a quick view to see if this was anything other than predictable.From the off, I was captivated at the beguiling and compelling storyline, something different with twists and turns, which totally sucked me in.As further episodes unfolded, the acting is so believable from all the cast, although did sit up and take particular notice of Kate Siegel, who plays one of the Crain siblings, that you cannot do anything but sit captivated and neck deep in this Netflix masterpiece.I jumped at times that I thought were safe, questioned parts that I thought I already had a handle on and sat shocked at the route of the already captivating story line.I have only given this an 9 as there is always room for perfection, but the investment I made in the characters of this nothing short of an original piece, was definitely a 10. Great dialogue, acting and unpredictable storyline.., this one has it all going on. Entertainment at its best."
    },
    {
      "username": "ten-thousand-marbles",
      "userUrl": "https://www.imdb.com/user/ur113208747",
      "reviewLink": "https://www.imdb.com/review/rw8093532",
      "warningSpoilers": false,
      "date": "26 April 2022",
      "rate": "9",
      "helpful": "11 out of 14 found this helpful.",
      "title": "Truly chilling, intense, beautiful and sad",
      "content": "This is one of the best things I've watched in recent memory. There are times it is legitimately scary with goosebumps and all, and times it is touching and may raise a tear. It caught me quickly and kept me engaged til the end.This would have been a 10/10 had they cut back on the dysfunctional soap opera drama that at times, took control of the story. In hindsight, it's easy to get past.An odd casting choice: nothing against Henry Thomas or Timothy Hutton. They both dishes out a fine performances. I have to wonder why they didn't choose one actor and use a little make up for aging effects. The two look similar, but either one could have pulled off the forty to sixty look necessary for the part.But I digress. Watch the show!"
    },
    {
      "username": "smileyyanny97",
      "userUrl": "https://www.imdb.com/user/ur29140961",
      "reviewLink": "https://www.imdb.com/review/rw8116384",
      "warningSpoilers": false,
      "date": "5 May 2022",
      "rate": "9",
      "helpful": "9 out of 10 found this helpful.",
      "title": "As Perfect As Art Can Be",
      "content": "Everything about this show was excellent in concept and execution. Writing, casting, acting, directing, cinematography ect... were great. A true tour de force of visual media. The show contains such sensible and intellectual ideas about grief and family that makes it so hopeful in the end, despite being gut-wrenching and terrifying. Although this is supernatural horror, it is well grounded in reality, even more than some \"realistic\" horror films.I have re-watched this show about 4 times, and I will be watching it many more times in the future. I can't recommend \"The Haunting of Hill House\" enough."
    },
    {
      "username": "khayatrony",
      "userUrl": "https://www.imdb.com/user/ur63842532",
      "reviewLink": "https://www.imdb.com/review/rw4393259",
      "warningSpoilers": false,
      "date": "12 October 2018",
      "rate": "10",
      "helpful": "275 out of 442 found this helpful.",
      "title": "I almost cried at the end of episode one",
      "content": "This is what I've been waiting for. I am a huge horror fan and a huge fun of this show. I almost cried at the end of episode one because I've been waiting for a show like this for so long. Thank you!"
    },
    {
      "username": "tulsi-das-khan",
      "userUrl": "https://www.imdb.com/user/ur49558132",
      "reviewLink": "https://www.imdb.com/review/rw5026943",
      "warningSpoilers": false,
      "date": "29 July 2019",
      "rate": "6",
      "helpful": "198 out of 357 found this helpful.",
      "title": "Overrated",
      "content": "I'm not saying this show is bad. But best horror show in the history? Are you serious? First of all, it's not horror. It is pure family drama which unfortunately drags for too long. The cinematography is spot on, the acting is great but that's about it. The series blends well with the different timelines but fails to create the required tension. It was a lame attempt by Flanagan to keep the viewers hookedBut the series could've finished easily within 6-7 episodes. The show starts off well, but after 5-6 episodes you'll be yawning half the time. Plus the ending is underwhelming."
    },
    {
      "username": "panos0000",
      "userUrl": "https://www.imdb.com/user/ur28867909",
      "reviewLink": "https://www.imdb.com/review/rw4405144",
      "warningSpoilers": false,
      "date": "18 October 2018",
      "rate": "6",
      "helpful": "436 out of 750 found this helpful.",
      "title": "Drama not horror",
      "content": "Started of great but it fell apart after the sixth episode.Too much melodrama and too many monologues ruined it."
    },
    {
      "username": "slipkorn_samantha",
      "userUrl": "https://www.imdb.com/user/ur23816810",
      "reviewLink": "https://www.imdb.com/review/rw6134610",
      "warningSpoilers": false,
      "date": "29 September 2020",
      "rate": "9",
      "helpful": "49 out of 72 found this helpful.",
      "title": "More Poppy!!",
      "content": "I DESPERATELY want a story about Hill House's past to see Poppy's entire story"
    },
    {
      "username": "JShaft33",
      "userUrl": "https://www.imdb.com/user/ur6501873",
      "reviewLink": "https://www.imdb.com/review/rw4721941",
      "warningSpoilers": false,
      "date": "14 March 2019",
      "rate": "5",
      "helpful": "70 out of 124 found this helpful.",
      "title": "Don't understand the hype",
      "content": "Writing this after 6 episodes and entertaining the idea of quitting right now. I find myself utterly distracted. This is like a gothic version of this is us. Overly dramatic. Drawn out storylines and conversations. Jump scare tactics. I really wanted to like it but it just couldn't hold my interest. I found a lot of the characters insufferable. If you don't care about the family dynamics, there really is not much left."
    },
    {
      "username": "Salamalad",
      "userUrl": "https://www.imdb.com/user/ur88483588",
      "reviewLink": "https://www.imdb.com/review/rw4392925",
      "warningSpoilers": false,
      "date": "12 October 2018",
      "rate": "8",
      "helpful": "110 out of 185 found this helpful.",
      "title": "Captivating",
      "content": "A series of a family that got f'd up in a haunted house, and you just want to find out why and what really went wrong. Each episode is captivating and you cant help but keep watching. horror/thriller/drama, good job netflix its always a 50/50 but this series is good"
    },
    {
      "username": "jhmoondance",
      "userUrl": "https://www.imdb.com/user/ur90568323",
      "reviewLink": "https://www.imdb.com/review/rw4612889",
      "warningSpoilers": false,
      "date": "28 January 2019",
      "rate": "2",
      "helpful": "32 out of 57 found this helpful.",
      "title": "Too slow and repetitive",
      "content": "Far to slow, predictable and frustrating waiting for the end! Good grief! It could have been condensed to an hour and a half perhaps a 2 hour movie! Hype is hype n this was dragged out to the nth degree! Disappointing after advised by other user critics to watch it"
    },
    {
      "username": "jkp-309-258974",
      "userUrl": "https://www.imdb.com/user/ur32151722",
      "reviewLink": "https://www.imdb.com/review/rw4444592",
      "warningSpoilers": false,
      "date": "8 November 2018",
      "rate": "6",
      "helpful": "154 out of 261 found this helpful.",
      "title": "The last episode was bad, bad, bad.",
      "content": "I don't watch many horror shows, but gave this a try. It kept me interested and there are some creepy and scary moments. I personally thought the character development was well done and the drama unfolding made me come back for more.The last episode, though, was a wordy, agonizing mess. The dialogue was painful. The way it is wrapped up makes you shake your head and ask, \"Why?\" It could have been good, but the way it is wrapped up is truly horrific."
    },
    {
      "username": "ken-01440",
      "userUrl": "https://www.imdb.com/user/ur93924616",
      "reviewLink": "https://www.imdb.com/review/rw4398971",
      "warningSpoilers": true,
      "date": "15 October 2018",
      "rate": "6",
      "helpful": "330 out of 543 found this helpful.",
      "title": "Strong start, weak finish.",
      "content": "I want two things after a horror movie/book/mini-series, some sort of closure and an uneasy feeling walking down a dark hallway. The series started out strong with lots of scary potential, but starts to disappoint halfway thru. The drama overtakes the plot and the scares become few and far between. The ending provides closure to the plot, but is extremely weak and throws a wet blanket on a potentially scary ending. Overall, the series is a mash-up of This Is Us and an edited-for-television version of The Shining."
    },
    {
      "username": "HLEYE",
      "userUrl": "https://www.imdb.com/user/ur90487084",
      "reviewLink": "https://www.imdb.com/review/rw4406751",
      "warningSpoilers": false,
      "date": "19 October 2018",
      "rate": "7",
      "helpful": "49 out of 88 found this helpful.",
      "title": "9 great episodes, episode 10 is also horror, but in another sense",
      "content": "Such a great horror show, with good acting (except the oldest girl - shirley), interesting plotting and character developments and interacting, nice occasional scares etc etc. Very good, until the walt disney corney sentimental ending. That was the biggest horror... With a more mature and gutsy ending i might have given a 9, or at least 8, now i can't...come on Flannegan, man up next time!"
    },
    {
      "username": "KlattMJessica",
      "userUrl": "https://www.imdb.com/user/ur20370953",
      "reviewLink": "https://www.imdb.com/review/rw4395028",
      "warningSpoilers": false,
      "date": "13 October 2018",
      "rate": "7",
      "helpful": "416 out of 642 found this helpful.",
      "title": "Oh, those monologues.",
      "content": "Monologues for days. Just so, so many \"poignant\" monologues. So, so many self-reflective, melodramatic monologues. Long speeches aside, the production value is great. The child actors are fantastic. The story is intriguing, though it tends to only creep along. Quite good, but not perfect, as it's high rating suggests."
    }
  ],
  "errorMessage": ""
}