{
  "imDbId": "tt4574334",
  "title": "Stranger Things",
  "fullTitle": "Stranger Things (TV Series 2016–2024)",
  "type": "TVSeries",
  "year": "2016",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8820688",
      "warningSpoilers": false,
      "date": "23 January 2023",
      "rate": "9",
      "helpful": "61 out of 66 found this helpful.",
      "title": "Good Sci-fi Series!",
      "content": "Stranger Things absolutely lives up to all the hype! This worldwide phenomenon has been one of the most talked about shows since it came out back in 2016 and for good reason...it's terrific! It's an absolute blast to watch and will keep you entertained throughout the entire series. This has everything a show needs to be great...action, comedy, drama, suspense, even nostalgia with this show. You really come to care for these characters and what happens to them. Obviously, season 1 was the best but the others are not far off. All are absolutely worth watching and I can't wait for the new season! Season 5 of s going to be its last so hopefully it goes out as good as it started. I can't wait!"
    },
    {
      "username": "EVON1TY",
      "userUrl": "https://www.imdb.com/user/ur47939660",
      "reviewLink": "https://www.imdb.com/review/rw8925638",
      "warningSpoilers": false,
      "date": "13 March 2023",
      "rate": "9",
      "helpful": "44 out of 47 found this helpful.",
      "title": "Gets even Stranger in every season!",
      "content": "I wasn't expecting this nostalgic TV show could be this good. In my opinion technical details in first season was not that charming but not only storyline that gets stranger, also all the technical details getting stranger.I know first three seasons were quite the same in some ways. But the Season Four explains that situations. Not all minor things, but explains the major questions.There is some great references to The Thing, E. T., D&D, Middle-earth and even more. That references makes ithe TV Show more exciting. Especially for geeks.Film Editing was perfect even from the first season.Cinematography, VFX and Sound is got better in the second season. They were a bit weak at first season.Makeup, Costume Design, Scores, Art Direction & Set Decoration were quite good from the first season, they get a bit better along the seasons."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw3585332",
      "warningSpoilers": true,
      "date": "23 November 2016",
      "rate": "10",
      "helpful": "347 out of 415 found this helpful.",
      "title": "Strange, that's for sure...but also very, very good.",
      "content": "\"Stranger Things\" is a very big surprise. After all, it's a made for Netflix series, so it's going to be cheap and suck...right?! Well, no...fortunately. Despite having mostly no-name actors and a modest budget, this show turned out to be a hit and one that promises to bring us more episodes. At the time I am writing this, the eighth episode has been aired and the series appears over...or so you think until the very end.So what is this show? Well, in many ways it's like some Steven King novels (particularly \"Firestarter\"), the 1980s and \"Gravity Falls\" all mashed up into one really strange but fascinating show.The show begins with a child being lost into another dimension and his mother is naturally out of her mind with worry. But soon this sense of panic is felt by many in this small community. In the midst of this, a young girl, who is simply named '11' arrives in the town and is hidden by some middle school boys. They know she's being hunted...but what does she have to do with the disappearance as well as folks seeing monsters?! Well, watch this paranoid show and you'll see.So why was the show so effective and why are so many folks eagerly awaiting more episodes? Well, the writing is terrific and the direction really keeps you on the edge of your seats. The acting is also surprisingly good and overall the package is well worth seeing and will impress you. Far better than network television."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8920700",
      "warningSpoilers": false,
      "date": "11 March 2023",
      "rate": "9",
      "helpful": "55 out of 61 found this helpful.",
      "title": "Lives up to all the hype!",
      "content": "Stranger Things is absolutely as good as everyone says it is. When a show is as talked about about as much as this one has been it's hard to live up to expectations. Stranger Things has not only met those expectations but has surpassed them in every way. This is the show that our Netflix on the map as far as original shows go as this was not only one of their first but their biggest. As much as I love this show it's probably time for it for end and it is. This upcoming season is going to be the last. We have literally watched this cast grow up, they were children when this show first started and now they're all in their 20's. I can't wait for this last season and going to miss it when it's gone!"
    },
    {
      "username": "cherold",
      "userUrl": "https://www.imdb.com/user/ur0011762",
      "reviewLink": "https://www.imdb.com/review/rw3509623",
      "warningSpoilers": false,
      "date": "22 July 2016",
      "rate": "9",
      "helpful": "262 out of 313 found this helpful.",
      "title": "Captures that '80s magic",
      "content": "There is no reason, in terms of story, for Stranger Things to take place in the '80s. But the '80s atmosphere - the dial phones, the chain smoking, Winona Ryder - are there to clue you in on the inspiration for this movie, which is pretty much every supernatural movie from the 80s with a focus on kids. E.T., Poltergeist, that sort of thing.The wondrous thing is how dead-on this tribute. It's not just the clothes and hair, but the style of acting, the scripting approach, the structure, all hold true to their inspiration. You've got the young nerdy kids, the horny, unsure teenagers, the monster, the mysterious one with the power, the bad science/government people, the conflicted investigator, the tearful mom.You could argue that this entire season is simply a pastiche made up of recycled elements, and I wouldn't disagree, but it really feels less like a copy and more like something of that era, as though the writers had fallen into a coma in 1985, woke up and got to working.While it doesn't have the high style of the Spielberg films that are a primary influence, it does have the likability. The story is consistently engaging and fun, the acting is excellent, and the movie has sufficient laughs and tears to satisfy."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw4028432",
      "warningSpoilers": false,
      "date": "9 January 2018",
      "rate": "8",
      "helpful": "277 out of 334 found this helpful.",
      "title": "Never judge a book by its cover.",
      "content": "I am one of those people that was put of by the thought that this was a kid's drama, from the advertising you'd swear this was aimed at a 4 o'clock after school transmission time, the reality is far from that. It's quite intense drama, thoroughly absorbing, the kind of show you can't help but binge watch. As someone that grew up in the Eighties, I can appreciate the detail that's gone into the production, it's like they slipped back and filmed it live, it is incredibly well made. I utterly love the music, it is so fitting, takes me back to wonderful eighties shows. Quality in both season one and two, I like the build up and tension that is abundant in the first. It's like the Goonies meets The Quatermass Experiment."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw4041559",
      "warningSpoilers": false,
      "date": "23 January 2018",
      "rate": "",
      "helpful": "215 out of 268 found this helpful.",
      "title": "A nostalgic callback to the stories from my youth - but also a beautifully shot supernatural tale with charming performances and great production values",
      "content": "There were two dominating forces in the eighties that had a lasting effect on my cinematic taste for ever after and also resulted in my undying love for fantasy, sci-fi and horror stories: Steven Spielberg and Stephen King. I guess it isn't an overstatement to say \"The Two Steves\" probably influenced and shaped the imagination - the dreams AND the nightmares - of an entire generation.The main factor why I loved their movies and books was that kids roughly my own age figured so prominently in many of them. King wrote 'Firestarter', 'It' and 'Stand By Me', and Spielberg either directed or produced (via his company Amblin) 'E.T.', 'The Goonies' and 'Gremlins'. Those were stories where the young protagonists encountered aliens and monsters or where they themselves had supernatural powers - or where they just went on an adventure (to find a body or a long lost treasure) with grown-ups largely out of the picture. Now if you've seen 'Stranger Things', that should sound pretty familiar, right?Of course it does: because 'Stranger Things' deliberately pays homage to all those stories - and it does it very, very well. And it's not a rip-off, it's a love letter. The show emulates the themes and a certain style from those eighties treasures, and while it is a (for me) very welcome callback to some of the favorite stories from my youth, it's also very much its own thing. I won't give away the plot here (I guess you get a pretty good picture what it's about from what I wrote above), but I would like to mention that it's beautifully shot, the effects and generally the production values are top-notch, and the period-inspired music is fantastic. The biggest shout-out, however, has to go to the ensemble of actors, especially the kids who play the protagonists: their charming performances are the key to why the show works as well as it does.To sum it all up: If you're an eighties kid like me, this show is a must. For everyone else, it might depend a bit more on whether you're a genre fan or not, but if you do like supernatural stories, 'Stranger Things' is a treat. I'd rate it eight stars out of ten, but with an extra star for nostalgia, that's a 9.Favorite TV-Shows reviewed: imdb.com/list/ls075552387/Favorite films: IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/"
    },
    {
      "username": "Dan_W_Reviews",
      "userUrl": "https://www.imdb.com/user/ur162010843",
      "reviewLink": "https://www.imdb.com/review/rw8870158",
      "warningSpoilers": false,
      "date": "14 February 2023",
      "rate": "9",
      "helpful": "37 out of 41 found this helpful.",
      "title": "Riveting and Suspenseful, An Excellent Standard of Writing, Acting & Production Value Throughout (S1-4)",
      "content": "Stranger Things is set in the 1980s in the fictional town of Hawkins, Indiana and follows a group of friends as they uncover supernatural mysteries and government conspiracies.Throughout all four seasons so far, I believe Stranger Things has maintained an extremely high level of quality in its writing, acting, and production value. The show's very memorable and likable characters, along with its riveting storyline and highly suspenseful moments, grabbed my attention and kept me invested and immersed in the show. The show's nostalgic elements, like its soundtrack and references to pop culture from the 80s, were also a highlight for me and one of my favourite aspects of the show.The first season sets a great foundation for the series, introducing the main characters and setting the stage for the strange events that occur in Hawkins. Each subsequent season expertly builds upon the previous one and no episode feels wasted, each expanding the show's intriguing mythology and exploring new themes and characters. The show's attention to detail and its commitment to its 1980s setting have helped to create a unique and immersive world that is both comfily familiar and creepily strange.In conclusion then, Stranger Things's combination of compelling storylines, impactful characters, and excellent attention to detail make it a standout Netflix series that is definitely worth watching from start to finish."
    },
    {
      "username": "magnoliacream",
      "userUrl": "https://www.imdb.com/user/ur118605093",
      "reviewLink": "https://www.imdb.com/review/rw8261732",
      "warningSpoilers": false,
      "date": "22 June 2022",
      "rate": "10",
      "helpful": "107 out of 139 found this helpful.",
      "title": "Never fails to satisfy",
      "content": "Season after season, this always leaves me feeling amazed, exhilarated and fully satisfied. There is an element of familiarity, even cliche, about the stories involving aliens, monsters, lab experiments, orphans and family relationships, yet the way they are presented is both nostalgic and magical.It's definitely one of the best series on Netflix."
    },
    {
      "username": "dszabo-53136",
      "userUrl": "https://www.imdb.com/user/ur142565377",
      "reviewLink": "https://www.imdb.com/review/rw8820265",
      "warningSpoilers": false,
      "date": "23 January 2023",
      "rate": "10",
      "helpful": "41 out of 48 found this helpful.",
      "title": "Very good",
      "content": "The series is set in the fictional town of Hawkins, Indiana in the 1980s and follows a group of friends as they uncover supernatural occurrences and government conspiracies.I would rate Stranger Things as a must-watch show for fans of science fiction, horror, and nostalgia. The show's attention to detail in recreating the 1980s is impressive, and it does an excellent job of capturing the feel and atmosphere of the era. The acting is top-notch, particularly from the young cast, and the characters are likable and relatable. The series has a good balance of horror, sci-fi, and drama elements that keep the audience on the edge of their seats. The plot is well written and engaging, with a good mix of mystery, action, and suspense that keeps you hooked and wanting more.The show also has a great soundtrack and uses music to set the tone and atmosphere of the show, adding to the overall nostalgia and atmosphere.Overall, I highly recommend Stranger Things, it's a well-crafted show with a great balance of horror, sci-fi, and drama elements that keeps the audience on the edge of their seats. The acting is top-notch, and the characters are likable and relatable. The show's attention to detail in recreating the 1980s is impressive, and the plot is well written and engaging. The series has a great soundtrack that adds to the overall nostalgia and atmosphere."
    },
    {
      "username": "chiragrathod19",
      "userUrl": "https://www.imdb.com/user/ur155643091",
      "reviewLink": "https://www.imdb.com/review/rw8820812",
      "warningSpoilers": false,
      "date": "23 January 2023",
      "rate": "10",
      "helpful": "39 out of 44 found this helpful.",
      "title": "One of the best Netflix show.",
      "content": "Stranger Things as a whole is one of the best shows I have seen so far. First three seasons have been exciting and stunning but season 4 is extraordinary 👌🏻. The Duffer Brothers knock it out of the park for what I believe that this series is one of the best netflix series so far. There are so many twists and turns and it had me on the edge of my seat the whole time. This is one of the most addicting series that I have ever watched. I love the characters so much! The storylines and characters are so fleshed out and watching it gets me emotional and millies acting is superb. Can't wait for season 5.From me 10/10 rating for this masterpiece❤."
    },
    {
      "username": "cc0077",
      "userUrl": "https://www.imdb.com/user/ur123451286",
      "reviewLink": "https://www.imdb.com/review/rw8321273",
      "warningSpoilers": false,
      "date": "10 July 2022",
      "rate": "10",
      "helpful": "72 out of 93 found this helpful.",
      "title": "I get the hype now",
      "content": "I just finished the last episode of season 4 and that was QUITE THE EXPERIENCE, I was shocked by how long the episode was but every second of it was entertaining. Season 3 was personally my favorite because I think that season had the most comedic scenes, and it just felt very vibrant in general. I LOVED HOPPER AND JOYCE and I'm so excited to see them in future seasons as well. So excited for season 5!!"
    },
    {
      "username": "jasperMeulendijks7",
      "userUrl": "https://www.imdb.com/user/ur152716011",
      "reviewLink": "https://www.imdb.com/review/rw8796920",
      "warningSpoilers": false,
      "date": "13 January 2023",
      "rate": "10",
      "helpful": "30 out of 34 found this helpful.",
      "title": "This is something you must watch! (season 4 review)",
      "content": "Review season 4 I still have a lot to say. There are almost no downsides to this series. Let me start with the fact that the characters are all fantastic and Eddie in particular is a really great addition to the cast. I think his character arc is phenomenal. I can say something positive about everyone. I'm watching this season for the 4th time now and it's still very good. In fact, now that I watch it for the 2nd time, I notice more and more details. What I also really like about the series is that everyone can compare themselves to a character. Furthermore, this is a bit of the season with the denouement of all your questions. The special effects look very good. What I actually like the most in terms of story is that this season really brings you back to the first season. This season also brings back several characters from seasons 1 and 2. I still have to say it, but argyle and murry are the funniest characters in the series. Almost everything they say is so funny! I laughed incredibly hard several times. I think that's really cool anyway if you don't just have to laugh in a series, but also cry and watch enthusiastically. I think that all emotions pass by at some point and that is really something that is great! Yes, I really shed some tears at the end of season 4. I really can't wait for the 5th season. Unfortunately that will take a while... I must also say that this feels a bit like a comfort series. This is truly something I could watch for hours. It never gets annoying. If you haven't seen it yet, what are you waiting for? Now fire up Netflix and go watch it.Season 4: 10/10.Review season 3 I always thought this was kind of the most unique season of stranger things. And I certainly mean that in a good way. This is the 2nd time I've watched this season now and for some reason I thought a lot of the same thing happened and not that much anyway. I've now seen it again and I found out that actually every episode is very unique. There is of course a Russian event in this season which I will not spoil but I thought that was a very nice part. And as with everything from stranger things, there are also a lot of pieces that really put a smile on my face. This season is also very funny thanks to Murray. I'm not going to give too much away, but there is also a kind of terminator character in the series and I would have liked to see a bit more of him. Because you actually know almost nothing about him and I think that's a bit of a shame. It actually kind of feels like he's there to push the story along a bit and that was it. But that's actually my biggest flaw. Other than that, this is another very good season. They sometimes say that opinions change and that is certainly true with me. I had first given an 8.5 this season, while I will certainly bet a bit higher now. I also cried really hard at the end and I think most will too.Season 3: 9.5."
    },
    {
      "username": "slayerjmk95",
      "userUrl": "https://www.imdb.com/user/ur22966909",
      "reviewLink": "https://www.imdb.com/review/rw3505327",
      "warningSpoilers": false,
      "date": "15 July 2016",
      "rate": "10",
      "helpful": "684 out of 970 found this helpful.",
      "title": "Steven Spielberg meets Stephen King",
      "content": "Stranger Things is the newest foray into Netflix's original programming, of which brings us their most impressive- and strange- production to date. When a young boy named Will Byers goes missing, his friends, mother and the town are thrust into a conspiracy involving a mysterious girl named Eleven and something even more sinister hiding in the woods of Hawkins, Indiana.From the get-go, you can tell this is an homage to classic '80s Spielberg, drawing on E.T. and Close Encounters, as well as JJ Abrams' Super 8. But, as the show progresses, it becomes more and more like a twisted Stephen King story set in a Spielberg movie. It becomes a dark and twisted ride into an even darker and more disturbing world where the stakes feel higher than anything before it.I can't go into great detail because spoiling even just a bit of the story takes away from the greater mystery, but I can say, it's one of the most thrilling and intense series to be on TV, without being on TV. If it were to continue, they have to pull the same punches they did with the first season, because they took a great many clichés, and somehow made them fresh and surprising, save for just a couple that they purposefully left cliché."
    },
    {
      "username": "djsmanzgeier",
      "userUrl": "https://www.imdb.com/user/ur158472899",
      "reviewLink": "https://www.imdb.com/review/rw8848270",
      "warningSpoilers": false,
      "date": "3 February 2023",
      "rate": "9",
      "helpful": "29 out of 34 found this helpful.",
      "title": "Perks of being a wallflower, meets jaws meets Carrie",
      "content": "A group of friends in the 80s gets deep into the dark side of Hawkins Indian. When they meet a telekinetic girl. And one goes missing.While perks of being a wallflower, jaws, and Carrie don't sound like they'd mix well. They do in this. This show is one of the greatest things Netflix has made. I'm separating this by sesonSeson 1: this seson is great. It starts off the whole series great, it introduces the characters perfectly. For a first seson it balances Horror, comedy, and thriller aspects perfectlySeason 2: this one is the worst. But that's not saying a lot it's still great but it's the most forgettable. It's more thriller then horror or comedy. And then episode 7 is just useless. But it's still great.Season 3: this so the most 80s out of them with its neon color scheme and references it's great. I would go as far to say it's finale battle is perfect. I it introduced 2 of the greatest characters. And the costumes are great.Season 4: this is the best it brings the horror, and thriller (the two driving parts to it) to the max. It dumbs down the comedy. It handles the four plots great. With mostly of them being outstanding. My only gripe is the California plot is bland they should of had more thriller parts throughout it. But I loved itOverview: this series is great go watch it."
    },
    {
      "username": "hjvergara",
      "userUrl": "https://www.imdb.com/user/ur111907910",
      "reviewLink": "https://www.imdb.com/review/rw8778570",
      "warningSpoilers": false,
      "date": "4 January 2023",
      "rate": "9",
      "helpful": "23 out of 27 found this helpful.",
      "title": "Season 4 Review - Best Season Yet!",
      "content": "After watching the final two episodes of \"Stranger Things: Season 4\", I appreciate the decision to make them into longer episodes - I understood the importance of wrapping up two essential story arcs: that of Papa and El and then Vecna and...everyone else. Well...so to speak. When all is said and done, I can't help but think of Plato's Allegory of the Cave.Metaphorically, Chapter 8 is about self-discovery, enlightenment, and creating healthy boundaries. Chapter 9 is about venturing into the darkness, facing your fears, and standing up for yourself.We do arrive at a conclusion of sorts that readies us for season 5. Loaded with resonating emotion and nuanced human connection, the ending is rockin' rolling fun, thrilling and frightening, and sometimes too bombastic and overstuffed with fighting conflicts for its own good.All the characters have an opportunity to shine through a combination of earnest and vulnerable conversations and near-impossible feats that once again puts them in extreme and hopeless peril. The stakes are higher than ever. And I loved it. I loved the sacrifices, the deceit, the teamwork, the reunions, and the action.I will say that while I do love Kate Bush's \"Running Up That Hill\", I felt it was overused, which took away from its brilliant use in Chapter 4. The ending of the series may have benefited from the reintroduction of another cool, theme-appropriate hit."
    },
    {
      "username": "Mymoviediscography",
      "userUrl": "https://www.imdb.com/user/ur144384572",
      "reviewLink": "https://www.imdb.com/review/rw9064812",
      "warningSpoilers": false,
      "date": "19 May 2023",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "\"An Enchanting Tribute to 80s Cinema with a Dash of the Supernatural\"",
      "content": "\"Stranger Things\" is a nostalgic masterpiece that takes audiences on a thrilling journey into the small town of Hawkins, Indiana. Set in the 1980s, this Netflix original series pays homage to classic films of the era while weaving a captivating story of friendship, mystery, and supernatural occurrences.One of the show's greatest strengths lies in its brilliant ensemble cast of talented young actors. The chemistry among the group of friends is palpable, and their performances are nothing short of exceptional. The child actors effortlessly capture the essence of youthful innocence and bravery, drawing viewers into their world of bikes, dungeons, and monsters. Moreover, the adult cast members, including Winona Ryder and David Harbour, bring depth and emotional resonance to their respective roles.The series' storytelling is equally impressive. It skillfully blends elements of horror, science fiction, and coming-of-age drama, creating a perfect blend of thrills and heartfelt moments. The pacing is superb, allowing the plot to unfold naturally while keeping viewers on the edge of their seats. Each season builds upon the previous one, expanding the mythology of the Upside Down and delving deeper into the characters' lives.In addition to its captivating narrative, \"Stranger Things\" boasts exceptional production values. The meticulous attention to detail in recreating the 1980s is evident in the set design, costumes, and soundtrack. The show's aesthetic transports viewers back in time, immersing them in the world of neon lights, Walkmans, and iconic pop culture references.While the series excels in many aspects, it occasionally falls into familiar tropes and predictable story beats. However, these minor flaws do not detract significantly from the overall enjoyment of the show. The strengths far outweigh the weaknesses, and the captivating performances and intriguing plotlines keep audiences eagerly awaiting each new season.\"Stranger Things\" has become a cultural phenomenon, resonating with both movie lovers and general audiences alike. It successfully captures the essence of 80s cinema while delivering a fresh and engrossing narrative. It is a testament to the show's quality that it has garnered such a passionate fan base and critical acclaim."
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw3690886",
      "warningSpoilers": true,
      "date": "22 April 2017",
      "rate": "9",
      "helpful": "376 out of 550 found this helpful.",
      "title": "Again a very nice series from Netflix!",
      "content": "Stranger Things is a 1980s inspired and themed science fiction horror Netflix show. The show is set in November 1983 and takes place in the fictional town of Hawkins. Hawkins residence live a fairly normal life until a boy named Will Byers goes missing in the woods. Three of Wills friends Mike Wheeler (played by Finn Wolfhard), Lucas Sinclair (played by Caleb McLaughin) and Dustin Henderson (played by Gaten Matarazzo) are very worried for him but what they uncover something more dark and sinister. After looking for their missing friend they come across a girl, who they call Eleven because of her tattoo. However they soon find out this isn't any ordinary girl but one with very special powers. It is very clear the show takes lot of inspiration from classics 80's films like The Goonies and ET. The performances from all of the cast are great especially the child actors, who show the right amount of charisma and banter you expect from kids growing up in the 80's. However, the star of the show here is definitely Eleven (played by Millie Bobby Brown) who plays the ET type of role in show. Millie's brilliant acting skills have a lasting effect on the viewer even though she has 42 words throughout the whole series. The Duffer Brothers brilliant writing and directing skills play with your emotions to create a love letter to all those 80's horror films. It's truly something special! 9/10"
    },
    {
      "username": "bzxkvjvw",
      "userUrl": "https://www.imdb.com/user/ur144425192",
      "reviewLink": "https://www.imdb.com/review/rw9047943",
      "warningSpoilers": false,
      "date": "11 May 2023",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Love this show",
      "content": "Man I love this show! It's honestly just amazing and very every time a new season comes out I rewatch the whole series! I'm sad that this upcoming season will be the last. But it was a good run and man they made a masterpiece of a show! For one the cast is amazing and I love them all! And the quality of this show is so well done! I loved watching it with my family back when it first came out! We would watch and talk about it with friends and family. Another thing I love all the music is amazing and the scenery and atmosphere I like so much! This show really is amazing! If for some reason you haven't watched it watch it!"
    },
    {
      "username": "Kevin-42",
      "userUrl": "https://www.imdb.com/user/ur0076091",
      "reviewLink": "https://www.imdb.com/review/rw3842981",
      "warningSpoilers": false,
      "date": "27 October 2017",
      "rate": "",
      "helpful": "194 out of 280 found this helpful.",
      "title": "Two very different seasons (EDIT: A few words about Season 3)",
      "content": "I guess plenty of people have said a lot of things about all the movie and TV references this series has and how it recreates the eighties in all their faults and splendor. I will not add to that.With the release of the second season I'd simply like to advise that both seasons are very different animals. Think of it as the difference between the original Alien movie and the Aliens sequel: Whereas the first season was more about an unknown and unseen horror and the mystery behind the backstory, the second has more in-your-face action and horror laced with character development arcs which feel nice but sometimes sidetrack the series a bit.Consequently, a fan of the show should probably watch the second season as a separate work of fiction rather than a true continuation of the first season in tone and spirit. The writers move the story forward and we get a very good piece of entertainment but the new season has to be judged on its own merits.EDIT: Season 3 turned out to be a huge change in tone for the series. Maybe it's really hard keeping up the mystery if much of the \"world\" of Stranger Things already yielded many of its secrets but the overall \"feel\" of the series went into a different direction. Maybe the writers simply ran out of 80' templates to rip off. Season 1 was very much inspired by supernatural horror as in \"Poltergeist\". Season 2 took many cues from \"Creature Features\" like \"Gremlins\" or \"Aliens\". Season 3 now uses elements of 80' zombie flicks and low budget gore horror with a little bit of spy comedy mixed in (and fight scenes which feel straight out of \"Die Hard\"). All those genres didn't really mix well in the 80' and this strange cocktail sure doesn't work today. That doesn't mean that Season 3 is bad. It simply relies on characters who were established in previous seasons which used very different 80' story elements and tropes. It's almost like seeing Darth Vader in an Indiana Jones movie. Both work on their own but not together.Basically, Season 3 is an all too transparent attempt to plough a fresh nostalgia field but it doesn't work in the context of previous seasons."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw5451518",
      "warningSpoilers": false,
      "date": "1 February 2020",
      "rate": "9",
      "helpful": "57 out of 82 found this helpful.",
      "title": "Nostalgia, horror and sci-fi in one great series",
      "content": "This series is set in '80s Hawkins, Indiana. As it opens twelve year old friends Will Byers, Mike Wheeler, Dustin Henderson and Lucas Sinclair are playing Dungeons and Dragons. Shortly afterwards Will vanishes; he has been taken to 'The Upside Down'; a dark parallel universe. Around the same time a mysterious girl, known as Eleven (shortened to El), turns up. It later becomes apparent that she has telekinetic powers and is being looked for by workers at a secretive facility. As the story progress's Will's friends befriend El and she helps them try to find him. His mother is convinced that he is trying to communicate with her.I've only described the basic plot of season one; the second and third seasons follow on with new, but related stories with most of the same characters and some new ones.I really enjoyed this series from the start of the first season to the end of the third. Perhaps it was because I was in my early teens in the early eighties I really enjoyed the nostalgia factor despite the fact that I was growing up in rural Oxfordshire not small town America... of course I was watching American films like ET and late '50s set 'Stand By Me'. The group of friends in this particularly reminded me of the boys in the latter of those films. The story provides some good scary moments and a great atmosphere with threats that are a combination of fantasy and sci-fi... creatures beautifully mirroring the Dungeon and Dragon monsters in the game the boys play. The characters are great; most obviously the boys, Eleven, Will's mother Joyce and Jim Hopper, the town's sheriff. The cast is really good; the youngsters are really great making their characters believable even during the most fantastical of scenes. Millie Bobby Brown particularly stands out as Eleven; a character that is both vulnerable and at times potentially dangerous. The adult cast is impressive too. The effects, an impressive mix of CGI and physical effects, impressively bring the more supernatural elements of the film to life. Overall I'd certainly recommend this series to fans of the genre... I can't wait for season four."
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw7946511",
      "warningSpoilers": false,
      "date": "12 March 2022",
      "rate": "8",
      "helpful": "44 out of 62 found this helpful.",
      "title": "Myriads of 80's pop culture done in an amazeballs way.",
      "content": "I was not interested in seeing this but my daughter made me sit with her cos she wanted explanation about each n every thing associated with the 80s.And to be honest, after completing the first 3 seasons, i can definitely vouch that fellas who were kids in the 80s will enjoy this.Some amazing homages : Stand By Me, Firestarter, The Blob, Back To The Future, NeverEnding Story, The Thing, The Goonies, E. T., Ghostbusters, Close Encounters of the Third Kind, Gremlins, IT, Risky Business, Star Wars Episode V, The Evil Dead, Day of the Dead, Fast Times at Ridgemont High, The Woody Woodpecker Show, Halloween 2, They Live (alleyway fight), Invasion of the Body Snatchers, The Terminator, Scanners, Aliens, Karate Kid, Jaws, The Predator, Poltergeist, Indiana Jones, The Mist, Cujo, etc.But the best homages were the arcade games n the vhs store."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw4003691",
      "warningSpoilers": true,
      "date": "16 December 2017",
      "rate": "10",
      "helpful": "53 out of 77 found this helpful.",
      "title": "what we know and don't know can lead to perceptive contrasts",
      "content": "Since its debut last year, Netflix's \"Stranger Things\" has become a popular show. I just binge-watched the first season. A couple of things struck me. One is of course the focus on government secrets and how Will's disappearance leads to the realization that this small, idealistic town might not be what it seems. Equally significant is the look at and allusions to 1980s popular culture.* But beyond that, there's the contrast between Will's family and Mike's family. Mike comes from an affluent family in an immaculate house, while Will comes from a working-class family in a house not in the best condition. These set the stage for the eerie events soon to dominate the town.From the first episode, it was clear that this was going to be a good show, and it didn't disappoint. Winona Ryder, as Will's distraught mother, puts on what has to be the best performance of her career. If you only know her from her \"cute\" roles, then you're in for a pleasant surprise. Outstanding series.And remember, the bad men are coming.*I understand that the show's creators tracked down the makers of the era's board games to find out what they got called in foreign languages, so as to be able to properly localize the show in foreign countries."
    },
    {
      "username": "BrnzReviews",
      "userUrl": "https://www.imdb.com/user/ur102393358",
      "reviewLink": "https://www.imdb.com/review/rw8349349",
      "warningSpoilers": false,
      "date": "19 July 2022",
      "rate": "10",
      "helpful": "32 out of 44 found this helpful.",
      "title": "What A Watch Must See!",
      "content": "Stranger Things was an amazing surprise upon watching it I had no idea what kind of adventure was ahead of me. The best way to put this show is a love letter to the '80s classics that captivated a generation. 'Stranger Things' is set in 1983 Indiana, where a young boy vanishes into thin air. As friends, family and local police search for answers, they are drawn into an extraordinary mystery involving top-secret government experiments, terrifying supernatural forces and one very strange little girl.I loved everything about this show, the cast were absolutely breathtaking, If I started to note on each one I liked we'd be here all day but some really did stand out to me like Joe Kreery as Steve Harrington, by far my favourite from start to nearly finish as we have one more round to go.I highly recommend watching this, I absolutely loved it! Bring on season to 5!"
    },
    {
      "username": "reddiemurf81",
      "userUrl": "https://www.imdb.com/user/ur27018907",
      "reviewLink": "https://www.imdb.com/review/rw8330993",
      "warningSpoilers": true,
      "date": "13 July 2022",
      "rate": "9",
      "helpful": "37 out of 52 found this helpful.",
      "title": "Season 4!!!!!!!!!!!!!!!!",
      "content": "I can't believe the first time I tried to watch the first episode of season 1 I didn't get into. What?!? I must have been having an off day.I thoroughly enjoyed seasons 1-3. The kids are just perfectly cast, and work so well together. The adult cast couldn't be better. I couldn't wait to see what happened after the end of sn 3 (unfortunately,,, lots happened in the world, and really slowed things down). Then finally,,,Season 4 brought everything to a COMPLETELY DIFFERENT LEVEL!!! First,, every episode was either a mini movie, or a full blown movie (as far as the run time goes). From the opening of ep 1, everything is different from previous seasons bc our group has become scattered. Joyce, Will, Jonathan, and El are in California now, while everyone else is back in Hawkins. While Jonathan has adapted to life in Cali (he's become a bit of a stoner along with his buddy Argyle, who drives a van to deliver pizza from the SURF PIZZA 🍕 chain), and Joyce has found a thriving new job where she can work from home,, Eleven has had a more difficult time. While still reeling from losing her adoptive Dad, Hopper, along with losing her powers,, she has become the target of ridicule and bullying from a group of California kids at school. At her age, it's tough for any child to adapt to theirs surroundings,, but for El,, the deck is always stacked against her. Will is also having troubles, but for him it's more of the estrangement from everything he's known, along with the realization that he's probably never going to feel normal after what he's been through.In Hawkins, Dustin, Lucas, and Mike have joined a D&D club called Hellfire, by their \"interesting\" leader Eddie Munson (the quintessential metal head of the 80s). However, Lucas has also joined the basketball team in an effort to gain popularity. Max, on the other hand is still reeling from the events that took place at the end of sn 3 (Billy's death, etc). She's even been visiting the school counselor, and although she'd broken up with Lucas at some point, he still tries to reach her to no avail.Nancy is still chasing down stories as a budding journalist while Steve and Robin toil away at the video store (we saw them get hired at in the last ep, sn 3).Overall, life seems to be going okay in Hawkins,, at least on the surface, that is. The upside down is still lurking just on the other side,, and a great evil is making itself known to the teenagers in Hawkins. Especially teens who've gone through certain trauma,,,I don't want to say too much (cause I'll give too much away),, but this season should win all kinds of awards!!! I can only hope that the last season will be as good (don't know how they can top this).So much happening in this season. I really can't emphasize this enough. Your emotions will be drained after watching, but in the best way possible.The big bad guy's name is Vecna, and he is one of THE greatest villains I've ever seen!! So evil, so scary, just incredible.I'm literally on pins and needles wanting to see season 5!! Of course,, we'll probably have to wait til 2024 before they get it on Netflix,,, ugh.P. S. Really!! If you enjoyed sns 1-3,, this season blows them out of the water several times over!!"
    }
  ],
  "errorMessage": ""
}