{
  "imDbId": "tt4236770",
  "title": "Yellowstone",
  "fullTitle": "Yellowstone (TV Series 2018–2023)",
  "type": "TVSeries",
  "year": "2018",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8806412",
      "warningSpoilers": false,
      "date": "17 January 2023",
      "rate": "10",
      "helpful": "62 out of 74 found this helpful.",
      "title": "Love This Show!",
      "content": "Yellowstone has easily become one of my favorite shows on tv. It's now going on to season five and every season has been fantastic so far. Almost every episode of every season is excellent and moves the story forward. There are some slow parts and slow episodes but that's not a bad thing. There is plenty of action and drama to keep everyone satisfied. The cast is just about perfect as they all give incredible performances. The cinematography is as good as it gets on tv and shows just how beautiful Montana is. I am completely hooked on this show and one of the few shows I still watch live because I love it that much."
    },
    {
      "username": "shanayneigh",
      "userUrl": "https://www.imdb.com/user/ur1738956",
      "reviewLink": "https://www.imdb.com/review/rw8302156",
      "warningSpoilers": true,
      "date": "5 July 2022",
      "rate": "5",
      "helpful": "50 out of 59 found this helpful.",
      "title": "Macho, macho man",
      "content": "A friend recommended it, she loves the setting which I agree is beautiful. But the show itself suffers from poor writing. The central conflict, much like in Succession, is the same throughout the show. Although the antagonists might change, they're always after Dutton's land for some reason or another. And after some 40 hours, that's getting a bit old.Taylor Sheridan does a poor job introducing us to this world I know absolutely nothing about. After the first episode I had absolutely no f-n idea what was going on with the cattle conflict and who all these people were in relation to one another.But the only thing more one-note than the story are the characters. Kevin Costner grumbles, growls and chuckles his way through every episode. Web Bentley mopes around with a jaw so clenched it could produce diamonds. Kelly Reilly acts like a maniacal a-hole to absolutely everyone she encounters, yet we are to believe she's some sort of business genius desired by everyone. The second son and his Indian wife are so bland they melt into the wallpaper. The characters remain the same. No growth or change.There is no one to root for. Am I supposed to sympathize with John Dutton, a whiny corrupt charmless billionaire who supposedly is the main protagonist? Then give me something to work with. It's not that a protagonist has to be a good guy. Tony Soprano is a perfect example of a ruthless a-hole one couldn't help rooting for. But Dutton? \"My family has owned this land for 200 years, and if we let someone build a casino/hotel/golf course/resort/airport next to it people can't afford to live here.\" But you holding on to the land also means that no one can live there, regardless of their income. It's a conflict which doesn't make sense. Or he's just simply a hypocrite.One other thing which doesn't make sense is why they kill people who want to leave. When it happened the first time I thought it was because Dutton was a secret kingpin of crime or something, with his ranch a front for drug running or whatever. But no, people just can't leave. I guess, because after some 40 hours we still don't have a proper explanation for it. The small stuff that they have been up to at the Dutton ranch doesn't seem to justify killing everyone who wants to leave. One little problem with this is that this cowboy world seems kind of small. People from different ranches and states know each other. One would think that someone would go \"Hey, whatever happened to these 20 guys who went to work for Dutton and were never heard from again?\".The episode structure is pretty much the same. At least one fist and/or gun fight per episode, and it's so boring. Although they mix it up in one late episode and have a knife fight instead. I guess that's progress.If I see one more montage set to cheesy country music I am going to kill myself."
    },
    {
      "username": "atlasmb",
      "userUrl": "https://www.imdb.com/user/ur34845698",
      "reviewLink": "https://www.imdb.com/review/rw4231864",
      "warningSpoilers": false,
      "date": "9 July 2018",
      "rate": "9",
      "helpful": "124 out of 157 found this helpful.",
      "title": "Costner Is Strong As An Aging Cowboy Patriarch",
      "content": "Kevin Costner is the patriarch presiding over a dynastic ranch that is the size of some countries. His way of life is being impinged on by resort developers, tribal rights, and the authority of the state of Montana. Reminiscent of Rock Hudson in \"Giant\", he is trying to hold on to the old ways.\"Yellowstone\" develops quickly with little introduction, yet its story unravels with the natural pace of a wilderness day, pausing for tribal rituals, cowboy conventionalities, and political machinations. It's a far flung undertaking that dwells on the seams between laws and justice, family and friendships.Costner fills his character's boots naturally, it seems. He is a world-wearied man who has seen too much and lied too often. The land and the family are his lifeblood. He can hear the footsteps coming his way, but he can only fulfill his role-out of habit as much as loyalty.Although some action is a little confusing due to lack of explanation, it feels natural, as if the viewer is getting a genuine slice-of-life glimpse into another world. I hope the resolution of this saga includes an emotional payoff that justifies its breadth and its attention to details.Update 7/20/18: After four episodes, this series has a strong voice and a persistent rhythm. We learn the fullness of each story, from roots to fruits. I am increasing my grade to \"9\"."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8809533",
      "warningSpoilers": false,
      "date": "18 January 2023",
      "rate": "10",
      "helpful": "65 out of 79 found this helpful.",
      "title": "Can't get enough of this show!",
      "content": "Yellowstone is one of the best shows on tv right now! It's been the #1 show on cable 5 years in a row! It's hard to explain just how good this show really is. The acting, writing, directing, cinematography, production, etc, are all incredible! It's exactly what you expect from a Taylor Sheridan show! Everything he does is fantastic! The acting is some of the best on tv right now. Kevin Costner, Luke Grimes, Cole Hauser, Kelly Reilly, Kelsey Asbille, Jamie Dutton and pretty much the rest of the entire cast all deserve recognition for the incredible job they do season after season! It's one of the rare shows where almost every episode is just as good as the others. I can not recommend this show enough, just go watch it for yourself!"
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw7589927",
      "warningSpoilers": false,
      "date": "27 November 2021",
      "rate": "10",
      "helpful": "322 out of 424 found this helpful.",
      "title": "something no one mentions",
      "content": "Not only is this one of the best produced, best acted, best written shows in history -- Catherine Fitts even quotes it in her interviews -- but it is also one of the only shows in our new streaming universe that has maintained the quality through four seasons. Your humble reviewer, with over 1700 reviews here, watches a lot of TV. Maybe too much. And, as exciting as the Netflix phenomenon may be, I have tracked literally dozens of shows that ran out of quality writing by the second season. They literally did not have an actual plan to follow in the event of renewal. Many of these shows are still in production, which is even more astonishing. And distressing. Yellowstone, against that backdrop. Is a true wonder. ((Designated \"IMDb Top Reviewer.\" Please check out my list \"167+ Nearly-Perfect Movies (with the occasional Anime or TV miniseries) you can/should see again and again (1932 to the present))"
    },
    {
      "username": "TxMike",
      "userUrl": "https://www.imdb.com/user/ur0438066",
      "reviewLink": "https://www.imdb.com/review/rw8649412",
      "warningSpoilers": false,
      "date": "1 November 2022",
      "rate": "",
      "helpful": "51 out of 62 found this helpful.",
      "title": "Dutton family and their sprawling Montana ranch.",
      "content": "This series has been on since 2018 but now is the first time I have watched any of it. Last night I completed the first episode of the first season, it runs right near 90 minutes. As to introduce the Dutton family we see they have powerful influence in their valley but are fending off \"attacks.\" One from developers who want to put up condos. Another from the neighboring Native reservation looking to get some of their land back plus some livestock. To help deal with all that and the sprawling size of his ranch Dutton (played authentically by 60-something Kevin Costner) has several grown Cowboy sons and a helicopter with a dedicated pilot.The reason I watched episode one of season one (on Peacock streaming) was to get the feel for the Dutton family because I am currently watching the ten episodes of the more recent Taylor Sheridan program \"1883\" which is the prequel of sorts. It was (fictionally) in 1883 that the Dutton family from Tennessee joined a larger group to wagon train from Fort Worth Texas to \"somewhere in the West\". They must have stopped when they reached Montana.Again it is all fiction but if we look at the ages of the men, and the fact that Costner was born in 1955, his character would probably be the great, great grandson of the Dutton patriarch (played by Tim McGraw) in \"1883\". E.g. With sons born about 1875, 1900, 1925, and the 1950s.\"Yellowstone\" is a really fine series, the actors are all first-rate, the cinematography and sound are excellent. It just ins't the kind of program I could get invested in and continue to watch. It is hard to find characters with redeeming qualities and I really don't long-term enjoy programs which constantly focus on arguments and fights, and often killing. Now in my 70s I prefer to spend time watching \"pleasant\" stories.NB - \"1883\" is a really fine and interesting series, how it authentically depicts the great hardship of pulling up roots and traveling through unknown territories to try to find a new life in a new place."
    },
    {
      "username": "jtomlinson-48204",
      "userUrl": "https://www.imdb.com/user/ur63855930",
      "reviewLink": "https://www.imdb.com/review/rw5763071",
      "warningSpoilers": false,
      "date": "23 May 2020",
      "rate": "10",
      "helpful": "281 out of 351 found this helpful.",
      "title": "This is definitely like watching a moving artistic masterpiece!!",
      "content": "It is so gorgeous and beautiful to look at and I guess being from Texas, I find it comforting. Obviously Kevin has gotten better with age! Hot Daddy! They scored big time to get Kelly Reilly in this! I still tear up when I think of her character in \"\"Flight\"! She is one powerful actress who really puts her heart out there! I am in love with this show! I don't want to spoil anything so I'll just leave it at this. It is enjoyable to let play in the background or focus on intently. It doesn't try to own you, it just offers you everything to take in as you please."
    },
    {
      "username": "Jeddia",
      "userUrl": "https://www.imdb.com/user/ur0251380",
      "reviewLink": "https://www.imdb.com/review/rw5551688",
      "warningSpoilers": false,
      "date": "15 March 2020",
      "rate": "9",
      "helpful": "195 out of 242 found this helpful.",
      "title": "A solid drama with influences that are all over the palce...",
      "content": "Yellowstone is a solidly written drama - great characters, well-crafted - that draws it's tone from a few different modern-day masterpieces.It has the feel and cinematography of Longmire, the plotting and grim outlook of The Sopranos, and the dramatic dynamics of shows like 'Dynasty' or any of the other network dramas similar to that.Much respect must go to Costner and Cole Hauser - these guys bring it 100%.I did not expect to get drawn in to this show like I did. It's well worth your time."
    },
    {
      "username": "codamax1",
      "userUrl": "https://www.imdb.com/user/ur37897199",
      "reviewLink": "https://www.imdb.com/review/rw4302425",
      "warningSpoilers": false,
      "date": "25 August 2018",
      "rate": "10",
      "helpful": "321 out of 386 found this helpful.",
      "title": "Cole Hauser as Rip is AMAZING",
      "content": "I have seen most of Coles tv work but I have to say when I watched the first Episode of \"Yellowstone\" and the next few I was so entriged with Rips character and he seemed familiar I had to look up who this handsome dark haired cowboy was and imagined my shock when it said Cole Hauser !!! I was telling myself NO WAY !! Brilliant I tell you JUST brilliant !!!"
    },
    {
      "username": "DocHolmberg",
      "userUrl": "https://www.imdb.com/user/ur18954996",
      "reviewLink": "https://www.imdb.com/review/rw8803307",
      "warningSpoilers": true,
      "date": "16 January 2023",
      "rate": "9",
      "helpful": "67 out of 79 found this helpful.",
      "title": "A solid 10 - if Monica disappeared",
      "content": "I loved this show from the start with its intense storytelling, great acting and actors topped of with magnificent photo and sceneries.Taylor Sheridan finds the right path once again with the rough cowboy life and Rip has got be one of the best character ever in tv-history.Some of the season finales have been some of the most thrilling hours in tv ever.This show would have been a solid 10 if it were'nt for Monica - the most depressing and flat character ever who just gets more airtime and becomes more and more annoying for each new episode.Kayce should just run away from her and never look back."
    },
    {
      "username": "amadour-87687",
      "userUrl": "https://www.imdb.com/user/ur106752841",
      "reviewLink": "https://www.imdb.com/review/rw8736514",
      "warningSpoilers": false,
      "date": "15 December 2022",
      "rate": "7",
      "helpful": "22 out of 23 found this helpful.",
      "title": "Takes a licking and keeps on ticking!",
      "content": "Considering the enormity of this one ranch in Montana it amazing trouble is ever able to find any of the Dutton-but it does! They're like the Cartwrights of Bonanza only not nearly as honorable. Hell, they're not as honorable as the Eweings of Dallas. Game of Thrones had a huge cast that was constantly being pared away each week. This made it believable, knowing anyone could get the ax at anytime. Watching this family being battered, beat up, blown to bits, rolled over in trucks, and shot multiple times with assault rifles, and surviving to do it all over again gets a little tedious. The best moments to me are when they behave like real people with real emotions and real risks of losing a lifestyle that's been lost for decades already. Rip and Beth have a compelling relationship to watch and admire. They don't need it amped up any further by manufactured drama that can never measure up to the natural chemistry between them. I like this show well enough when I get an unexpected look at the practical life of a cowboy or the grueling effort it takes to sustain life on the reservation. I don't need Ninja's or Militia clowns planning secrets attacks to enjoy the superior writing or the grandvperformances of the actors."
    },
    {
      "username": "Homer_Ate2",
      "userUrl": "https://www.imdb.com/user/ur49667288",
      "reviewLink": "https://www.imdb.com/review/rw7720972",
      "warningSpoilers": false,
      "date": "4 January 2022",
      "rate": "5",
      "helpful": "124 out of 163 found this helpful.",
      "title": "It was a guilty pleasure until S04",
      "content": "This show has run dry on ideas and I'm done investing time. None of the characters, save Jimmy, grow or change. It's gone from a modern western to soap opera. To add insult to injury the story now is completely unbelievable, I really think that the duttons are the bad guys in their own show."
    },
    {
      "username": "coronitasc",
      "userUrl": "https://www.imdb.com/user/ur57537714",
      "reviewLink": "https://www.imdb.com/review/rw4210738",
      "warningSpoilers": false,
      "date": "21 June 2018",
      "rate": "10",
      "helpful": "283 out of 346 found this helpful.",
      "title": "Finally a modern day western worth watching!",
      "content": "I've been waiting on this show to premiere and I was more than pleased with the performance with the great set of actors and actresses that seem to bring their A game along. Beautiful cinematography and we'll bred horses what else could a gal ask for?"
    },
    {
      "username": "paulwattriley",
      "userUrl": "https://www.imdb.com/user/ur55597043",
      "reviewLink": "https://www.imdb.com/review/rw7871653",
      "warningSpoilers": false,
      "date": "16 February 2022",
      "rate": "5",
      "helpful": "147 out of 202 found this helpful.",
      "title": "Overhyped nonsense",
      "content": "Massively overhyped and the epitome of how weird modern people are most of the characters extremely unlikeable however it appears people like horrible nasty people. The good people are disliked. Its basically Dallas with foul mouthed nasty people in a fantasy world of the unbelievable. Yes GOT had this but GOT was pure fantasy this is supposed to be realism but its far from it. Yes I watched all 4 season and it did start of well but soon it was 90% nonsense and watched to see how much more nonsensical it would get."
    },
    {
      "username": "characters-132-663775",
      "userUrl": "https://www.imdb.com/user/ur55807515",
      "reviewLink": "https://www.imdb.com/review/rw4245296",
      "warningSpoilers": false,
      "date": "20 July 2018",
      "rate": "10",
      "helpful": "165 out of 204 found this helpful.",
      "title": "Theater quality programming on Television",
      "content": "One of the best pieces of television I have seen. Among the ranks with the Sopranos, Mad Men, etc.. Costner fans know he has always been fascinated with the west. Dances with Wolves, Open Range, Silverado. Costner doesn't need to make movies or TV shows anymore. He is a great writer. Given the quality writing and cinematography depicted in Yellowstone, Costner is clearly enjoying making this one. Excellent acting across the cast and the fact that most of the actors are not household names, makes the characters more interesting. I would urge anyone who likes smart dramas to watch this series. If you like westerns, you can's miss it."
    },
    {
      "username": "johnschubert-93854",
      "userUrl": "https://www.imdb.com/user/ur126296033",
      "reviewLink": "https://www.imdb.com/review/rw8811773",
      "warningSpoilers": true,
      "date": "19 January 2023",
      "rate": "8",
      "helpful": "26 out of 31 found this helpful.",
      "title": "Excellent beginning but tails off",
      "content": "After two exceptional Seasons the quality has somewhat diminished in future seasons, especially in Season 4 and in the first part of season 5. Season 4 often became an opportunity to advertise horse training which may appeal to some but I was completely bored by it. Sheridan apparently has a spin off series, 6666, planned that will expand on this which I will simply avoid. Season 5 has John Dutton becoming the Montana Governor who's only purpose is to protect his ranch from those who would like to requisition a portion of his land in order to develop \"vacation\" properties for the wealthy and build an airport. Yawn. That story line gets even more boring than the horse training (the only positive was the introduction of his advisor as Governor who besides being a lesbian had some surprising qualities). Almost equally uninteresting is Beth Dutton's never ending effort to punish Summer Higgins (Piper Perabo), an activist against the killing of animals and a vegan as well as being her father's \"advisor\" and apparent \"love\" interest. After a beat down that seemed to have resolved that, Beth's continued sniping has become challenging to watch. Beth Dutton was always a hard core B*tch (which she is proud of) but that was the part of her character that made viewers like her but her vindictive attitude is turning many away from her. It may be time for Taylor Sheridan to focus on other projects or return Yellowstone to what brought so many people to the series in the first place and abandoned the most recent storylines."
    },
    {
      "username": "babyyygorilla",
      "userUrl": "https://www.imdb.com/user/ur149761675",
      "reviewLink": "https://www.imdb.com/review/rw8782969",
      "warningSpoilers": false,
      "date": "6 January 2023",
      "rate": "9",
      "helpful": "30 out of 35 found this helpful.",
      "title": "Monica's lines are a headache but..",
      "content": "I'm on season 1 episode 8, before the end of the season.I really enjoy the series, There's quite a lot of drama, I feel like it's sort of a telenovela about cowboys.There's a lot of life experiences that I've never had the chance to experience (and probably never will) on the show and it's interesting to see it.The script is almost perfect. I feel like the screenwriter had some beef with Monica because her lines sometimes don't completely relate to the situation, and maybe it's her acting too? I do not know .Her lines are definitely really bad. I hope it will get better with the seasons."
    },
    {
      "username": "knifemagnet",
      "userUrl": "https://www.imdb.com/user/ur10017506",
      "reviewLink": "https://www.imdb.com/review/rw4987538",
      "warningSpoilers": false,
      "date": "10 July 2019",
      "rate": "4",
      "helpful": "99 out of 136 found this helpful.",
      "title": "Plodding and worsens as it moves forward",
      "content": "I ran across a video on YouTube where Costner approaches some tourists on his land; prior to this I didn't know this show existed as I typically avoid 'TV' shows like the plague. While the acting from Costner, Reilly, Hauser, and Huston is solid, the writing and general directing leave a lot to be desired. This thing moves like a soap opera without being of interest. Too much here annoys me, and beyond the writing and general direction of the show, coming in second in the annoyance department is the character Kayce and his annoyingly present son. Throughout season one in its entirety nearly nothing happens that isn't contrived - and that's just how the show feels. One silly episode synopsis read something about John Dutton's secret, which is brought up as a concern, regarding elections, by a governor to a AG candidate (which is not John Dutton) - it's utterly absurd. And that's this show. Absurd. Driving with your son, have a gun in the glove, and see a strange van on the side of the road? Well, of course you go full vigilante with your little irritating son present. And of course this character is a SEAL - cliche? Stick a fork in it. Given the option of watching more of this or staring at my ceiling I choose the ceiling."
    },
    {
      "username": "adamcomito",
      "userUrl": "https://www.imdb.com/user/ur58565595",
      "reviewLink": "https://www.imdb.com/review/rw7573267",
      "warningSpoilers": false,
      "date": "22 November 2021",
      "rate": "4",
      "helpful": "105 out of 147 found this helpful.",
      "title": "Started strong but the characters are unlikable",
      "content": "Half way through season 4 and it's really testing my patience. The entire family is unlikable and who knows how any of them lasted this long. Each of the main characters are terrible people and are very hard to have empathy for. As others have said...just sell the damn ranch already, the way they do business is so far from reality it's a wonder the government hasn't raided this place Al la Waco- Branch Davidians style. Way too many bodies hidden on this ranch to be realistic, the feds would have a field day with this family."
    },
    {
      "username": "Love_Life_Laughter",
      "userUrl": "https://www.imdb.com/user/ur56061462",
      "reviewLink": "https://www.imdb.com/review/rw8748852",
      "warningSpoilers": true,
      "date": "21 December 2022",
      "rate": "7",
      "helpful": "22 out of 27 found this helpful.",
      "title": "Suggestion",
      "content": "In the latest season, the show seems to be in a repetitive cycle. Take a page from Star Trek and other long-running shows. Nothing wrong with the main themes but each episode or so choose a supporting character to focus and weave a back story. How did the female wrangler get so desperate to be on the ranch? How come the singing cowboy never pursued that career when he was so good? What brought the other wranglers to jail? Are there unknown relationships that surface between, say, the wrangler families and atrocities committed on the reservation? What is the Chairman of the reservation back story and what drives him? How does the grandson interact with his schoolmates on the reservation having wealth and a white father? Lots to explore within the already compelling themes of corporate greed, intergenerational wealthy family warfare, and Beths lack of impulse control!"
    },
    {
      "username": "cwalker-04551",
      "userUrl": "https://www.imdb.com/user/ur121218696",
      "reviewLink": "https://www.imdb.com/review/rw8701452",
      "warningSpoilers": false,
      "date": "29 November 2022",
      "rate": "8",
      "helpful": "23 out of 27 found this helpful.",
      "title": "Yes, there are Horses in Heaven",
      "content": "I've been a fan of this show since it's inception. This latest episode was an eye opener for me. Governor Dutton seems surprised that there is room for animals in Heaven. I didn't think of his character as being that detached from the creatures he depended on to sustain his earthly livelihood. I realize that this may be the final season of Yellowstone the series. I find myself conflicted in that I love the depiction of that last great frontier being sucked up and commercialized by capitalists from the west. And yet, that's exactly what happened to the indigenous peoples. And the indigenous peoples there are rooting for the Western capitalists. Irony. Still, a great TV series. Worth watching."
    },
    {
      "username": "dmckenzie1981",
      "userUrl": "https://www.imdb.com/user/ur59444992",
      "reviewLink": "https://www.imdb.com/review/rw8717447",
      "warningSpoilers": true,
      "date": "5 December 2022",
      "rate": "8",
      "helpful": "19 out of 21 found this helpful.",
      "title": "They should rename it Beth",
      "content": "I loved the first four seasons, but the new season is so Beth-centric, it's lost its spark. While Beth in small doses made for a great sub plot, her brooding, anger, hate and self destructive attitude as the central character has become so annoying and tedious, I found myself cheering for Jamie to punch the accelerator and run right through her.Every time a new sub plot pops up, there's Beth to skull a vodka and storm out of the room, or sit at the table and whinge. There's still time to salvage things, but more Casey, Rip, John and the Cowboys, and less Beth, would go a long way to getting back on track."
    },
    {
      "username": "douglasmcbroom",
      "userUrl": "https://www.imdb.com/user/ur127033612",
      "reviewLink": "https://www.imdb.com/review/rw6598145",
      "warningSpoilers": false,
      "date": "15 February 2021",
      "rate": "5",
      "helpful": "113 out of 170 found this helpful.",
      "title": "Desperately Needs Balance",
      "content": "Costner is brilliant. The supporting cast is outstanding. The problem is we need a rooting interest and mostly we don't like these characters very much, especially the daughter played by Kelly Reilly. She is despicable on every level. The son played by Wes Bentley is weak. The son played by Luke Grimes is the only character who gives us a chance to root. His wife, as played by Kelly Asbille, embodies all the arrogance of wokism and revisionist historians. Cole Hauser's character is a one-note thug. Danny Huston and Gil Birmingham are the bad guys of the piece but they get a real run for their money by the supposed good guys.But more than disagreeable characters, this series desperately needs some humor, some joy, some happiness. It is all negative, all the time."
    },
    {
      "username": "jiballini64",
      "userUrl": "https://www.imdb.com/user/ur38215575",
      "reviewLink": "https://www.imdb.com/review/rw7558430",
      "warningSpoilers": false,
      "date": "18 November 2021",
      "rate": "4",
      "helpful": "97 out of 143 found this helpful.",
      "title": "Just sell up...",
      "content": "...and move to Florida! Your children are vile, your workers are more stupid than their horses and everything about your ranching enterprise looks like you don't have a clue. If this is supposed to be a ranching dynasty, heaven help the cows!!!!Slow moving soap opera with horses, cows and Kevin Costner. I've given it enough of my time (S2E5) and I'm going back to Scandi noir or re-runs of Fitch."
    },
    {
      "username": "lisacarlson50",
      "userUrl": "https://www.imdb.com/user/ur62164515",
      "reviewLink": "https://www.imdb.com/review/rw5953862",
      "warningSpoilers": false,
      "date": "30 July 2020",
      "rate": "2",
      "helpful": "87 out of 126 found this helpful.",
      "title": "Painfully slow, Writing is terrible",
      "content": "None of the characters are worth watching and this sadly applies to Kevin Costner's character as well. It's the lack of writing which makes this show a real miss.. There's barely any acting going on and you can't rely on the beautiful environment and horses to fill in the large gaps. I can't believe this show is in Season 3 and being renewed. Why?"
    }
  ],
  "errorMessage": ""
}