{
  "imDbId": "tt7660850",
  "title": "Succession",
  "fullTitle": "Succession (TV Series 2018–2023)",
  "type": "TVSeries",
  "year": "2018",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw5968198",
      "warningSpoilers": false,
      "date": "5 August 2020",
      "rate": "10",
      "helpful": "371 out of 439 found this helpful.",
      "title": "Started slow...now it's one of my favorite shows ever!",
      "content": "What can you say about Succession that hasn't already been said? First off this show has won the Emmy for Best Drama all three seasons it's been on so far and literally every major character has been nominated or won an Emmy for their work on this show. It's also one of the highest rated shows here so it's not only a hit with the critics but the fans love it too. Bottom line is this is one of the best shows ever created. It's one of the rare shows where every season is just as good as the others. There's no let down or weak season. The writing and acting is what makes this show so special. It sucks you into their world and doesn't let go. You'll want to binge the entire series as quick as you can."
    },
    {
      "username": "jeroen-106",
      "userUrl": "https://www.imdb.com/user/ur8600622",
      "reviewLink": "https://www.imdb.com/review/rw4287094",
      "warningSpoilers": false,
      "date": "15 August 2018",
      "rate": "10",
      "helpful": "291 out of 343 found this helpful.",
      "title": "Give it time. It's great.",
      "content": "Early on this show is trying to find its tone. Too many weird zooms imply a mockumentary style and the humor clashes with drama early on. This show is at its best when it resolves around the sadness of each character, all trying to earn dads love, who just might not be capable of giving it. The acting is phenomenal, especially after the first couple of episodes. In some instances it reminded me of Festen (Thomas Vinterberg). I strongly disagree with some reviews here stating that the characters are two dimensional. On the contrary! It just takes a while before things come together. I highly recommend this show and I hope you do too."
    },
    {
      "username": "jeroen-106",
      "userUrl": "https://www.imdb.com/user/ur8600622",
      "reviewLink": "https://www.imdb.com/review/rw4210701",
      "warningSpoilers": false,
      "date": "21 June 2018",
      "rate": "10",
      "helpful": "327 out of 401 found this helpful.",
      "title": "I don't understand the negativity.",
      "content": "Characters are actually not one-dimensional as some people state here. Everyone is imperfect in this show. And even if they all seem greedy, they all have their weaknesses and their motivation is rooted deep in their personalities. For example the son who is temp CEO only wants his father's approval and pride, but gets rejected time after time. He plays the character very well. It's a healthy dose of drama and humor. I'm not sure yet about The Office - ish camerawork (sudden zooms) because it gives the impression of a mockumentary, as if the cameraman is there and just recording what is happening in real-time. It clashes a bit with the overall style of the show. Same for some of The Office style humor they brought to this show. But these are minor things that don't get in the way of the story.Definitely recommended. Give it a few episodes!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8576355",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "10",
      "helpful": "110 out of 137 found this helpful.",
      "title": "One of the best shows on tv!",
      "content": "Succession is not only one of the best shows currently on tv but it's one of the best shows of all-time! I heard such great things about it and saw all the awards it's won but still put it off until recently. I can't believe how much I was missing out on, I binged the entire series within a week. I have to admit that you have to give it a few episodes before you really get into it because it starts off pretty slow but before you know it you'll be addicted. The writing and acting is what makes this show so popular. I can't say enough about this cast, just about the entire cast has been nominated or won an Emmy for their work on this show. It absolutely deserves all the awards it's won and more!"
    },
    {
      "username": "helenahandbasket-93734",
      "userUrl": "https://www.imdb.com/user/ur69270793",
      "reviewLink": "https://www.imdb.com/review/rw4203947",
      "warningSpoilers": false,
      "date": "15 June 2018",
      "rate": "9",
      "helpful": "169 out of 222 found this helpful.",
      "title": "Family Practice In Obfuscation of Morals",
      "content": "I'm intrigued by this patriarchy, a blending of familial story lines that segue from one dysfunctional atrocity to the next. Like witnessing a torturous train wreck that reveals one train car to hold more carnage than the one previously revealed; we're carried along to decide for ourselves which of these halfwits is even remotely capable of stepping out from under their fathers expansive wing span. I'm completely taken aback by previous reviews that dispel the notion that this is compelling viewing, and find myself drawn into the plots and devices. I've long considered myself a fan of Adam McKay's story telling, and I'm afraid I must disagree with those who've pronounced this as 'unwatchable'. From one sibling to the next, theirs is a cautionary tale of raising your children to be loathsome human beings, that attributable wealth can breed contentious offspring that will feast on the flesh of others while laughing at the horror left in their wake. That a spine isn't inherited, and weakness isn't easily overcome. In this world, we witness the sowing of what they willfully reap- with repercussions meted out on a slow burn that may or may not bring casualties. I'm intrigued and can say without pause that this is a triumphant return to the greatness that once was HBO, and hopefully more to come, after the lackluster choices we've been witness to in the last decade or so from the likes of Girls, Vinyl, Rome, etc and more in keeping with some of the best television has to offer in Sopranos, 6FU, etc. Count me in on this one. For now at least."
    },
    {
      "username": "MadamWarden",
      "userUrl": "https://www.imdb.com/user/ur34187486",
      "reviewLink": "https://www.imdb.com/review/rw5207288",
      "warningSpoilers": false,
      "date": "23 October 2019",
      "rate": "7",
      "helpful": "158 out of 210 found this helpful.",
      "title": "REAL LIFE AT THE TOP",
      "content": "I really enjoyed this epic insight into the family life of the super powerful. I have had the opportunity over the years to witness first hand the shenanigans of families like this and it really struck a chord.This is a powerful series. Unlike Crazy Rich Asians, this really hits home. The deeply flawed and overtly ridiculous relationships within patriarchal or matriarchal dynastic families are exposed in their raw and nauseating honesty.The sad fact is that this series truly reflects the reality of wealthy families that seemingly seem so perfect to the gawking masses. It has been said that this is based on the lives of the Murdoch's but I can definitely say that it could be based upon many many wealthy dynasties.A superbly written, directed and acted masterpiece of TV theatre.A must watch!"
    },
    {
      "username": "cynthiacaton",
      "userUrl": "https://www.imdb.com/user/ur83360456",
      "reviewLink": "https://www.imdb.com/review/rw4227046",
      "warningSpoilers": false,
      "date": "5 July 2018",
      "rate": "10",
      "helpful": "303 out of 355 found this helpful.",
      "title": "Love this show!",
      "content": "It is true that most - if not all - of the characters are unlikeable but I think that is part of Succession's charm! The casting is spot on and the dialog is tight. It is well nuanced and I'm looking forward to where the plot is going.Highly recommended!"
    },
    {
      "username": "maniepranav",
      "userUrl": "https://www.imdb.com/user/ur64297988",
      "reviewLink": "https://www.imdb.com/review/rw5965428",
      "warningSpoilers": false,
      "date": "4 August 2020",
      "rate": "10",
      "helpful": "207 out of 251 found this helpful.",
      "title": "Another HBO drama destined for prestige TV status.",
      "content": "Why I was attracted to watching Succession in the first place was because I had heard that it had no likeable characters. Coupled with a backdrop of corporate America, it seemed like a show right up my alley. I had absolutely no idea that the show would exceed my expectations by a large mile.Not since The Sopranos have I seen an interplay of character dynamics this good, especially the toxic traits of those characters. Every little interaction is important, and affects another character on some or the other level significantly. Succession makes sure that behind the gaudy, showy nature of the Roy family, the ugliness of their existence is visible to you, even in the most subtle ways. The show both revels in and critiques the world it bases itself in. And I don't remember a character-driven drama being this thrilling. Hostile takeovers are usually not exciting to people uninterested in the financial world, but this show makes sure you understand the stakes involved. Like, Breaking Bad-level of tense.Of course, much of this is possible because of the phenomenal cast. I want Jeremy Strong to win an Emmy this year so badly. Kendall Roy is one of the most brilliant (and surprisingly sympathetic) characters I've seen, a mixture of Christopher Moltisanti and Jesse Pinkman, with a slice of your average venture capitalist. I just hope it doesn't typecast him as a Wall Street-type, although I love him in The Big Short too. I want him to win more than Brian Cox, who scares the living daylights out of me as Logan Roy when he merely enters a room. Then there's Sarah Snook as the prideful Shiv, an excellent, pitch-perfect arc like no other. And my man Kieran Culkin as the foul-mouthed-but-concerned Roman, another truly surprising sympathetic turn. And of course, when I talk about Roman, I will talk about Gerri, a role that actress J Smith Cameron absolutely kills, and should have received an Emmy nomination for. And this paragraph is incomplete without my love for Matthew McFadyen and Nicholas Braun in the most hilariously paired people that are Tom and (cousin) Greg since Chris and Paulie Walnuts.Succession doesn't mince words (or chicken hahahaha). Nothing on the script feels wasted. And the insults are ingenious. As long as Jesse Armstrong remains showrunner, this show will surprise us in the most insane of ways. The research shows (the writers' room is apparently asked to read the Financial Times everyday), and it adds to the authenticity of the show, one which I appreciate. I would also be stupid not to talk about the best original opening theme I have ever heard in any TV show. Nicholas Britell has made a masterful score which does not sound excessive at all. Much like in Mr Robot, the score amplifies the mood.If you're watching Succession, don't be thrown off by the first 2 episodes of the show (I actually like them). Give it time, because by the 6th episode you'll probably fall off your bed. And come season 2 (which I consider one of the greatest executions of anything in television history because it's flawless), you'll drop your jaw every 25-30 minutes of screentime, which is basically every halftime moment of an episode.Succession deserves every honor coming its way. HBO has landed another absolute winner in its roster, one that will likely age extremely well with a season or two and be compared to the other Golden Age dramas of this generation. Yes, by that, I mean shows like Mad Men, Breaking Bad, The Leftovers, and maybe, just maybe, The Wire and The Sopranos. Good call on ditching Westworld for marketing this, HBO. This is arguably going to be my favorite deconstruction of capitalism right now.I can't wait for season 3 at all. I'm just going to rewatch season 2 till then. All the white kids fight for a kiss from daddy, and that might not sell the show a lot. But the fight spins into so many nuances it's hard to look away and just dismiss them as that."
    },
    {
      "username": "robertemerald",
      "userUrl": "https://www.imdb.com/user/ur73668075",
      "reviewLink": "https://www.imdb.com/review/rw4731387",
      "warningSpoilers": false,
      "date": "19 March 2019",
      "rate": "8",
      "helpful": "74 out of 103 found this helpful.",
      "title": "Engaging tense high-stakes drama",
      "content": "You can't compare this show to Billions. All the characters on Billions are whip-smart. Here only the boss is that sort of smart, and he's often complicated by other issues. While the cat's away .... Not that the devilish characters here are stupid, but they are all definitely spoilt, and show it, which is awesome. One garners huge sympathy for the old man. On a technical level I wondered at the shaky camera and often used close ups. You have to get used to it (but you do, and from that point its smooth sailing). It's not nearly so pronounced as found-footage movies, but I did wonder at why they felt they needed to use such a method at all. That's where I docked the two stars. The soundtrack's left-motif is a delightful little piano tune. Of all HBO's recent experiments I thought this show finally found the traction they have been looking for. It's edgy and fast, full of surprises and interesting locations. The characters don't race toward obvious pitfalls, and the drama is, for all its pace, measured and all the more interesting when it arrives at the end of a sub-plot or at an unintended circumstance. This first series winds up with a neat bow, so it doesn't leave one unsatisfied. Indeed, I binged the whole 10 or so episodes easily over three nights, and really enjoyed every minute."
    },
    {
      "username": "maria-ricci-1983",
      "userUrl": "https://www.imdb.com/user/ur53556132",
      "reviewLink": "https://www.imdb.com/review/rw5171151",
      "warningSpoilers": false,
      "date": "8 October 2019",
      "rate": "10",
      "helpful": "99 out of 131 found this helpful.",
      "title": "EXTRA-ORDIN-ARY!! Masterclass of performative talent, direction, scriptwriting and... MUSIC!",
      "content": "Everything in this show is fantastic. Second season is even better than the first, if this could be possible.From the mesmerizing title score by Nicholas Brittell (Chopin of the 21st century) to the tremendous, really tremendous performance by Brian Cox (he deserves every award for his composition of Roy Logan). But then every character... I had never watched Jeremy Strong before, and I have to say his Kendall is, as another reviewer said here, tragically fascinating both with empathy and pity. Kudos! And Nicholas Braun as grandnephew Craig-Greg is a most welcome box of surprises (is he a naive fast-learner making his way through the game, or a machiavellic master chess player?) The casting people have made an impeccable, perfect choice for every character in the show.Very complex characters, intriguing plot even with the cards on the table, outstanding pace. Don't miss this show redolent of quality, skill, intelligence and theatrical tension. Some of the episodes have been remarkable jaw-droppers!"
    },
    {
      "username": "mosnowvt66",
      "userUrl": "https://www.imdb.com/user/ur17690942",
      "reviewLink": "https://www.imdb.com/review/rw4224024",
      "warningSpoilers": false,
      "date": "3 July 2018",
      "rate": "10",
      "helpful": "246 out of 291 found this helpful.",
      "title": "Watch for Greg and Tom, stay for Kendall",
      "content": "I didn't know what to expect from this show but I'm hooked. It's uncomfortable to watch and hilariously sad. Greg the outsider nephew is perfect and I do love Tom, Shiv and Roman but it's Kendall who is the tragically watchable."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw4291715",
      "warningSpoilers": true,
      "date": "18 August 2018",
      "rate": "10",
      "helpful": "127 out of 188 found this helpful.",
      "title": "Just when you think this show is about who can swear the most, up pops the shadow of Ted Kennedy's ghost!",
      "content": "I will say no more as to what the title of my review means. Watch yourself and find out. Let me just say that I watched the first episode and found the whole concept mediocre. A self made man and his sprawling media empire and his four spoiled kids who are each damaged in their own unique way. OK, I get it already, the Trumps are eeeeeeeevil!!! Either that or HBO had snatched the Stetsons off of the Ewing family, moved them from Dallas to NYC, and exchanged their oil for newsprint. Haven't I seen this before???But I was wrong. This first season is a ten episode masterpiece of well written television. And the season finale was as well done as any season finale I have ever seen with some great foreshadowing (what do some of those musical pieces playing in the background mean? I think they mean something as to the plot).Brian Cox plays the 80 year old patriarch of the family, Logan Roy. He is torn. Maybe he wants to move on and pass the reins to somebody else but likes the control, or maybe it is that only one of his children shows any interest in the business and that child, Kendall, is like a soft boiled egg - not sturdy at all and easily devoured.So the set-up is that Logan Roy, on his eightieth birthday, has a cardiac event and is raced to the hospital. He is in a coma and not expected to survive. The kids make arrangements to carry on without dad and Kendall thinks he is going to take dad's place. But dad wakes up. And so besides the themes of the corrupting effect of excessive wealth we have a theme pretty much unique to the 21st century. In the past our great leaders and monarchs just passed away quietly. What happens in an age when medicine can put quite elderly people back together - sort of? As in not their brains. So Logan does gradually recover, but his behavior is erratic, sometimes stuck in neutral, sometimes violent, sometimes showing a caveman like desire for dominance (at one point he urinates on the carpet in his son Kendall's office).I'll let you watch and hope you enjoy it as much as I did. And writers - put the brakes on the f word. There were some episodes that would have been twenty minutes shorter had you left it out entirely. There are other words in the English language you can use for emphasis."
    },
    {
      "username": "amrouten",
      "userUrl": "https://www.imdb.com/user/ur70508027",
      "reviewLink": "https://www.imdb.com/review/rw4224667",
      "warningSpoilers": false,
      "date": "3 July 2018",
      "rate": "10",
      "helpful": "371 out of 432 found this helpful.",
      "title": "Don't give up",
      "content": "As I binged watch this, I realized HBO packaged this as their answer to Billions. However, this show is not about the business of industry; it's about the business of family. The characters become more likeable as season progresses. This is a great show and I bet the final episode is going to be a jaw dropper."
    },
    {
      "username": "brett-76260",
      "userUrl": "https://www.imdb.com/user/ur71629917",
      "reviewLink": "https://www.imdb.com/review/rw6742415",
      "warningSpoilers": false,
      "date": "26 March 2021",
      "rate": "9",
      "helpful": "77 out of 114 found this helpful.",
      "title": "Holy crap what a show",
      "content": "This show delivers on absolutely every capacity. One of the best series I've watched in a very long time. It will suck you in from the first episode and won't disappoint. Such a good show and one not to miss."
    },
    {
      "username": "andrewroy-04316",
      "userUrl": "https://www.imdb.com/user/ur71021213",
      "reviewLink": "https://www.imdb.com/review/rw5984133",
      "warningSpoilers": false,
      "date": "12 August 2020",
      "rate": "10",
      "helpful": "75 out of 111 found this helpful.",
      "title": "Succession is a masterclass in screenwriting and ensemble acting, and doesn't have a single down episode",
      "content": "Succession deserves every bit of acclaim it gets, and I can't wait for it to roll through the Emmys next month. This is a character drama at its best: each character is intriguing, unique, and very well developed, and every episode we see the way each character's individual struggles and personal plans clash and affect each other and bigger events in fascinating and unexpected ways. This confluence of intricate character decisions and actions is what makes the show so true to its characters but also so unpredictable. It also is extremely effective in making many larger societal statements about class, inequality, abuse, power structures, and familial influences. The writing is I think the best I've ever seen in a show, and every single episode is fantastic and gripping. It doesn't take a while to get up to speed or rely on a gimmick to keep you invested - it is full bore, deep character drama from the start. The genuine way the characters are written also make the show's humor work fantastically. Greg is a great example of how great Succession is - clearly comic relief from the start (and he does a great job, he is hilarious) but they don't make him a caricature the way almost every movie or show I've seen do with his type of character, they develop him into a realistic and interesting character. The entire cast does an amazing job, but Jeremy Strong and Sarah Snook take the cake for me. Phenomenal show, S3 can't come soon enough."
    },
    {
      "username": "Broccolidwarf",
      "userUrl": "https://www.imdb.com/user/ur24232661",
      "reviewLink": "https://www.imdb.com/review/rw7574244",
      "warningSpoilers": false,
      "date": "22 November 2021",
      "rate": "7",
      "helpful": "90 out of 127 found this helpful.",
      "title": "It started out as a 10...",
      "content": "...in season 1,Stellar cast, top notch production quality, and a very interesting premise - kind of the Hollywood take on the Murdoch family.However, now in season 3, the fatal flaw of the show has become very apparent.It seems both writers and production are so hung up, on presenting \"fictional Murdoch and his family\" in such a bad light, that not a single character in the show has any redeeming qualities, whatsoever, nor is there any significant development of any of said characters... they have become perpetual caricatures.So by now the show is simply going nowhere... they are all still fighting over the same thing, and nobody learns anything nor changes, in any way shape or form.It renders the show entirely without purpose, except as a social commentary on the decadence of \"the very rich\"... and we all got that message in season 1, so perpetuating it is both uninteresting and lacking creativity.I had high hopes for this one, but have stopped watching it, simply because the story no longer has purpose."
    },
    {
      "username": "Otkon",
      "userUrl": "https://www.imdb.com/user/ur0955440",
      "reviewLink": "https://www.imdb.com/review/rw8027705",
      "warningSpoilers": false,
      "date": "2 April 2022",
      "rate": "5",
      "helpful": "73 out of 110 found this helpful.",
      "title": "As the seasons go on, a tiresome formula is appearing.",
      "content": "Other than Kendall, none of the characters have any sort of arc. And Ken just keeps going back and forth from obnoxious 80's corporate tool to washed-up 90's addict. But everyone else is just the same annoying money-grubbing rich jerk that you can't stand. Power hungry. Hoity-toity. Roman is just so one note. And the Gerri-atric obsession - yeah that was played out way too long. Shiv and Tom. And Greg. Get a new record. Then the whole season is back-stabbing back and forth until the shocking Et tu, Brute moment in the finale.I mean nothing is changing. Every loathsome one-dimensional person just plods along to the same tune. No one walks away from the intoxicatingly toxic environment of high-rolling for Daddy's love. And that makes all of them entirely worthless and pointless. Until they change for the better or disassociate themselves altogether, this show is stuck in a rut. That or some drastic stakes are up with dead darlings or assassinations or something.Otherwise, I am better off reading a synopsis of every season than sitting through it."
    },
    {
      "username": "DLochner",
      "userUrl": "https://www.imdb.com/user/ur12740916",
      "reviewLink": "https://www.imdb.com/review/rw6311043",
      "warningSpoilers": false,
      "date": "26 November 2020",
      "rate": "8",
      "helpful": "46 out of 68 found this helpful.",
      "title": "The Godfather in modern life",
      "content": "An incredibly mean, profound, and nerve-wracking family epic. Bryan Cox plays an outstanding role as a family father. Above all, the series requires patience and life experience to really enjoy all the meanness and entanglement within the family. A demanding series, for a demanding viewer."
    },
    {
      "username": "paul2001sw-1",
      "userUrl": "https://www.imdb.com/user/ur2082018",
      "reviewLink": "https://www.imdb.com/review/rw8612762",
      "warningSpoilers": false,
      "date": "15 October 2022",
      "rate": "9",
      "helpful": "35 out of 51 found this helpful.",
      "title": "Human monsters",
      "content": "These days, a lot of television dramas are strung out over multiple series, maxing out the content provided to the networks but their stories could have been told mor effectively in just one. But Jesse Armstrong's 'Succession', the story of a Murdochian press baron leaving his failsons (and one daughter) and various hangers-on to fight over the inheritence of his empire, really benefits from an extended format. At first glance, the characters are so cartoonshly evil, farcical and above all entitled that it takes time to see them as real, damaged human beings. But there's a subtlety to the writing and performance behind the grotesquery that comes out with increasing clarity in series two and especially three. It must have been fun to shoot this programme as it follows its anti-heroes through an endless sucession of gorgeous locations; but you wouldn't want to live their lives."
    },
    {
      "username": "alicepepperpot",
      "userUrl": "https://www.imdb.com/user/ur74918754",
      "reviewLink": "https://www.imdb.com/review/rw5081162",
      "warningSpoilers": false,
      "date": "25 August 2019",
      "rate": "8",
      "helpful": "111 out of 137 found this helpful.",
      "title": "Brian Cox can do no wrong..",
      "content": "I'm surprised there isn't more positive reviews.Its well written, nice amount of dark humour. The characters are mostly horrible people you'd never want to meet in your life.I love it."
    },
    {
      "username": "midnitepantera",
      "userUrl": "https://www.imdb.com/user/ur126619686",
      "reviewLink": "https://www.imdb.com/review/rw7206117",
      "warningSpoilers": false,
      "date": "8 August 2021",
      "rate": "9",
      "helpful": "52 out of 78 found this helpful.",
      "title": "Can't wait for the next season of this Family I Love to HaTE!! :o",
      "content": "Supposedly, loosely based on the Murdoch family. Jeez, what a HOT, EVIL Den of Vipers this family is. If this is what being super rich makes u act like, then that's a BiG pass from me. I don't know how these people sleep at night and they are so amoral and egotistical and honestly, they are NOT ALL THAT. Most of them are outright IDIOTS. But it is fun to Watch especially Roman, OmG he is such a trippy, vacuous little dude.Kendall is so spineless and I was mortified watching him RaPPIN, LOL it was hilarious and Sick and Not in a Good way.Tom has his nose shoved so far up that families arse, that he will never get the brown stains off if he lives to be 1,000.And Greg, is such a fortune chaser, and started out clueless, but he's got the full on corruption running thru his veins now and is learning to kick and claw.I initially liked Shiv, but she finally showed her true colors and watching her and Roman fighting like 2 kids is hilarious.Brian Cox is wonderful as Logan, and really pulls off the role of Lord of the Flies. What a Monster Logan is, and how he pits his kids against each other just for fun, cause he basically thinks their all idiots and won't give his empire to his female child, and they never learn that he's just dangling a gold carrot in their face knowing he will NEVER let them have it. :oUghhhh, I'm sorry, if I was born into this Hot Mess, I would leave as soon as I could and get as far away from them as possible. Such a bunch of Liars, Back stabbers, cheaters, losers, criminals, vultures who don't care about anything but themselves (what's the use of being together as a family when you have a Kane and Able relationship?_ GREED, I guess, just plain Greed. Sad, really and pathetic people. But it's like the old Freak Shows, you just can't turn away. Except most of the real life freaks were a lot better human beings than this family. It's a good binge if you haven't seen it yet. It feels like the whole family is a Spectre at the Feast!! Quite Twisted, but a fun watch! ;D."
    },
    {
      "username": "bshaef",
      "userUrl": "https://www.imdb.com/user/ur25217752",
      "reviewLink": "https://www.imdb.com/review/rw5922462",
      "warningSpoilers": false,
      "date": "21 July 2020",
      "rate": "9",
      "helpful": "57 out of 87 found this helpful.",
      "title": "An Utterly Awesome Series",
      "content": "The actors are without equals in their parts, Kieran Caulkin is a darn good cusser, and I could make my review totally about them but my real favorite is the story and all its peripherals. Want a helicopter, snap your fingers, bingo you have one. I'll never live like this so thank you who wrote all that rich stuff into the script. I really like this show, mainly because its completely original and you never know whats going to happen next. I hope the bro in law winds up big cheese but I predict bad things for him."
    },
    {
      "username": "Michael Fargo",
      "userUrl": "https://www.imdb.com/user/ur0590820",
      "reviewLink": "https://www.imdb.com/review/rw5096053",
      "warningSpoilers": false,
      "date": "2 September 2019",
      "rate": "10",
      "helpful": "42 out of 62 found this helpful.",
      "title": "A handsome, well-written skewering of the consequences of greed",
      "content": "Right now, this is my nominee for best new series. It's certainly cleverly written and gives us characters so self-absorbed and eager to please...well-eager to please their buttered side of the toast, i.e., Daddy.The assortment of personalities assembled at any given time is deliciously, wickedly triumphant. Dressed to the nines and living in surroundings just short of European royalty, the damage that each character is doing to themselves in an effort to harm others is a kind of guilty pleasure not usually offered on any major network. We usually see these types held up in admiration. Not so here. You wouldn't want to spend a second of time with any of these folks...other than to be a fly on the wall and see what degrading thing they're up to next.I was disappointed that one of the major character was so emasculated at the end of season 1, although perhaps by the end of season 2 he will have regrouped to wreck havoc on his family yet again. The poise of Sarah Snook's Siobhan as she sinks a dagger into the heart of anyone nearby is particularly admirable. And Kieran Culkin's Roman is the family clown that shows how pratfalls masks a very insecure, desperate character that probably everyone needs to look out for, is deserving of his being singled out for an acting award. Hiam Abbass as a kind of step mother Lady Macbeth holds her own in this nest of vipers, and anyone who is smart enough to cast J. Smith Cameron in anything, anytime, anywhere should get our thanks. (Ditto for giving us Jeannie Berlin.)But it's Brian Cox as Pater familias *in extremis\" who provides the glue that holds all of this craziness together that wins my praise. Alternately compelling, brilliant and truly terrifying, he proves we never get to see him enough in our entertainment.Long may this family live and demonstrate, \"It ain't so great to accumulate riches.\""
    },
    {
      "username": "Top_Dawg_Critic",
      "userUrl": "https://www.imdb.com/user/ur64798417",
      "reviewLink": "https://www.imdb.com/review/rw9107441",
      "warningSpoilers": true,
      "date": "8 June 2023",
      "rate": "5",
      "helpful": "24 out of 35 found this helpful.",
      "title": "The most overrated show in TV/streaming history.",
      "content": "It's bad enough I wasted my time watching this show for four seasons, but the series finale is what really angered me, as it was the most ridiculous, underwhelming and laziest writing I have ever seen. All four seasons combined would barely make an enjoyable two-hour film, never mind the useless ending, that well, wasn't even an ending.You have characters that started off interesting and engaging, but with the exception of Logan's character - which was played brilliantly by Cox, the rest became annoying and unrealistic very fast. There's no corporate world where Roman Roy would last as a low-level executive, let alone consideration for the top job, especially with his narcissistic and sadistic personality. Shiv's constant flip-flopping and bipolar character got tiring and annoying very fast, and would barely survive in a political environment let alone a corporate one. Ken was the only possibility to take the top job, but of course he had issues and couldn't decide if he could handle the heat and the power amidst his passive-aggressive behavior. But even with Ken as the most qualified, far be it for the writers to conclude the series that way. And there's no world - corporate or family, that would put up with Greg's annoying and infantile nerdy behavior. That kid, even to consider nepotism, would've been thrown in the basement mail room and forgotten.Creating a bunch of clown-like characters who are privileged deranged sociopaths and inserting them in a dysfunctional corporate and family dynamic may be entertaining in the short term, but the constant revolving door of repetitive sibling backstabbing got tiring in the first season, let alone repeating the cycle constantly in every other season and dragging out the same merry-go-round narrative.The first half of the first season was a great build-up to what could've been a very powerful and engaging series, but it fell flat with excessive repetitiveness, absurd dialogue being passed off as dark comedy, and plot holes galore within the lazy and underwhelming writing. The second season showed promise to begin with, but just ended up with the same repetitive nonsense narrative, which of Logan's kids should and would get the torch. Ken's power play move was the only defining suspense that was intriguing leading up to season three. But in season three, Ken's play was dismissed as a red herring to further an already exhausting narrative, and it was the same merry-go-round story and perceived passing of the torch, but in more scenic destinations, with the exact same usual suspects and agendas. The final season added another new (albeit refreshing) character with Alexander Skarsgard as Lukas Matsson, but that was just another red herring to stretch out the already exhausting narrative, plus they also threw in a boring political landscape just to stretch-out the rubber-band basic plot of this show to the max. This show should've just ended with Logan's death, and the reading of an actual will to his estate and named successor(s) to finally answer the four-season long awaited question, but HBO in typical fashion just kept milking a dry cow in what I feel is the most overrated show in TV/streaming history.When you can summarize each season in one sentence or less, the multitude of episodes are all just filler. Sure there are some taboo eccentrics and dialogue, but that's not enough to justify the ridiculous high praise this show received. It's boring and tedious seeing the same characters rotating at each others throats within the same narrative, then riddle it with plot holes and useless red herrings, change up the landscapes, and call it a season.Add to the pain that I had to put up with the amateur-hour constant annoying fast zoom-ins that are has-been camerawork from The Office era that became unbearable quickly. The only redeeming factors this show had was the incredible casting and performances (albeit mostly annoying and unbelievable characters), a great score, and some spot-on cinematography and beautiful landscapes. I'm glad this series is over, and regret ever watching it. It's a generous 5/10 for the entire series, only for the few redeeming qualities."
    },
    {
      "username": "katlynnhahn",
      "userUrl": "https://www.imdb.com/user/ur80012182",
      "reviewLink": "https://www.imdb.com/review/rw4285740",
      "warningSpoilers": false,
      "date": "15 August 2018",
      "rate": "10",
      "helpful": "105 out of 131 found this helpful.",
      "title": "Fantastic!",
      "content": "I could not stop watching this show and certainly hope there will be a season 2. The entire cast was fabulous but Matthew Macfadyen's character Tom was my favorite. Macfadyen had me laughing, cringing and cheering throughout the series. Can't wait to see what happens next!"
    }
  ],
  "errorMessage": ""
}