{
  "imDbId": "tt7660850",
  "title": "Succession",
  "fullTitle": "Succession (TV Series 2018–2023)",
  "type": "TVSeries",
  "year": "2018",
  "language": "en",
  "titleInLanguage": "Succession (TV series)",
  "url": "https://en.wikipedia.org/wiki/Succession_(TV_series)",
  "plotShort": {
    "plainText": "Succession is an American comedy-drama television series created by Jesse Armstrong that aired on HBO from June 3, 2018, to May 28, 2023. The series centers on the Roy family, the owners of global media and entertainment conglomerate Waystar RoyCo, and their fight for control of the company amidst uncertainty about the health of the family's patriarch.\r\nAmong the cast are Brian Cox as patriarch Logan Roy, Jeremy Strong as Kendall, Kieran Culkin as Roman, and Sarah Snook as Siobhan (\"Shiv\"), Logan's children employed by the company. Matthew Macfadyen stars as Tom Wambsgans, Shiv's husband and Waystar executive; Nicholas Braun as Greg Hirsch, Logan's grandnephew also employed by the company; Alan Ruck as Connor, Logan's eldest child; and Hiam Abbass as Marcia Roy, Logan's third and current wife. Peter Friedman, Natalie Gold, and Rob Yang also star, while Dagmara Domińczyk, Arian Moayed, J. Smith-Cameron, Justine Lupe, David Rasche, Fisher Stevens, and Alexander Skarsgård featured in recurring roles before being promoted to the main cast.\r\nSuccession received widespread critical acclaim across all four seasons for its writing, acting, musical score, directing, production values, and examination of its subject matter, with several critics labelling it as one of the best television series of all time. The series has received several awards and nominations, including the British Academy Television Award for Best International Programme and two wins for both the Golden Globe for Best Television Series – Drama and the Primetime Emmy for Outstanding Drama Series in 2020 and 2022.\r\nBoth Cox and Strong received the Golden Globe for Best Actor – Television Series Drama and Snook the Golden Globe for Best Supporting Actress – Series, Miniseries or Television Film, with Strong and Macfadyen receiving Primetime Emmy Awards for their performances – in addition to Armstrong's three wins for Outstanding Writing for a Drama Series.",
    "html": "<p>Succession is an American comedy-drama television series created by Jesse Armstrong that aired on HBO from June 3, 2018, to May 28, 2023. The series centers on the Roy family, the owners of global media and entertainment conglomerate Waystar RoyCo, and their fight for control of the company amidst uncertainty about the health of the family's patriarch.</p><p>Among the cast are Brian Cox as patriarch Logan Roy, Jeremy Strong as Kendall, Kieran Culkin as Roman, and Sarah Snook as Siobhan (\"Shiv\"), Logan's children employed by the company. Matthew Macfadyen stars as Tom Wambsgans, Shiv's husband and Waystar executive; Nicholas Braun as Greg Hirsch, Logan's grandnephew also employed by the company; Alan Ruck as Connor, Logan's eldest child; and Hiam Abbass as Marcia Roy, Logan's third and current wife. Peter Friedman, Natalie Gold, and Rob Yang also star, while Dagmara Domińczyk, Arian Moayed, J. Smith-Cameron, Justine Lupe, David Rasche, Fisher Stevens, and Alexander Skarsgård featured in recurring roles before being promoted to the main cast.</p><p>Succession received widespread critical acclaim across all four seasons for its writing, acting, musical score, directing, production values, and examination of its subject matter, with several critics labelling it as one of the best television series of all time. The series has received several awards and nominations, including the British Academy Television Award for Best International Programme and two wins for both the Golden Globe for Best Television Series – Drama and the Primetime Emmy for Outstanding Drama Series in 2020 and 2022.</p><p>Both Cox and Strong received the Golden Globe for Best Actor – Television Series Drama and Snook the Golden Globe for Best Supporting Actress – Series, Miniseries or Television Film, with Strong and Macfadyen receiving Primetime Emmy Awards for their performances – in addition to Armstrong's three wins for Outstanding Writing for a Drama Series.</p>"
  },
  "plotFull": {
    "plainText": "Succession is an American comedy-drama television series created by Jesse Armstrong that aired on HBO from June 3, 2018, to May 28, 2023. The series centers on the Roy family, the owners of global media and entertainment conglomerate Waystar RoyCo, and their fight for control of the company amidst uncertainty about the health of the family's patriarch.\r\nAmong the cast are Brian Cox as patriarch Logan Roy, Jeremy Strong as Kendall, Kieran Culkin as Roman, and Sarah Snook as Siobhan (\"Shiv\"), Logan's children employed by the company. Matthew Macfadyen stars as Tom Wambsgans, Shiv's husband and Waystar executive; Nicholas Braun as Greg Hirsch, Logan's grandnephew also employed by the company; Alan Ruck as Connor, Logan's eldest child; and Hiam Abbass as Marcia Roy, Logan's third and current wife. Peter Friedman, Natalie Gold, and Rob Yang also star, while Dagmara Domińczyk, Arian Moayed, J. Smith-Cameron, Justine Lupe, David Rasche, Fisher Stevens, and Alexander Skarsgård featured in recurring roles before being promoted to the main cast.\r\nSuccession received widespread critical acclaim across all four seasons for its writing, acting, musical score, directing, production values, and examination of its subject matter, with several critics labelling it as one of the best television series of all time. The series has received several awards and nominations, including the British Academy Television Award for Best International Programme and two wins for both the Golden Globe for Best Television Series – Drama and the Primetime Emmy for Outstanding Drama Series in 2020 and 2022.\r\nBoth Cox and Strong received the Golden Globe for Best Actor – Television Series Drama and Snook the Golden Globe for Best Supporting Actress – Series, Miniseries or Television Film, with Strong and Macfadyen receiving Primetime Emmy Awards for their performances – in addition to Armstrong's three wins for Outstanding Writing for a Drama Series.\r\nPremise\r\nSuccession follows the Roy family, who are the owners of the New York City-based global media conglomerate Waystar RoyCo. The family patriarch, Logan Roy, has experienced a decline in health. His four children—estranged oldest son Connor (Ruck), power-hungry Kendall (Strong), irreverent Roman (Culkin), and politically savvy Shiv (Snook)—who all have varying degrees of connection to the company begin to prepare for a future without their father and vie for prominence within the company.\r\nCast and characters\r\nHiam Abbass as Marcia Roy (seasons 1–2 and 4; recurring season 3): Logan Roy's third and current wife. Born and raised in Beirut, she is often at odds with Logan's mistrustful children. She has a son, Amir, from her first marriage and a daughter from a previous relationship.\r\nNicholas Braun as Greg Hirsch: the bumbling yet opportunistic grandson of Logan's brother Ewan. Greg is unfamiliar with the rough terrain he must navigate to win Logan over, and finds himself indentured to Tom Wambsgans in his quest for a place at Waystar and with the family.\r\nBrian Cox as Logan Roy: the Dundee-born billionaire founder of media and entertainment conglomerate Waystar RoyCo. He is a brash leader whose primary focus is his company, rather than his four children: Connor, from his first marriage, and Kendall, Roman and Siobhan, from his second marriage. He is married to Marcia, his third wife.\r\nKieran Culkin as Roman Roy: half-brother to Connor and the middle child from Logan's second marriage. Roman is immature, does not take responsibilities seriously and often finds himself lacking the common sense his father requires of him. This is likely because, as evidenced in many episodes, his father's abuse targeted him. He is frequently at odds with his older brother Kendall and sometimes his sister Shiv, with whom he often vies for power and their father's attention.\r\nPeter Friedman as Frank Vernon: COO and later vice-chairman of Waystar RoyCo, and longtime confidant of Logan. Frank is a member of Logan's old guard, on whom Kendall frequently relies to help win back Logan's favor. He is Kendall's mentor and godfather, and is disliked by Roman.\r\nNatalie Gold as Rava Roy (season 1; recurring seasons 3–4): Kendall's former wife and mother of his two children.\r\nMatthew Macfadyen as Tom Wambsgans: Shiv's fiancé and then her husband. Tom is a Waystar executive who is promoted from head of the amusement park and cruise division to running ATN, the company's global news outlet. He enjoys his proximity to the Roy family's power, but is frequently dismissed by the family's inner circle. He ingratiates himself with those more powerful than he, but torments his hapless subordinate Greg.\r\nAlan Ruck as Connor Roy: the only child from Logan's first marriage. Mostly removed from corporate affairs, he defers to his half-siblings on most firm-related matters and resides at a ranch in New Mexico with his younger girlfriend Willa. He is prone to delusions of grandeur and \"had an interest in politics from a young age.\" Similar to his half-siblings, Connor does not have the best recollections of his childhood, as he mentioned that he went three years without seeing Logan when he was a child.\r\nSarah Snook as Siobhan \"Shiv\" Roy: Logan's youngest child and only daughter. A left-leaning political fixer, she worked for a time for presidential candidate Gil Eavis, whose political views clash with Waystar. She eventually leaves politics to focus on building a future at Waystar. She is engaged to and then marries Tom, but their relationship is undermined by Shiv's infidelity.\r\nJeremy Strong as Kendall Roy: half-brother to Connor and the eldest child from Logan's second marriage. As Logan's heir apparent, Kendall struggles to prove his worth to his father after battling substance abuse and bungling major deals. He toils to maintain a relationship with his siblings, ex-wife Rava, and their children.\r\nRob Yang as Lawrence Yee (seasons 1–2): the founder of media website Vaulter that is acquired by Waystar RoyCo. He holds great contempt for Waystar and particularly Kendall, with whom he is often at odds.\r\nDagmara Domińczyk as Karolina Novotney (seasons 2–4; recurring season 1): the head of public relations for Waystar RoyCo and a member of the company's legal team.\r\nArian Moayed as Stewy Hosseini (seasons 2 and 4; recurring seasons 1 and 3): Kendall's friend from the Buckley School and Harvard who is now a private-equity investor with a seat on Waystar's board. He is covertly in partnership with Logan's rival Sandy Furness.\r\nJ. Smith-Cameron as Gerri Kellman (seasons 2–4; recurring season 1): the general counsel to Waystar RoyCo, who is also godmother to Shiv. She becomes a mentor figure to Roman, with whom she also shares a secret sexual connection.\r\nJustine Lupe as Willa Ferreyra (seasons 3–4; recurring seasons 1–2): Connor's younger girlfriend, and later wife, who is a former call girl and an aspiring playwright.\r\nDavid Rasche as Karl Muller (seasons 3–4; recurring seasons 1–2): Waystar RoyCo's CFO and member of the company's legal team.\r\nFisher Stevens as Hugo Baker (seasons 3–4; recurring season 2): a senior communications executive for Parks and Cruises in charge of managing a scandal involving Brightstar cruise lines.\r\nAlexander Skarsgård as Lukas Matsson (season 4; recurring season 3): the CEO of streaming media giant GoJo who is looking to buy Waystar RoyCo.\r\nEpisodes\r\nSeason 1 (2018)\r\nSeason 2 (2019)\r\nSeason 3 (2021)\r\nSeason 4 (2023)\r\nProduction\r\nDevelopment\r\nShowrunner Jesse Armstrong initially conceived the series as a feature film about the Murdoch family, but the script never went into production. Armstrong eventually expanded the scope of the story to include the larger landscape of Wall Street, which he felt better suited a television format. Armstrong wrote a new script centered on original characters loosely inspired by various powerful media families such as the Murdochs, the Redstones, the Maxwells, and the Sulzbergers. On June 6, 2016, it was announced that HBO had given the production a pilot order. The episode was written by Armstrong and directed by Adam McKay. Executive producers for the pilot include Armstrong, McKay, Will Ferrell, Frank Rich, and Kevin Messick. On May 16, 2017, it was announced that HBO had given the production a series order for a first season consisting of ten episodes. The previously announced creative team continued their involvement as the series entered into production.\r\nOn November 17, 2017, it was reported that Nicholas Britell would serve as the series' composer. On April 26, 2018, it was announced that the series would premiere on June 3, 2018. On June 11, 2018, HBO renewed the series for a second season. On May 23, 2019, it was announced that the second season would premiere on August 11, 2019. On August 20, 2019, HBO renewed the series for a third season. On March 28, 2020, HBO announced the third season's production was delayed due to the COVID-19 pandemic. The third season premiered on October 17, 2021. In June 2021, executive producer Georgia Pritchett commented that the series would not go beyond five seasons, and possibly would end after season four. On October 26, 2021, HBO renewed the series for a fourth season which premiered on March 26, 2023. In an interview with The New Yorker in February 2023, Armstrong confirmed that the series would conclude with the fourth season. He stated that while the season was not initially pitched as the series' last, \"the decision to end solidified through the writing and even when we started filming: I said to the cast, 'I'm not a hundred percent sure, but I think this is it.'\"\r\nCasting\r\nOn October 6, 2016, it was announced that Brian Cox, Jeremy Strong, Kieran Culkin, Sarah Snook, Nicholas Braun, and Matthew Macfadyen had been cast in lead roles in the series' pilot. On November 4, 2016, it was announced that Hiam Abbass, Alan Ruck, Rob Yang, Parker Sawyers, and Peter Friedman had also joined the main cast of the pilot. On January 24, 2018, it was reported that Ashley Zukerman had joined the series in a recurring role. On May 21, 2019, Holly Hunter joined the cast in a recurring role in the second season.\r\nIn January 2021, it was announced Sanaa Lathan, Linda Emond and Jihae had joined the cast of the series in recurring roles in the third season. In February 2021, it was reported that Hope Davis was cast in a recurring role in the third season. In March, Dasha Nekrasova was reported to have a recurring role in the third season. In May 2021, Alexander Skarsgård was cast in a recurring role while Adrien Brody was cast to guest star for the third season. In August 2021, it was announced Ella Rumpf would guest star in the third season. In January 2023, it was announced that Adam Godley, Annabeth Gish, Eili Harboe and Jóhannes Haukur Jóhannesson were cast in the fourth season.\r\nFilming\r\nThe series is primarily filmed in Manhattan, and shot on 35 mm film. The series is distinct for its predominantly handheld cinematography, which was inspired by the Dogme 95 movement and intended to embody the style of mockumentaries. Cinematographer Patrick Capone characterized the series' camerawork as \"voyeuristic\" and \"non-cinema\", relying on natural light, close coverage and frequent zooms to evoke the feeling of \"eavesdropping\" upon the characters and their environments.\r\nDirector Adam McKay filmed the pilot in late 2016, while principal photography for the rest of the first season of the series began in October 2017. Key locations included the American Irish Historical Society on Fifth Avenue as the location for Logan's apartment, 714 Broadway as the location of Shiv's season 1 apartment, and the Downtown Manhattan Heliport on the East River for scenes of the Roys departing on their helicopters. For scenes depicting the interiors of the Waystar RoyCo offices, the crew uses towers 4 and 7 of the World Trade Center, while 28 Liberty Street is used for exterior shots. Silvercup Studios in Queens houses many of the sets used for the series.\r\nOther filming locations for the first season included Bellevue Hospital (where the second episode took place), the Cunard Building on 25 Broadway (which houses Cipriani S.A., the venue for a gala in the fourth episode), the East New York Freight Tunnel (the entrance of a bachelor party in the eighth episode), and the Financial District of Lower Manhattan. From mid-to-end of January 2018, the production moved from New York to New Mexico for the episode \"Austerlitz\", which was primarily filmed in Santa Fe. On February 22, 2018, filming took place in New Jersey, which required the closing of the Atlantic City-Brigantine tunnel. On February 25, 2018, filming took place at Eastnor Castle near Ledbury in Herefordshire, England, which served as the setting for the last two episodes of the season.\r\nThe second season saw a significant increase in location shifts. The opening scenes of the season premiere were shot on location in Iceland, while Henry Ford II's 1960 estate in the Hamptons was used as the Roys' summer home. Oheka Castle in Huntington, New York, stood in for the Roys' hunting lodge in Hungary for the episode \"Hunting\". Filming also took place in Long Island, with a mansion once belonging to Junius Spencer Morgan featuring prominently in the episode \"Tern Haven\". The estate is one of several in the area used as filming locations for the second season. From April through May 2019, the production recruited extras for filming in Lake Placid, and Lake George, New York, where the episode \"Argestes\" was shot. Production moved to Dundee for the eighth episode, with additional filming taking place in Glasgow and Ayr for the preceding episode (which takes place in England). Starting from July 17, 2019, the crew filmed in Korčula, Croatia, for the second-season finale episode \"This Is Not for Tears\", including extensive scenes on a yacht.\r\nFilming for season 3, which was slated to begin in April 2020, was postponed due to the COVID-19 pandemic. In early November 2020, star Alan Ruck announced that filming would begin in mid-November in New York City. The season had begun filming in New York as of December 2020. Filming locations in the city included the Woolworth Building in Tribeca, The Shed in Hudson Yards, and a number of hotels including the Marriott Marquis in Times Square and the Plaza Hotel on Fifth Avenue. Production also returned to the Hamptons, at locations including Montauk and Wainscott. In May, additional filming for season 3 took place in Richmond, Virginia, primarily at the Jefferson Hotel. In June, production on the third season moved to Italy for the final two episodes, with filming primarily taking place in the Val d'Orcia region of Tuscany – where a wedding reception was filmed at the estates La Foce and Villa Cetinale. Additional filming took place in other nearby comuni in the province of Siena – including Pienza, Montalcino and Chianciano Terme – as well as in Cortona, Lake Como, Milan, and Florence (the lattermost of which was used for establishing shots in the opening episodes).\r\nProduction on the 10-episode fourth season began in New York City on June 27, 2022, with Mark Mylod directing the first episode. In October 2022, it was confirmed that filming occurred in western Norway, including locations such as the Atlantic Ocean Road, Romsdalen Gondola, Eggen Restaurant, and Juvet Landscape Hotel, as part of a storyline involving Skarsgård's character. The series also filmed in Los Angeles and Barbados for the fourth season.\r\nMusic\r\nThe music for Succession is composed by Nicholas Britell. The score is considered as a combination of \"hip hop and classical music\" and along with the main title theme, it received critical acclaim and several accolades.\r\nRelease\r\nOn April 27, 2018, the series held its official world premiere during the Series Mania Festival in Lille, France, in which the pilot episode was screened. On May 22, 2018, the series held its official US premiere at the Time Warner Center in New York City. All four seasons aired on Sky Atlantic in the UK.\r\nHBO released the first season on DVD on August 6, 2018, which included special features; a Blu-ray release was made available on November 6 of the same year. Subsequent seasons have been released on DVD-only; season 2 was released on September 15, 2020, and season 3 was released on May 17, 2022.\r\nReception\r\nCritical response\r\nThe series has received an average score of 95% on Rotten Tomatoes and a score of 85 on Metacritic. In 2021, BBC Culture polled 206 \"critics, journalists, academics and industry figures\" from around the world to compile the 100 greatest television series of the 21st century; Succession came in at number 10. In 2022, Rolling Stone ranked the show number 11 on its list of the 100 greatest TV shows. The series has often drawn parallels to the works of William Shakespeare.\r\nThe first season was met with positive reviews from critics. On the review aggregation website Rotten Tomatoes, the season holds an approval rating of 89% with an average rating of 7.9 out of 10, based on 88 reviews. The website's critical consensus reads, \"Peppering its pathos with acid wit, Succession is a divine comedy of absolute power and dysfunction – brought to vivid life by a ferocious ensemble.\" Metacritic, which uses a weighted average, assigned the season a score of 70 out of 100 based on 29 critics, indicating \"generally favorable reviews\".\r\nThe second season received widespread critical acclaim. On Rotten Tomatoes, the season holds a 97% rating with an average rating of 8.9 out of 10, based on 238 reviews. The website's critical consensus reads, \"Succession returns in darkly funny form, with sharp writing, exceptional performances, and a surprising new level of sympathy for some of television's least likable characters.\" On Metacritic, the season has a weighted average score of 89 out of 100, based on 19 critics, indicating \"universal acclaim\".\r\nThe third season received critical acclaim. On Rotten Tomatoes, the season holds a 97% approval rating with an average rating of 9.3 out of 10, based on 145 reviews. The website's critical consensus reads, \"Fans already buying what Succession is selling will be pleasantly surprised to find its third season in crackling form – even if it gets a little too real from time to time.\" On Metacritic, the season has a weighted average score of 92 out of 100, based on 31 critics, indicating \"universal acclaim\".\r\nThe fourth and final season has been met with widespread critical acclaim. On Rotten Tomatoes, the season holds an approval rating of 97% with an average rating of 9.2 out of 10, based on 316 reviews. The website's critical consensus reads, \"As compulsively watchable as ever, Succession's final season concludes the saga of the backbiting Roy family on a typically brilliant – and colorfully profane – high note.\" On Metacritic, the season has received a weighted average score of 92 out of 100, based on 31 critics, indicating \"universal acclaim\".\r\nReaction from Murdoch family\r\nExecutive producer Frank Rich told Town & Country in 2019 that he heard from Murdoch insiders that members of the family found the show to be \"interesting\" and even \"amusing\". Rupert Murdoch himself responded to an e-mail sent by a Semafor reporter that he had never seen the show. Furthermore, Vanity Fair reported that as part of the settlement for her divorce from Murdoch, Jerry Hall was barred from contacting Succession producers with ideas for storylines.\r\nRatings\r\nThe series premiere episode drew 582,000 live viewers, down from the 1.39 million viewers that watched its lead-in, Westworld. The season 2 finale drew 1.1 million viewers across all viewing platforms. Season 3 premiered to 1.4 million viewers across various platforms and ended with 1.7 million viewers across all viewing platforms, a record high for the show. The series finale drew 2.9 million viewers, making it the highest watched episode of the show. This was a 68% increase from the 1.7 million viewers for the season three finale.\r\nAccolades\r\nSuccession has received numerous awards and nominations from various television award ceremonies. It has received 48 Primetime Emmy Award nominations with 13 wins. Its first season received five nominations at the 71st Primetime Emmy Awards, including Outstanding Drama Series, and Jesse Armstrong won for Outstanding Writing for a Drama Series for the episode \"Nobody Is Ever Missing\".\r\nIts second season received 18 nominations with 7 wins at the 72nd Primetime Emmy Awards; including Outstanding Drama Series, Jeremy Strong for Outstanding Lead Actor in a Drama Series, Cherry Jones for Outstanding Guest Actress in a Drama Series, and for Outstanding Writing and Directing. Brian Cox, Matthew Macfadyen, Kieran Culkin, Nicholas Braun, Sarah Snook, James Cromwell, and Harriet Walter all received acting nominations.\r\nIts third season received a leading 25 nominations with 4 wins at the 74th Primetime Emmy Awards; including Outstanding Drama Series, Macfadyen for Outstanding Supporting Actor in a Drama Series, and Armstrong for Outstanding Writing for a Drama Series. Cox, Strong, Culkin, Braun, Snook, Cromwell, and Walter all received repeat nominations, while J. Smith-Cameron, Adrien Brody, Arian Moayed, Alexander Skarsgård, Hope Davis, and Sanaa Lathan all received acting nominations as well. The series also received three nominations for Outstanding Directing for a Drama Series.\r\nPodcast\r\nIn July 2020, HBO launched a companion podcast, \"HBO's Succession Podcast\". The first season featured British-American broadcaster, podcaster, and filmmaker Roger Bennett interviewing members of the cast over eight episodes. The second season featured American journalist Kara Swisher discussing with guests how season three plot points tied to real world events. A third season of the podcast continued the same format to examine the fourth and final season of the series, with Swisher reprising hosting duties.",
    "html": "<p>Succession is an American comedy-drama television series created by Jesse Armstrong that aired on HBO from June 3, 2018, to May 28, 2023. The series centers on the Roy family, the owners of global media and entertainment conglomerate Waystar RoyCo, and their fight for control of the company amidst uncertainty about the health of the family's patriarch.</p><p>Among the cast are Brian Cox as patriarch Logan Roy, Jeremy Strong as Kendall, Kieran Culkin as Roman, and Sarah Snook as Siobhan (\"Shiv\"), Logan's children employed by the company. Matthew Macfadyen stars as Tom Wambsgans, Shiv's husband and Waystar executive; Nicholas Braun as Greg Hirsch, Logan's grandnephew also employed by the company; Alan Ruck as Connor, Logan's eldest child; and Hiam Abbass as Marcia Roy, Logan's third and current wife. Peter Friedman, Natalie Gold, and Rob Yang also star, while Dagmara Domińczyk, Arian Moayed, J. Smith-Cameron, Justine Lupe, David Rasche, Fisher Stevens, and Alexander Skarsgård featured in recurring roles before being promoted to the main cast.</p><p>Succession received widespread critical acclaim across all four seasons for its writing, acting, musical score, directing, production values, and examination of its subject matter, with several critics labelling it as one of the best television series of all time. The series has received several awards and nominations, including the British Academy Television Award for Best International Programme and two wins for both the Golden Globe for Best Television Series – Drama and the Primetime Emmy for Outstanding Drama Series in 2020 and 2022.</p><p>Both Cox and Strong received the Golden Globe for Best Actor – Television Series Drama and Snook the Golden Globe for Best Supporting Actress – Series, Miniseries or Television Film, with Strong and Macfadyen receiving Primetime Emmy Awards for their performances – in addition to Armstrong's three wins for Outstanding Writing for a Drama Series.</p><br/><h3>Premise</h3><p>Succession follows the Roy family, who are the owners of the New York City-based global media conglomerate Waystar RoyCo. The family patriarch, Logan Roy, has experienced a decline in health. His four children—estranged oldest son Connor (Ruck), power-hungry Kendall (Strong), irreverent Roman (Culkin), and politically savvy Shiv (Snook)—who all have varying degrees of connection to the company begin to prepare for a future without their father and vie for prominence within the company.</p><br/><h3>Cast and characters</h3><ul><li>Hiam Abbass as Marcia Roy (seasons 1–2 and 4; recurring season 3): Logan Roy's third and current wife. Born and raised in Beirut, she is often at odds with Logan's mistrustful children. She has a son, Amir, from her first marriage and a daughter from a previous relationship.</li><li>Nicholas Braun as Greg Hirsch: the bumbling yet opportunistic grandson of Logan's brother Ewan. Greg is unfamiliar with the rough terrain he must navigate to win Logan over, and finds himself indentured to Tom Wambsgans in his quest for a place at Waystar and with the family.</li><li>Brian Cox as Logan Roy: the Dundee-born billionaire founder of media and entertainment conglomerate Waystar RoyCo. He is a brash leader whose primary focus is his company, rather than his four children: Connor, from his first marriage, and Kendall, Roman and Siobhan, from his second marriage. He is married to Marcia, his third wife.</li><li>Kieran Culkin as Roman Roy: half-brother to Connor and the middle child from Logan's second marriage. Roman is immature, does not take responsibilities seriously and often finds himself lacking the common sense his father requires of him. This is likely because, as evidenced in many episodes, his father's abuse targeted him. He is frequently at odds with his older brother Kendall and sometimes his sister Shiv, with whom he often vies for power and their father's attention.</li><li>Peter Friedman as Frank Vernon: COO and later vice-chairman of Waystar RoyCo, and longtime confidant of Logan. Frank is a member of Logan's old guard, on whom Kendall frequently relies to help win back Logan's favor. He is Kendall's mentor and godfather, and is disliked by Roman.</li><li>Natalie Gold as Rava Roy (season 1; recurring seasons 3–4): Kendall's former wife and mother of his two children.</li><li>Matthew Macfadyen as Tom Wambsgans: Shiv's fiancé and then her husband. Tom is a Waystar executive who is promoted from head of the amusement park and cruise division to running ATN, the company's global news outlet. He enjoys his proximity to the Roy family's power, but is frequently dismissed by the family's inner circle. He ingratiates himself with those more powerful than he, but torments his hapless subordinate Greg.</li><li>Alan Ruck as Connor Roy: the only child from Logan's first marriage. Mostly removed from corporate affairs, he defers to his half-siblings on most firm-related matters and resides at a ranch in New Mexico with his younger girlfriend Willa. He is prone to delusions of grandeur and \"had an interest in politics from a young age.\" Similar to his half-siblings, Connor does not have the best recollections of his childhood, as he mentioned that he went three years without seeing Logan when he was a child.</li><li>Sarah Snook as Siobhan \"Shiv\" Roy: Logan's youngest child and only daughter. A left-leaning political fixer, she worked for a time for presidential candidate Gil Eavis, whose political views clash with Waystar. She eventually leaves politics to focus on building a future at Waystar. She is engaged to and then marries Tom, but their relationship is undermined by Shiv's infidelity.</li><li>Jeremy Strong as Kendall Roy: half-brother to Connor and the eldest child from Logan's second marriage. As Logan's heir apparent, Kendall struggles to prove his worth to his father after battling substance abuse and bungling major deals. He toils to maintain a relationship with his siblings, ex-wife Rava, and their children.</li><li>Rob Yang as Lawrence Yee (seasons 1–2): the founder of media website Vaulter that is acquired by Waystar RoyCo. He holds great contempt for Waystar and particularly Kendall, with whom he is often at odds.</li><li>Dagmara Domińczyk as Karolina Novotney (seasons 2–4; recurring season 1): the head of public relations for Waystar RoyCo and a member of the company's legal team.</li><li>Arian Moayed as Stewy Hosseini (seasons 2 and 4; recurring seasons 1 and 3): Kendall's friend from the Buckley School and Harvard who is now a private-equity investor with a seat on Waystar's board. He is covertly in partnership with Logan's rival Sandy Furness.</li><li>J. Smith-Cameron as Gerri Kellman (seasons 2–4; recurring season 1): the general counsel to Waystar RoyCo, who is also godmother to Shiv. She becomes a mentor figure to Roman, with whom she also shares a secret sexual connection.</li><li>Justine Lupe as Willa Ferreyra (seasons 3–4; recurring seasons 1–2): Connor's younger girlfriend, and later wife, who is a former call girl and an aspiring playwright.</li><li>David Rasche as Karl Muller (seasons 3–4; recurring seasons 1–2): Waystar RoyCo's CFO and member of the company's legal team.</li><li>Fisher Stevens as Hugo Baker (seasons 3–4; recurring season 2): a senior communications executive for Parks and Cruises in charge of managing a scandal involving Brightstar cruise lines.</li><li>Alexander Skarsgård as Lukas Matsson (season 4; recurring season 3): the CEO of streaming media giant GoJo who is looking to buy Waystar RoyCo.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th><th scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\">Average viewership<br>(in millions)</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 3, 2018</td><td style=\"padding:0 8px\">August 5, 2018</td><td>0.603</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">August 11, 2019</td><td style=\"padding:0 8px\">October 13, 2019</td><td>0.597</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">9</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 17, 2021</td><td style=\"padding:0 8px\">December 12, 2021</td><td>0.553</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 26, 2023</td><td style=\"padding:0 8px\">May 28, 2023</td><td>0.705</td></tr></tbody></table><h4>Season 1 (2018)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#4B322D;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#4B322D;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#4B322D\">Title</th><th scope=\"col\" style=\"background:#4B322D\">Directed by</th><th scope=\"col\" style=\"background:#4B322D\">Written by</th><th scope=\"col\" style=\"background:#4B322D\">Original air date</th><th scope=\"col\" style=\"background:#4B322D;width:10%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Celebration</span>\"</td><td style=\"text-align:center\"><span>Adam McKay</span></td><td style=\"text-align:center\"><span>Jesse Armstrong</span></td><td style=\"text-align:center\">June 3, 2018</td><td style=\"text-align:center\">0.582</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4B322D\">The Roy family prepare to celebrate the 80th birthday of Logan Roy, CEO of the family-owned <span>media conglomerate</span> Waystar RoyCo. Logan's second-oldest son Kendall believes he is the company heir following his father's retirement, but Logan announces that he will not be stepping down as CEO. He presents his children with papers giving his third wife, Marcia, two votes on the <span>trust</span> to decide his successor upon his death. During the family's traditional softball game, Logan fires his longtime <span>COO</span> Frank Vernon, and agrees to give a new position to his estranged great-nephew Greg Hirsch, who was fired from his job at one of Waystar's parks. Kendall leaves the game to secure Waystar's acquisition of the media startup Vaulter. On the helicopter ride back to New York City, Logan and his children Roman, Shiv, and Connor argue over the terms of the agreement, but Logan suddenly collapses from a <span class=\"mw-redirect\">hemorrhagic stroke</span> and is rushed to the hospital. Kendall receives word of Logan's stroke from Lawrence Yee, Vaulter's CEO and Kendall's rival, immediately after securing the acquisition deal, and rushes to the hospital.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Shit Show at the Fuck Factory\"</td><td style=\"text-align:center\"><span>Mark Mylod</span></td><td style=\"text-align:center\"><span>Tony Roche</span></td><td style=\"text-align:center\">June 10, 2018</td><td style=\"text-align:center\">0.491</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4B322D\">The Roy children are in disagreement over who should take control of Waystar in the wake of Logan's incapacitation: Roman and Connor want to sign the papers out of respect for their father's wishes, whereas Kendall believes he should become CEO, and Shiv is opposed based on doubts about Marcia's role in the company. Marcia sends Greg to retrieve Logan's items from his apartment. Roman asks Greg to bring the trust change papers, but Shiv instructs the opposite; Greg ultimately decides not to bring the papers. Shiv's boyfriend Tom Wambsgans proposes to her at the hospital, and she accepts. It is eventually agreed that Kendall should become acting CEO of Waystar with Roman as COO. Waystar's <span>general counsel</span>, Gerri Kellman, informs Kendall that Logan is $3 billion in debt due to his expansion into parks. Logan wakes up in his hospital bed.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Lifeboats\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\"><span>Jonathan Glatzer</span></td><td style=\"text-align:center\">June 17, 2018</td><td style=\"text-align:center\">0.605</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4B322D\">Kendall learns that one of the creditors to Waystar's family holding company is entitled to demand full repayment for Logan's $3 billion debt if Waystar's stock falls below $130 per share. After a failed attempt to negotiate with the bank, Kendall enlists the aid of Stewy Hosseini, his friend from college who is now a <span>private equity</span> investor. Stewy agrees to inject $4 billion into Waystar in return for stock and a seat on the company's board. However, Greg later spots Stewy meeting with Sandy Furness, Logan's enemy who wants to take control of Waystar. Kendall is also trying to repair his marriage with his estranged wife Rava, but after a night together, she confirms she has already hired a divorce lawyer. Shiv asks Nate Sofrelli, a fellow political fixer and former boyfriend, to run a background check on Marcia. Kendall visits a recovering Logan to inform him that Waystar's stock has fallen below $130, but that his efforts have staved off a greater financial decline. Logan nonetheless disapproves.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Sad Sack Wasp Trap\"</td><td style=\"text-align:center\"><span>Adam Arkin</span></td><td style=\"text-align:center\"><span>Anna Jordan</span></td><td style=\"text-align:center\">June 24, 2018</td><td style=\"text-align:center\">0.543</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4B322D\">The Roys prepare for the company's annual foundation gala. Frank is rehired to mentor Roman in his position as COO. Upon starting his new role as the head of the Waystar's Parks and Cruises division, Tom is given secret documents confirming a massive cover-up of crimes committed on the company's cruises, including sexual assault and potential murder. Panicked, he confides this information to Greg. At the charity gala, Connor notices changes in the transcript of Kendall's speech, leading him to mistakenly believe that Kendall plans to announce Logan's retirement. He tells Logan, who opts to make a speech in Kendall's place announcing that he is returning to his role as CEO. Tom plans to go public about the cruises scandal, but Gerri advises against it during the gala. Tom angrily accuses Greg of snitching to Gerri about the scandal, which Greg denies. However, Gerri later thanks Greg in private, confirming that he did disclose the information to her.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"I Went to Market\"</td><td style=\"text-align:center\">Adam Arkin</td><td style=\"text-align:center\"><span>Georgia Pritchett</span></td><td style=\"text-align:center\">July 1, 2018</td><td style=\"text-align:center\">0.583</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4B322D\">Marcia invites Logan's estranged brother Ewan to Thanksgiving, and Greg travels to Canada to pick Ewan up. Logan wants to aggressively acquire more local news stations for Waystar, against the advice of his children and counsel. Kendall plots to hold a <span>vote of no confidence</span> against his father amidst his erratic behavior. Tom sends Greg to shred company documents pertaining to the cruises scandal, but Greg secretly makes copies. During dinner, an argument erupts between Logan and Ewan over the company and family's values, and Ewan storms out, warning Greg not to trust the Roys. As he leaves, Kendall suggests the possibility of a company takeover to Ewan – who is on Waystar's board – but Ewan refuses to conspire against his own brother. The dinner falls apart after Logan strikes Kendall's son Iverson during a game. Logan's behavior convinces Gerri to support Kendall in his vote of no confidence.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Which Side Are You On?</span>\"</td><td style=\"text-align:center\"><span>Andrij Parekh</span></td><td style=\"text-align:center\">Susan Soon He Stanton</td><td style=\"text-align:center\">July 8, 2018</td><td style=\"text-align:center\">0.673</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4B322D\">Kendall, Roman, Frank and Gerri work together to amass a majority vote in favor of removing Logan from his position as CEO. Roman is able to sway Lawrence to their side. Logan travels to <span>Washington, D.C.</span> for a meeting with the President, but the meeting is cancelled last-minute amid concerns regarding a terror threat. Greg is advised by Ewan to stay out of the no-confidence vote, but Greg later discloses his knowledge of the vote to Tom. On the day of the vote, Kendall flies to <span>Long Island</span> to visit an ailing board member at her home to convince her to vote with him, but is unable to take a helicopter back to Manhattan due to a lockdown over the terror threat. He is thereby delayed in his arrival to the vote while stuck in traffic, and Frank begins the vote without him. However, a furious Logan refuses to leave the room during the vote and instead berates several board members (including Roman) to side with him, and fires everyone who voted against him, including Kendall and Frank.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Austerlitz</span>\"</td><td style=\"text-align:center\"><span>Miguel Arteta</span></td><td style=\"text-align:center\"><span>Lucy Prebble</span></td><td style=\"text-align:center\">July 15, 2018</td><td style=\"text-align:center\">0.626</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4B322D\">Kendall has cut off communications with his family and is suing Logan for firing him from Waystar. Tabloids falsely suggest that Kendall, a recovering addict, has relapsed. Logan attempts to repair his public image by holding a weekend family therapy session at Austerlitz, Connor's ranch in New Mexico, which Kendall chooses not to attend. After a fruitless initial session, Shiv leaves to meet with Senator Gil Eavis, a Democratic presidential candidate and Logan's public rival, after Nate persuades her to join him in working on Gil's campaign. Afterwards, she and Nate have a sexual encounter in her car. Kendall eventually does arrive in New Mexico, but chooses to join some locals on a cocaine and methamphetamine binge. Roman brings him back to the ranch, where an argument erupts between Logan and the rest of the family. Logan insults Tom and berates Shiv for meeting with Gil, causing her to leave crying. He also admits to planting the tabloid allegations about Kendall's drug use prior to his actual relapse. The argument nearly turns violent when Kendall dismisses Logan's stories of the abuse he suffered as a child at the hands of his uncle. The next morning, Logan is seen privately swimming with visible scars on his back, attesting to his abuse.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Prague\"</td><td style=\"text-align:center\"><span>S. J. Clarkson</span></td><td style=\"text-align:center\">Jon Brown</td><td style=\"text-align:center\">July 22, 2018</td><td style=\"text-align:center\">0.637</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4B322D\">Roman is put in charge of planning Tom's bachelor party. Though he initially wants to host it in <span>Prague</span>, Stewy invites him to a secret underground party held inside an abandoned New York railway station where powerful business and media figures mingle. Logan tasks Greg with ensuring Kendall's safety amid his renewed drug abuse. Tom is initially drawn to the party's unhinged, sexual atmosphere, but he becomes doubtful about his relationship with Shiv, unaware of her ongoing affair with Nate. He is eventually goaded by Roman into having sex with a woman at the party. Shiv meets Logan for dinner, where he implies that he knows of her affair. Shiv, perceiving this as a veiled threat, refuses to stop working for Gil. Marcia later calls Shiv to say that Logan will not be attending Shiv and Tom's wedding. At the party, Kendall meets with Stewy and Sandy, who want to buy out his share in Waystar for half a billion dollars. A vengeful Kendall instead proposes a <span class=\"mw-redirect\">hostile takeover</span> that will grant them a <span>controlling interest</span> in the company and name him CEO.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Pre-Nuptial\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\">Jesse Armstrong</td><td style=\"text-align:center\">July 29, 2018</td><td style=\"text-align:center\">0.558</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4B322D\">The Roys gather at an English castle in preparation for Shiv and Tom's wedding. Shiv believes Logan will not be present, but Logan chooses to attend to avoid bad publicity. Kendall, Roman and Shiv reunite with their mother Caroline, Logan's second wife. Tom is surprised to find that Tabitha, the woman with whom he had an embarrassing sexual encounter at his bachelor party, is now dating Roman. Nate meets Tom and tells him of his history with Shiv. Tom confronts Shiv about her infidelity, but she denies it and instead asks to know the details of the cruises scandal, hoping to use it as political ammunition for Gil. Greg later spots Shiv and Nate together, but when he attempts to relay his suspicions to Tom the following morning, Tom attacks him. Shiv tells Gerri that she will let the cruises scandal remain secret as long as ATN – Waystar's right-leaning news network — stops slandering Gil over his wife's suicide. Gil and Logan agree to a truce on these terms. Kendall is told by Stewy and Sandy that their takeover of Waystar has been moved up to the day of Shiv's wedding, as they would have more leverage over Logan while he is out of the country.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Nobody Is Ever Missing</span>\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\">Jesse Armstrong</td><td style=\"text-align:center\">August 5, 2018</td><td style=\"text-align:center\">0.730</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4B322D\">Kendall serves Logan with his planned takeover bid. A furious Logan kicks him out, but begins scrambling to get ahead of the situation with his lawyers immediately afterwards. During the wedding, the siblings are infuriated to learn from Logan about Kendall's takeover plans. Shiv admits her infidelity to Tom and suggests that she is better suited for a <span>non-monogamous</span> relationship. Tom forgives her and later ejects Nate from the wedding. Outside the castle, Kendall does drugs with Andrew Dodds, a young waiter whom Logan had fired from the staff, and the two drive off in search of cocaine. They swerve to avoid a deer, and the car lands in the water. Unable to save Dodds, Kendall flees the scene and returns to the wedding in shock. The police investigate the following morning, and Logan tells Kendall that he will make the case go away if Kendall calls off the takeover and attends rehab. Kendall obliges and breaks down crying in his father's arms.</td></tr></tbody></table><h4>Season 2 (2019)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#AE906E;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#AE906E;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#AE906E\">Title</th><th scope=\"col\" style=\"background:#AE906E\">Directed by</th><th scope=\"col\" style=\"background:#AE906E\">Written by</th><th scope=\"col\" style=\"background:#AE906E\">Original air date</th><th scope=\"col\" style=\"background:#AE906E;width:10%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The Summer Palace</span>\"</td><td style=\"text-align:center\"><span>Mark Mylod</span></td><td style=\"text-align:center\"><span>Jesse Armstrong</span></td><td style=\"text-align:center\">August 11, 2019</td><td style=\"text-align:center\">0.612</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #AE906E\">48 hours after Shiv and Tom's wedding, Kendall is pulled out of a rehab facility in Iceland to give a public statement regarding his decision to back off from his role in the hostile takeover. Logan's financial adviser Jamie Laird suggests that he sell the company and name his successor. Despite going to rehab, Kendall continues to indulge his cocaine addiction and receives his deliveries from Greg. The Roys assemble for lunch at the family's summer home in <span>the Hamptons</span>. Logan is unable to extract an honest opinion from his children about whether he should sell the company; he has each of his children individually meet him in his office, and offers Shiv the role of CEO during their meeting. Shiv is eager for the opportunity, but does not disclose it to Tom, only telling him that he has been promoted to ATN's Chair of Global Broadcast News. That night, Logan flies Kendall to a meeting with Stewy and Sandy, who refuse to come to a compromise.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Vaulter</span>\"</td><td style=\"text-align:center\"><span>Andrij Parekh</span></td><td style=\"text-align:center\">Jon Brown</td><td style=\"text-align:center\">August 18, 2019</td><td style=\"text-align:center\">0.603</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #AE906E\">Gil promotes Shiv to <span>chief of staff</span> for his presidential campaign. Connor and Willa return to New York, where Connor prepares to announce his own bid for President. Logan suggests to Shiv that it would take three years for her to fully integrate into her CEO role. Tom tasks Greg with rooting out inefficiencies in ATN's operations, despite Greg's reluctance to work for the network. Logan has Kendall and Roman review Vaulter's performance; Kendall wants to keep the company, but Roman reports to Logan that its business is failing and that its employees want to <span>unionize</span>. Logan sides with Roman and tasks Kendall with closing down Vaulter. Shiv tells Tom that Logan offered her the role of CEO, which puts Tom's ambitions to inherit the company in jeopardy; Shiv assures him that his inheritance is safe. Shiv later quits Gil's campaign. Kendall terminates Vaulter's staff, flatly telling Lawrence that he is doing so on his father's orders.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Hunting</span>\"</td><td style=\"text-align:center\">Andrij Parekh</td><td style=\"text-align:center\"><span>Tony Roche</span></td><td style=\"text-align:center\">August 25, 2019</td><td style=\"text-align:center\">0.607</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #AE906E\">Logan plans to acquire rival media giant Pierce Global Media (PGM), against the counsel of his peers and family, and rehires Frank due to his friendship with the head of its board. The family departs on a hunting retreat in Hungary. On the way, Logan is furious to learn that someone disclosed information on him to author Michelle Pantsil, who is writing an unauthorized biography on him. While hunting, Greg confides to Tom that he met with Pantsil, and begs him to keep it a secret. Connor announces his presidential bid on a platform against taxation. Shiv has a one-night stand while Tom is away. During dinner, Logan finds out that PGM is already aware of his plans, and subjects Greg, Tom and Karl to a vicious <span>hazing</span> ritual called \"Boar on the Floor\" until the source comes forth. Kendall finds out that it was Roman who privately reached out to the Pierces. The next morning, Logan learns that Mo, a recently deceased board member, talked to Pantsil, absolving Greg of suspicion. Frank informs Logan that PGM's CEO is interested in a meeting. Logan tells Shiv it is time to bring her into the company.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Safe Room</span>\"</td><td style=\"text-align:center\"><span>Shari Springer Berman &amp; Robert Pulcini</span></td><td style=\"text-align:center\"><span>Georgia Pritchett</span></td><td style=\"text-align:center\">September 1, 2019</td><td style=\"text-align:center\">0.577</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #AE906E\">Logan and Kendall meet with Rhea Jarrell, CEO of PGM, who relays the Pierce family's disinterest in selling their company. Tom investigates ATN anchor Mark Ravenhead, an alleged <span>Nazi sympathizer</span>, but their meeting is cut short by the sound of a gunshot. The building's occupants are ushered into panic rooms, where Kendall and Logan sway Rhea with a $24 billion offer for PGM, which she agrees to pass on to the Pierces. The source of the gunshot is found to have been an ATN employee who committed suicide in his office. Greg reveals to Tom that he kept copies of the cruises documents and blackmails him into giving him a promotion. Connor and Willa attend Mo (real name Lester McClintock)'s funeral; Pantsil is present and presses Connor on his association with Lester, a known sexual predator, but Willa helps rewrite Connor's eulogy to avoid him being entrapped by Pantsil. Roman, following Gerri's advice on how to earn his father's respect, enrolls in Waystar's management training program. He later finds himself sexually aroused when Gerri scolds him over the phone. Kendall tearfully confides to Shiv his belief that his loyalty to Logan is all he is worth.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep15\" style=\"text-align:center\">15</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Tern Haven</span>\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\">Will Tracy</td><td style=\"text-align:center\">September 8, 2019</td><td style=\"text-align:center\">0.507</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #AE906E\">The Roys spend a weekend with the Pierces at their family estate. Conversations between the families become increasingly tense and culminate when matriarch Nan Pierce asks Logan during dinner who will replace him as CEO. Logan refuses to name his successor, and an indignant Shiv stuns the room by announcing she has been chosen. Kendall indulges in drugs and sex with Nan's cousin Naomi, a fellow recovering addict. She admits she despises the Roys and Waystar for running tabloids on her during her troubled past, and that she came to ensure that the acquisition fails. However, Kendall convinces her that the money from the deal could free her from the entanglements of a family business. The following morning, Nan (on Naomi's advice) agrees to sell PGM to the Roys on the condition that Shiv be named Logan's successor on the day of the merger. Logan refuses and calls off the deal. However, he receives a call soon after saying the Pierces have changed their mind. The Roys celebrate at Logan's home.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep16\" style=\"text-align:center\">16</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Argestes</span>\"</td><td style=\"text-align:center\"><span>Matt Shakman</span></td><td style=\"text-align:center\">Susan Soon He Stanton</td><td style=\"text-align:center\">September 15, 2019</td><td style=\"text-align:center\">0.610</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #AE906E\">The Roys attend Argestes, an international business conference, where they plan to finalize their agreement with the Pierces. However, they learn that <i><span>New York Magazine</span></i> has received a tip on the cruise line scandal and plans to publish an exposé within the next 36 to 48 hours. Despite the Roys' attempts to block the story's publication, it goes online the following morning while Logan and Kendall meet with Nan and Rhea. Shiv meets privately with Rhea, who admits that she wants the Waystar–PGM acquisition to succeed regardless of the scandal. Roman attempts to secure an investment from Azerbaijani aristocrat Eduard Asgarov, who agrees to provide his family's money if Waystar runs propaganda on behalf of his home country. Kendall, Roman and Shiv take the stage for a scheduled panel discussion, where Shiv shocks the audience when she makes comments seemingly suggesting that Logan should step down from the company. An argument ensues after the event, during which Logan strikes Roman. Nan decides to call off the acquisition and fires Rhea for conspiring with Logan.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep17\" style=\"text-align:center\">17</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Return</span>\"</td><td style=\"text-align:center\"><span>Becky Martin</span></td><td style=\"text-align:center\"><span>Jonathan Glatzer</span></td><td style=\"text-align:center\">September 22, 2019</td><td style=\"text-align:center\">0.508</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #AE906E\">Sandy and Stewy launch a public smear campaign against Waystar in the wake of the cruises scandal. Logan, Kendall and Roman travel to <span>London</span> to secure shareholder support from Caroline. Logan invites Rhea along to aid in strategy, and the two spend the night together. Shiv arrives in London and meets with Rhea, who proposes that Shiv become CEO of PGM; Shiv is not opposed to the idea, but remains suspicious of Rhea's motives. Shiv and Roman meet Caroline, who agrees to vote her shares with the family for a payout of 20 million dollars and her children visiting her every Christmas. Sandy and Stewy run tabloids suggesting that Andrew Dodds's death was a suicide triggered by Logan's bullying. Logan has Kendall come along to visit Dodds's family to sort out the situation; Kendall is thoroughly shaken, and revisits the house that night to secretly deliver cash to the family. He attempts to confide his guilt to Caroline, but she neglects to make herself available. Tom faces an internal investigation into the cruises incidents. He forces Greg to burn the latter's copies of the documents, though Greg covertly recovers some of them. Logan accuses Shiv of disloyalty for considering the PGM position; Shiv begins to suspect that Rhea may be plotting to take over the company.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep18\" style=\"text-align:center\">18</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Dundee</span>\"</td><td style=\"text-align:center\"><span>Kevin Bray</span></td><td style=\"text-align:center\">Mary Laws</td><td style=\"text-align:center\">September 29, 2019</td><td style=\"text-align:center\">0.579</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #AE906E\">Rhea organizes a celebration for Logan's 50th anniversary at Waystar in his hometown of <span>Dundee</span>, Scotland. Shiv, now intensely suspicious of Rhea, schemes with her siblings to sabotage Rhea's chances of being named Logan's successor. Though they play along in hazing Rhea, none of the other Roy children are genuinely opposed to having her take over as CEO. Ewan arrives in Dundee and warns Greg that he will relinquish his $250 million inheritance unless the latter stops working for Logan. Gerri and other company advisors inform Shiv that a <span>whistleblower</span> plans to go public with details of the cruises incidents and is refusing to take a payout. Realizing that Rhea will bear the burden of the scandal as CEO, Shiv gives Logan her approval to name Rhea as his successor, which he does during a speech prior to his plaque unveiling ceremony. Marcia, feeling betrayed, leaves the event. Ewan confronts his brother at the ceremony and warns him that he will face a reckoning.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep19\" style=\"text-align:center\">19</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>DC</span>\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\">Jesse Armstrong</td><td style=\"text-align:center\">October 6, 2019</td><td style=\"text-align:center\">0.705</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #AE906E\">The company whistleblower gives a televised interview implicating Gerri, Tom, and Kendall in the cover-up of the crimes committed aboard the company cruise lines. Gil compels the Roys to testify before the <span>Senate</span>. Tom is the first to be called to the stand alongside Gerri and performs disastrously. Shiv attempts to leverage her past connection to Gil and learns that he has a new witness. Shiv meets with the woman, Kira, and talks her out of testifying by warning her that her allegations will follow her for the rest of her life. Logan sends Roman along with Karl and Laird to secure funding from Eduard's family so Waystar can go private; Eduard introduces them to his father in Turkey, but the pitch meeting is cut short when an anti-corruption militia holds the building's occupants hostage. Logan and Kendall testify; Logan attempts to deflect blame onto Kendall for overseeing the cover-up during his tenure as acting CEO, but Kendall delivers a sharp rebuke to Gil. After the hearing, Rhea tells Logan she no longer wants to be CEO. Logan tells Shiv that a \"blood sacrifice\" will have to be made to appease the company's shareholders.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep20\" style=\"text-align:center\">20</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>This Is Not for Tears</span>\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\">Jesse Armstrong</td><td style=\"text-align:center\">October 13, 2019</td><td style=\"text-align:center\">0.660</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #AE906E\">Logan is advised by Waystar shareholders to take the blame for the cruises incidents. The Roys spend a holiday on their yacht in the <span>Mediterranean</span>, where they debate over who should be the company's public scapegoat. Roman, Karl and Laird return from Turkey apparently having closed the financing deal with Eduard's family, though Roman admits to Logan that it is likely illegitimate. Logan and Kendall unsuccessfully attempt to convince Stewy to back Waystar's privatization. Tom admits to Shiv that he is unhappy with their relationship. Shaken, Shiv pleads with Logan not to have Tom take the fall for the scandal. Logan ultimately chooses Kendall; during a private conversation, Kendall asks Logan if he ever saw him fit to run the company, but Logan tells his son that he doesn't see him as a \"killer\". The next morning, Kendall and Greg are flown back to New York for a press conference, where the former is set to accept responsibility for the company's handling of the crimes. However, Kendall suddenly deviates from his prepared remarks and instead blames Logan, announcing that his father was well aware of the misconduct and personally oversaw the ensuing legal settlements. Greg is present at the conference with the probative documents. Logan, who is watching a telecast of Kendall's statement, smiles enigmatically.</td></tr></tbody></table><h4>Season 3 (2021)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#98ACB3;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#98ACB3;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#98ACB3\">Title</th><th scope=\"col\" style=\"background:#98ACB3\">Directed by</th><th scope=\"col\" style=\"background:#98ACB3\">Written by</th><th scope=\"col\" style=\"background:#98ACB3\">Original air date</th><th scope=\"col\" style=\"background:#98ACB3;width:10%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep21\" style=\"text-align:center\">21</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Secession</span>\"</td><td style=\"text-align:center\"><span>Mark Mylod</span></td><td style=\"text-align:center\"><span>Jesse Armstrong</span></td><td style=\"text-align:center\">October 17, 2021</td><td style=\"text-align:center\">0.564</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #98ACB3\">Picking up immediately after Kendall's press conference, Logan decides to split his inner circle into two teams: he, Tom, Karl, Frank and Hugo station themselves in <span>Sarajevo</span> to avoid being extradited to the U.S., while Roman, Gerri and Shiv are sent back to New York. Logan informs his team that he intends to temporarily step back as CEO; the family and company management debate who should take his place as a figurehead. Kendall, meanwhile, sets up a temporary base of operations at Rava's apartment, and hires two PR consultants to help steward his public image. He unsuccessfully attempts to sway more of Waystar's senior cadre to his side. Shiv attempts to acquire representation for Waystar from Lisa Arthur, a high-profile New York attorney and personal friend, but realizes Kendall has already hired her. In light of Shiv's perceived failure, Gerri is named interim CEO.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep22\" style=\"text-align:center\">22</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Mass in Time of War</span>\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\">Jesse Armstrong</td><td style=\"text-align:center\">October 24, 2021</td><td style=\"text-align:center\">0.520</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #98ACB3\">Shiv, Roman, and Connor covertly meet with Kendall, who refuses to compromise and attempts to persuade his siblings to join him. However, the discussion falls apart when Kendall declares that he will be CEO under their new arrangement. Seeing no personal benefit from siding with Kendall, the three siblings ultimately decide to remain aligned with Logan. Kendall additionally meets with Stewy and Sandi Furness (Sandy's daughter) to propose a partnership ahead of the company's shareholder meeting, but they remain skeptical. Greg obtains legal representation from Ewan's attorney. Logan has Marcia flown in to Sarajevo after his legal team advises that the two publicly appear reconciled. Marcia, disgruntled over Logan's infidelity, demands several assurances from the company to ensure her cooperation. Logan returns to New York and names Shiv President of Domestic Operations at Waystar, assuring her she is under Gerri's protection.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep23\" style=\"text-align:center\">23</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The Disruption</span>\"</td><td style=\"text-align:center\"><span>Cathy Yan</span></td><td style=\"text-align:center\">Ted Cohen &amp; <span>Georgia Pritchett</span></td><td style=\"text-align:center\">October 31, 2021</td><td style=\"text-align:center\">0.405</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #98ACB3\">Both Kendall and Logan take steps to boost their respective public profiles. Logan refuses to cooperate with the <span>Department of Justice</span>'s impending investigation, and attempts to pressure White House aide Michelle-Anne Vanderhoven into granting him favors from the President. Tom offers to take the fall by allowing himself to be incarcerated. Kendall sabotages Shiv's speech at a company town hall intended to allay employee grievances by having his assistants blast <span>Nirvana</span>'s \"<span>Rape Me</span>\" from a speaker; an irate Shiv retaliates by publishing an open letter questioning Kendall's mental state, invoking his addiction issues and poor relationship with his children. Kendall prepares to make an appearance on a late-night comedy show that has been disparaging him, but backs out at the last minute after Shiv's letter goes online, deeply shaken by its contents. The <span>FBI</span> raid Waystar's offices, forcing Logan to cooperate.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep24\" style=\"text-align:center\">24</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Lion in the Meadow</span>\"</td><td style=\"text-align:center\"><span>Shari Springer Berman &amp; Robert Pulcini</span></td><td style=\"text-align:center\">Jon Brown</td><td style=\"text-align:center\">November 7, 2021</td><td style=\"text-align:center\">0.484</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #98ACB3\">On Logan's orders, Shiv gets ATN to cover the White House more critically, in hopes of pressuring the President into curtailing the DOJ investigation. However, she finds that she is receiving little respect or support either from within the company or from Logan. Tom begins to unravel over his growing fear of going to prison. Greg informs him he has signed a joint defense agreement with Waystar after meeting with Logan. Shareholder Josh Aaronson requests a meeting with Logan and Kendall, worried that their conflict will endanger his investment, and leads them on a walk around his private island to hear each side's arguments. However, Kendall and Logan fail to present a united front, and Logan suffers from exhaustion on the walk back to Josh's mansion, refusing help until he nearly collapses. Kendall is later informed that Josh has lost confidence in Waystar's current leadership, and witnesses him meeting with Stewy.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep25\" style=\"text-align:center\">25</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Retired Janitors of Idaho</span>\"</td><td style=\"text-align:center\"><span>Kevin Bray</span></td><td style=\"text-align:center\"><span>Tony Roche</span> &amp; Susan Soon He Stanton</td><td style=\"text-align:center\">November 14, 2021</td><td style=\"text-align:center\">0.584</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #98ACB3\">At the Waystar RoyCo annual shareholder meeting, both Kendall and Logan's factions attempt to broker a settlement with Stewy and Sandi (largely negotiating on behalf of her ailing father), realizing that going to a vote would almost certainly deprive the Roys of their majority stake in the company. Logan, who is suffering from a <span>urinary tract infection</span>, initially refuses Sandy's terms, but becomes increasingly incoherent, forcing the other children and senior management to negotiate on his behalf. The vote is stalled while Shiv and Sandi manage to reach a deal offering either side an additional board seat; the two sides agree on the terms without waiting for an incapacitated Logan to approve. Ewan decides to donate his entire estate to <span>Greenpeace</span>, leaving Greg with no inheritance. The President calls the Roys to announce that he will not be seeking a second term amid the blowback from ATN's attacks, jeopardizing Waystar's political survival.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep26\" style=\"text-align:center\">26</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>What It Takes</span>\"</td><td style=\"text-align:center\"><span>Andrij Parekh</span></td><td style=\"text-align:center\">Will Tracy</td><td style=\"text-align:center\">November 21, 2021</td><td style=\"text-align:center\">0.525</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #98ACB3\">Kendall's testimony to the DOJ regarding the cruises scandal goes poorly, and Lisa warns that the documents he has retrieved are insufficient legal ammunition against Waystar. An unsatisfied Kendall dispenses with Lisa's services and hires new attorneys. Meanwhile, the rest of the Roys travel to <span>Richmond, Virginia</span> to attend the Future Freedom Summit, a conservative political fundraiser, to pick a new presidential candidate in the upcoming election. While there, Roman learns that his mother is getting married in <span>Tuscany</span> to British CEO Peter Munion. Kendall arrives in Virginia and privately meets with Tom in an attempt to sway him to his side, but Tom refuses, believing Kendall will once again lose to his father. Among the presidential candidates, Roman takes a liking to Jeryd Mencken, a controversial figure with <span>fascist</span> leanings, who he believes will significantly boost ATN's ratings. Logan decides to back Mencken despite Shiv's protests.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep27\" style=\"text-align:center\">27</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Too Much Birthday</span>\"</td><td style=\"text-align:center\"><span>Lorene Scafaria</span></td><td style=\"text-align:center\">Georgia Pritchett &amp; Tony Roche</td><td style=\"text-align:center\">November 28, 2021</td><td style=\"text-align:center\">0.645</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #98ACB3\">The company receives word that the DOJ investigation is weakening and will likely end in a settlement. Tom is deeply relieved to be avoiding prison time. Logan, who has been working to acquire streaming giant GoJo, learns that its CEO, Lukas Matsson, declined to meet him personally. Shiv and Roman attend Kendall's lavish 40th birthday party to negotiate with Matsson, who is in attendance. Roman delivers his and Logan's gift to Kendall: an offer to buy out his shares in Waystar for $2 billion. Shiv is angered when she learns she has been excluded as a beneficiary. Roman meets with Matsson alone and proposes that Waystar buy GoJo without Matsson ever having to report directly to Logan; Matsson expresses guarded interest. Kendall, feeling hurt by the buyout offer and embarrassed with the hollow excess of the party, has an emotional breakdown while searching for his children's gift and has Naomi take him home.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep28\" style=\"text-align:center\">28</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Chiantishire</span>\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\">Jesse Armstrong</td><td style=\"text-align:center\">December 5, 2021</td><td style=\"text-align:center\">0.613</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #98ACB3\">The Roys travel to Tuscany for Caroline's wedding. Kendall demands a sit-down with Logan over dinner, where he requests taking the $2 billion buyout to permanently uncouple himself from his \"evil\" father, but Logan refuses. Caroline admits to Shiv she never wanted children and encourages Shiv not to bear one of her own; out of spite, Shiv asks to have a child with Tom, but tells him before sex that she does not love him, later passing it off as foreplay. GoJo's stock price soars after Matsson sends a tweet suggesting he has received major financing; Roman goes to meet him and discovers that Matsson is interested in a <span>merger of equals</span> with Waystar rather than an acquisition. Logan accepts the renewed terms, but Waystar's meeting with GoJo's bankers is derailed when Roman mistakenly sends a photo of his penis to Logan instead of Gerri. Kendall drunkenly floats facedown in his pool, and slowly lets his head sink into the water.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep29\" style=\"text-align:center\">29</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>All the Bells Say</span>\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\">Jesse Armstrong</td><td style=\"text-align:center\">December 12, 2021</td><td style=\"text-align:center\">0.634</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #98ACB3\">Kendall is saved from drowning in his pool. GoJo's <span>market capitalization</span> overtakes Waystar's; Logan and Roman go to meet Matsson, who proposes that GoJo acquire Waystar with him as CEO while Logan exits with a settlement. Roman is sent back to attend Caroline's wedding, where he and Shiv discover that Logan has decided to sell the company without their input, jeopardizing the children's chances of succeeding him. They tell Kendall, who breaks down and tearfully admits his involvement in Andrew Dodds's death, only to be met with support from his siblings. The three recall a clause in Logan and Caroline's divorce settlement granting the children veto power over any change in company control, and decide to face their father together. On the way, Shiv informs Tom, who cryptically offers Greg a chance at significant ascension within the company. Upon being confronted by his children, Logan informs them that he and Caroline have renegotiated their divorce agreement, effectively depriving the children of company control. Tom is revealed to have tipped off Logan about the children's revolt.</td></tr></tbody></table><h4>Season 4 (2023)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#284866;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#284866;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#284866\">Title</th><th scope=\"col\" style=\"background:#284866\">Directed by</th><th scope=\"col\" style=\"background:#284866\">Written by</th><th scope=\"col\" style=\"background:#284866\">Original air date</th><th scope=\"col\" style=\"background:#284866;width:10%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep30\" style=\"text-align:center\">30</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The Munsters</span>\"</td><td style=\"text-align:center\"><span>Mark Mylod</span></td><td style=\"text-align:center\"><span>Jesse Armstrong</span></td><td style=\"text-align:center\">March 26, 2023</td><td style=\"text-align:center\">0.598</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #284866\">Six months after the events in Tuscany and 48 hours before the GoJo acquisition, Logan celebrates his birthday in New York while Kendall, Shiv, and Roman are in Los Angeles to propose a new media startup to investors. The siblings learn Logan is attempting to purchase PGM again and decide to launch a rival bid. They meet with Nan and Naomi at the Pierces' California estate; Nan is indecisive about the competing offers from Waystar and the siblings, which in turn sparks a bidding war between the factions. The siblings ultimately sway Nan with a $10 billion offer, which Logan is forced to concede. Shiv returns to New York and finds Tom at the apartment they no longer share due to a trial separation. While Tom wants to discuss the breakdown of their marriage, Shiv tells him she wants to divorce him as painlessly as possible.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep31\" style=\"text-align:center\">31</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Rehearsal</span>\"</td><td style=\"text-align:center\"><span>Becky Martin</span></td><td style=\"text-align:center\"><span>Tony Roche</span> &amp; Susan Soon He Stanton</td><td style=\"text-align:center\">April 2, 2023</td><td style=\"text-align:center\">0.481</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #284866\">Logan, who gets to keep control of ATN per the terms of the GoJo sale, visits the newsroom to announce his plans to radically revamp its vision. Stewy and Sandi tell the siblings they want to veto the GoJo acquisition at Waystar's upcoming board meeting to negotiate a price increase. All but Shiv dismiss their proposal and go to spend time with Connor, but Matsson privately calls Kendall to say he will call off the acquisition if pushed on price; Kendall suddenly becomes interested in Stewy and Sandi's offer. Logan meets with his children at a karaoke bar to convince them to allow the GoJo sale to go through, but Kendall and Shiv refuse to make peace with their father. Roman, growing weary of his siblings' desire to spite Logan, visits him at his home, where Logan asks his help in negotiating with Matsson, and offers him a position as head of ATN.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep32\" style=\"text-align:center\">32</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Connor's Wedding</span>\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\">Jesse Armstrong</td><td style=\"text-align:center\">April 9, 2023</td><td style=\"text-align:center\">0.609</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #284866\">On the day of Connor and Willa's wedding in New York, Logan departs for Sweden with Tom and the rest of his senior cadre (except Gerri and Hugo) to negotiate with Matsson. He decides to fire Gerri for her perceived mishandling of the fallout from the cruises scandal, and tasks a reluctant Roman with delivering her the news at the wedding. However, the siblings soon receive word from Tom that Logan collapsed onboard the plane and is unresponsive. It gradually becomes clear that Logan will not survive; his plane is turned around and he is pronounced <span>dead upon landing</span>. The devastated siblings are forced to coordinate a response alongside the rest of Waystar's executives. Connor and Willa go through with their wedding in a small ceremony, while Kendall, Shiv and Roman travel to <span>Teterboro Airport</span> to receive their father's body and issue a statement announcing his death to the press.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep33\" style=\"text-align:center\">33</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Honeymoon States</span>\"</td><td style=\"text-align:center\"><span>Lorene Scafaria</span></td><td style=\"text-align:center\">Jesse Armstrong &amp; <span>Lucy Prebble</span></td><td style=\"text-align:center\">April 16, 2023</td><td style=\"text-align:center\">0.695</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #284866\">Shiv is revealed to be pregnant. Logan's family and close associates gather at his apartment for his wake. Hugo approaches Kendall and informs him of a potential <span>insider trading</span> scandal involving his daughter. Frank finds an undated document in Logan's safe naming Kendall as his successor upon his death. Kendall is taken aback by the news while the others debate the document's legitimacy. Since the company's succession plan formally dictated that leadership be passed on to the COO – a title Roman currently holds – Kendall and Roman decide to run the company as co-CEOs. The brothers promise to involve Shiv in all operational decisions, but she feels dejected regardless. Given Kendall's past controversies, Hugo and Karolina propose a PR campaign questioning Logan's judgment leading up to his death, which Roman shuts down. Kendall, however, privately leverages Hugo to go through with the strategy.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep34\" style=\"text-align:center\">34</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Kill List</span>\"</td><td style=\"text-align:center\"><span>Andrij Parekh</span></td><td style=\"text-align:center\">Jon Brown &amp; Ted Cohen</td><td style=\"text-align:center\">April 23, 2023</td><td style=\"text-align:center\">0.652</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #284866\">With Kendall and Roman now running the company, the Roys fly to Norway for GoJo's annual retreat, where they are hoping to finalize the sale to Matsson with a floor of $144 per share. Matsson, however, wishes to absorb ATN into the acquisition as well, which the brothers oppose. Matsson also privately confides to Shiv that he is trying to avoid a potential <span>harassment</span> scandal involving his head of PR, with whom he was romantically linked. Kendall and Roman eventually decide to torpedo the sale by indirectly convincing Matsson to call it off himself. However, Roman lashes out at Matsson during their next meeting for not giving them time to grieve their father, and openly calls off the deal. Matsson then bypasses the brothers and makes an offer directly to Waystar's senior management for $192 per share, which they pass on to the board, though all the senior management except Gerri, Karolina, and Tom are to be fired.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep35\" style=\"text-align:center\">35</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Living+</span>\"</td><td style=\"text-align:center\">Lorene Scafaria</td><td style=\"text-align:center\"><span>Georgia Pritchett</span> &amp; <span>Will Arbery</span></td><td style=\"text-align:center\">April 30, 2023</td><td style=\"text-align:center\">0.847</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #284866\">The Roys return to Los Angeles for Waystar's Investor Day, where they plan to launch \"Living+\", a luxury <span>assisted living</span> community that Logan had proposed prior to his death. Matsson dislikes the idea and unsuccessfully tries to convince Shiv to call it off, telling her about his hostile negotiation with Kendall and Roman in Norway. Shiv confronts her brothers, who admit they dislike the GoJo deal. Roman impulsively fires the head of Waystar's film studio in light of their latest film's troubled production, and later fires Gerri as well when she reprimands him for it. Shiv and Tom begin to reconnect romantically. Kendall prepares an outlandish presentation for the Living+ product launch, hoping to attract enough investment interest to render the GoJo acquisition untenable. Despite Shiv and Roman's concerns (and Matsson's attempts to sabotage him), he delivers his speech successfully, giving Waystar stock a major boost.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep36\" style=\"text-align:center\">36</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Tailgate Party</span>\"</td><td style=\"text-align:center\"><span>Shari Springer Berman &amp; Robert Pulcini</span></td><td style=\"text-align:center\">Will Tracy</td><td style=\"text-align:center\">May 7, 2023</td><td style=\"text-align:center\">0.739</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #284866\">The night before the presidential election, the Roys host their traditional party for political insiders at Shiv and Tom's apartment. Kendall and Roman hope to build an <span class=\"mw-redirect\">antitrust</span> case against the GoJo acquisition, but Shiv – who wants to preserve the deal – invites Matsson to the party in hopes of thwarting her brothers. However, the siblings later learn that Matsson has grossly inflated GoJo's subscriber numbers in India, which could create a fatal scandal for the company. Roman unsuccessfully attempts to convince Connor to drop out of the presidential race after his polling numbers draw support away from Mencken. Gerri refuses Roman's request to return to Waystar, having negotiated a hefty severance agreement. Tom is incensed by rumors of his firing circulating at the party, leading to a vicious argument with Shiv about their marriage. Kendall proposes to Frank that Waystar buy GoJo with him as sole CEO.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep37\" style=\"text-align:center\">37</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>America Decides</span>\"</td><td style=\"text-align:center\">Andrij Parekh</td><td style=\"text-align:center\">Jesse Armstrong</td><td style=\"text-align:center\">May 14, 2023</td><td style=\"text-align:center\">0.746</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #284866\">On election night, the siblings are torn over the candidates: Roman supports Mencken as he will advance Waystar's agenda – including blocking the GoJo deal – while Kendall is uncomfortable with Mencken due to blowback from his extreme politics affecting his daughter Sophie. Shiv, meanwhile, remains aligned with Matsson. Shiv finally tells Tom she is pregnant with his child, but Tom reacts skeptically. A vote center in <span>Milwaukee</span> is firebombed, destroying thousands of ballots that would have likely gone to Democratic candidate Daniel Jiménez; Roman uses the situation to pressure Tom into having ATN prematurely call Wisconsin for Mencken, while Connor concedes to Mencken as well. Kendall ponders backing Jiménez for his family's sake, but learns from Greg that Shiv is working with Matsson; hurt by his sister's betrayal, he throws in his support for Mencken. After Mencken wins Arizona, ATN calls the election in his favor.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep38\" style=\"text-align:center\">38</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Church and State</span>\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\">Jesse Armstrong</td><td style=\"text-align:center\">May 21, 2023</td><td style=\"text-align:center\">0.789</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #284866\">The Roys arrive at Logan's funeral amidst street protests that have broken out following the announcement of Mencken's win. Shiv advises Matsson to publicize his bogus subscriber counts in India while the news cycle is occupied with the election, and tells her brothers about her pregnancy. Ewan gives a charged eulogy lending insight into Logan's troubled childhood while condemning his brother's actions. Roman is unable to deliver his speech and breaks down crying, prompting Kendall to give one in his place. Shiv brokers a deal between Matsson and Mencken to allow the GoJo deal to go through in exchange for naming an American CEO, which she hopes will be her. Upon learning this, Kendall enlists Roman and Hugo to join him against Shiv at the final board vote on the acquisition. Roman, overwhelmed with the funeral and ashamed at letting his deal with Mencken backfire, walks into a crowd of rioters and gets assaulted.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep39\" style=\"text-align:center\">39</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>With Open Eyes</span>\"</td><td style=\"text-align:center\">Mark Mylod</td><td style=\"text-align:center\">Jesse Armstrong</td><td style=\"text-align:center\">May 28, 2023</td><td style=\"text-align:center\">0.896</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #284866\">Kendall scrambles to secure board votes to block the GoJo deal. He and Shiv visit Caroline's estate in <span>Barbados</span>, where Roman is recovering from his wounds. Matsson interviews Tom and offers him the CEO position; Greg tips off the siblings that Shiv will not be Matsson's CEO. The siblings then agree to let Kendall take over, forming a voting bloc. Upon their return to New York, Shiv learns Tom has been chosen as CEO; the siblings race to sway the board. The board comes to a 6–6 tie over selling to GoJo, with only Shiv's vote left; Shiv, however, has second thoughts about Kendall's competence, and votes in favor of the deal despite Kendall's protests. Tom is appointed CEO with Shiv by his side; Roman accepts that he and his siblings were never worthy successors; a devastated Kendall contemplates his future.</td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>Showrunner Jesse Armstrong initially conceived the series as a feature film about the Murdoch family, but the script never went into production. Armstrong eventually expanded the scope of the story to include the larger landscape of Wall Street, which he felt better suited a television format. Armstrong wrote a new script centered on original characters loosely inspired by various powerful media families such as the Murdochs, the Redstones, the Maxwells, and the Sulzbergers. On June 6, 2016, it was announced that HBO had given the production a pilot order. The episode was written by Armstrong and directed by Adam McKay. Executive producers for the pilot include Armstrong, McKay, Will Ferrell, Frank Rich, and Kevin Messick. On May 16, 2017, it was announced that HBO had given the production a series order for a first season consisting of ten episodes. The previously announced creative team continued their involvement as the series entered into production.</p><p>On November 17, 2017, it was reported that Nicholas Britell would serve as the series' composer. On April 26, 2018, it was announced that the series would premiere on June 3, 2018. On June 11, 2018, HBO renewed the series for a second season. On May 23, 2019, it was announced that the second season would premiere on August 11, 2019. On August 20, 2019, HBO renewed the series for a third season. On March 28, 2020, HBO announced the third season's production was delayed due to the COVID-19 pandemic. The third season premiered on October 17, 2021. In June 2021, executive producer Georgia Pritchett commented that the series would not go beyond five seasons, and possibly would end after season four. On October 26, 2021, HBO renewed the series for a fourth season which premiered on March 26, 2023. In an interview with The New Yorker in February 2023, Armstrong confirmed that the series would conclude with the fourth season. He stated that while the season was not initially pitched as the series' last, \"the decision to end solidified through the writing and even when we started filming: I said to the cast, 'I'm not a hundred percent sure, but I think this is it.'\"</p><h4>Casting</h4><p>On October 6, 2016, it was announced that Brian Cox, Jeremy Strong, Kieran Culkin, Sarah Snook, Nicholas Braun, and Matthew Macfadyen had been cast in lead roles in the series' pilot. On November 4, 2016, it was announced that Hiam Abbass, Alan Ruck, Rob Yang, Parker Sawyers, and Peter Friedman had also joined the main cast of the pilot. On January 24, 2018, it was reported that Ashley Zukerman had joined the series in a recurring role. On May 21, 2019, Holly Hunter joined the cast in a recurring role in the second season.</p><p>In January 2021, it was announced Sanaa Lathan, Linda Emond and Jihae had joined the cast of the series in recurring roles in the third season. In February 2021, it was reported that Hope Davis was cast in a recurring role in the third season. In March, Dasha Nekrasova was reported to have a recurring role in the third season. In May 2021, Alexander Skarsgård was cast in a recurring role while Adrien Brody was cast to guest star for the third season. In August 2021, it was announced Ella Rumpf would guest star in the third season. In January 2023, it was announced that Adam Godley, Annabeth Gish, Eili Harboe and Jóhannes Haukur Jóhannesson were cast in the fourth season.</p><h4>Filming</h4><p>The series is primarily filmed in Manhattan, and shot on 35 mm film. The series is distinct for its predominantly handheld cinematography, which was inspired by the Dogme 95 movement and intended to embody the style of mockumentaries. Cinematographer Patrick Capone characterized the series' camerawork as \"voyeuristic\" and \"non-cinema\", relying on natural light, close coverage and frequent zooms to evoke the feeling of \"eavesdropping\" upon the characters and their environments.</p><p>Director Adam McKay filmed the pilot in late 2016, while principal photography for the rest of the first season of the series began in October 2017. Key locations included the American Irish Historical Society on Fifth Avenue as the location for Logan's apartment, 714 Broadway as the location of Shiv's season 1 apartment, and the Downtown Manhattan Heliport on the East River for scenes of the Roys departing on their helicopters. For scenes depicting the interiors of the Waystar RoyCo offices, the crew uses towers 4 and 7 of the World Trade Center, while 28 Liberty Street is used for exterior shots. Silvercup Studios in Queens houses many of the sets used for the series.</p><p>Other filming locations for the first season included Bellevue Hospital (where the second episode took place), the Cunard Building on 25 Broadway (which houses Cipriani S.A., the venue for a gala in the fourth episode), the East New York Freight Tunnel (the entrance of a bachelor party in the eighth episode), and the Financial District of Lower Manhattan. From mid-to-end of January 2018, the production moved from New York to New Mexico for the episode \"Austerlitz\", which was primarily filmed in Santa Fe. On February 22, 2018, filming took place in New Jersey, which required the closing of the Atlantic City-Brigantine tunnel. On February 25, 2018, filming took place at Eastnor Castle near Ledbury in Herefordshire, England, which served as the setting for the last two episodes of the season.</p><p>The second season saw a significant increase in location shifts. The opening scenes of the season premiere were shot on location in Iceland, while Henry Ford II's 1960 estate in the Hamptons was used as the Roys' summer home. Oheka Castle in Huntington, New York, stood in for the Roys' hunting lodge in Hungary for the episode \"Hunting\". Filming also took place in Long Island, with a mansion once belonging to Junius Spencer Morgan featuring prominently in the episode \"Tern Haven\". The estate is one of several in the area used as filming locations for the second season. From April through May 2019, the production recruited extras for filming in Lake Placid, and Lake George, New York, where the episode \"Argestes\" was shot. Production moved to Dundee for the eighth episode, with additional filming taking place in Glasgow and Ayr for the preceding episode (which takes place in England). Starting from July 17, 2019, the crew filmed in Korčula, Croatia, for the second-season finale episode \"This Is Not for Tears\", including extensive scenes on a yacht.</p><p>Filming for season 3, which was slated to begin in April 2020, was postponed due to the COVID-19 pandemic. In early November 2020, star Alan Ruck announced that filming would begin in mid-November in New York City. The season had begun filming in New York as of December 2020. Filming locations in the city included the Woolworth Building in Tribeca, The Shed in Hudson Yards, and a number of hotels including the Marriott Marquis in Times Square and the Plaza Hotel on Fifth Avenue. Production also returned to the Hamptons, at locations including Montauk and Wainscott. In May, additional filming for season 3 took place in Richmond, Virginia, primarily at the Jefferson Hotel. In June, production on the third season moved to Italy for the final two episodes, with filming primarily taking place in the Val d'Orcia region of Tuscany – where a wedding reception was filmed at the estates La Foce and Villa Cetinale. Additional filming took place in other nearby comuni in the province of Siena – including Pienza, Montalcino and Chianciano Terme – as well as in Cortona, Lake Como, Milan, and Florence (the lattermost of which was used for establishing shots in the opening episodes).</p><p>Production on the 10-episode fourth season began in New York City on June 27, 2022, with Mark Mylod directing the first episode. In October 2022, it was confirmed that filming occurred in western Norway, including locations such as the Atlantic Ocean Road, Romsdalen Gondola, Eggen Restaurant, and Juvet Landscape Hotel, as part of a storyline involving Skarsgård's character. The series also filmed in Los Angeles and Barbados for the fourth season.</p><h4>Music</h4><p>The music for Succession is composed by Nicholas Britell. The score is considered as a combination of \"hip hop and classical music\" and along with the main title theme, it received critical acclaim and several accolades.</p><br/><h3>Release</h3><p>On April 27, 2018, the series held its official world premiere during the Series Mania Festival in Lille, France, in which the pilot episode was screened. On May 22, 2018, the series held its official US premiere at the Time Warner Center in New York City. All four seasons aired on Sky Atlantic in the UK.</p><p>HBO released the first season on DVD on August 6, 2018, which included special features; a Blu-ray release was made available on November 6 of the same year. Subsequent seasons have been released on DVD-only; season 2 was released on September 15, 2020, and season 3 was released on May 17, 2022.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>The series has received an average score of 95% on Rotten Tomatoes and a score of 85 on Metacritic. In 2021, BBC Culture polled 206 \"critics, journalists, academics and industry figures\" from around the world to compile the 100 greatest television series of the 21st century; Succession came in at number 10. In 2022, Rolling Stone ranked the show number 11 on its list of the 100 greatest TV shows. The series has often drawn parallels to the works of William Shakespeare.</p><p>The first season was met with positive reviews from critics. On the review aggregation website Rotten Tomatoes, the season holds an approval rating of 89% with an average rating of 7.9 out of 10, based on 88 reviews. The website's critical consensus reads, \"Peppering its pathos with acid wit, Succession is a divine comedy of absolute power and dysfunction – brought to vivid life by a ferocious ensemble.\" Metacritic, which uses a weighted average, assigned the season a score of 70 out of 100 based on 29 critics, indicating \"generally favorable reviews\".</p><p>The second season received widespread critical acclaim. On Rotten Tomatoes, the season holds a 97% rating with an average rating of 8.9 out of 10, based on 238 reviews. The website's critical consensus reads, \"Succession returns in darkly funny form, with sharp writing, exceptional performances, and a surprising new level of sympathy for some of television's least likable characters.\" On Metacritic, the season has a weighted average score of 89 out of 100, based on 19 critics, indicating \"universal acclaim\".</p><p>The third season received critical acclaim. On Rotten Tomatoes, the season holds a 97% approval rating with an average rating of 9.3 out of 10, based on 145 reviews. The website's critical consensus reads, \"Fans already buying what Succession is selling will be pleasantly surprised to find its third season in crackling form – even if it gets a little too real from time to time.\" On Metacritic, the season has a weighted average score of 92 out of 100, based on 31 critics, indicating \"universal acclaim\".</p><p>The fourth and final season has been met with widespread critical acclaim. On Rotten Tomatoes, the season holds an approval rating of 97% with an average rating of 9.2 out of 10, based on 316 reviews. The website's critical consensus reads, \"As compulsively watchable as ever, Succession's final season concludes the saga of the backbiting Roy family on a typically brilliant – and colorfully profane – high note.\" On Metacritic, the season has received a weighted average score of 92 out of 100, based on 31 critics, indicating \"universal acclaim\".</p><h4>Reaction from Murdoch family</h4><p>Executive producer Frank Rich told Town & Country in 2019 that he heard from Murdoch insiders that members of the family found the show to be \"interesting\" and even \"amusing\". Rupert Murdoch himself responded to an e-mail sent by a Semafor reporter that he had never seen the show. Furthermore, Vanity Fair reported that as part of the settlement for her divorce from Murdoch, Jerry Hall was barred from contacting Succession producers with ideas for storylines.</p><h4>Ratings</h4><p>The series premiere episode drew 582,000 live viewers, down from the 1.39 million viewers that watched its lead-in, Westworld. The season 2 finale drew 1.1 million viewers across all viewing platforms. Season 3 premiered to 1.4 million viewers across various platforms and ended with 1.7 million viewers across all viewing platforms, a record high for the show. The series finale drew 2.9 million viewers, making it the highest watched episode of the show. This was a 68% increase from the 1.7 million viewers for the season three finale.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\" style=\"text-align: left;\"><div class=\"mbox-text-span\">Graphs are temporarily unavailable due to technical issues.</div></td></tr></tbody></table><h4>Accolades</h4><p>Succession has received numerous awards and nominations from various television award ceremonies. It has received 48 Primetime Emmy Award nominations with 13 wins. Its first season received five nominations at the 71st Primetime Emmy Awards, including Outstanding Drama Series, and Jesse Armstrong won for Outstanding Writing for a Drama Series for the episode \"Nobody Is Ever Missing\".</p><p>Its second season received 18 nominations with 7 wins at the 72nd Primetime Emmy Awards; including Outstanding Drama Series, Jeremy Strong for Outstanding Lead Actor in a Drama Series, Cherry Jones for Outstanding Guest Actress in a Drama Series, and for Outstanding Writing and Directing. Brian Cox, Matthew Macfadyen, Kieran Culkin, Nicholas Braun, Sarah Snook, James Cromwell, and Harriet Walter all received acting nominations.</p><p>Its third season received a leading 25 nominations with 4 wins at the 74th Primetime Emmy Awards; including Outstanding Drama Series, Macfadyen for Outstanding Supporting Actor in a Drama Series, and Armstrong for Outstanding Writing for a Drama Series. Cox, Strong, Culkin, Braun, Snook, Cromwell, and Walter all received repeat nominations, while J. Smith-Cameron, Adrien Brody, Arian Moayed, Alexander Skarsgård, Hope Davis, and Sanaa Lathan all received acting nominations as well. The series also received three nominations for Outstanding Directing for a Drama Series.</p><br/><h3>Podcast</h3><p>In July 2020, HBO launched a companion podcast, \"HBO's Succession Podcast\". The first season featured British-American broadcaster, podcaster, and filmmaker Roger Bennett interviewing members of the cast over eight episodes. The second season featured American journalist Kara Swisher discussing with guests how season three plot points tied to real world events. A third season of the podcast continued the same format to examine the fourth and final season of the series, with Swisher reprising hosting duties.</p><br/>"
  },
  "errorMessage": ""
}