{
  "imDbId": "tt4269716",
  "title": "Umbre",
  "fullTitle": "Umbre (TV Series 2014–2019)",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "chervenkov",
      "userUrl": "https://www.imdb.com/user/ur110399767",
      "reviewLink": "https://www.imdb.com/review/rw5280522",
      "warningSpoilers": false,
      "date": "25 November 2019",
      "rate": "10",
      "helpful": "53 out of 57 found this helpful.",
      "title": "Dark humour, parts of the series especially season 3 are unsetlling to say the least",
      "content": "The entire thing is an acquired taste. The characters are who they are, violent, merciless towards \"rats\" and people who don't pay up on time. The thought of changing seems to have never have crossed their minds. Only Relu doesn't seem to take any plesure in doing what he does.I am pesonally blown alway by the production value, especially the third season. If the language was not Romanian, I could swear that I am watching True Detective, it really is that good. The the soundtrack, the lighting, the entire atmosphere are absolutely spot on.Not entirely sure if all people are going to have the somach to get over a few very disturbing parts. There are constantly references towards fu***ing in a slightly different way than the American shows so bear that in mind.I live pretty close to Romania and cannot believe that such masterfully crafted show could be produced in our part of the world. It really blows out of the water anything I have previously seen from the Estern European region. If you like dark twisted humour, you will definetely have plenty of laughts."
    },
    {
      "username": "ispas-paul",
      "userUrl": "https://www.imdb.com/user/ur19556328",
      "reviewLink": "https://www.imdb.com/review/rw3169080",
      "warningSpoilers": false,
      "date": "24 January 2015",
      "rate": "9",
      "helpful": "91 out of 99 found this helpful.",
      "title": "The best TV series in Romanian Language, or: as good as it gets",
      "content": "Most watchers will compare this series with other international big-budget successes such as Breaking Bad, the Sopranos or the Wire. I think that this is the first mistake that the Romanian audience makes. The second one is referring to the language that is used as being to vulgar or non-representative for the street (illegal) activities that occurs in Romania. The third mistake is emphasizing the lack of character development.On the first case, this is a low budget series, with its main aim being entertainment. If it plays well, then the future seasons will, most likely, be better. Comparing apples and oranges is one thing - they're both fruit, but comparing sledgehammers and ponies is a totally different thing. This series was created for the Romanian audience, not the American one, and because the watcher's used to American series, then he is part of the American audience.Secondly, on the language used, referring to it as exaggerated means not seeing the chain of events. Each episode has 45 minutes and it reflects 45 minutes of events, which happen to be the ones that demand that type of language. Again, this is due to the lack of experience the Romanian audience has with this type of native- swearing. We're used to foreign street language and we consider it natural, but when someone talks like that in Romanian its, somehow exaggerated. Thirdly, the lack of character development might be seen as an issue, but, to my eyes, this is what makes the show entertaining. You don't know what to expect from the main character, especially since he's an anti-hero. Not being fed with the way you should feel about the main character gives this story an upper hand. Nevertheless, I must say that I'm writing this review based only on the first five episodes, but even so, I personally find this show highly entertaining with more than just a few glances of genius writing and acting. A definite must for Romanian speakers and highly recommended for those into the anti-hero underworld drama series."
    },
    {
      "username": "delicios",
      "userUrl": "https://www.imdb.com/user/ur85980094",
      "reviewLink": "https://www.imdb.com/review/rw5196785",
      "warningSpoilers": false,
      "date": "18 October 2019",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Brilliant acting",
      "content": "Absolutely brilliant actors, very refreshing to see a different kind of acting, more organic and realistic. I binge watched it and I hope more seasons will fallow without killing other important characters!"
    },
    {
      "username": "mlynch5187",
      "userUrl": "https://www.imdb.com/user/ur50353664",
      "reviewLink": "https://www.imdb.com/review/rw4992467",
      "warningSpoilers": false,
      "date": "13 July 2019",
      "rate": "9",
      "helpful": "25 out of 28 found this helpful.",
      "title": "Fantastic Gangster Film",
      "content": "This film is from Romania, yet easily hangs with the best that HBO, Netflix, & Hollywood have ever offered. Umbre is about a family man who tries to balance his life a taxi driver with his secret life in the Romanian underworld. Backs are stabbed, and plots are schemed. If you like shows like the Sopranos or Breaking Bad, check this out. You won't be disappointed."
    },
    {
      "username": "playstrong",
      "userUrl": "https://www.imdb.com/user/ur53164859",
      "reviewLink": "https://www.imdb.com/review/rw5166616",
      "warningSpoilers": false,
      "date": "6 October 2019",
      "rate": "9",
      "helpful": "21 out of 22 found this helpful.",
      "title": "So nice to see the darker side of EU countries.",
      "content": "Well done! This series is amazing. It is really nice to see that Romania got so many talented actors, directors and writers. This Balkan area is full of the activities that are put in screenplay of this series. It is so nice to see that countries like Romania talk freely about their problems through those amazing pieces of art. It is a huge boost for whole area, thanks to HBO Europe, to continue on producing stuff like this. Strongly recommending Umbre (Shadows), and keep on going Romanians!PS. Characters are not that well developed, it is more focused on the topic rather than characters, so that is why I gave this series 9 and not 10.Waiting for season 3!"
    },
    {
      "username": "lex131",
      "userUrl": "https://www.imdb.com/user/ur4447777",
      "reviewLink": "https://www.imdb.com/review/rw3175601",
      "warningSpoilers": false,
      "date": "29 January 2015",
      "rate": "10",
      "helpful": "142 out of 150 found this helpful.",
      "title": "Finally a Romanian TV series worth watching!",
      "content": "First of all, I'm an avid TV-series watcher. It's pointless to name them all but believe me, I've probably wasted years of my life watching series of all kind.Second, I just can't believe the quality of this show. Romanian shows are cheap soap operas, cheap comedies or just plain bad cheap stuff for the masses.It is the first time a Romanian show (original show) pays attention to details such as: - music - lighting - perfect sound - editing and special fxI've seen the shows other reviewers mention: Breaking bad, The Wire, Sopranos, 24, etc - more than once. UMBRE is not a copy of those shows. But now, in 2015, after millions of movies have been made it is almost impossible to say a new show is totally original so of course you feel the need to compare them.UMBRE has the Romanian touch to it - the long scenes where all you see is a bit of the normal life of a character - the type of scenes that give you a sense of reality to it. You don't have these in US shows.The actors do a wonderful job and I don't need more character development, it's not a novel it's an action-comedy show not a theater play.The slang might be too much for some but when was the last time you spend some time within that social class? When you watch The Wire there are scenes where all they say is \"fu*k\" for 5 minutes, continuously. I really want this show to continue - it's a new breed of show in Romania and I want to see this one succeed and other to appear afterward. I'm just sick and tired of shows about communism, Romanian tragedies, telenovelas, etc."
    },
    {
      "username": "Ludi_Jazavac",
      "userUrl": "https://www.imdb.com/user/ur24023969",
      "reviewLink": "https://www.imdb.com/review/rw3561576",
      "warningSpoilers": false,
      "date": "14 October 2016",
      "rate": "8",
      "helpful": "59 out of 62 found this helpful.",
      "title": "Romanian gem",
      "content": "I have to admit I'm not familiar with the Romanian cinema, but it seems they have some serious talent. Story follows a cab driver, who works as a debt collector for a local gangster and, of course, things get complicated rather quickly. Some people compare this with Sopranos, but it is in my opinion very different. Maybe it's the east European setting, cheap cars and run- own houses, but it sells the idea that he is doing it just to survive. There is no glam gangster life present in Sopranos, no pools, no expensive cars, just making the ends meet. The production value is high. Good acting, writing and directing. I think it helps seeing actors you've never seen before,because it makes them more believable and you can enjoy them without prejudice. Nice little change of pace from the same old, same old American TV shows."
    },
    {
      "username": "student-sfv",
      "userUrl": "https://www.imdb.com/user/ur5012432",
      "reviewLink": "https://www.imdb.com/review/rw3227136",
      "warningSpoilers": false,
      "date": "26 April 2015",
      "rate": "10",
      "helpful": "41 out of 45 found this helpful.",
      "title": "Romanian sopranos",
      "content": "I just started watching this, saw the first 3 episodes. I wasn't expecting it to be good or bad, but being HBO I was confident it wouldn't suck. What I found is a good show, it resembles The Sopranos in many ways but with the exoticism of Romania it's not that visible. There are many funny moments, some great scenes, some nudity (ofc, it's HBO), all in all I recommend it if you liked The Sopranos or similar shows, or if you want a taste of Romania and its criminal organizations. I'm looking forward to the next season and I hope it continues for the classical HBO 6 series (or more) because there's some good stuff here."
    },
    {
      "username": "ScGreen20",
      "userUrl": "https://www.imdb.com/user/ur86610594",
      "reviewLink": "https://www.imdb.com/review/rw5407376",
      "warningSpoilers": false,
      "date": "14 January 2020",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Irony so dark, it's hilarious. A MUST watch.",
      "content": "After the first two episodes, I just can't stop myself from laughing through each episode. The irony just gets deeper and deeper by each episode. Especially in silence, Relu's or his wife's expression just got me bursting out in laughter (the wedding episode is the icing on the cake).I am pretty sure this series is not meant to be dark humor type like say, Patriot, or action-comedy genre, but it actually makes me laugh uncontrollably at times. It totally deserves 10 stars."
    },
    {
      "username": "BeneCumb",
      "userUrl": "https://www.imdb.com/user/ur32764997",
      "reviewLink": "https://www.imdb.com/review/rw4592990",
      "warningSpoilers": false,
      "date": "19 January 2019",
      "rate": "9",
      "helpful": "18 out of 22 found this helpful.",
      "title": "Surprisingly meaty and catchy series with comic elements",
      "content": "I have never visited Romania, have no acquaintances there, probably have seen a couple of Romanian films, but definitely no Romanian TV-series... And now this - wow! Umbre did not captivate me from the very first minutes, but then it started working on me: its characters, performances, scenes, intertwining of people and events...Some stuff may seem bizarre, but bearing in mind their standard of living, corruption index and problems with the EU, I am sure most things are not exaggerated. There are lots of lines, glimpses, sights, occasions, etc. that are essentially tragic, but you find yourself giggling, and all the cast is just something... bold and assiduous, even minors, and the reactions of the characters to surprising outcomes are worth recording.So, if you like something original and different, including raw scenes, then Umbre is definitely for you!"
    },
    {
      "username": "mdesteptu",
      "userUrl": "https://www.imdb.com/user/ur2271892",
      "reviewLink": "https://www.imdb.com/review/rw3785988",
      "warningSpoilers": false,
      "date": "21 August 2017",
      "rate": "10",
      "helpful": "34 out of 40 found this helpful.",
      "title": "A hidden gem",
      "content": "Definitely a gem! Too bad it is so little known! It deserves a better promotion, since it is one of the best \"mafia\" movies I've seen lately. Seriously! It is close to Sopranos when it comes to the vivid imagery (e.g. the scene when the main character was about to get his head chopped in a bathtub was absolutely breathtaking), but without the glamour and wealth of the American mob. A great plot! It feels authentic and it is immersive! You will see a slice of real life with cheap cars, decayed buildings, ruthless thugs ready to kill for few thousands. The language is brutal but full of authentic and often very funny expressions (it helps if you speak Romanian)You will not be able to resist the binge-watching temptation. Highly recommended!PS: I hear HBO Europe is planning a second season. Looking forward to have it also on Amazon, as soon as possible."
    },
    {
      "username": "revnicraul_95",
      "userUrl": "https://www.imdb.com/user/ur33260558",
      "reviewLink": "https://www.imdb.com/review/rw5311509",
      "warningSpoilers": false,
      "date": "9 December 2019",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "The only good Romanian TV series.",
      "content": "Like I said in the title, this TV series is romanian Breaking Bad level. As a romanian, I am simply amazed of the quality of this show. We (as romanians) are used to crappy comedies, cheap ones and bad productions, that's why I am amazed of how extremely good is this title, i can't believe is a Romanian show. The show grows constantly from season 1 to season 3, which surprised me the most, the best season IMO."
    },
    {
      "username": "xerogen-1",
      "userUrl": "https://www.imdb.com/user/ur19008060",
      "reviewLink": "https://www.imdb.com/review/rw7288460",
      "warningSpoilers": false,
      "date": "30 August 2021",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "So underrated...",
      "content": "It makes me cry literally..THE writing, THE dialog, THE acting, THE cinematography - everything works perfectly.People compare this to Sopranos, it even surpasses Sopranos in quite a few ways.Spread this series, tell your friends - it's a must watch!"
    },
    {
      "username": "oaie2000",
      "userUrl": "https://www.imdb.com/user/ur10485112",
      "reviewLink": "https://www.imdb.com/review/rw3169170",
      "warningSpoilers": false,
      "date": "24 January 2015",
      "rate": "9",
      "helpful": "40 out of 47 found this helpful.",
      "title": "great director in need of a better scriptwriter",
      "content": "Great director and great acting performance. Maybe the characters are not so well developed, maybe the script is sometimes lacking consistence. In the same time the Director compensates with incredible talent and flair. Igor Cobileanski is a huge surprise, HBO people were lucky to find such a talent who was practically unknown. Serban Pavlu is playing like Relu is his alter ego and Maria Obretin, even as she has theater written all over her face, she performs like she has been doing TV movies for her entire life. Quality of the movie is in the same league with Breaking Bad. The image is brilliant, the D.O.P. does a marvelous job. Some audiences consider the language too violent, in my opinion language is very realistic considering the nature of the characters. I believe it is the best Romanian TV series ever made. With a better script, I would have given a 10."
    },
    {
      "username": "singhravi-00980",
      "userUrl": "https://www.imdb.com/user/ur77893868",
      "reviewLink": "https://www.imdb.com/review/rw7622165",
      "warningSpoilers": false,
      "date": "6 December 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "One of the top foreign shows I've ever seen.",
      "content": "Truly amazing. Action packed show. Relu and all the characters did a fantastic job. Thumbs up to the makers and everyone who made this show. Thank you. Hope to see season 4."
    },
    {
      "username": "usjdnb",
      "userUrl": "https://www.imdb.com/user/ur69009628",
      "reviewLink": "https://www.imdb.com/review/rw4134988",
      "warningSpoilers": false,
      "date": "19 April 2018",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Brutal yet clever and genuine.",
      "content": "It is not easy to depict the underworld. Especially the underworld of an ex communist country. The plot is great and it resembles reality more than many people would actually be inclined to believe. There is a huge cultural and social gap between the ex communist countries and theier western counterparts. Watching it is quite an experience. The slang is well researched, the actors are doing a great job, the directors wow captured the essence of the criminal life in Bucharest down to an almost impossible level of detail. Great job. Can't wait to see the next season."
    },
    {
      "username": "emilferent",
      "userUrl": "https://www.imdb.com/user/ur119386296",
      "reviewLink": "https://www.imdb.com/review/rw5800596",
      "warningSpoilers": false,
      "date": "5 June 2020",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Brutally humorist and real; and raw",
      "content": "Probably the best out of Romania so far; it's a gangster series, with gangsters and people from the low levels of society, so expect violence at all levels, and pastel language, but also brutally humorist and real; and raw; the pov is that of the underdog, the violence is generally non lethal (it's Romania after all where there aren't many firearms), and the story is building up during the episodes, from simple to complicated to complex, situations escalade; the acting is specifically Romanian (where the theater school overlaps the film school) and it quite theatrical in that sense, with some very good actors; and, of course, the highlight, is learning some of the things that are fundamentally bad in Romania: corruption, mafias... :)"
    },
    {
      "username": "danbad",
      "userUrl": "https://www.imdb.com/user/ur52565834",
      "reviewLink": "https://www.imdb.com/review/rw3190377",
      "warningSpoilers": false,
      "date": "11 February 2015",
      "rate": "10",
      "helpful": "40 out of 48 found this helpful.",
      "title": "Changed my perspective about Romanian cinematography",
      "content": "I was pleasantly surprised with this series!It was recommended to me by one of my friends ,and described as \"The best Romanian series he ever saw\", even though I was quite doubtful at first, as I saw the first episode I was convinced he was not exaggerating that much.The plot is pretty good for a low-budget series , certainly better than in many Romanian films, the director and the actors are amazing, especially the main character, Serban Pavlu. At first I thought the language was a little bit over the top , but as I watched another American series I realized that the amount of curses was not that big at all, and if you listened to the actual street language in Bucharest you would find it very similar. In conclusion, this is one of the best Romanian series ever made.It made me look better at Romanian films/series and it made me proud that I am Romanian! As a Romanian would say:\"Uite ca se poate!\"(It can be done!)."
    },
    {
      "username": "maestronicknrp",
      "userUrl": "https://www.imdb.com/user/ur64737238",
      "reviewLink": "https://www.imdb.com/review/rw6249475",
      "warningSpoilers": false,
      "date": "9 November 2020",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "America needs to step it up",
      "content": "I have discovered, and this may sound general, but foreign actors are much better than American actors today. Hands down...Hollywood has given up on talent but pumped into the election and social commentary where foreign actors really have taken the lead. Bravo to this show. I could not expect to binge watch 2 seasons in one day from the first hour of this show but by the second episode i was convinced this was unique. When i got to the second season i realized this show is masterful. funny, brilliant acting, brutal and shocking scenes, and captivating story. Bravo"
    },
    {
      "username": "sabinionescu",
      "userUrl": "https://www.imdb.com/user/ur109748754",
      "reviewLink": "https://www.imdb.com/review/rw5824783",
      "warningSpoilers": false,
      "date": "14 June 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "A very good show, definitely worth spending time watching it!",
      "content": "Very good cinematography, plot, acting, directing... almost realistic and very addictive. Some says here it resembles Sopranos but is more like Ray Donovan gripped on Romanian real and underground society's issues..."
    },
    {
      "username": "dintesa",
      "userUrl": "https://www.imdb.com/user/ur110587202",
      "reviewLink": "https://www.imdb.com/review/rw5291018",
      "warningSpoilers": false,
      "date": "30 November 2019",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Quite an experience!",
      "content": "Watching this movie proved to be an experience in itself! I am a Romanian expat, missing my country while searching for reasons to prove to me it was worthy leaving it. This movie shows me a fiction I could easily take as a possible reality in my home country, while leaving me hope this kind of events could not happen in reality. I loved the 3rd season the most: it has both the Hollywood scent, with a genuine Romanian perfume that anyone (Romanian or not) can easily sense! My congrats to the entire team!"
    },
    {
      "username": "e-mail9050",
      "userUrl": "https://www.imdb.com/user/ur22299880",
      "reviewLink": "https://www.imdb.com/review/rw3177738",
      "warningSpoilers": true,
      "date": "5 February 2015",
      "rate": "10",
      "helpful": "10 out of 13 found this helpful.",
      "title": "Surprise",
      "content": "Totally surprised by this show, it's as gripping as anything I've seen. The image looks shaky but it does it's job well, the editing must be at least correct since it doesn't attract attention in a bad way. The coloring and lighting must be fine since the atmosphere is correct. And the acting must be pretty good since I feel those characters are pretty real. The swearing might be considered too intellectual for gangsters maybe, but I see it just as a nice touch, in tune with the slightly comedic aura that the events have. It's nice to see some quality swearing instead of \"f--k you and f--k your mother's\". And that wouldn't even be realistic.I also like how the actor's faces reflect their role. People generally have a look and even if it's not polite to tell people 'you look like a crazy bastard, or you look insane, or you stupid and insane,' I guess actors have to be told. :)The only moment I didn't like so far was the \"partying\" at the end of the 6th episode. It was a bit off-tune I guess."
    },
    {
      "username": "azariel666",
      "userUrl": "https://www.imdb.com/user/ur27934356",
      "reviewLink": "https://www.imdb.com/review/rw5517601",
      "warningSpoilers": false,
      "date": "29 February 2020",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "One of the best TV series out there",
      "content": "A must watch for every fan of drama action series with a nice change of pace from the regular series of the same genre. Keep it up!"
    },
    {
      "username": "danmihaim",
      "userUrl": "https://www.imdb.com/user/ur94303059",
      "reviewLink": "https://www.imdb.com/review/rw4417620",
      "warningSpoilers": false,
      "date": "24 October 2018",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Sooo, Romania did it!",
      "content": "One Romanian TV-show made by HBO Europe which combines drama, thriller and crime. I powerfully recommend this TV series for it's story line and actors. Really love that minor details such as romanian music, romanian radios which is played when someone is driving. There are so many other details but I let you find them. 10/10!"
    },
    {
      "username": "Vladdhu",
      "userUrl": "https://www.imdb.com/user/ur4437550",
      "reviewLink": "https://www.imdb.com/review/rw3157229",
      "warningSpoilers": true,
      "date": "6 January 2015",
      "rate": "7",
      "helpful": "25 out of 37 found this helpful.",
      "title": "Captivating story",
      "content": "This drama is centered around an odd family man who must balance the life of an enforcer with that of a husband and father of two. Every twist and turn derives from this double life and it's by no means a new idea. Unfortunately we don't see too much character development which could have added a lot more depth to the story but nevertheless it does it's best to construct a plausible scenario.It abounds in street language which feels a little bit forced at times, giving the impression that the screenwriter wanted so much for this story to look and feel authentic that he over did it at times. Nobody squeezes so many clichés per minute of talking in real life (much of them being street language stereotypes from the 70-80s, so a little out of place).Overall it's interesting and worth watching but it could have been so much better with just a little more effort and a more seasoned screenwriter."
    }
  ],
  "errorMessage": ""
}