{
  "imDbId": "tt6025022",
  "title": "Justice League Unlimited",
  "fullTitle": "Justice League Unlimited (TV Series 2004–2006)",
  "type": "TVSeries",
  "year": "2004",
  "items": [
    {
      "username": "Better_TV",
      "userUrl": "https://www.imdb.com/user/ur87042131",
      "reviewLink": "https://www.imdb.com/review/rw4133053",
      "warningSpoilers": false,
      "date": "17 April 2018",
      "rate": "10",
      "helpful": "48 out of 51 found this helpful.",
      "title": "The Absolute Pinnacle of the Superhero Narrative",
      "content": "When I watched this show as a kid, I thought it was the biggest show on television. How could it not be? It aired in the evenings and was so... mature, for lack of a better word. It had voice real celebrity actors who weren't just phoning it in, who were selling these dramatic stories without a hint of irony.The writing was thoughtful and intelligent, reminding me of some of the other dramas my parents watched on the major broadcast networks... and yet it was a superhero cartoon. I am far from the first person to say that the dialogue and conversations on this show are so good, it's almost a disappointment when the inevitable earth-shaking superhero battles break out.But the show pulls those off brilliantly too. JLU has some of the most exciting fights you are ever going to see these characters wage outside of the comic books. There isn't a single live-action fight in any of the DC movies that even comes close to the level of action this show provides on an episodic basis - and I don't say that lightly.The three seasons of this show are an absolute love letter to comics fans, with dozens and dozens of ancillary DC characters getting the animated treatment for the very first time. It not only works from a narrative standpoint, adding more diversity to the classic lineup of Superman, Wonder Woman, Batman, etc., but it also creates a wonderful Star Trek-like feel on the Justice League watchtower. Plenty of scenes show characters commiserating and enjoying their leisure time on this futuristic moon-based headquarters, and it adds a fantastic familial feel to the show that, again, makes it feel more like a mature sci-fi show or broadcast drama.I treasure this show, and I also fear that the respect and gravitas this series showed towards the superhero narrative is a thing of the past. Sure, it's easy to have a cheeky Marvel movie where the characters crack jokes about how stupid they look, and it's easy to have a self-serious DC film that tries to make viewers forget the heroes are wearing costumes. But it's tougher to actually pay tribute to the original comic books in a thoughtful, developed way, to respect the men and women who actually created the narratives from which these pop culture icons have stemmed.That's something this show did day-in and day-out, episode by episode. It's why it stands apart from other animated American TV productions, and why it deserves every bit of praise I can give it."
    },
    {
      "username": "TheOny13",
      "userUrl": "https://www.imdb.com/user/ur23255110",
      "reviewLink": "https://www.imdb.com/review/rw3765340",
      "warningSpoilers": true,
      "date": "27 July 2017",
      "rate": "10",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Darker, more complex and more mature than its predecessor!",
      "content": "I don't know why this title was separated from the big Justice League title since its only an extension of the justice league members count. While Justice League had only the major 7 members in it, this one has so many that the title is suggestive for how many superheroes were in it.For start, this series has a lot of new ideas. There were countless episodes with new twists and original screenplay that just makes you want to see more. Then the more mature character of the show is actually because of the fact that almost each episode is centered around a certain superhero of the Justice League. So the viewer gets to see the situation from that superhero's perspective while the show also develops his character over the episode and over the whole show eventually. And there are sometimes unknown heroes that I for once never heard of them up until then than get episodes that develops them so much and make you care for them especially for the human side of them. That's the other thing I love about the show... the human side of the superheroes. It's not like everyone is invincible or a contest to see who is the strongest but rather a story about everyone and their relationship as they save the world and also their development as the show goes on.I cannot recommend this show any more than this. It's what every superhero show should be: character-driven story with interesting and ingenious plots that make for great and unpredictable episodes that keep you wanting more and satisfied for each one of them."
    },
    {
      "username": "mhorg2018",
      "userUrl": "https://www.imdb.com/user/ur22761455",
      "reviewLink": "https://www.imdb.com/review/rw4239653",
      "warningSpoilers": false,
      "date": "15 July 2018",
      "rate": "9",
      "helpful": "16 out of 18 found this helpful.",
      "title": "One of the best Superhero toons ever.",
      "content": "DC Animated strikes again. Staying true to the heroes, this show contains nearly every single animated hero from the DC verse. All done very well and some of the stories (such as the one where Kara/Supergirl remains in the future) are quite moving. Very well done."
    },
    {
      "username": "WeAreLive",
      "userUrl": "https://www.imdb.com/user/ur79460801",
      "reviewLink": "https://www.imdb.com/review/rw4162500",
      "warningSpoilers": true,
      "date": "12 May 2018",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Best DC cartoon alongside Young Justice",
      "content": "I know it has been a few months ever since I reviewed the first but the wait is finally over. This is the best DC alongside it's predorserror (Justice League) and Young Justice. Instead of just Superman, Batman, Wonder Woman, Green Lantern/John Stewart, Flash/Wally West, Martian Manhunter and Hawkgirl. We have even more heroes like Green Arrow, Question, Black Canary, Captain Atom and many more and a bigger league. In all honesty I had no idea who half of these DC characters were until I watched this show.We even have guest characters like Green Lantern/Hal Jordan, Speedy, Batman/Terry McGinnis, Captain Marvel and much more.The only flaws to the show was that we don't always see the original league together in every episode like we used to, the episodes aren't always two parters and some episodes can get a bit mature compared to the previous series but still safe for both kids and adults. Also I wasn't too happy about the fact that Supergirl left the League to join the Legion of Superheroes and some of the league members like Etrigan, Vibe, Crimson Avenger, Nightwing (cameo in the episode: Grudge Match) and Creepy had very little or no screen time. But that couldn't be helped because of the amount of episodes this show had: it could have lasted for another season or so.I am just glad the incident with Hawkgirl towards the end of the previous series was fixed and that she was a member of the League again. The voice acting, animation, art style and character development was good. I really wish today's superhero shows had all of these qualities. But instead kids are stuck with garbage like Justice League Action, Ben 10 2016 and Teen Titans Go!My favourite episodes are For The Man Who Has Everything, Kids Stuff, Hawk and Dove, Fearful Symmetry, The Return, Dark Heart, Wake the dead, The Once and Future Thing Part 2: Time Warped, The Doomsday of Satisfaction, Clash, Question Authority, Flashpoint, Panic in the Sky, Divided We Fall, Epilogue, Shadow of the Hawk, Flash and Substance, Dead Reckoning, Patriot Act, The Great Brain Robbery, Far From Home, Alive!, Ancient History and Destroyer. I liked how in the episode The Great Brain Robbery when Lex Luthor swapped bodies with Flash who was voiced by Michael Rosenbaum (the actor who was Lex Luther in the Smallville series) got to voice Lex Luther but in Flash's body.The ending was good when they had all of the heroes come together to fight the invasion of Apkolipse and the return of Darksied but I honestly never expected a key character in that episode to die.If you haven't seen Justice League Unlimited, then what are you doing here? Go and watch along with it's predecessor you don't know what you are missing out. Trust me you won't regret it ;)"
    },
    {
      "username": "Animany94",
      "userUrl": "https://www.imdb.com/user/ur78948186",
      "reviewLink": "https://www.imdb.com/review/rw4517467",
      "warningSpoilers": false,
      "date": "17 December 2018",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "A true superhero spectacle!",
      "content": "The 2001 series was a Justice League fanboy's dream come true and a great series in general, but with its continuation \"Unlimited\" WB Animation's team reached new heights!So much more is added to the DC Animated Universe: more heroes are brought on board without sacrificing quality of development, updating the animation, getting previous DCAU series significant treatments within JLU.I loved it as an animation fan, superhero fan, Batman fan and a Comics fan in general.I recommend it to everyone who loves action and good storytelling and every DC fan out there!"
    },
    {
      "username": "ThunderKing6",
      "userUrl": "https://www.imdb.com/user/ur71305899",
      "reviewLink": "https://www.imdb.com/review/rw5127839",
      "warningSpoilers": false,
      "date": "18 September 2019",
      "rate": "10",
      "helpful": "11 out of 18 found this helpful.",
      "title": "Great show not because of batman. Its a great show because its not about batman",
      "content": "This show is fun and the animation is flawless. There isn't just 1 story. It's basically DC Hero show where each hero gets their own story for different episodes.batman took the back seat and no one cared which is probably why it got cancelled.To the trolls giving me numerous unhelpful ratings. Don't stop I love the attention."
    },
    {
      "username": "trexman-79876",
      "userUrl": "https://www.imdb.com/user/ur64882980",
      "reviewLink": "https://www.imdb.com/review/rw4158360",
      "warningSpoilers": false,
      "date": "8 May 2018",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "The justice league at it's best!",
      "content": "This review is actually for both Justice League and Justice League Unlimited because to me Unlimited felt more of a continuation than a reboot.To start off this is probably the best place to see how the justice league should be like,not the movies, and while comics are great, this is still a cut above most of the justice league comics.There is not a single episode that I would call bad, in fact all of them are good to great with some being one of the best episodes I have ever watched, and what really sells it is the characters, and not just the main seven who have some of the best character development around, but even side characters like the Question, Green Arrow, and Huntress to name a few, all get fleshed out quite well that you can't help but love them.The art is not much to write about, but it gets the job done and when things start running the animation usually keeps up with some great scenes animated in there that help complement the well written story. The story is where this show shines, I mean holy hell do they know how to write good episodes with some even deserving awards, they connect seemingly unconnected episodes to each other bringing the whole thing together as a package (this happens mostly in Unlimited) nicely tying it all up into something special, but that isn't everything, what really made me love this show as fan of comics and superheroes, is the way they pay respect to the comics, it is clear that the writers, voice actors, animators, sound designers and anyone who worked on this show love the comics and they show that love with great pride, and that more than anything is what, at least to me, makes a show something to write home about."
    },
    {
      "username": "kerrodr",
      "userUrl": "https://www.imdb.com/user/ur103547771",
      "reviewLink": "https://www.imdb.com/review/rw6539220",
      "warningSpoilers": false,
      "date": "29 January 2021",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "The definitive Superhero/DC narrative outside of comics",
      "content": "If someone asked me \"I want to watch/know more about DC, where should I start?\" or \"Where can I watch Superman slap someone around?\" or \"Who is Batman?\" I would tell them to watch the DCAU. No ifs buts or maybes.Starting with Batman: TAS you have what I would call the best standalone Batman material, period. With the fantastic voice work of Kevin Conroy laying down the chops of Batman (when I read or think Batman, he is who I hear) and Mark Hamill voicing Joker and the rest of the supporting cast, followed up with complex but easy to follow story lines and it's fantastic gothic noir artwork, you get an unbelievable cartoon.Following on from that, you get my favourite of the series which is Superman: TAS. Move over Christopher Reeve and Henry Cavill, because this is Superman. It's charming, it's complex, it's fun, it's beautiful to watch and it stands out even today just like B:TAS. It has a mix of old looking technology mixed in with futuristic but believable technology, and bright artwork that just brings Metropolis to life. (Seriously DC and WB, why haven't you remastered this in Blu Ray like the rest? You are sleeping on Superman and it breaks my heart...)Then you have a few other gems like Static Shock and Batman Beyond which are worth a watch if they interest you.And then you get Justice League and Justice League Unlimited. I love Marvel (Spidey is my main man!) but please step aside MCU, this is how you do Superhero storylines. It throws everything the previous series had and mixes it all together with the added bonus of the other members of the Justice League. It's brilliant and it works.I'm not going to write anything more about these two shows, because if you are here and reading this, it means you are slightly interested to begin with and you shouldn't be reading me dribbling on, you should be watching the shows! Seriously just go do it. I mean it. Do it."
    },
    {
      "username": "amiranda-39274",
      "userUrl": "https://www.imdb.com/user/ur79825992",
      "reviewLink": "https://www.imdb.com/review/rw5481507",
      "warningSpoilers": true,
      "date": "13 February 2020",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "The Crown Jewel of Superhero shows:Full Series Analysis",
      "content": "For as long as I can remember, this show and these heroes have been apart of my life from childhood to my current 20s, and most likely for the rest of my life. This tv series stems from interconnected shows called the dc animated universe or DCAU for short. Starting from batman the animated series, which was the inception for this entire animated enterprise. It is honestly the gold standard for the dc universe in this media outside of its source material. Its what introduced me to numerous DC characters, and whether they were A list or D list they made me fall in love with this universe. This show displays passion for these characters and stories that elevates it far above just being a cartoon made for kids, it makes it an experience. This show is so good that if I even see a clip from it, I am immediately compelled to binge watch all of it. Which just happened since I watched J reviews on the entire DCAU, I decided to binge watch the show with some friends starting from batman the animated series to justice unlimited, and I will be giving my retrospective on it.Story: The majority of the DCAU is built on individual episodic adventures, but the longer story arcs show the true potential the story writers possessed and how creative they could be. They are fantastic! While I believe the 1st season of justice league is definitely the weakest in story ( And animation), it still has many impressive episodes. Justice league begins with an alien vision of earth and 7 superheroes coming together to save the planet, which are Superman, Batman, Wonder Woman, Green lantern, Jonn Jonez the Martian manhunter, Hawkgirl and the Flash, from then on they help protect the world together as a team. After the Thanagarian invasion, the justice league expands, creating a army of well organized superheroes. This however causes the governments of the world to be on edge, and a secret government group called Cadmus begin to devil methods and other superhumans to combat the league. The Cadmus arc is the most thematically powerful, it goes places you couldn't even imagine with the use of politics and authoritarian themes. And unlike the previous seasons, almost every episode in this season cultivates into a perfect finale. As a child,I couldn't truly appreciate this season until I was an adult. The show then continues into the last season called justice League unlimited, where villains lex Luthor and Gorilla grodd create their own group of supervillains called the secret society. The Secret society arc is not as impactful as the previous season, but it is a very entertaining watch and it leads up to the last finale. While the finale is nothing too grand in story, like the Cadmus arc was, it serves as one final epic spectacle as the justice league battles darkseid and his forces world wide. The show is truly something unique since important plot points are used from the batman and superman shows, not to mention everything is almost consecutive, which really weaves a larger overall story, that not many shows or even movies franchises can accomplish.Characters: The character writing in this show is so strong, that almost every character introduced is likeable and for those that are focused on are given an almost human personality that we the audience can relate to and admire. Even d list characters from the comics are given their moment to shine and become more dimensional. The show also takes the time to show us that the superheroes aren't always saving the day, and that they have lives too, they do this by showing their jobs, daily routines, their friendships and even romantic relationships. In fact the romantic dynamics used for some characters feels so genuine that it puts most rom coms to shame. Most characters are introduced into the story without prior introduction like it was done in the batman and superman shows, even 4 of the original 7 team were introduced in the first episode without any introduction and it worked because that's how effective this universe is, you know this is a world of superheroes, so the story organically has them be apart it, and its remarkable how well this works. It just shows how much the creative team understood the characters that were being used in this show. For me and im sure several others these are the definitive versions of these characters, their personalities, their voice acting, is just perfect and I am always found disappointed by other versions that don't even come close to the gold standard these versions set. In fact this universes batman is so amazing that he is considered among many, to be the best version of batman ever created. While the personalities of the characters are perfect their outward appearances can be off-putting at first, most of the men have box chests and chins, but with better animation, they become more impressive to look at. As for the women of the DCAU, let me just say, ever woman in this universe is 100% attractive, to the point I believe these are the hottest animated women ever created.Dialogue: The characters are given brilliant material to work with, that really fleshes out the characters, and despite their cartoony look you believe these are real people because of it. Some characters engage in regular daily conversations about relationships or work. Also infamously, this show possesses a lot of innuendo, it is hilariously used in a way that no child will understand it ( I know I didn't), but any adult will, and to be honest its more funnier being done like this, instead of being blunt like in current dc animated works. But there is still a lot of steamy moments in this show they will cause titillation. The humor used in this just gold and never fails to make me have a done grin on my face throughout the whole episode. But besides that, this show can be very deep at times, while discussing theological themes,there are many instances where you will feel almost enlightened by the dialogue used. For example, In The Return, Lex Luthor has to convince the god like android, amazo not to destroy the planet by giving him a speech on what his purpose in life is. The voice actors truly breathe life into these characters and I consider some of the voice acting and dialogue used in the show, as some of the greatest ever.Action: What can I say this is some of the best animated action ever, in every episode there is always a epic and unique fight, sure it can get repetitive at times but its always extremely entertaining. I love how the animation make each fight seem fast and full of energy, the movement and fluidity just keeps every fight exciting to watch. because of the animation style used, the characters can move freely without restraint. Despite being in a cartoon superhero universe, I admire that the animators never went too over the top, and tried to keep the action in a grounded reality, such as when you hear superman struggle to stop a plane, just hearing moans, grunts,and watching the struggle makes the action feel more believable and intense like you will feel the heroes are in danger. No character is ever completely powerful not even superman ( he even gives an epic speech in the finale on why he holds back) and it just makes each hero even more relatable by showing the effort they must put in to stop the threat. The action and storytelling works as a balance that provides the viewer with emotionally engaging and thrilling stories.Legacy: The finale of the series leaves me a wheeping mess as all the heroes come running down a flight of stairs to continue their duty of protecting the planet and everybody who lives on it, as the show comes to an end with the main trio of superman, wonder woman and batman,ending on batmans logo, which is fitting, since it was because of the batman the animated series that this show even exists. While there are many other good superhero shows even DC comic ones like young justice, I don't think any show or movie could ever top the greatness that is this show. What makes this show so unique is that it evolves from just the core group of heroes to a large cast of them, which could have ended in disaster, but this show demonstrated that it could be done with good writing and a well established universe. Most other shows that attempt this feel almost too messy, stale and artificial by comparison. This show is truly the highest bar that all other superhero related shows or movies should be measured up too, because this show is truly one of the greatest animated feats in history. While I don't think you need to watch every episode to enjoy the overall experience, there are specific episodes to watch in the batman, and superman shows that cultivate in your watch of this show. Such as when batman first meets superman in \" Worlds Finest\" and the superman show Finale, there are so many easter eggs and references to these shows, that you will have just as much fun recognizing them.This is truly one of the greatest animated shows ever made, that is so rewatchable that its addicting. But as much as I adore this show it is not perfect, it is still an action cartoon and therefore it has short stories and requires a lot of pointless action, not to mention the 1st season was very bland especially the animation, but like the animation the show improves considerably, until it turns into a gorgeous work of art. The writing is excellent and the character writing is even better making us care about each character and their struggles. Although I am saddened by the fact live action movies cannot surpass these cartoons, I believe its because this was the medium superheroes were destined to be portrayed in, the show serves as a broad canvas and is a perfect setting for great storytelling. I am eternally grateful to this show and these heroes for molding me from childhood in to a good man. If you haven't watched the entire DCAU please go do it. \"And the Adventure Continues\"..."
    },
    {
      "username": "vaaugustin",
      "userUrl": "https://www.imdb.com/user/ur43259978",
      "reviewLink": "https://www.imdb.com/review/rw7799987",
      "warningSpoilers": false,
      "date": "26 January 2022",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "This...is...GOD TIER!!!",
      "content": "Brooooo, this is such an incredible cartoon. The animation is sublime, the lineup of characters...I can't even man. I won't even get into how amazing this show was it's too much.To say that they should have had at least 10 seasons is an understatement. It's an absolute CRIME that they ended this gem so soon.Excuse me while I mourn this loss."
    },
    {
      "username": "belldog8",
      "userUrl": "https://www.imdb.com/user/ur35118533",
      "reviewLink": "https://www.imdb.com/review/rw4413740",
      "warningSpoilers": false,
      "date": "22 October 2018",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Best animated show ever!!",
      "content": "I know theres a lot of animated shows that could be considered the best, Young Justice and Batman the series to name a few, this one stands out because of its consistent writing. I cant believe they canceled this show. I just wanted to put my 2 cents in and praise this show. If you haven't checked it out, do so!! You wont be disappointed."
    },
    {
      "username": "F3RYX",
      "userUrl": "https://www.imdb.com/user/ur68051737",
      "reviewLink": "https://www.imdb.com/review/rw8276530",
      "warningSpoilers": false,
      "date": "26 June 2022",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "It is so good that it makes me upset about other superhero shows",
      "content": "I used to think the original (Justice league Animated) was better than Unlimited, but re watching it now I realize unlimited has so much soul and better stories.They shed the spotlight on so many other lesser known heroes while still making sure the stars of the show are the seven. It's such a nice balance.The stories are so relatable, personal, and smart. From the messy relationship of hawkgirl, to the fear and hate of the JL super powers, or insecurities of the no super power heroes in the league. It's all just so well written.As much as I love \"Young Justice\", it's just a little too serious and dark sometimes but this show doesn't even have that problem, it somehow found a perfect balance.As a Marvel fan, it's so upsetting to me that of all the Marvel Animated shows out there(there's a lot of Marvel series) only \"Spectacular Spider-Man\" has this kind of writing and heart. None of the \"Avengers\" animated series feel like this. They all feel like a quick something to cash on the success of the MCU instead of doing something deep and meaningful."
    },
    {
      "username": "romanedgar",
      "userUrl": "https://www.imdb.com/user/ur83932746",
      "reviewLink": "https://www.imdb.com/review/rw4263861",
      "warningSpoilers": false,
      "date": "1 August 2018",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Emotionally awesome",
      "content": "Pure heart With stories that make one a better leesin"
    },
    {
      "username": "kiehjohn",
      "userUrl": "https://www.imdb.com/user/ur43741095",
      "reviewLink": "https://www.imdb.com/review/rw3659754",
      "warningSpoilers": true,
      "date": "11 March 2017",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "A Bold Yet Effective Reboot (\"Justice League\" Spoilers)",
      "content": "\"Justice League Unlimited\" is a continuation of the animated series \"Justice League\". Until recently, I was unaware of Unlimited's existence, despite the original animated series being my favorite as a kid (as well as serving as an early introduction to my favorite superhero, J'onn J'onzz, AKA The Martian Manhunter). When \"Justice League\" was first aired in mid-November of 2001, it's animation quality was top-notch for its time. However, in the three and a half years it took to reach a third season, large strides had been made in animating technology and (subsequently) animation quality in general. As a result, the series was rebooted with better animation and renamed. However, unlike many other series, they DID NOT \"change\" their animation, but rather they improved it. Rather than using new methods, they simply improved the animation quality, and thus achieved a cleaner, brighter, smoother animation without changing their signature animation form and look. Also, the addition of superheros in the continuation (while being mostly for plot convenience) solves several problems, such as the resignation of Hawkgirl, as well as also serving to introduce other DC heroes, which was actually my main problem with the original series. The Justice League of the original series seemed to be isolated, and a magnet for all evil throughout the universe, yet hardly any other DC heroes from those extensive distances were introduced, nor were any of the minor heroes seemingly close to the main characters' powers. There were a few other minor negative spots (mainly poor grammar and plot holes) and a few other things were changed as a result of the unmentioned time-skip between the occurrences of the original's finale and the first episode of the reboot, but after getting over the minor changes, (Hawkgirl can't REALLY be gone... right? Please tell me I'm right... please??....) I came to find that this reboot is a rare occurrence of a continuation that rivals the greatness of the original series. I would definitely recommend this series and suggest any fan of the original series or DC Comics in general watch this series."
    },
    {
      "username": "Funkeysnow",
      "userUrl": "https://www.imdb.com/user/ur63955736",
      "reviewLink": "https://www.imdb.com/review/rw7058779",
      "warningSpoilers": false,
      "date": "24 June 2021",
      "rate": "",
      "helpful": "2 out of 2 found this helpful.",
      "title": "GOAT show",
      "content": "It's so good and the re-watchability factor is insane. It's not even only about nostalgia, this show is mint and even gets better the older you get as you understand things you couldn't understand as a kid.The way they introduced other DC characters without taking the main focus away from the OG Justice league members basically expands an amazing world that we didn't even know was there to begin with. Basically bigger and better. This is the only reason I'm a dc fan and to go a bit off topic, why the DCEU is just so disappointing."
    },
    {
      "username": "Mysterygeneration",
      "userUrl": "https://www.imdb.com/user/ur104853183",
      "reviewLink": "https://www.imdb.com/review/rw8532155",
      "warningSpoilers": false,
      "date": "10 September 2022",
      "rate": "7",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Best show that WB ever produce.",
      "content": "The \"Justice League\" changed into Justice League \"Unlimited\" after two seasons, adding colorful additions like the Green Arrow and Supergirl to the original roster of DC characters (Superman, Batman, Wonder Woman, Flash, Green Lantern, and Martian Manhunter).These new, half-hour episodes from Bruce Timm and company are more self-contained than their earlier animated series, but the new characters give the action new life, and the animation and language are on par with their earlier works (the \"Batman\" and \"Superman\" Animated Series as well as the former \"Justice League\").The show always make fans got nostalgia on it."
    },
    {
      "username": "tinytots2",
      "userUrl": "https://www.imdb.com/user/ur144605672",
      "reviewLink": "https://www.imdb.com/review/rw8072965",
      "warningSpoilers": false,
      "date": "19 April 2022",
      "rate": "7",
      "helpful": "2 out of 3 found this helpful.",
      "title": "An expanded (but not indisputably better) Justice League",
      "content": "A high point for the DC Animated Universe, Justice League Unlimited features an expanded cast of superheroes as they battle evil across the universe.Much like its predecessor Justice League, the stories are set in varied well-realized locations and take inspiration from sci-fi concepts, historical happenings and mythological legends. Balance is maintained between self-contained episodic plots and an overarching storyline, enabling meaningful character development and progression as well as the build-up of tension and suspense to explosive finales. Many lesser known heroes are included and humanized as themes like love, loss, trust and unity are touched upon. Finally, gorgeous character designs and jaw-dropping action sequences abound thanks to the beautiful art, excellent animation and creative storyboarding.Of course, including a larger cast means there is less focus given to individual superheroes and less time available to adequately flesh out stories; the return to largely single-episode narratives exacerbates this issue. The premise of humanity's mistrust of the superheroes' intentions is repeated far too often and apart from a few notable exceptions, the villains and antagonists are unremarkable. Power levels in general feel inconsistent and the tropes typical of superhero cartoons are very much present and evident.But to its credit, Justice League Unlimited has aged remarkably well. Apart from its aesthetic beauty, the show bears many uplifting messages while also having no dearth of superhero action. As long as one can suspend one's disbelief, it can be enjoyed and appreciated by viewers of all ages."
    },
    {
      "username": "crazelord",
      "userUrl": "https://www.imdb.com/user/ur110076728",
      "reviewLink": "https://www.imdb.com/review/rw7885173",
      "warningSpoilers": false,
      "date": "21 February 2022",
      "rate": "8",
      "helpful": "1 out of 2 found this helpful.",
      "title": "Better in some ways than JL, but more ok episodes",
      "content": "Rewatching these in 2022 I was originally under the impression that JLU was an upgrade from JL. And in some ways it is. I love the expanded cast, the show becoming more of a general DC superhero show rather than just a JL one but also making sure to maintain stories for the main cast. And the direction and action continued to improve.However with that change, and the change to more single episode stories I feel like some of the brilliant character depth and stories are lost from the previous series due to having less time to build things out. Still some absolutely stupendous writing and directing."
    },
    {
      "username": "GhostReacher",
      "userUrl": "https://www.imdb.com/user/ur113483266",
      "reviewLink": "https://www.imdb.com/review/rw8956624",
      "warningSpoilers": false,
      "date": "28 March 2023",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "The Series that told the Original Story",
      "content": "I have loved the new DCUAOM, it is much a much darker universe, embodying the character of DC. However despite how many excellent pieces they produce, it still pales in comparison to JLU.A proper Justice done to Justice League with excellent execution. It makes up where the modern movies lack, where there is some quite a lot.Most obvious one is the range of superheroes it introduced, rather then being stuck to same ones, which we have seen over and over again, characters like Vigilante, Vixen, Shining Knight, Question and several more were introduced to casual audience, and each of them was brilliant in itself.Another thing I came to love was the depth in story it told. A random scene between Vigilante and Knight about Clint Eastwood movies, was it necessary? No, did it add depth? Yes. It told a great other side of heroes, providing excellent depth to each of characters, something which I woe for in modern DCUAOM, where there is a lack of.This was my childhood and I loved it when I watched it as kid, still love it to this day.JLU will always be pinnacle of DC."
    },
    {
      "username": "BrianPhilbin",
      "userUrl": "https://www.imdb.com/user/ur1460586",
      "reviewLink": "https://www.imdb.com/review/rw7086590",
      "warningSpoilers": false,
      "date": "3 July 2021",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Decades Later, Still Being Expanded.",
      "content": "Few shows - particularly sequels - have a reach that continues to generate new content 15 years after it ended. This is one of those shows. Lots of snark, fun, adventure and great superheroics put to the test. The storylines are excellent, the Universe thought-out beforehand so that there are few continuity glitches (and certainly almost none that catch your eye right away) and the characters are still true to their published selves. This should have been the template for the DCEU."
    },
    {
      "username": "jascinth",
      "userUrl": "https://www.imdb.com/user/ur82846363",
      "reviewLink": "https://www.imdb.com/review/rw3871571",
      "warningSpoilers": false,
      "date": "30 November 2017",
      "rate": "10",
      "helpful": "4 out of 14 found this helpful.",
      "title": "Too many heroes",
      "content": "Not as good as preceding justice league but so as long Superman is there, the score will be 10.There's just too many superheroes involved & I actually hoped for Superman appearance in every episode I watched, even counted the scenes.Overall, it's worth to watch & you will crave for more."
    },
    {
      "username": "OliverJoya1998",
      "userUrl": "https://www.imdb.com/user/ur60057607",
      "reviewLink": "https://www.imdb.com/review/rw7851797",
      "warningSpoilers": true,
      "date": "10 February 2022",
      "rate": "7",
      "helpful": "0 out of 0 found this helpful.",
      "title": "Good, fun and enjoyable",
      "content": "I finally saw Justice League Unlimited and I though it was an excellent continuation of the first show. It is not perfect, and It has some major problems, despite that, it does live up to the legacy of the greatest superhero team of all time.The shortcomings are clear: less serialize storylines. Lack of introductions and context for a lot of characters. Rush conclusions and a lot less dialogue.The positives are also clear: excellent presentation. Fantastic character moments. Phenomenal villains and great heroes.While not as good as the first show, Justice League Unlimited is a good, fun and enjoyable show for all ages that should satisfy DC fans."
    }
  ],
  "errorMessage": ""
}