{
  "imDbId": "tt4508902",
  "title": "One Punch Man",
  "fullTitle": "One Punch Man (TV Series 2015–2019)",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "Irishchatter",
      "userUrl": "https://www.imdb.com/user/ur23577930",
      "reviewLink": "https://www.imdb.com/review/rw4350000",
      "warningSpoilers": false,
      "date": "20 September 2018",
      "rate": "9",
      "helpful": "40 out of 43 found this helpful.",
      "title": "Absolutely think one punch man is excellent",
      "content": "Honestly when I first heard of this anime, it was shown as a \"ok\" meme gif on Facebook and made me fall in love with the show as well as its main characters. I like how Saitama is this laid back hero but at the same time, does his best to be badass and save the world. I even like his robot companion Genos, he's also likeable too and actually kind of sweet for a tough ass looking hero himself. As well as that, he cares about Saitama and that really stands out with the show!Love the humour, the characters and its on going storyline. I'm even looking forward to season 2 and hopefully it's good as its original first season!"
    },
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw7866572",
      "warningSpoilers": false,
      "date": "14 February 2022",
      "rate": "9",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Thoughts on the first two seasons",
      "content": "The first season was excellent, with very great animation and impressive action sequences, being an amusing parody of action anime shows and the superhero genre.The second season, while not as good as the first, was still very entertaining to watch, even if the plot was a little bit more conventional. (With the addition of the typical \"rival\" character, though there were a couple of interesting aspects in his backstory)My vote vote for the first season is 9/10.My vote for the second is 8/10."
    },
    {
      "username": "Alan_H4",
      "userUrl": "https://www.imdb.com/user/ur25418935",
      "reviewLink": "https://www.imdb.com/review/rw3351729",
      "warningSpoilers": false,
      "date": "9 November 2015",
      "rate": "9",
      "helpful": "118 out of 141 found this helpful.",
      "title": "Blown away - Like Saitama the anime itself has no limit's to its awesomeness!",
      "content": "I am truly tempted to give One punch man a 10 but in my opinion there is no perfection. There is near perfection and one punch man is that. The first episode that i saw, i laughed so hard that i almost fell off my chair. As it progresses to the next episodes they try to combine the comedic and the seriousness of the story together, and they manage to do that. I feel like that the writers are truly doing this with a feeling of passion and next to it they enjoy the absurd fighting sequences. Opinion on the last two episodes of season 1:My thoughts: The amount of awesomeness put in this two episodes is beyond imagination. It's just incredible how they build up the climax to the end and to show the endless powers Saitama has. Although it's a parody it doesn't stop me as a viewer to enjoy the anime and accept it as part of something great. When i say something great, i mean putting it next dragon ball, and other incredible animes. It's obvious to the rational thinker that a lot of elements like the characters design (boros etc) are similar to Dragon ball, and that it's influenced by them. BUT what makes it so different one might ask himself: Just by observing the amount of details put in to the fighting sequences will tell you that 'one punch man' is a serious anime (in some ways). Dragon ball is nostalgic and has a great history and character development behind its series and one punch man will have to gain more years in order to obtain the status DB has. What i'm trying to say is that the detail put in to the fighting scenes in one punch man are far beyond what other anime have achieved or tried to... It's a masterpiece in way... And that's what gave this anime a 9 out of 10. He destroys all of his enemies with one punch and mocks them like they were nothing. But it still does not get boring and that's the reason why this anime is a great success. Make the details look sublime and the fighting sequences beyond comprehention, mix it with a flavor of humor/comedy and you've got in my eyes the perfect anime (action fans). Just take a good look at the episode where Saitama fights Genos and you'll get the perfect picture on why this anime is amazing (there are youtube videos with that scene). It even got me to search some more info about this anime on the internet. There are youtube videos and articles about the origin of one punch man. It's interesting to take a look. I hope this show keeps up the quality as it is and i can't wait for more! ----> after watching the last two episodes i can only imagine where it is headed. This anime has proved (after this season) that it will not fail to entertain it's anime loving fans!"
    },
    {
      "username": "facecht",
      "userUrl": "https://www.imdb.com/user/ur35470298",
      "reviewLink": "https://www.imdb.com/review/rw3355195",
      "warningSpoilers": false,
      "date": "15 November 2015",
      "rate": "9",
      "helpful": "119 out of 138 found this helpful.",
      "title": "One-Punch Dude",
      "content": "A new perspective in the Japanese Anime. No mainstream characters, not a cliché story or plot, it has a great potential in becoming even better, personally I didn't read the manga(the comic) and in my opinion this anime show is really watchable and I recommend it to everyone no parental advisory, call them even and watch it together.Saitama is very interesting character you'll never know what he is going to do next or when is he going to punch the opposer.Don't hesitate and start watch this great show you won't be disappointed, and you'll thank anyone and everyone who made you watch it."
    },
    {
      "username": "baumhenrik",
      "userUrl": "https://www.imdb.com/user/ur80388571",
      "reviewLink": "https://www.imdb.com/review/rw5441386",
      "warningSpoilers": false,
      "date": "27 January 2020",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Epic",
      "content": "One Punch Man has the perfect balance between powerful planet bursting action scenes and a chilled main character that doesn't seem to bother about anything going on. The animation of the first season is top notch the way the images display the impact and speed of the fights is just mind blowing and a must watch for every animation lover. Also there's this great humor and perfect timing that makes One Punch Man almost a parody for so many other Anime shows. When Son Goku's gotta train his butt off to defeat his enemies Saitama is already over this point. He just needs one punch to blow away whatever's standing in his way. This idea is just brilliant to me and works surprisingly well. Watch this show you won't regret it."
    },
    {
      "username": "kaangunderen",
      "userUrl": "https://www.imdb.com/user/ur58663563",
      "reviewLink": "https://www.imdb.com/review/rw3331575",
      "warningSpoilers": false,
      "date": "8 October 2015",
      "rate": "10",
      "helpful": "347 out of 372 found this helpful.",
      "title": "Completely Hilarious and Full of Quality",
      "content": "One Punch Man is one of the funniest and most entertaining anime series I've ever watched in my entire life. Even though it is a newly started anime, the first episode was highly anticipated throughout the anime community, and it was definitely golden in my eyes, with high quality animations and a hilarious story line. The main character, his enemies and the life he lives is a complete mockery of other popular anime plots, both from recent and present anime's. The lines and the dialogs in the episodes are full of puns and jokes, with a satiric sense of comedy injected into them. I highly recommend that you watch this anime, as it will definitely at least bring a smile to your face, and you won't regret the time you spent to watch it."
    },
    {
      "username": "gav_c",
      "userUrl": "https://www.imdb.com/user/ur72417233",
      "reviewLink": "https://www.imdb.com/review/rw4979731",
      "warningSpoilers": true,
      "date": "6 July 2019",
      "rate": "9",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Hilariously good",
      "content": "I had to watch this with me living in Japan and everyone mentioning wanpanman. From the start I found it hilarious with Saitama deadpan attitude on everything and how bored he his on fighting like it's an inconvenience. I'm not a massive fan of anime but this is good. I recommend it to everyone."
    },
    {
      "username": "coles_notes",
      "userUrl": "https://www.imdb.com/user/ur105348721",
      "reviewLink": "https://www.imdb.com/review/rw8369050",
      "warningSpoilers": false,
      "date": "25 July 2022",
      "rate": "8",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Great",
      "content": "Based on the manga of the same name created by One, One-Punch Man follows Saitama, a super hero whose incredible strength allows him to defeat all enemies in a single punch. Definitely a farce of the entire anime superhero / fighting genre, the plot lines and humour are superb for what it is, if you're already a fan of these style fighter anime then you should find this quite funny. Netflix is currently carrying the first season, but you'll need Tubi or another service to get the latest season 2 which I just finished up. Unfortunately a new director and animation studio took over for the second season, and while its still quite good, it doesn't near live up to the quality of the first. The first season of One-Punch Man is in my opinion some of the highest quality animation in the last decade, and I could not recommend it more."
    },
    {
      "username": "mhorg2018",
      "userUrl": "https://www.imdb.com/user/ur22761455",
      "reviewLink": "https://www.imdb.com/review/rw4158105",
      "warningSpoilers": false,
      "date": "8 May 2018",
      "rate": "10",
      "helpful": "16 out of 19 found this helpful.",
      "title": "Absolutely Hysterical!",
      "content": "One of the best superhero satires ever made, One Punch Man is, basically, the story of a guy who wills himself to become the most powerful hero of all time. I've only seen the first season, and I hope to see more. One Punch spends most of his time bored - as few if any can survive one of his blows. My second favorite character is the short tempered green haired telekinetic heroine, Tornado. This really has to be watched because it is so damn funny."
    },
    {
      "username": "Thomas_sharma",
      "userUrl": "https://www.imdb.com/user/ur52592608",
      "reviewLink": "https://www.imdb.com/review/rw3343182",
      "warningSpoilers": false,
      "date": "25 October 2015",
      "rate": "10",
      "helpful": "114 out of 132 found this helpful.",
      "title": "A sparkle of sure brilliance",
      "content": "This series has blown me away within the first 3 episodes, it's hilarious, the action is great, the characters are interesting and not to mention its original design. The main thing that i love about this Anime is the potential it has to be something amazing due to the Manga being so excellently written. Its been a long time since i've seen an Anime that has peaked my interest so much, if you are a fan of Anime you will not be disappointed! Saitama (the main protagonist) is hilarious. Anime seems to have peaked recently due to the standard being set by shows such as Attack on Titan and I believe this show will set a new standard for Animes similar to its genre."
    },
    {
      "username": "vipul_chaturvedi",
      "userUrl": "https://www.imdb.com/user/ur91465446",
      "reviewLink": "https://www.imdb.com/review/rw7368291",
      "warningSpoilers": false,
      "date": "22 September 2021",
      "rate": "9",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Imagine Deadpool, but manga version",
      "content": "Imagine Deadpool, but manga version. The de facto superhero parody series of this decade. Brilliant, impressive, and hilarious in every respect. For a series all about an overpowered protagonist, it got my heart pumping and emotionally invested. Also, Tatsumaki is a loli goddess."
    },
    {
      "username": "drewsterwang",
      "userUrl": "https://www.imdb.com/user/ur26467048",
      "reviewLink": "https://www.imdb.com/review/rw4896201",
      "warningSpoilers": true,
      "date": "29 May 2019",
      "rate": "7",
      "helpful": "81 out of 96 found this helpful.",
      "title": "First Season Is a Masterpiece",
      "content": "One Punch Man is a send-up of anime series from the past that turns tired tropes on their head and breaks up the regular formula seen in series such as Dragonball Z. The main character, Saitama, doesn't have to struggle, level up, or learn new special attacks to defeat the villains over dozens of episodes. His difficulties are mainly interpersonal and societal as he tries to fit into a world of over-the-top heroes and monsters while remaining hilariously deadpan and clueless in contrast. Highlights are not the fights and monsters, but the depiction of bureaucracy and boring details of everyday life that Saitama goes through. Season 1. 10/10.Season 2 (8 episodes in so far) is becoming what it used to satirize. We see far less of Saitama and focus shifts to an extremely powerful monster association and the pantheon of heroes fighting agains unbeatable odds to stop them. Saitama is conveniently removed from the action by way of a banal martial arts tournament with his only gag being that he has to keep a wig on his head while fighting. The fights surrounding the bloated cast have become front and center, robbing the series of its originality. Season 2 (so far) 5/10. It would be far funnier to see Saitama dealing with having a fan club than watching dozens of heroes engage in predictable monster fights."
    },
    {
      "username": "newindex",
      "userUrl": "https://www.imdb.com/user/ur61129963",
      "reviewLink": "https://www.imdb.com/review/rw3351938",
      "warningSpoilers": false,
      "date": "5 November 2015",
      "rate": "10",
      "helpful": "270 out of 295 found this helpful.",
      "title": "Interesting Plot. Likable Characters. Amazing Animation!",
      "content": "One Punch Man follows a hero that can end all of his fights with one punch, and that makes him so frustrated. Now you might be thinking, what's so interesting about that? Don't you want to see the hero struggling to kill his enemy? Well not this time. Here, you will see a super-overpowered hero struggling to find a stronger enemy, struggling to feel the thrill and adrenaline of the fights he once felt when he was weak. Was his training to become strong not worth it after all?This anime is so random so the plot is unpredictable, in good ways. The animation and the fight scenes are SUPERB! It has the best fight scenes I have ever seen in all of the animes I have ever watched. Go ahead and watch it! It will be worth your time."
    },
    {
      "username": "James_096",
      "userUrl": "https://www.imdb.com/user/ur63305386",
      "reviewLink": "https://www.imdb.com/review/rw3351615",
      "warningSpoilers": true,
      "date": "9 November 2015",
      "rate": "10",
      "helpful": "39 out of 46 found this helpful.",
      "title": "Just AWESOME!!!",
      "content": "I'd never heard of this manga..So,when I saw the anime getting rave reviews,I decided to give it a shot...Trust me,One Punch Man did not disappoint.OPM tells about the life of Saitama,a guy who can defeat enemies with just one punch,OPM acts as a parody of sorts to the endless amounts of shonen action anime that Japan produces(u know,DBZ,Naruto and the like).The anime is just comic gold with Saitama frustrated that no enemy is of his caliber(Again,a parody of the classic shonen trope).Where other series show the hero training to his peak,the guy's already at his peak..The anime is just comic gold with Saitama's expressions being the best part of it and just because it's a parody doesn't mean the action is crappy...It's the opposite actually...OPM has the best fights I've seen in ages...All in all,You should definitely watch OPM!!"
    },
    {
      "username": "seige-hound",
      "userUrl": "https://www.imdb.com/user/ur39024931",
      "reviewLink": "https://www.imdb.com/review/rw3365490",
      "warningSpoilers": false,
      "date": "2 December 2015",
      "rate": "10",
      "helpful": "27 out of 36 found this helpful.",
      "title": "One of the best action shows since Avatar, period",
      "content": "I'll admit I'm not the biggest fan of anime. I love Studio Ghibli and Mamuro Hosoda's stuff, and I enjoyed Sword Art Online enough (even though it's really flawed) and Clannad is my favourite romance show, but beyond that, I find Anime really hard to get into.Not One-Punch Man. This show is incredible.First the opening. This opening doesn't get old. We got this fantastic Power Metal theme song, paired up with some incredible stills. There's not too much animation in the opening actually, but the way the monsters are framed against the hero shows how powerful Saitama really is.So the main crux of the story follows Saitama. He's kinda bored with life at the beginning because he's too powerful. In the first episode, he defeats a massive giant with a single punch, and every other monster he faces meets a similar fate. You'd think that would make the show boring, since there's no real threat to his life, but the creators of the show found a way out of that problem by introducing a large and diverse cast of side characters.The quality of animation is impressive, with expressive comedy matched up with some amazing fight choreography. I'm reminded of the better parts of Man of Steel when I watch the fight scenes. There are moments where the fights are paused for characters to spout exposition, but they're not too frequent, and they're well done enough to ignore.I feel the one minor flaw, that may be remedied later in the show, is that there is a lack of emotional pull. I get that this is more of a Shonen show, and that the action is the main focus, but I would appreciate a little more heart to match with the flair. An example I think of would be Avatar, but this is a minor complaint that doesn't necessarily need to be fixed in order to make this show great.Overall, I'm glad I got into this, and I hope that the show continues to improve as it goes along."
    },
    {
      "username": "simone-email",
      "userUrl": "https://www.imdb.com/user/ur48380731",
      "reviewLink": "https://www.imdb.com/review/rw3339176",
      "warningSpoilers": false,
      "date": "20 October 2015",
      "rate": "8",
      "helpful": "137 out of 160 found this helpful.",
      "title": "First episode and I already love it",
      "content": "I saw this anime online once and I finally took the time to watch it. Needless to say, the first few episodes are none less than EXCELLENT! It's action packed, funny, has just the right amount of hot people for the classic anime needs. As soon as I watched the first episode I found myself watching all of them and telling all my friends to watch it; it's so amazing, something to be put to the top, next to Death Note or Fullmetal Alchemist, or Dragon Ball Z. Definitely my favorite anime currently. There's not that much to say except that it's definitely a comedy, you'll definitely laugh or have a good chuckle. It is very gory however, not that suitable for younger anime fans. Though if you've watched Neon Genesis Evangelion or Future Diary, this show is most likely in your range of comfort and you'll most likely enjoy this anime as much as I have. Again, great anime so far."
    },
    {
      "username": "eerdem92",
      "userUrl": "https://www.imdb.com/user/ur41196443",
      "reviewLink": "https://www.imdb.com/review/rw3353228",
      "warningSpoilers": false,
      "date": "11 November 2015",
      "rate": "10",
      "helpful": "206 out of 228 found this helpful.",
      "title": "Definitely a must-watch anime",
      "content": "I didn't know about the anime when its manga existed but many people told me that \"this thing is brilliant you gotta read it\" and I was like \"meh\" and didn't bother much. However, recently I saw that the show is being animated and 6 episodes were released and I just wanted to give it a shot. And I was like.. Boom! Absolutely blown away with the first episode and watched all 6 episodes without a break and I can say this is currently the best anime out there you can watch. The story is about a bald superhero defeating every bad-ass enemy in his way with a single blow. The animation is spectacular(better than any anime made IMO), the jokes and puns are hilarious, most importantly the plot and pacing of the story is so fast and there are definitely zero windy/exaggerated moments scenes. So, every tiny bit of second you watch has a value and NEVER boring since they packed 22 manga episodes into 6 anime episodes so far. I watched over a hundred anime but this is the first one making me impatiently wait for Sundays. Just go and watch it, NOW!"
    },
    {
      "username": "jasonlonski",
      "userUrl": "https://www.imdb.com/user/ur84362974",
      "reviewLink": "https://www.imdb.com/review/rw8393374",
      "warningSpoilers": false,
      "date": "2 August 2022",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Yup",
      "content": "I hated anime until this one. Now i been reading manga, watching anime, buying shirts and all that crap you don't need. They really need this to come back."
    },
    {
      "username": "Big_Chez",
      "userUrl": "https://www.imdb.com/user/ur156604760",
      "reviewLink": "https://www.imdb.com/review/rw8703608",
      "warningSpoilers": false,
      "date": "30 November 2022",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Honestly Amazing",
      "content": "When I thought of One Punch Man I thought that it was just a spoof show making fun of other anime. However, after giving it a chance I came around to find out I was very wrong. This show is amazing, definitely a top 5 anime for me. It's funny, action-packed, and you will always be on the edge of your seat. Saitama is one of the most badass characters I have ever seen, the fight scenes make this show perfect. Some may find this show un-interesting because of how powerful he is, and this may be true. I think the underlying goal of Saitama's character is that he is ultimately trying to find someone strong enough to give him a challenge. I think this show is an example of \"you'll either love it or hate it.\" Give it a try I promise you, you'll be hooked in an instant."
    },
    {
      "username": "lucasdenomme",
      "userUrl": "https://www.imdb.com/user/ur63297001",
      "reviewLink": "https://www.imdb.com/review/rw3341431",
      "warningSpoilers": false,
      "date": "19 October 2015",
      "rate": "10",
      "helpful": "167 out of 190 found this helpful.",
      "title": "One Punch Man a must watch",
      "content": "This anime which has released a few weeks ago is a masterpiece created by renown anime producer, Madhouse. It sat ires classical anime genre making it an extremely hilarious show which will bring many grins to those who have already watch other anime.Perhaps the most notable accomplishment of this anime so far is the main hero Saitama who through his plain bald appearance makes us rejoice as he reveals tiny fractions of his power against formidable foes. Combine this with an epic soundtrack, amazingly drawn fight scenes and the badassery that it Saitama you get yourself an awesome anime."
    },
    {
      "username": "dwarves-36003",
      "userUrl": "https://www.imdb.com/user/ur65254000",
      "reviewLink": "https://www.imdb.com/review/rw3407685",
      "warningSpoilers": true,
      "date": "2 February 2016",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "Best. Anime. Ever.",
      "content": "When I first heard of One Punch Man, I was skeptical of its premise. But after watching the first episode, I was immediately hooked! I've never seen a show that blends action and comedy so well! The music is great and the characters are very well drawn and acted out.It may only have English subtitles and only has twelve episodes, I still am enthralled. I also heard that the release date for the second season is sometime late this year, so I don't have to go through another Attack on Titan black hole thing again.If you are new to anime or even manga, One Punch Man is the right show for you."
    },
    {
      "username": "sohamvhadgir",
      "userUrl": "https://www.imdb.com/user/ur156302380",
      "reviewLink": "https://www.imdb.com/review/rw8734921",
      "warningSpoilers": false,
      "date": "14 December 2022",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "saitma",
      "content": "Differnent and interting anime to watch the stroyline of this anime is diferent i except i get on 1 ep but this 5 episodes are intrting then i thought you shuould check this anime at once it sgives you fun and enjoy animation is grate dialogue and charater is alos excellent than i thought all charater devlop well and written also you can watch this episodes one day only threr is 12 episodes you can finish the more you watch the more you enjoy the anime this beat anime i can recommend foryou is one punch man the saitma stroy is good to go the saitama charateres is more interting love the chaeraterr."
    },
    {
      "username": "alansabljakovic-39044",
      "userUrl": "https://www.imdb.com/user/ur70682706",
      "reviewLink": "https://www.imdb.com/review/rw4680279",
      "warningSpoilers": false,
      "date": "22 February 2019",
      "rate": "8",
      "helpful": "8 out of 10 found this helpful.",
      "title": "So far so good",
      "content": "It is really entertaining and funny but it really doesn't have any story. I feel like every episode could be standalone. Animation is great and charachters are funny. And ending theme song is amazing."
    },
    {
      "username": "doomedmac",
      "userUrl": "https://www.imdb.com/user/ur111092901",
      "reviewLink": "https://www.imdb.com/review/rw5393450",
      "warningSpoilers": false,
      "date": "9 January 2020",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Kind of amazing",
      "content": "The characters, animation, and story are all very good. Also, this show is really interesting and really funny. A must-watch for anime fans."
    },
    {
      "username": "way2smart",
      "userUrl": "https://www.imdb.com/user/ur52269947",
      "reviewLink": "https://www.imdb.com/review/rw3382441",
      "warningSpoilers": true,
      "date": "28 December 2015",
      "rate": "9",
      "helpful": "14 out of 17 found this helpful.",
      "title": "One Punch Man (OPM) will knock your socks off!",
      "content": "Let me start by saying that I never skipped the opening song of OPM. The opening (albeit somewhat cheesy) fitted this over-the-top and outrageously cool anime really well. My scouter was reading hype levels of over 9000 when the \"Hero\" opening kicked in (or punched in?).Studio Madhouse pulled out all their stops when animating this 12-episode wonder.Protagonist Saitama is a hero for fun, an ordinary human who managed to acquire extraordinary strength. Hero Saitama's strength corresponds to the titular \"One Punch Man\" as he effortlessly beats monstrous opponents to pulp with a single punch. This anime is a satire of superheroes and the whole idea of heroes beating stronger villains effortlessly each time (it takes this premise to an absurd level). Saitama is already (presumably) at the pinnacle of his strength. He gets disappointed each time that no opponent lives up to his power. Normally, formulaic battle anime focus on a protagonist who trains religiously to obtain new powers and skills in order to keep up with a rival while beating powerful enemies. However, OPM does not follow the norm.Surprisingly this anime stills grabs our attention despite us knowing that the protagonist is absurdly strong from the very beginning and that he will probably never lose a fight. This anime manages to captivate us with this rather plain hero (he is bald and possesses no fancy attacks). With the arrival of Genos (a cyborg hero who is very flashy), the simplicity of hero Saitama becomes apparent. Genos's repertoire of attacks, masculine appearance and seriousness can be juxtaposed to Saitama's plain combat skills, low-key appearance and nonchalant attitude. Interestingly, while Saitama's physical hero feats are commendable and absolutely insane, it is his virtues that makes him a hero in every sense. Saitama does not care that he is being labelled as a fake (lambasted by society); he is also prepared to relinquish his own worth to preserve the value of other heroes. The relationship between Saitama, Genos and the Hero Association is also very interesting.Give this 12-episode anime a watch. Watch at least 3 episodes before writing this off as this: \"Oh... This egg-headed guy just beat an alien with one punch. Where is the climax? This is stupid. Does this show even have a premise?\"The anime stays true to the manga and is full of vibrant colours, explosions, sonic booms, etc. The animation is eye candy. The whole concept is just fresh.OPM has already spawned debates like Saitama versus Goku or Superman, and it has engaged the interest of superhero lovers. The final fight in OPM was fantastic. Saitama will be talked about for a very long time. And as I am writing this, I am listening to OPM's intro."
    }
  ],
  "errorMessage": ""
}