{
  "imDbId": "tt4508902",
  "title": "One Punch Man",
  "fullTitle": "One Punch Man (TV Series 2015–2019)",
  "type": "TVSeries",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "One-Punch Man",
  "url": "https://en.wikipedia.org/wiki/One-Punch_Man",
  "plotShort": {
    "plainText": "One-Punch Man (Japanese: ワンパンマン, Hepburn: Wanpanman) is a Japanese superhero manga series created by One. It tells the story of Saitama, a superhero who, because he can defeat any opponent with a single punch, grows bored from a lack of challenge. One wrote the original webcomic manga version in early 2009.\r\nA digital manga remake, illustrated by Yusuke Murata, began publication on Shueisha's Tonari no Young Jump website in June 2012. Its chapters are periodically compiled and published into individual tankōbon volumes. As of June 2023, 28 volumes have been released. In North America, Viz Media has licensed the remake manga for English language release and has serialized it in its Weekly Shonen Jump digital magazine.\r\nAn anime adaptation produced by Madhouse was broadcast in Japan from October to December 2015. A second season, produced by J.C.Staff, was broadcast from April to July 2019. A third season has been announced. Licensed in North America by Viz Media, it premiered in the United States on Adult Swim's Toonami programming block in July 2016. The second season premiered on the block in October 2019.\r\nBy June 2012, the original webcomic manga surpassed 7.9 million hits. By April 2020, the manga remake had sold over 30 million copies worldwide, making it one of the best-selling manga series of all time.",
    "html": "<p>One-Punch Man (Japanese: ワンパンマン, Hepburn: Wanpanman) is a Japanese superhero manga series created by One. It tells the story of Saitama, a superhero who, because he can defeat any opponent with a single punch, grows bored from a lack of challenge. One wrote the original webcomic manga version in early 2009.</p><p>A digital manga remake, illustrated by Yusuke Murata, began publication on Shueisha's Tonari no Young Jump website in June 2012. Its chapters are periodically compiled and published into individual tankōbon volumes. As of June 2023, 28 volumes have been released. In North America, Viz Media has licensed the remake manga for English language release and has serialized it in its Weekly Shonen Jump digital magazine.</p><p>An anime adaptation produced by Madhouse was broadcast in Japan from October to December 2015. A second season, produced by J.C.Staff, was broadcast from April to July 2019. A third season has been announced. Licensed in North America by Viz Media, it premiered in the United States on Adult Swim's Toonami programming block in July 2016. The second season premiered on the block in October 2019.</p><p>By June 2012, the original webcomic manga surpassed 7.9 million hits. By April 2020, the manga remake had sold over 30 million copies worldwide, making it one of the best-selling manga series of all time.</p>"
  },
  "plotFull": {
    "plainText": "One-Punch Man (Japanese: ワンパンマン, Hepburn: Wanpanman) is a Japanese superhero manga series created by One. It tells the story of Saitama, a superhero who, because he can defeat any opponent with a single punch, grows bored from a lack of challenge. One wrote the original webcomic manga version in early 2009.\r\nA digital manga remake, illustrated by Yusuke Murata, began publication on Shueisha's Tonari no Young Jump website in June 2012. Its chapters are periodically compiled and published into individual tankōbon volumes. As of June 2023, 28 volumes have been released. In North America, Viz Media has licensed the remake manga for English language release and has serialized it in its Weekly Shonen Jump digital magazine.\r\nAn anime adaptation produced by Madhouse was broadcast in Japan from October to December 2015. A second season, produced by J.C.Staff, was broadcast from April to July 2019. A third season has been announced. Licensed in North America by Viz Media, it premiered in the United States on Adult Swim's Toonami programming block in July 2016. The second season premiered on the block in October 2019.\r\nBy June 2012, the original webcomic manga surpassed 7.9 million hits. By April 2020, the manga remake had sold over 30 million copies worldwide, making it one of the best-selling manga series of all time.\r\nPlot\r\nOn a supercontinent version of Earth that has four Moons, powerful monsters and supervillains wreak havoc. The millionaire Agoni creates the Hero Association, which employs superheroes to fight evil. Saitama, an unassociated hero, hails from City Z and performs heroic deeds as a hobby. For three years, he has trained enough to defeat any enemy with a single punch, his unmatched strength leaving him bored. He becomes a reluctant mentor to Genos, a cyborg seeking revenge against another cyborg who killed his family and destroyed his hometown, after Saitama defeats a monster that defeated Genos.\r\nSaitama and Genos join the Hero Association, hoping to attain notability, but Genos instantly obtains an S-Class rank; meanwhile, due to scoring low on the written exam despite having a perfect score on the physical exam, Saitama only becomes a C-Class hero. His feats remain unnoticed even after saving people from an asteroid and then a sea monster, barely getting himself promoted to B-Class. Later, shortly before her death, the seer Shibabawa predicts that the world is in great danger as the alien Boros invades the planet. The heroes kill the invaders and destroy Boros's ship as Saitama defeats Boros in single combat.\r\nMonsters begin appearing faster while the rogue martial artist Garo, a former apprentice of the hero Bang, and self-dubbed \"Hero Hunter,\" begins terrorizing heroes. Due to childhood bullying, he holds a grudge against everything \"heroic.\" The heroes learn that the monster influx comes from the Monster Association, an organization of monsters under City Z intent on destroying the Hero Association. They attack various cities, recruit fighters by offering them \"monster cells\" that mutate humans into monsters, and kidnap a Hero Association executive's son. Garo bonds with Tareo, a child who idolizes heroes, as he hunts down more heroes, his combat prowess slowly rising. The Monster Association attempts to recruit him and kidnaps the child when Garo refuses. He storms the Monster Association HQ trying to rescue the child but ultimately gets captured.\r\nThe Hero Association assaults the headquarters to rescue the two children, causing a battle that destroys City Z and kills almost every monster. Saitama meets the highest-ranked hero Blast during the raid when he arrives to collect artifacts, who warns him of a threat known as \"God.\" Many heroes are heavily injured when Garo emerges, mutated into a monster from the fighting. Unable to match the power of Saitama, Garo receives some of \"God's\" power when he meets it in a vision, causing him to emit radiation that kills all the heroes, including Genos by ripping out his core to get Saitama to fight him seriously. He briefly matches Saitama in a brutal battle that sends them across the solar system. After Saitama defeats him, Garo becomes distraught over Tareo's death and teaches Saitama to time travel before \"God\" kills him. Saitama goes back in time and subdues Garo before he killed the heroes, destroying his monster mutation and cosmic power. Despite the objections of the other heroes, Saitama spares Garo and lets him flee after Tareo stops them. Only Genos, who reconnected with his core from the original timeline bought by Saitama (who seemed to remember nothing of his battle and time travel with the original Garo), remembers the entire events of the original ominous future caused by Garo.\r\nWith the Monster Association destroyed, Saitama gets promoted to A-Class for defeating Garo. As the battle destroyed his apartment, he relocates to the Hero Association's HQ in A-City. The Hero Association's poor performance causes public opinion of them to plummet. Several heroes and officials decide to retire or defect to the Neo Heroes, a rival group appearing to be more effective in handling the growing monster threats. Leading it is the hero Blue, who claims to be the son of Blast.\r\nProduction\r\nOne began the original webcomic of One-Punch Man in 2009. The Japanese shortened name Wanpanman is a play on the long-running children's character Anpanman, wanpan being a contraction of wanpanchi (\"one punch\"). One became interested in creating a comic superhero who was already the strongest in the world. He wanted to focus on different aspects of storytelling than those normally relied on in standard superhero stories, such as everyday problems. One said: \"Punching is oftentimes pretty useless against life's problems. But inside One-Punch Man's universe, I made Saitama a sort of guy who was capable of adapting his life to the world that surrounded him, only armed with his immense power. The only obstacles he faces are mundane things, like running short of money.\"\r\nONE has taken several breaks from updating the webcomic. In February 2010, he put the series on hiatus, deciding to take a one-year break due to family circumstances. After releasing the 109th chapter in January 2017, ONE took a two-year break, releasing the following chapter in April 2019. When One returned to drawing in 2011, he was contacted by artist Yusuke Murata about a possible partnership in which Murata would redraw the webcomic for One. Murata had been an enormous fan of One-Punch Man and was ill at the time. Fearing he was going to die, he contacted One. Looking back, he said, \"Around that time, I was actually really sick. I broke out in hives, my inner organs were infected, and I couldn't breathe well with my windpipes swelling. I was in the hospital when I thought, 'Ah, I guess people die just like that.' If I'm going to die, I want to do something I really love to do. I want to draw manga with Mr. One. That's what I thought.\" Murata, already a successful manga artist, used his connections in the industry to get a publishing deal with Weekly Young Jump comics. The manga became an digital publication on Weekly Young Jump's spin-off manga website Tonari no Young Jump (となりのヤングジャンプ, Tonari no Yangu Janpu), published by Shueisha.\r\nMedia\r\nWebcomic\r\nThe webcomic version of One-Punch Man was created by One in 2009. He self-published the series on the Japanese manga website Nitosha.net. As of May 2023, the webcomic has 142 chapters.\r\nManga\r\nThe manga remake of One-Punch Man is illustrated by Yusuke Murata. It has been published on Shueisha's Tonari no Young Jump website since June 14, 2012. The chapters are periodically collected and published in tankōbon volumes. The first volume was published on December 12, 2012. A radio drama CD was bundled with the ninth volume released in August 2015. As of June 2, 2023, twenty-eight volumes have been published.\r\nIn North America, the series began publication in Viz Media's Weekly Shonen Jump (Shonen Jump Alpha at the time) on January 21, 2013. The first e-book was released in February 2014. In June 2014, One-Punch Man was one of a number of series that Viz made available on the digital distribution platform ComiXology. The manga has been released in print in North America since September 2015.\r\nAnime\r\nAn anime adaptation was announced in the 15th issue of Weekly Young Jump on March 10, 2015. The first season was directed by Shingo Natsume at Madhouse animation studio and written by Tomohiro Suzuki. The series features character designs by Chikashi Kubota, who also served as chief animation director. The music was by Makoto Miyazaki, with art design by Shigemi Ikeda and Yukiko Maruyama. Ken Hashimoto served as the color key artist, Akane Fushihara served as the director of photography, Kashiko Kimura served as the series editor, and Shoji Hata did sound design. One-Punch Man's first season ran for 12 episodes. It aired in Japan from October 5 to December 21, 2015, on TV Tokyo. It aired later on Television Osaka (TVO), TVQ Kyushu Broadcasting (TVQ), Kyoto Broadcasting System (KBS), BS Japan, and AT-X. The season streamed on Niconico and was simulcast on Hulu, Daisuki, and Viz Media's Neon Alley service. A preview screening of the first two episodes was held at the Saitama City Cultural Center on September 6, 2015. The opening theme song is \"The Hero!! ~Ikareru Ken ni Honō o Tsukero~\" (THE HERO!! ～怒れる拳に火をつけろ～, \"The Hero!! Set Fire to the Furious Fist\") by JAM Project, and the closing theme is \"Hoshi Yori Saki ni Mitsukete Ageru\" (星より先に見つけてあげる, \"I'll Find It Before the Stars for You\") by Hiroko Moriguchi. An original video animation (OVA) was released with the tenth manga volume on December 4, 2015. Additional OVA episodes are included with Blu-ray Disc/DVD volumes of the season, the first of which was released on December 24, 2015.\r\nThe series is licensed by Viz Media in North America, Latin America, and Oceania. Viz Media announced they were working on an English-language dub of One-Punch Man at Anime Boston 2016. On July 1, 2016, it was announced during Toonami's Anime Expo panel that the series would begin airing on July 17, 2016. The series has been also licensed by Viz Media Europe in Europe, the Middle East, and Africa. Kaze UK and Manga Entertainment handle the distribution of the series in the United Kingdom. Madman Entertainment handles distribution in Australia and New Zealand, and also simulcast the series on AnimeLab.\r\nA second season was confirmed in September 2016. On September 25, 2017, it was announced that One-Punch Man would be changing both its production company and director. The second season was animated by J.C.Staff, with Chikara Sakurai replacing Shingo Natsume as director and Yoshikazu Iwanami replacing Shoji Hata as sound director. Tomohiro Suzuki, Chikashi Kubota, and Makoto Miyazaki reprised their roles as series composer, character designer, and music composer, respectively. The opening theme song is \"Uncrowned Greatest Hero\" (静寂のアポストル, Seijaku no Apostle, lit. \"Quiet Apostle\") by JAM Project, and the closing theme is \"Chizu ga Nakutemo Modoru kara\" (地図が無くても戻るから, lit. \"Even Without a Map, I'll Return\") by Makoto Furukawa. The second season aired from April 9 to July 2, 2019, and a television special aired on April 2, 2019. A ten-minute OVA was bundled with the second season's first Blu-ray Disc/DVD volume on October 25, 2019. Two more OVAs were bundled with the second season's second and third Blu-ray Disc/DVD volume on November 26 and December 25, 2019, respectively. Another OVA was bundled with the second season's fourth Blu-ray Disc/DVD volume on January 28, 2020. The fifth OVA was bundled with the second season's fifth Blu-ray Disc/DVD volume on February 27, 2020.\r\nThe second season was simulcast on Hulu in the US, on Tubi in Canada, on AnimeLab in Australia and New Zealand and on Crunchyroll in Europe. The second season premiered on Toonami on October 12, 2019.\r\nIn August 2022, it was announced that the series would receive a third season.\r\nVideo games\r\nOn June 25, 2019, One-Punch Man: A Hero Nobody Knows was announced for the PlayStation 4, Xbox One, and PC. It was released in Japan on February 27, 2020, and in North America and Europe on February 28 of the same year. On August 22, 2019, a mobile game titled One Punch Man: Road to Hero was released for iOS and Android.\r\nBlizzard Entertainment announced an Overwatch x One-Punch Man crossover collaboration event on February 6, 2023, which ran from March 7 to April 6 of the same year. The collaboration included multiple skins and a custom loading screen; the skins included a Saitama-inspired one for Doomfist, a Genos-inspired one for Genji, a Mumen Rider-inspired one for Soldier: 76, and a Terrible Tornado-inspired one for Kiriko.\r\nLive-action film\r\nOn April 21, 2020, Sony's Columbia Pictures announced that a live-action film adaptation was in development. Scott Rosenberg and Jeff Pinkner are signed on as writers, while Avi Arad will produce. On June 13, 2022, Justin Lin was revealed to be the film's director and co-producer, with the film set to enter production later in the year.\r\nReception\r\nWebcomic\r\nThe webcomic was considered an instant success shortly after its inception, receiving thousands of views and comments within weeks. It received 7.9 million hits by June 2012. According to One, by the time he had written the fifth chapter, he was receiving 30 comments per update. (On Nitosha.net, a series was considered \"popular\" if it consistently received at least 30 comments.) The number of comments gradually increased, and by the time One had published the 30th chapter, he was receiving nearly 1000 comments per update.\r\nManga\r\nOne-Punch Man was one of the Manga Division's Jury Recommended Works at the 17th and 18th installments of Japan Media Arts Festival in 2013 and 2014, respectively. The series was nominated for the seventh annual Manga Taishō Award in 2014. It was nominated for an Eisner Award in 2015; and a Harvey Award in 2016. The manga won the Sugoi Japan Award; and the Spanish Manga Barcelona award for the seinen category in 2017.\r\nOne-Punch Man was the ninth best-selling manga of 2016, with over 3.9 million copies sold. It was the eighth best-selling manga of 2017, with over 3.2 million copies sold. The manga had 2.2 million copies in print by November 2013. By July 2017, the manga had 13 million copies in print; by July 2019, this had grown to 20 million copies in print. By April 2020, the series has sold over 30 million copies worldwide.\r\nOnce released in the United States, both the first and second volumes debuted on the New York Times Manga Best Sellers list, in first and second place respectively, and remained there for two weeks. Volume one dropped to second place for the third week, while volume two fell off the list altogether. In July 2019, the first volume of the series had been on the list for 71 weeks.\r\nAnime\r\nThe first season of the anime received critical acclaim, receiving praise for its uniqueness, animation, humor, characters and fight scenes. On review aggregator Rotten Tomatoes, it holds an approval rating of 100% based on 12 reviews, with an average rating of 8.4/10. The site's critics consensus reads, \"With its state-of-the-art animation, unorthodox hero, and gut-bustlingly funny jabs at the shounen genre, One-Punch Man is simply a knockout.\"\r\nThe second season received mixed reviews. Although the humor, characters, and story were still praised, reviewers unanimously criticized the drop in the quality of the animation following the change of studios. The direction, pacing, and fights were also criticized, as was the last episode for feeling like an improper season finale. Screen Rant noted that fan reaction to the season was divided, with their response to the new animation being notably negative. They criticized the drop of quality in animation as well as the change of director, saying \"One-Punch Man was previously crisp, detailed and fluid, but many fans claim that the latest season has felt static, bland and uninspiring. This is almost certainly down to a change in director. has gone from the pinnacle of TV anime visuals to looking like just another weekly series.\" However, they believed the season \"improves in terms of story, character and world-building\", although they mostly attributed this to the original manga its based on rather than the anime series' staff. They were very critical of the season finale, noting how the anime could have adapted one or two extra manga chapters to offer a more conclusive finale and build excitement towards a third season.\r\nIGN gave season 2 a five out of ten rating, calling it \"mediocre\". Although they felt the humor and characters were on par with the first season, they were very critical of the animation and pacing, saying: \" taking horrendous shortcuts to get the fights done and dusted in as simple a way as possible. Gone are the intricately detailed character action shots, with dynamic slow motion and constantly-shifting camerawork. Instead, we have flashes, cuts to black, and machine-gun punches all reminiscent of the drawn-out fight scenes of Dragon Ball Z from more than twenty years ago.\" They concluded saying: \"Season 2 of One-Punch Man is a half-baked jumble of poor and lazy animation that is far more concerned with staying relevant than being crafted into something worthy of the season that came before it. If you're only in it for the advancement of the plot, it's all here. But it's also all in the manga, and that looks an awful lot better than this season.\"\r\nIn 2019, One-Punch Man won the \"Most In-Demand Export from Asia\" at the second Global TV Demand Awards.",
    "html": "<p>One-Punch Man (Japanese: ワンパンマン, Hepburn: Wanpanman) is a Japanese superhero manga series created by One. It tells the story of Saitama, a superhero who, because he can defeat any opponent with a single punch, grows bored from a lack of challenge. One wrote the original webcomic manga version in early 2009.</p><p>A digital manga remake, illustrated by Yusuke Murata, began publication on Shueisha's Tonari no Young Jump website in June 2012. Its chapters are periodically compiled and published into individual tankōbon volumes. As of June 2023, 28 volumes have been released. In North America, Viz Media has licensed the remake manga for English language release and has serialized it in its Weekly Shonen Jump digital magazine.</p><p>An anime adaptation produced by Madhouse was broadcast in Japan from October to December 2015. A second season, produced by J.C.Staff, was broadcast from April to July 2019. A third season has been announced. Licensed in North America by Viz Media, it premiered in the United States on Adult Swim's Toonami programming block in July 2016. The second season premiered on the block in October 2019.</p><p>By June 2012, the original webcomic manga surpassed 7.9 million hits. By April 2020, the manga remake had sold over 30 million copies worldwide, making it one of the best-selling manga series of all time.</p><br/><h3>Plot</h3><p>On a supercontinent version of Earth that has four Moons, powerful monsters and supervillains wreak havoc. The millionaire Agoni creates the Hero Association, which employs superheroes to fight evil. Saitama, an unassociated hero, hails from City Z and performs heroic deeds as a hobby. For three years, he has trained enough to defeat any enemy with a single punch, his unmatched strength leaving him bored. He becomes a reluctant mentor to Genos, a cyborg seeking revenge against another cyborg who killed his family and destroyed his hometown, after Saitama defeats a monster that defeated Genos.</p><p>Saitama and Genos join the Hero Association, hoping to attain notability, but Genos instantly obtains an S-Class rank; meanwhile, due to scoring low on the written exam despite having a perfect score on the physical exam, Saitama only becomes a C-Class hero. His feats remain unnoticed even after saving people from an asteroid and then a sea monster, barely getting himself promoted to B-Class. Later, shortly before her death, the seer Shibabawa predicts that the world is in great danger as the alien Boros invades the planet. The heroes kill the invaders and destroy Boros's ship as Saitama defeats Boros in single combat.</p><p>Monsters begin appearing faster while the rogue martial artist Garo, a former apprentice of the hero Bang, and self-dubbed \"Hero Hunter,\" begins terrorizing heroes. Due to childhood bullying, he holds a grudge against everything \"heroic.\" The heroes learn that the monster influx comes from the Monster Association, an organization of monsters under City Z intent on destroying the Hero Association. They attack various cities, recruit fighters by offering them \"monster cells\" that mutate humans into monsters, and kidnap a Hero Association executive's son. Garo bonds with Tareo, a child who idolizes heroes, as he hunts down more heroes, his combat prowess slowly rising. The Monster Association attempts to recruit him and kidnaps the child when Garo refuses. He storms the Monster Association HQ trying to rescue the child but ultimately gets captured.</p><p>The Hero Association assaults the headquarters to rescue the two children, causing a battle that destroys City Z and kills almost every monster. Saitama meets the highest-ranked hero Blast during the raid when he arrives to collect artifacts, who warns him of a threat known as \"God.\" Many heroes are heavily injured when Garo emerges, mutated into a monster from the fighting. Unable to match the power of Saitama, Garo receives some of \"God's\" power when he meets it in a vision, causing him to emit radiation that kills all the heroes, including Genos by ripping out his core to get Saitama to fight him seriously. He briefly matches Saitama in a brutal battle that sends them across the solar system. After Saitama defeats him, Garo becomes distraught over Tareo's death and teaches Saitama to time travel before \"God\" kills him. Saitama goes back in time and subdues Garo before he killed the heroes, destroying his monster mutation and cosmic power. Despite the objections of the other heroes, Saitama spares Garo and lets him flee after Tareo stops them. Only Genos, who reconnected with his core from the original timeline bought by Saitama (who seemed to remember nothing of his battle and time travel with the original Garo), remembers the entire events of the original ominous future caused by Garo.</p><p>With the Monster Association destroyed, Saitama gets promoted to A-Class for defeating Garo. As the battle destroyed his apartment, he relocates to the Hero Association's HQ in A-City. The Hero Association's poor performance causes public opinion of them to plummet. Several heroes and officials decide to retire or defect to the Neo Heroes, a rival group appearing to be more effective in handling the growing monster threats. Leading it is the hero Blue, who claims to be the son of Blast.</p><br/><h3>Production</h3><p>One began the original webcomic of One-Punch Man in 2009. The Japanese shortened name Wanpanman is a play on the long-running children's character Anpanman, wanpan being a contraction of wanpanchi (\"one punch\"). One became interested in creating a comic superhero who was already the strongest in the world. He wanted to focus on different aspects of storytelling than those normally relied on in standard superhero stories, such as everyday problems. One said: \"Punching is oftentimes pretty useless against life's problems. But inside One-Punch Man's universe, I made Saitama a sort of guy who was capable of adapting his life to the world that surrounded him, only armed with his immense power. The only obstacles he faces are mundane things, like running short of money.\"</p><p>ONE has taken several breaks from updating the webcomic. In February 2010, he put the series on hiatus, deciding to take a one-year break due to family circumstances. After releasing the 109th chapter in January 2017, ONE took a two-year break, releasing the following chapter in April 2019. When One returned to drawing in 2011, he was contacted by artist Yusuke Murata about a possible partnership in which Murata would redraw the webcomic for One. Murata had been an enormous fan of One-Punch Man and was ill at the time. Fearing he was going to die, he contacted One. Looking back, he said, \"Around that time, I was actually really sick. I broke out in hives, my inner organs were infected, and I couldn't breathe well with my windpipes swelling. I was in the hospital when I thought, 'Ah, I guess people die just like that.' If I'm going to die, I want to do something I really love to do. I want to draw manga with Mr. One. That's what I thought.\" Murata, already a successful manga artist, used his connections in the industry to get a publishing deal with Weekly Young Jump comics. The manga became an digital publication on Weekly Young Jump's spin-off manga website Tonari no Young Jump (となりのヤングジャンプ, Tonari no Yangu Janpu), published by Shueisha.</p><br/><h3>Media</h3><h4>Webcomic</h4><p>The webcomic version of One-Punch Man was created by One in 2009. He self-published the series on the Japanese manga website Nitosha.net. As of May 2023, the webcomic has 142 chapters.</p><h4>Manga</h4><p>The manga remake of One-Punch Man is illustrated by Yusuke Murata. It has been published on Shueisha's Tonari no Young Jump website since June 14, 2012. The chapters are periodically collected and published in tankōbon volumes. The first volume was published on December 12, 2012. A radio drama CD was bundled with the ninth volume released in August 2015. As of June 2, 2023, twenty-eight volumes have been published.</p><p>In North America, the series began publication in Viz Media's Weekly Shonen Jump (Shonen Jump Alpha at the time) on January 21, 2013. The first e-book was released in February 2014. In June 2014, One-Punch Man was one of a number of series that Viz made available on the digital distribution platform ComiXology. The manga has been released in print in North America since September 2015.</p><h4>Anime</h4><p>An anime adaptation was announced in the 15th issue of Weekly Young Jump on March 10, 2015. The first season was directed by Shingo Natsume at Madhouse animation studio and written by Tomohiro Suzuki. The series features character designs by Chikashi Kubota, who also served as chief animation director. The music was by Makoto Miyazaki, with art design by Shigemi Ikeda and Yukiko Maruyama. Ken Hashimoto served as the color key artist, Akane Fushihara served as the director of photography, Kashiko Kimura served as the series editor, and Shoji Hata did sound design. One-Punch Man's first season ran for 12 episodes. It aired in Japan from October 5 to December 21, 2015, on TV Tokyo. It aired later on Television Osaka (TVO), TVQ Kyushu Broadcasting (TVQ), Kyoto Broadcasting System (KBS), BS Japan, and AT-X. The season streamed on Niconico and was simulcast on Hulu, Daisuki, and Viz Media's Neon Alley service. A preview screening of the first two episodes was held at the Saitama City Cultural Center on September 6, 2015. The opening theme song is \"The Hero!! ~Ikareru Ken ni Honō o Tsukero~\" (THE HERO!! ～怒れる拳に火をつけろ～, \"The Hero!! Set Fire to the Furious Fist\") by JAM Project, and the closing theme is \"Hoshi Yori Saki ni Mitsukete Ageru\" (星より先に見つけてあげる, \"I'll Find It Before the Stars for You\") by Hiroko Moriguchi. An original video animation (OVA) was released with the tenth manga volume on December 4, 2015. Additional OVA episodes are included with Blu-ray Disc/DVD volumes of the season, the first of which was released on December 24, 2015.</p><p>The series is licensed by Viz Media in North America, Latin America, and Oceania. Viz Media announced they were working on an English-language dub of One-Punch Man at Anime Boston 2016. On July 1, 2016, it was announced during Toonami's Anime Expo panel that the series would begin airing on July 17, 2016. The series has been also licensed by Viz Media Europe in Europe, the Middle East, and Africa. Kaze UK and Manga Entertainment handle the distribution of the series in the United Kingdom. Madman Entertainment handles distribution in Australia and New Zealand, and also simulcast the series on AnimeLab.</p><p>A second season was confirmed in September 2016. On September 25, 2017, it was announced that One-Punch Man would be changing both its production company and director. The second season was animated by J.C.Staff, with Chikara Sakurai replacing Shingo Natsume as director and Yoshikazu Iwanami replacing Shoji Hata as sound director. Tomohiro Suzuki, Chikashi Kubota, and Makoto Miyazaki reprised their roles as series composer, character designer, and music composer, respectively. The opening theme song is \"Uncrowned Greatest Hero\" (静寂のアポストル, Seijaku no Apostle, lit. \"Quiet Apostle\") by JAM Project, and the closing theme is \"Chizu ga Nakutemo Modoru kara\" (地図が無くても戻るから, lit. \"Even Without a Map, I'll Return\") by Makoto Furukawa. The second season aired from April 9 to July 2, 2019, and a television special aired on April 2, 2019. A ten-minute OVA was bundled with the second season's first Blu-ray Disc/DVD volume on October 25, 2019. Two more OVAs were bundled with the second season's second and third Blu-ray Disc/DVD volume on November 26 and December 25, 2019, respectively. Another OVA was bundled with the second season's fourth Blu-ray Disc/DVD volume on January 28, 2020. The fifth OVA was bundled with the second season's fifth Blu-ray Disc/DVD volume on February 27, 2020.</p><p>The second season was simulcast on Hulu in the US, on Tubi in Canada, on AnimeLab in Australia and New Zealand and on Crunchyroll in Europe. The second season premiered on Toonami on October 12, 2019.</p><p>In August 2022, it was announced that the series would receive a third season.</p><h4>Video games</h4><p>On June 25, 2019, One-Punch Man: A Hero Nobody Knows was announced for the PlayStation 4, Xbox One, and PC. It was released in Japan on February 27, 2020, and in North America and Europe on February 28 of the same year. On August 22, 2019, a mobile game titled One Punch Man: Road to Hero was released for iOS and Android.</p><p>Blizzard Entertainment announced an Overwatch x One-Punch Man crossover collaboration event on February 6, 2023, which ran from March 7 to April 6 of the same year. The collaboration included multiple skins and a custom loading screen; the skins included a Saitama-inspired one for Doomfist, a Genos-inspired one for Genji, a Mumen Rider-inspired one for Soldier: 76, and a Terrible Tornado-inspired one for Kiriko.</p><h4>Live-action film</h4><p>On April 21, 2020, Sony's Columbia Pictures announced that a live-action film adaptation was in development. Scott Rosenberg and Jeff Pinkner are signed on as writers, while Avi Arad will produce. On June 13, 2022, Justin Lin was revealed to be the film's director and co-producer, with the film set to enter production later in the year.</p><br/><h3>Reception</h3><h4>Webcomic</h4><p>The webcomic was considered an instant success shortly after its inception, receiving thousands of views and comments within weeks. It received 7.9 million hits by June 2012. According to One, by the time he had written the fifth chapter, he was receiving 30 comments per update. (On Nitosha.net, a series was considered \"popular\" if it consistently received at least 30 comments.) The number of comments gradually increased, and by the time One had published the 30th chapter, he was receiving nearly 1000 comments per update.</p><h4>Manga</h4><p>One-Punch Man was one of the Manga Division's Jury Recommended Works at the 17th and 18th installments of Japan Media Arts Festival in 2013 and 2014, respectively. The series was nominated for the seventh annual Manga Taishō Award in 2014. It was nominated for an Eisner Award in 2015; and a Harvey Award in 2016. The manga won the Sugoi Japan Award; and the Spanish Manga Barcelona award for the seinen category in 2017.</p><p>One-Punch Man was the ninth best-selling manga of 2016, with over 3.9 million copies sold. It was the eighth best-selling manga of 2017, with over 3.2 million copies sold. The manga had 2.2 million copies in print by November 2013. By July 2017, the manga had 13 million copies in print; by July 2019, this had grown to 20 million copies in print. By April 2020, the series has sold over 30 million copies worldwide.</p><p>Once released in the United States, both the first and second volumes debuted on the New York Times Manga Best Sellers list, in first and second place respectively, and remained there for two weeks. Volume one dropped to second place for the third week, while volume two fell off the list altogether. In July 2019, the first volume of the series had been on the list for 71 weeks.</p><h4>Anime</h4><p>The first season of the anime received critical acclaim, receiving praise for its uniqueness, animation, humor, characters and fight scenes. On review aggregator Rotten Tomatoes, it holds an approval rating of 100% based on 12 reviews, with an average rating of 8.4/10. The site's critics consensus reads, \"With its state-of-the-art animation, unorthodox hero, and gut-bustlingly funny jabs at the shounen genre, One-Punch Man is simply a knockout.\"</p><p>The second season received mixed reviews. Although the humor, characters, and story were still praised, reviewers unanimously criticized the drop in the quality of the animation following the change of studios. The direction, pacing, and fights were also criticized, as was the last episode for feeling like an improper season finale. Screen Rant noted that fan reaction to the season was divided, with their response to the new animation being notably negative. They criticized the drop of quality in animation as well as the change of director, saying \"One-Punch Man was previously crisp, detailed and fluid, but many fans claim that the latest season has felt static, bland and uninspiring. This is almost certainly down to a change in director. has gone from the pinnacle of TV anime visuals to looking like just another weekly series.\" However, they believed the season \"improves in terms of story, character and world-building\", although they mostly attributed this to the original manga its based on rather than the anime series' staff. They were very critical of the season finale, noting how the anime could have adapted one or two extra manga chapters to offer a more conclusive finale and build excitement towards a third season.</p><p>IGN gave season 2 a five out of ten rating, calling it \"mediocre\". Although they felt the humor and characters were on par with the first season, they were very critical of the animation and pacing, saying: \" taking horrendous shortcuts to get the fights done and dusted in as simple a way as possible. Gone are the intricately detailed character action shots, with dynamic slow motion and constantly-shifting camerawork. Instead, we have flashes, cuts to black, and machine-gun punches all reminiscent of the drawn-out fight scenes of Dragon Ball Z from more than twenty years ago.\" They concluded saying: \"Season 2 of One-Punch Man is a half-baked jumble of poor and lazy animation that is far more concerned with staying relevant than being crafted into something worthy of the season that came before it. If you're only in it for the advancement of the plot, it's all here. But it's also all in the manga, and that looks an awful lot better than this season.\"</p><p>In 2019, One-Punch Man won the \"Most In-Demand Export from Asia\" at the second Global TV Demand Awards.</p><br/>"
  },
  "errorMessage": ""
}