{
  "imDbId": "tt4647692",
  "title": "Letterkenny",
  "fullTitle": "Letterkenny (TV Series 2016– )",
  "type": "TVSeries",
  "year": "2016",
  "items": [
    {
      "username": "scbaxter2014",
      "userUrl": "https://www.imdb.com/user/ur55600144",
      "reviewLink": "https://www.imdb.com/review/rw5010934",
      "warningSpoilers": false,
      "date": "21 July 2019",
      "rate": "10",
      "helpful": "148 out of 165 found this helpful.",
      "title": "Not So-bad",
      "content": "Watched a show thee-utha-day... 'twas a funny one. The laidback lackies of Letterkenny lay low like little lazy lizards lickin' lemon lollipops. The gang gets together and gabs a good gob of gossip 'bout God's great gotta-git-ya's. And fists fly ferociously with force in fear that fickle fanatics will forget 'bout whose tough rough and buff enough. It's a good show I suppose...not one to talk down about a good show when I don't have one of m' own. Ten stars cuz I can't find a flaw in the production. Watch it if you'd like."
    },
    {
      "username": "michaeldeangray",
      "userUrl": "https://www.imdb.com/user/ur71930317",
      "reviewLink": "https://www.imdb.com/review/rw6066076",
      "warningSpoilers": false,
      "date": "5 September 2020",
      "rate": "9",
      "helpful": "31 out of 34 found this helpful.",
      "title": "Letterkenny?",
      "content": "A few years ago, the humor of Napoleon Dynamite and the talking speed of Gilmore Girls hung out and played Cards Against Humanity together.They conceived a baby and gave birth to Letterkenny."
    },
    {
      "username": "jmaurer1-1",
      "userUrl": "https://www.imdb.com/user/ur21894819",
      "reviewLink": "https://www.imdb.com/review/rw4480037",
      "warningSpoilers": false,
      "date": "26 November 2018",
      "rate": "8",
      "helpful": "64 out of 71 found this helpful.",
      "title": "As an American I love this show!",
      "content": "I'm a huge Corner Gas fan and have really grown to appreciate Canadian Comedy, and while this show is not family friendly at all, I love the style of humor and how fast paced it is. It is not hard to understand, so don't believe the bad reviews. Also, I have seen a lot of comments stating it's full of Canadian slang, and while that may be, it is very easy for Americans to understand. The first episode is the worst in my opinion, so just get past that and you will be fine."
    },
    {
      "username": "dbrynnalyn",
      "userUrl": "https://www.imdb.com/user/ur63529594",
      "reviewLink": "https://www.imdb.com/review/rw4292952",
      "warningSpoilers": false,
      "date": "19 August 2018",
      "rate": "10",
      "helpful": "87 out of 102 found this helpful.",
      "title": "That's a Texas Sized 10-4",
      "content": "This show is absolutely hilarious, full of dry humor and witty lines. I can't wait for Season 3. Very enjoyable, visit LetterKenny have a few drinks with the boys, admire the hot little sister and squirrely Dan's appreciation of her."
    },
    {
      "username": "taterbaby-68548",
      "userUrl": "https://www.imdb.com/user/ur71410754",
      "reviewLink": "https://www.imdb.com/review/rw4694090",
      "warningSpoilers": false,
      "date": "2 March 2019",
      "rate": "10",
      "helpful": "405 out of 423 found this helpful.",
      "title": "Pitter patter, let's get at 'er",
      "content": "Yer writin a review on IMDB tha other day....So, ya found a show with quick wit, quick words and even quicker punches. All in glorious slo-mo. Now I know whatcha might be thinking. How coulda buncha Maple junkie, schneef snortin, beer chuggin, ne'er-do-wells with nothin but time on their hands have the testicular fortitude to throw handfuls of hilarious hypothetical haymakers heartily hitting at our hearts and heads? Well, if you'll pump the brakes, and back 'er off about 10-20 there Squirrely Dan, I'd be glad to increase your brain knowings, before you get all hellbent for a Donny Brook.As sure as God wears sandals I've only two words for this clearly Canadian conscription of classic conundrums converging conveniently in concise conversational colloquialisms.......Hard yes."
    },
    {
      "username": "tomfleming2470",
      "userUrl": "https://www.imdb.com/user/ur11005674",
      "reviewLink": "https://www.imdb.com/review/rw4280750",
      "warningSpoilers": false,
      "date": "12 August 2018",
      "rate": "10",
      "helpful": "79 out of 94 found this helpful.",
      "title": "This should be your new favorite show",
      "content": "Recently discovered this show as it just came to the U.S. on Hulu. From the first beat of episode one I loved it. Fast paced dialogue by all of the characters in a small town in Canada. I have tried to persuade people to watch it by describing the characters as 'Kevin Smith's if Randall and Dante, etc... grew up in rural Canada instead of suburban New Jersey.' Some of the funniest dialogue I have heard in a long time. All of the cast are great and each character is uniquely odd in their own way. If you haven't given this sho a try yet, time to figure it out!"
    },
    {
      "username": "Top_Dawg_Critic",
      "userUrl": "https://www.imdb.com/user/ur64798417",
      "reviewLink": "https://www.imdb.com/review/rw3615498",
      "warningSpoilers": false,
      "date": "8 January 2017",
      "rate": "9",
      "helpful": "31 out of 44 found this helpful.",
      "title": "I can't help it, it gets funnier faster than a duck with a boner dragging weeds.",
      "content": "I can't help it, it gets funnier faster than a duck with a boner dragging weeds.I initially saw season 1 and gave it a 7. I enjoyed the series but felt some of the humor was over the top and trying too hard with lots of fluff between the punch lines. Then I saw season 2. Well now, talk about upping the ante! Way more funnier, and more true to the roots of growing up in small town Canada with some real-life small-town issues!I first got introduced to Jared Keeso watching 19-2, and his role in that next to Letterkenny is yin to yang. I think he found his true calling in this series. I'm hoping the episodes increase in numbers and come out sooner than later, because watching all 6 in the 2nd season so fast with a massive cliff hanger, I can't wait to see what happens next. So pitter patter let's get at'er boys, needing season 3 asap is a Texas sized 10-4."
    },
    {
      "username": "mattiaszw",
      "userUrl": "https://www.imdb.com/user/ur65739239",
      "reviewLink": "https://www.imdb.com/review/rw3431626",
      "warningSpoilers": false,
      "date": "6 March 2016",
      "rate": "10",
      "helpful": "147 out of 169 found this helpful.",
      "title": "Fantastic show with lots of heart",
      "content": "This show is really something. The mixture of brutal simplicity with some top notch tongue-in-cheek writing really sets this show apart from virtually every comedy I've seen in the last few years. The jokes are crass yet eloquent, the situations absurd yet low key. The style is simple, yet laced with subtle wit. The hybrid of dry British comedy with a loud mouthed American twist is a rare beauty to behold.A special recognition should definitely also go to the actors of the show. The entire cast seem to be deeply involved in the show and really give it their all with their characters, playing them with equal share satire and honesty. It makes the show all the better for having characters that are genuinely lovable and relatable. I sincerely hope this show gets another season and world wide acclaim because it is rare to find something so fresh and original nowadays. 10/10"
    },
    {
      "username": "j_loome",
      "userUrl": "https://www.imdb.com/user/ur2437571",
      "reviewLink": "https://www.imdb.com/review/rw3448945",
      "warningSpoilers": false,
      "date": "10 April 2016",
      "rate": "9",
      "helpful": "45 out of 62 found this helpful.",
      "title": "Sharp, dry and dead-on satire of small-town Ontario",
      "content": "It's just friggin funny, eh? From the angst-ridden small-town goth wannabes to the obviously flaming pastor to the hockey hair goons and the stoic farm boys, everyone drinks too much, fights too much and does a whole lot of nothing in Letterkenny. It takes small-town stereotypes and skewers the hell out of them, but doesn't stick to making fun of rural Canada, as the city folk get their comeuppance too. Principle topics of plots: sledding, drinking, hockey, fighting, religion, political correctness, weed and unemployment. If Trailer Park Boys is a slice of Canada's white trash culture, Letterkenny is a clever homage, explaining why so many people in the second-largest nation on Earth can drive hundreds of miles and still go nowhere."
    },
    {
      "username": "kleptomania",
      "userUrl": "https://www.imdb.com/user/ur35236716",
      "reviewLink": "https://www.imdb.com/review/rw3499278",
      "warningSpoilers": false,
      "date": "5 July 2016",
      "rate": "10",
      "helpful": "53 out of 72 found this helpful.",
      "title": "I don't know what to say...",
      "content": "...other than how amazing this show is! After seeing the pilot, I rated the show a 9 but now that I've seen 6 episodes of it, I've been convinced to give it a 10.Its not just a funny show, its actually got actual jokes in it. The characters are very lovable and they occasionally dig in deep about their backgrounds. Even the camera shots are very interesting at times.Its consistent with the humor and the ridiculousness brilliance just sneaks up on you. This is a show you gotta try out just to see how it fares and if you actually get the humor, its gonna be the funniest thing ever!"
    },
    {
      "username": "dblackman-83420",
      "userUrl": "https://www.imdb.com/user/ur65664764",
      "reviewLink": "https://www.imdb.com/review/rw3425264",
      "warningSpoilers": false,
      "date": "1 March 2016",
      "rate": "10",
      "helpful": "130 out of 160 found this helpful.",
      "title": "a smarter trailer park boys",
      "content": "Asa small town Ontarian, this rang so true it made me wonder if it would translate outside of my world of inside jokes - i even guessed the town it was based on (Listowel) just by watching the season.dialog is Tarantino sharp and fast, the catch phrases fly by almost too fast to catch ( eyes on your own work there super chief) and if this series was on a VHS tape, I would wear it out. If this show does not garner awards for comedic writing, i will be shocked - simply the best thing i have seen in some timeI signed up to the Canadian crave TV service solely for this offering and it is well worth it - i am surprised by the lack of buzz about this show in the media to be honest. I do not know if it is because this is not based on a reserve, or an urban coffee shop, or if the humor simply goes over most critic's heads"
    },
    {
      "username": "aaronsauer",
      "userUrl": "https://www.imdb.com/user/ur69276079",
      "reviewLink": "https://www.imdb.com/review/rw4559547",
      "warningSpoilers": false,
      "date": "4 January 2019",
      "rate": "9",
      "helpful": "142 out of 174 found this helpful.",
      "title": "Figure it out",
      "content": "For those who don't understand or like the show. Figureitout."
    },
    {
      "username": "theknownames",
      "userUrl": "https://www.imdb.com/user/ur12161715",
      "reviewLink": "https://www.imdb.com/review/rw6703268",
      "warningSpoilers": false,
      "date": "17 March 2021",
      "rate": "9",
      "helpful": "10 out of 16 found this helpful.",
      "title": "Dialog is exceptional",
      "content": "This is one of those times that my personal preferences won't bump-up or lower a rating . I am not a fan of a many of the jokes but the delivery , the characters , the dialogue is super entertaining. The main character is immaculate,"
    },
    {
      "username": "triplem33",
      "userUrl": "https://www.imdb.com/user/ur3660963",
      "reviewLink": "https://www.imdb.com/review/rw3498674",
      "warningSpoilers": false,
      "date": "4 July 2016",
      "rate": "9",
      "helpful": "24 out of 39 found this helpful.",
      "title": "Corner Gas meets Trailer Park Boys",
      "content": "Just watched the first season and though it was hilarious. I did not realize it was set in Ontario...thought it was set out west...so Corner Gas meets Trailer Park Boys came to mind. Or perhaps the bazarro version of Corner Gas. The important things is that we finally have another Canadian show that reflects the real Canada...not the Avonlea, Murdock Mysteries hokum that represents...well...nothing really. I think we all know characters like this...maybe not as colourful or aware but people we have all likes and hated over the years. Let's hope it continues. I would hate for a \"big screen\" or \"Americanized\" version to crop up before this one really gets established."
    },
    {
      "username": "brandenoller",
      "userUrl": "https://www.imdb.com/user/ur46323984",
      "reviewLink": "https://www.imdb.com/review/rw4609528",
      "warningSpoilers": false,
      "date": "27 January 2019",
      "rate": "10",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Unbelievably hilarious show",
      "content": "I'll keep it short and sweet. This show is filled to the brim with incredible and quotable dialogue. The characters are so outrageous and loveable. A must watch if you like quirky/ Canadian style humor."
    },
    {
      "username": "tcbhughes",
      "userUrl": "https://www.imdb.com/user/ur6387031",
      "reviewLink": "https://www.imdb.com/review/rw5778328",
      "warningSpoilers": false,
      "date": "28 May 2020",
      "rate": "10",
      "helpful": "20 out of 23 found this helpful.",
      "title": "If I could give more stars I would... I hope this ride never ends!",
      "content": "I discovered this show a couple of years ago and I love it. I hope it never ends. I wish I could find a man like Wayne and friends like the gang. These are such honest and humble characters that you can relate with. I love the snappy and funny dialogue that sometimes makes my head spin its so fervently delivered. This show makes me want to move to Letterkenny!"
    },
    {
      "username": "JasonR77",
      "userUrl": "https://www.imdb.com/user/ur52562217",
      "reviewLink": "https://www.imdb.com/review/rw3805526",
      "warningSpoilers": false,
      "date": "14 September 2017",
      "rate": "10",
      "helpful": "19 out of 33 found this helpful.",
      "title": "Rapid-Fire Hilarity",
      "content": "I discovered this show on YouTube, and I was laughing so hard during the Cold Open that I knew I had to watch all the episodes as quickly as possible. Jared Keeso's delivery and stone-face are terrific, and just about every line he has is hysterical.This is an amazing show that hopefully will become a big hit even in the States. Don't come looking for complex plots or deep characters, as you won't find them here, but you don't need them. This is great comedy with fun personalities and is going to keep you going back over and over again to catch something you may have missed before. Long live Letterkenny."
    },
    {
      "username": "sthompson-90907",
      "userUrl": "https://www.imdb.com/user/ur65526459",
      "reviewLink": "https://www.imdb.com/review/rw3420294",
      "warningSpoilers": false,
      "date": "20 February 2016",
      "rate": "10",
      "helpful": "74 out of 97 found this helpful.",
      "title": "My compliments to the Chiefs",
      "content": "Proud to be Canadian with productions like this. Way to go Jarrod and friends. The MacKenzie brothers would be proud of the notch you have taken our comedy to. Can't wait for season 2. Would love to see a blooper reel of takes - the sincere straight forward delivery would only lead to crack ups when tongues are twisted. Love the side kicks Daryl and Dan. Little sister is in control, but I worry about her taste in men. Gotta say Gail kills me, keep barking up Wayne's tree, he is bound to roll over. The hockey twins are classic and having a son around that age - well I just giggle and giggle. Final word- awesome. You have managed to take reality and creatively depict it in a very humorous way. good on ya eh."
    },
    {
      "username": "neil-levett",
      "userUrl": "https://www.imdb.com/user/ur54396889",
      "reviewLink": "https://www.imdb.com/review/rw3477455",
      "warningSpoilers": false,
      "date": "27 May 2016",
      "rate": "10",
      "helpful": "35 out of 52 found this helpful.",
      "title": "How are you now?",
      "content": "I am always reluctant to wax lyrical to my friends about films or TV series' as I'd prefer them to go into the experience without massive expectations. Not with Letterkenny, I cannot big this up enough. I have just completed my second viewing of this 6 part series and am champing at the bit for the next instalment. The acting is superb but what makes this gem stand out is the writing, it is simply non stop, machine gun patter that is intelligent, authentic and most of all hysterical. As a Brit there were bits I caught on the second viewing that I'd missed the first time round due to the Canadian colloquialisms but that only increased the longevity for me. Although all the characters are well fleshed out, the stand out performance for me comes from Tyler Johnston who plays king of the meth heads, Stewart. Not taking anything away from the others but you see his character develop so well through the very short series. I sincerely hope this series gets the recognition, acclaim and popularity it deserves. I was lucky enough to go watch the the Arctic Monkeys in a tiny venue when they first started out, I hope I can say similar when Letterkenny gets massive."
    },
    {
      "username": "rachelgallit",
      "userUrl": "https://www.imdb.com/user/ur92194562",
      "reviewLink": "https://www.imdb.com/review/rw5127102",
      "warningSpoilers": false,
      "date": "17 September 2019",
      "rate": "10",
      "helpful": "9 out of 15 found this helpful.",
      "title": "Texas Sized 10-4",
      "content": "This is show is the epitome of well orchestrated dialogue, outlandish but not garish characters, and plot that interests a wide range of people: from fist fights, to farming, to pun-battles. Toughest man in town Wayne spearheads his little band of brothers, composed of his sister, his best friend, and a big lovable lug. The town is filled with fascinating people: the meth-heads, the hicks, the christians, and the normal folk. The protagonists are at once crude, drunken, assholes who goad each other into fights, and are throwing wit and hyperbolic puns out at the speed of light. It is a combination of the brilliant acting, crystal clear dialogue, and distinct and hilarious character types that make this show more than a tangled mess of conflict. This show likely misses much of the American audience, as the action and lines move at a speed and with such sharp changes that it is a little hard to follow without devoting ones full attention. The staging is both realistic and mundane and utterly manufactured, as it is almost a parody of a realistic situation played out in an exaggerated form."
    },
    {
      "username": "naterslater288",
      "userUrl": "https://www.imdb.com/user/ur31174982",
      "reviewLink": "https://www.imdb.com/review/rw4955676",
      "warningSpoilers": false,
      "date": "24 June 2019",
      "rate": "9",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Some of the most memorbale quotes of all time.",
      "content": "I have to say I was skeptical after watching the first episode but just stick with it and this series will have you crying with laughter. It moves quickly and there is almost no time to laugh at a joke before another one, or five are thrown directly in your face. With some of the most memorable quotes/phrases iv'e heard since the movie \"Fletch\". I'd say this is one of if not my favorite comedy show. Give it a chance and make sure you have subtitles on as the jokes and speaking in general are very fast paced. You will probably find yourself rewinding on occasion just to catch the next joke in the illiteration bits but it doesn't matter, this show is downright hilarious. So, give your balls a tug and pitter patter."
    },
    {
      "username": "koytschubert",
      "userUrl": "https://www.imdb.com/user/ur71616560",
      "reviewLink": "https://www.imdb.com/review/rw4583718",
      "warningSpoilers": false,
      "date": "15 January 2019",
      "rate": "10",
      "helpful": "16 out of 23 found this helpful.",
      "title": "Where has this show been hiding?",
      "content": "This show is like nothing I've ever seen and I absolutely love it. The writing is amazing. I binged all 6 seasons in 2 days and now I feel so empty inside. May rewatch the whole series again this weekend."
    },
    {
      "username": "durham100",
      "userUrl": "https://www.imdb.com/user/ur12870451",
      "reviewLink": "https://www.imdb.com/review/rw8772927",
      "warningSpoilers": false,
      "date": "2 January 2023",
      "rate": "9",
      "helpful": "2 out of 2 found this helpful.",
      "title": "I love silly and I like smart...",
      "content": "And you get both with letterkenny. I somehow stumbled across a clip on youtube and instantly became addicted. I then bought the series on Amazon and to be farrr, that is something I rarely do but I needed to see every one of these shows. It's like a cross between Father Ted and Paradise PD. It's very clever and very silly. The dragons den episode will go down as a classic. Every performance is superb - even when an actor is not centre stage their facial expressions and reactions are priceless and add to the scene. I have no idea why this isnt on regular TV as it would be so popular. I love it. I end up with tears streaming down my face. I urge you to give it a go, try a few episodes to get into it and then you will be hooked."
    },
    {
      "username": "ebrailey22",
      "userUrl": "https://www.imdb.com/user/ur52392140",
      "reviewLink": "https://www.imdb.com/review/rw4285129",
      "warningSpoilers": false,
      "date": "14 August 2018",
      "rate": "8",
      "helpful": "12 out of 21 found this helpful.",
      "title": "Canadian Always Sunny",
      "content": "If you like Always Sunny give this a try. A frienf of mine had me watch a few episodes and now I have five seasons to binge watch. It's Hicks, Hockey players, and Skids and their life styles coming together in a small town. And it's hilarious. It's really fast paced, witty, and some of the funniest insults/ comebacks I've ever heard. It's not outlandish like Always Sunny but the banter is pretty similar and the character development"
    },
    {
      "username": "jennfinn",
      "userUrl": "https://www.imdb.com/user/ur61194652",
      "reviewLink": "https://www.imdb.com/review/rw6517334",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "10",
      "helpful": "7 out of 12 found this helpful.",
      "title": "Pitter Patter",
      "content": "I had never heard of Letterkenny until someone mentioned it in an Arrested Development Subreddit and said how funny it was. I'm sorry I put off watching it for so long because it is quite enjoyable. Thank goodness for subtitles because there are some things I would've missed without them. Jared Keeso as Wayne is top notch, Michelle Mylett plays his little sister, Katy and she's adorable. Daryl, Stewart, Reilly & Jonesy are funny as hell. My only complaint is Dan is kinda gross and Gail is creepy AF and a bit too much."
    }
  ],
  "errorMessage": ""
}