{
  "imDbId": "tt7137906",
  "title": "When They See Us",
  "fullTitle": "When They See Us (TV Series 2019–2019)",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "ramesesbrathwaite",
      "userUrl": "https://www.imdb.com/user/ur81206279",
      "reviewLink": "https://www.imdb.com/review/rw4902740",
      "warningSpoilers": true,
      "date": "1 June 2019",
      "rate": "10",
      "helpful": "574 out of 689 found this helpful.",
      "title": "Justice for humanity",
      "content": "Knew these kids from my neighborhood were innocent the whole time. Back then and much like now, cops in my neighborhood were notorious for all types of crimes: They sold drugs, robbed drug dealers, were involved in sex crimes and even were guilty of extortion and homicides. We knew the outcome was race based, but besides the nightmare these 6 individuals endured ( Yes, there were 6 not 5)... because the police lied and the prosecutor also, an innocent woman, a pregnant woman would later be murdered by the actual killer. No \"Justice\" for Black & Brown, \"Just Us\" being incarcerated at disproportionate levels."
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw4926401",
      "warningSpoilers": false,
      "date": "10 June 2019",
      "rate": "10",
      "helpful": "307 out of 406 found this helpful.",
      "title": "The Central Park Five",
      "content": "This production, which has been very popular since the introduction process, made an ambitious introduction to Netflix. When They See Us aims to tell an impressive story that has shaken the audience deeply.The series focuses on the \"Central Park Five\" incident in 1989. Since many people are aware of this tragic event thanks to this series, the mission that the series takes on is very important. Five blackish youths are unfairly accused of rape in Central Park in 1989. The series, which tells the struggle of these five young people against justice, dates from 1989 to 2002. The series, which reveals a flutter that touches the heart, is not only important because it is based on reality, but also has inferences that shed light on today. When They See Us is very successful in reflecting the tension and drama of young people's struggle for justification. The main reason why emotions are well reflected is the excellent acting performances in the series. Accurate actor preferences help to better reflect the screenplay with an impressive fiction. Episodes ranging from 60 to 80 minutes allow the 23-year process to be followed step by step. A successful cinematography has been applied to ensure that this tense atmosphere is supported visually. Apart from the main characters, there are also successful names in episodes of the series. The series, which has a crowded staff, is becoming one of the productions to be watched thanks to this collective success.When They See Us reflects a successful example of a genre not so common in Netflix. To see the reflections of a true-life event with its different dimensions in today's world will give the viewers a new perspective. An excellent option for those who want a quality drama. 10/10"
    },
    {
      "username": "punkndrublic7542",
      "userUrl": "https://www.imdb.com/user/ur6901527",
      "reviewLink": "https://www.imdb.com/review/rw4905511",
      "warningSpoilers": false,
      "date": "2 June 2019",
      "rate": "10",
      "helpful": "465 out of 549 found this helpful.",
      "title": "Moved me to tears",
      "content": "The acting in this series especially by the kids/young adults really pulled me in. I havent gotten this emotional watching anything in a long time. The last episode had me in tears multiple and I hope viewers withhold judgment till they see the whole thing. This is still so relevant 30 years later."
    },
    {
      "username": "Imme-van-Gorp",
      "userUrl": "https://www.imdb.com/user/ur76725747",
      "reviewLink": "https://www.imdb.com/review/rw8900512",
      "warningSpoilers": false,
      "date": "1 March 2023",
      "rate": "9",
      "helpful": "10 out of 11 found this helpful.",
      "title": "This story will leave you speechless.",
      "content": "Rating: 8.5/10Themes: Biography, History, Drama, Racism, Injustice, Rape, Prison, Persecution, Law, Police & Crime.Review: This story is something that honestly leaves me speechless. There are no words to describe the outrage I feel with regards to this situation or the injustice of what these five boys went through. It's insane. It's crazy. It's UNJUST. However, I'm now going to go into the actual execution of this series, rather than the story itself, which, in my opinion, left certain things to be desired. I think the first and final episode were chilling and were able to portray the story in the exact right manner. However, the middle two episodes (especially the third) could have been done better. They didn't hit as deep and they felt very rushed. I feel like we didn't really get to see the struggle Kevin, Yusef, Antron and Raymond went through after they got convicted. I feel like we glossed over their experiences a little bit. Opposingly, Korey's life was depicted in detail and with a lot of emotion (in the final episode), and it was his story that eventually brought me to tears. In conclusion, this story is a devastating one, and this series luckily brings a strong light to that, but I personally feel like some things could have been executed a little better to portray the story even better and do even more justice to all these five boys."
    },
    {
      "username": "kiomarsnu",
      "userUrl": "https://www.imdb.com/user/ur22798009",
      "reviewLink": "https://www.imdb.com/review/rw4904865",
      "warningSpoilers": false,
      "date": "1 June 2019",
      "rate": "10",
      "helpful": "236 out of 331 found this helpful.",
      "title": "Oscar contender",
      "content": "This is one of the most beautiful and emotional mini series of the year so far. Well directed, excellent character building, amazing acting and well scripted. It touches your soul and cries out your heart. Thank you, Netflix!"
    },
    {
      "username": "gideonzack",
      "userUrl": "https://www.imdb.com/user/ur100183539",
      "reviewLink": "https://www.imdb.com/review/rw4903428",
      "warningSpoilers": false,
      "date": "1 June 2019",
      "rate": "10",
      "helpful": "130 out of 202 found this helpful.",
      "title": "Should be shown in classrooms across the country",
      "content": "This is educational, jaw dropping, sickening, eye opening, impeccably done on every level, and makes u really think how this could have happened. The DA and the lead Detective should be in jail because this is criminal. The story is true and those accountable for lying to take away 5 young kids lives need to be exposed.I hope every kid sees this in this country. It's not only about race but about being smart and unifying as a country . Understanding the \"justice system\". Don't forget the Kleenex when u watch ep 4."
    },
    {
      "username": "jlangston-29131",
      "userUrl": "https://www.imdb.com/user/ur67759550",
      "reviewLink": "https://www.imdb.com/review/rw4902736",
      "warningSpoilers": false,
      "date": "1 June 2019",
      "rate": "",
      "helpful": "274 out of 392 found this helpful.",
      "title": "Necessary",
      "content": "The only bad reviews I have seen are by conservative commentators who see it as a political diatribe. It isn't. It's the brutally honest story of a horrible tragedy and the racial discrimination of the time, exemplified in a nationally known case. Unfortunately for conservatives, if it's a story about racial discrimination - which has existed throughout history and continues to exist today - its considered a liberal agenda, even though it is not. It's a story of Injustice, and an excellent one at that. Side note: Now some commentators have some now claimed that it blames Trump, but it doesn't. I would point out, however, that Trump backed their conviction and opposed their being let go even after it was demonstrated they were innocent."
    },
    {
      "username": "rebeccarage-11322",
      "userUrl": "https://www.imdb.com/user/ur97271411",
      "reviewLink": "https://www.imdb.com/review/rw4903951",
      "warningSpoilers": false,
      "date": "1 June 2019",
      "rate": "9",
      "helpful": "159 out of 233 found this helpful.",
      "title": "A hard watch but a must watch.",
      "content": "This was an uncomfortable but necessary watch. I was very familiar with the case, even more so that I actually thought but to see it acted out and shot so tremendously was gut wrenching. Sadly injustice has been and will be part of life until the end of time, undoubtedly there's people fighting through it right now. I've seen quite a few negative reviews that this is just a puppet show to stomp on Trump and if that's your belief fine, but in my view facts speak for themselves and I knew about Trumps involvement in this case before this series, but there's no doubt the writer/director really wanted that message out there. Putting all politics, corruption and media aside, it's a truly harrowing, gut wrenching story about how five normal BOYS, lost their freedom, youth and innocence and how all of them including the victim never saw justice served correctly. A hard watch but a must watch."
    },
    {
      "username": "gwen-24620",
      "userUrl": "https://www.imdb.com/user/ur103821150",
      "reviewLink": "https://www.imdb.com/review/rw4904946",
      "warningSpoilers": true,
      "date": "1 June 2019",
      "rate": "10",
      "helpful": "308 out of 385 found this helpful.",
      "title": "A must see!",
      "content": "This was the best movie I've seen in years. It made me angry and it made me sad. Needless to say, justice was not served in this case. The police, the prosecutors, the prison system, and the parole system all failed. Who was there to \"protect and serve\" these boys? How do the prosecutors charge them with confessions such as these? How can people tolerate the crimes and torture happening in our prisons? I don't know if I could have watched this movie if I didn't already know the ending."
    },
    {
      "username": "cey1978-546-444331",
      "userUrl": "https://www.imdb.com/user/ur38282193",
      "reviewLink": "https://www.imdb.com/review/rw4902166",
      "warningSpoilers": false,
      "date": "31 May 2019",
      "rate": "10",
      "helpful": "425 out of 514 found this helpful.",
      "title": "It's a tough watch...",
      "content": "Hard to watch and because it feels so real it really makes me sad and angry."
    },
    {
      "username": "wezza84",
      "userUrl": "https://www.imdb.com/user/ur52286747",
      "reviewLink": "https://www.imdb.com/review/rw4901621",
      "warningSpoilers": false,
      "date": "31 May 2019",
      "rate": "10",
      "helpful": "248 out of 341 found this helpful.",
      "title": "Beautiful acting",
      "content": "Compelling. Just goes to show how messed up a county America is. My heart go out to the Wrongly accused."
    },
    {
      "username": "daniellebridger",
      "userUrl": "https://www.imdb.com/user/ur15738262",
      "reviewLink": "https://www.imdb.com/review/rw4901429",
      "warningSpoilers": false,
      "date": "31 May 2019",
      "rate": "10",
      "helpful": "366 out of 463 found this helpful.",
      "title": "Shocking to watch. So good",
      "content": "Brilliant but very hard to watch. It made me so angry. Fantastic acting from start to finish."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw5802998",
      "warningSpoilers": false,
      "date": "6 June 2020",
      "rate": "9",
      "helpful": "28 out of 51 found this helpful.",
      "title": "Incredible...",
      "content": "Incredible story, incredible storytelling, incredible people, incredible performances, incredible film making, incredible scripting, incredible injustice, incredibly shocking, incredibly relevant, incredibly infuriating, incredible incredible incredible."
    },
    {
      "username": "p_empi",
      "userUrl": "https://www.imdb.com/user/ur2508528",
      "reviewLink": "https://www.imdb.com/review/rw4906166",
      "warningSpoilers": false,
      "date": "2 June 2019",
      "rate": "9",
      "helpful": "95 out of 161 found this helpful.",
      "title": "In rage.",
      "content": "I just finished the first episode and have never felt so outraged. I wanted to turn it off. I just cannot believe those cops were so corrupt. I will continue to watch so that hopefully justice will prevail. This series is intense and I think it's going be worth watching!"
    },
    {
      "username": "PaxtonMalloy",
      "userUrl": "https://www.imdb.com/user/ur26140785",
      "reviewLink": "https://www.imdb.com/review/rw4916118",
      "warningSpoilers": false,
      "date": "6 June 2019",
      "rate": "10",
      "helpful": "36 out of 73 found this helpful.",
      "title": "Jharrel Jerome Breakout Performance",
      "content": "The whole story as it unfolds is absolutely haunting. You feel the pain of those children who had no idea what they are talked and beaten into exploited by the police. If by any chance you feel like stopping to watch, which could possibly happen during the 3rd episode because the script has some structual problems there, don't do it! Episode 4 will blow your mind. A big chunk of this episode follows Korey Wise. This is where Jharrel Jerome delivers nothing short of an oscar performance that will make you tear up. How he captures the innocence, the vulnerbility and the pain of his character is absolutely amazing. Eventhough there are other good performances in the show and it is told well his performance is what makes this a show to remember and elevates it above just good."
    },
    {
      "username": "egeferentino9",
      "userUrl": "https://www.imdb.com/user/ur28804043",
      "reviewLink": "https://www.imdb.com/review/rw4902376",
      "warningSpoilers": false,
      "date": "31 May 2019",
      "rate": "9",
      "helpful": "69 out of 130 found this helpful.",
      "title": "A Must See",
      "content": "I made a mistake in my first review of this Netflix mini series! I wanted to correct myself when I said do read all of the negative reviews. What I want to say is please do not read all of the negative reviews on here. Watch it and make up your own mind!"
    },
    {
      "username": "iliaskymusic",
      "userUrl": "https://www.imdb.com/user/ur72439041",
      "reviewLink": "https://www.imdb.com/review/rw5117951",
      "warningSpoilers": true,
      "date": "13 September 2019",
      "rate": "10",
      "helpful": "59 out of 107 found this helpful.",
      "title": "Disgusted by some of the reviews here...",
      "content": "Firstly, I will address the TV series itself and then the story behind it. As far as actual cinema goes...A riveting spectacle. Sometimes, a bit slow and probably could have been done in 3 parts instead of 4, but nevertheless excellent! The cast is superb! Especially, Jharrel Jerome as Kevin Wise.Now to the actual story: I've been reading some negative reviews here by people screaming that it is \"Lies, propaganda\", \"how rapists get millions of dollars\". What is wrong with you people? Of course, no one truly knows if they were 100% innocent or not, but look at THE FACTS of the case.A known felon, with a history of Rape and Murder confessed to the crime. His DNA matched the DNA found on the victim. He confirmed details and characteristics of the crime that only he could have known. Next to that, you have 5 teenagers. NONE of their DNA matched the DNA found on the victim. None of them had a drop of the victim's blood on their cloths. Read that last sentences again. None of them had a history of violence against women and most probably didn't even know what the word \"rape\" means. 5 Children were brought into an interrogation room, aggressively questioned (including physical violence) for almost 2 days without sleep, without food and without the presence of their parents, who were only present during the \"confessions\" later on. So you have 5 black (PC doesn't matter at this point) children from unprivileged socio economic and educational backgrounds who are questioned by predominately white police inspectors who use a variety of intimidation and manipulation techniques (both mental and physical) to get a confession out of them. Put most children in their place and they would say they freakin' killed the president, just so that they could go home....and without ANY physical evidence connecting them to the crime scene, with greatly conflicting versions in the confessions, with confused time lines and location descriptions, these people STILL get convicted in a trial that today, would have been thrown out the window after 5 min considering how many violations were made...and you STILL have the nerve to scream they were guilty and deserved to rot in prison? You are asking to look at the facts...did YOU go through them? Let me repeat that for you. NO physical evidence was found to tie the suspects to the crime scene. NO DNA matches, NO plausible motive. On the other hand, you have an individual that has all 3 and who has no connection to the 5 teenagers whatsoever, and you STILL want to make them guilty? Un-freakin'-belivable."
    },
    {
      "username": "BudoSenpai",
      "userUrl": "https://www.imdb.com/user/ur23807550",
      "reviewLink": "https://www.imdb.com/review/rw4904144",
      "warningSpoilers": false,
      "date": "1 June 2019",
      "rate": "",
      "helpful": "48 out of 107 found this helpful.",
      "title": "Great job Ava DuVernay !!!",
      "content": "The Trump supporting trolls on here are trying to ruin the overall rating for this compelling story that needs to be told over and over again! This film is definitely not a 1 out of 10 like they're rating it. It deserves at least an 8 just for the acting alone to which I felt was excellent. If you haven't already, please watch the highly acclaimed award winning documentary The Central Park Five. It goes into greater detail about the corrupt NYPD Detectives who brutalized these men who were just innocent kids at the time. I was so pleased that they eventually were exonerated and succeeded in suing New York City and receiving an award for $41 million! This is still happening to Black men in America today, there are many Black men being released after having spent 25-30 years in prison for a crime they didn't commit to receive little to nothing in monetary compensation. Overall, I think this was an excellent Mini-series."
    },
    {
      "username": "karlmartin-47352",
      "userUrl": "https://www.imdb.com/user/ur88404398",
      "reviewLink": "https://www.imdb.com/review/rw4906393",
      "warningSpoilers": false,
      "date": "2 June 2019",
      "rate": "9",
      "helpful": "49 out of 103 found this helpful.",
      "title": "The young cast are phenomenal...",
      "content": "Absolutely outstanding & I can well imagine this winning many, many awards. Some amazing performances, especially by the young cast with what is a shocking but compelling story. A dramatisation Of The Central Park Five"
    },
    {
      "username": "nomi_waters",
      "userUrl": "https://www.imdb.com/user/ur103729770",
      "reviewLink": "https://www.imdb.com/review/rw4903046",
      "warningSpoilers": false,
      "date": "1 June 2019",
      "rate": "10",
      "helpful": "50 out of 104 found this helpful.",
      "title": "Honest, Amazing and Outstanding",
      "content": "The bad reviews are all from conservative trump supporters who believe this show was just trying to pin this on him. Which It is not! Watch the show for yourself and make your own opinion. But this is not a \"liberal agenda to bash trump.\" It stated facts that you guys seem to be upset about. Accept the facts and then maybe you'll be able to enjoy this series."
    },
    {
      "username": "phd_travel",
      "userUrl": "https://www.imdb.com/user/ur22484170",
      "reviewLink": "https://www.imdb.com/review/rw5082358",
      "warningSpoilers": false,
      "date": "26 August 2019",
      "rate": "10",
      "helpful": "15 out of 31 found this helpful.",
      "title": "The justice system failed everyone!",
      "content": "Those who lived through the period all heard of The Central Park Jogger. But not everyone knows about the miscarriage of justice that happened after. This series is breathtakingly tragic and and shocking to watch. A terrible chapter of history about crime and race. New York was a terribly frightening place in the late 80s. Fear ruled. The way the young boys were treated by the law enforcement is so unspeakable. The young actors are excellent and natural. Kudos to Vera Farmiga and Felicity Huffman for playing such wicked people and especially to Vera for putting on an ugly wig. The adjustment to life after prison is quite eye opening. The final episode about Korey is like Papillon with the medieval conditions he suffered.Unforgettable. Required viewing!"
    },
    {
      "username": "sebastianfoxworth",
      "userUrl": "https://www.imdb.com/user/ur47428287",
      "reviewLink": "https://www.imdb.com/review/rw4902636",
      "warningSpoilers": false,
      "date": "31 May 2019",
      "rate": "10",
      "helpful": "61 out of 123 found this helpful.",
      "title": "Simply Put, BRILLIANT!!!",
      "content": "Watched every episode today & it literally has triggered every emotion except laughter in me. Thirty years has passed for me since this first happened and it reminded me of how scary it was to be a young black male in this country. And unfortunately, it still reminds me of how scary it can be."
    },
    {
      "username": "Erlik_Han",
      "userUrl": "https://www.imdb.com/user/ur56039006",
      "reviewLink": "https://www.imdb.com/review/rw4902733",
      "warningSpoilers": false,
      "date": "1 June 2019",
      "rate": "10",
      "helpful": "36 out of 82 found this helpful.",
      "title": "Heart wrenching and brilliant.",
      "content": "This was on my Netflix main page and when I first clicked on it, I thought I was watching the trailer of a show that was newly announced but not yet released. 5 minutes later I finally realised I was actually watching the show. The late 80's early 90's music and vibe kinda drew me in and I figured I'd give it a chance despite knowing absolutely nothing about the show..I binged watched all 4 episodes back to back after that. It was so good I couldn't stop watching.It kinda reminds me of HBOs \"the night of\". It's an incredibly sad and heart wrenching series based on a real event. I don't know how much of it is dramatised but it's absolutely brilliant. The acting is incredible.My only issue with the show is some of the artistic choices made on how it was filmed / edited. Half the show looks washed out or like someone smeared Vaseline over the screen.Other than that it's brilliant though.EDIT: when I first reviewed this, it had a 7.5 or something. Right bow it has a 9 which is in my opinion a very fair score maybe a tiny bit too high. So I removed \"deserves a higher score\" from my title"
    },
    {
      "username": "dstpierre-78223",
      "userUrl": "https://www.imdb.com/user/ur103749095",
      "reviewLink": "https://www.imdb.com/review/rw4901839",
      "warningSpoilers": false,
      "date": "31 May 2019",
      "rate": "10",
      "helpful": "124 out of 201 found this helpful.",
      "title": "A Tragic Story to Remind Us A Powerful Message",
      "content": "Firstly I would like to state, taking the tiny portion given to Trump and then shoving aside the rest of the series is YOUR right. Coming on here and trying to act like your review gives meaning, is also okay.Now an actual review after watching it all. If you can set aside politics and see the much bigger message of The Central Park Five, you'll be able to bear witness a masterpiece. DuVernay has made their story hit hard to a generation who all may not have been around or heard of the tragedy. To those who were around then will see how past mistakes are still made today. Injustice in the justice system continuing with no regards to consequence. To all this can strike a chord if you just watch for their story at the least. This will be a series talked about so might as well watch it and take whatever you get out of it. If there is any takeaway my review can hold it should be this, pause when you need to take a moment. This series is raw but a needed series."
    },
    {
      "username": "Montayj",
      "userUrl": "https://www.imdb.com/user/ur88718227",
      "reviewLink": "https://www.imdb.com/review/rw4940088",
      "warningSpoilers": false,
      "date": "17 June 2019",
      "rate": "6",
      "helpful": "43 out of 105 found this helpful.",
      "title": "Real Story Good, this series not so much",
      "content": "The reason this is good is because of the real story, not because of anything Ava brought to the table. Everything is so drawn out, as only she can do, and tedious and boring. Most people won't criticize because of the real story but I am able to disconnect the real story to a poor job in creating this film version. There are a lot of empty spots in this film. Antron's daddy's story is horribly incomplete. Part 3 was a total waste. We don't see a dramatic prison experience until part 4 with Corey; the other ones are kind of put to the side. There is an unnecessary \"love\" scene\" with little man's sister that had nothing to do with nothing. Part 1 and 2 are drawn out. The only reason it's a 6 rating is because part 4 is good. Then there's that horrible interview by Oprah, talking about when they see us now. She was asking elementary questions."
    }
  ],
  "errorMessage": ""
}