{
  "imDbId": "tt7137906",
  "title": "When They See Us",
  "fullTitle": "When They See Us (TV Series 2019–2019)",
  "type": "TVSeries",
  "year": "2019",
  "language": "en",
  "titleInLanguage": "When They See Us",
  "url": "https://en.wikipedia.org/wiki/When_They_See_Us",
  "plotShort": {
    "plainText": "When They See Us is a 2019 American crime drama television miniseries created, co-written, and directed by Ava DuVernay for Netflix, that premiered in four parts on May 31, 2019. It is based on events of the 1989 Central Park jogger case and explores the lives and families of the five Black and Latino male suspects who were falsely accused then prosecuted on charges related to the rape and assault of a white woman in Central Park, New York City. The series features an ensemble cast, including Jharrel Jerome, Asante Blackk, Jovan Adepo, Michael K. Williams, Logan Marshall-Green, Joshua Jackson, Blair Underwood, Vera Farmiga, John Leguizamo, Felicity Huffman, Niecy Nash, Aunjanue Ellis, Marsha Stephanie Blake, and Kylie Bunbury.\r\nWhen They See Us received critical acclaim, with particular praise for its cast. At the 71st Primetime Emmy Awards, it received 11 nominations; Jerome won for Outstanding Lead Actor in a Limited Series or Movie while it was nominated for Outstanding Limited Series and Ellis, Nash, Blackk, Leguizamo, Williams, Blake, and Farmiga all received acting nominations. The series also won the Critics' Choice Television Award for Best Limited Series.\r\nA companion special, titled Oprah Winfrey Presents When They See Us Now, in which the cast, the creator, and the exonerated five are interviewed, premiered on June 12, 2019, on Netflix and the Oprah Winfrey Network.",
    "html": "<p>When They See Us is a 2019 American crime drama television miniseries created, co-written, and directed by Ava DuVernay for Netflix, that premiered in four parts on May 31, 2019. It is based on events of the 1989 Central Park jogger case and explores the lives and families of the five Black and Latino male suspects who were falsely accused then prosecuted on charges related to the rape and assault of a white woman in Central Park, New York City. The series features an ensemble cast, including Jharrel Jerome, Asante Blackk, Jovan Adepo, Michael K. Williams, Logan Marshall-Green, Joshua Jackson, Blair Underwood, Vera Farmiga, John Leguizamo, Felicity Huffman, Niecy Nash, Aunjanue Ellis, Marsha Stephanie Blake, and Kylie Bunbury.</p><p>When They See Us received critical acclaim, with particular praise for its cast. At the 71st Primetime Emmy Awards, it received 11 nominations; Jerome won for Outstanding Lead Actor in a Limited Series or Movie while it was nominated for Outstanding Limited Series and Ellis, Nash, Blackk, Leguizamo, Williams, Blake, and Farmiga all received acting nominations. The series also won the Critics' Choice Television Award for Best Limited Series.</p><p>A companion special, titled Oprah Winfrey Presents When They See Us Now, in which the cast, the creator, and the exonerated five are interviewed, premiered on June 12, 2019, on Netflix and the Oprah Winfrey Network.</p>"
  },
  "plotFull": {
    "plainText": "When They See Us is a 2019 American crime drama television miniseries created, co-written, and directed by Ava DuVernay for Netflix, that premiered in four parts on May 31, 2019. It is based on events of the 1989 Central Park jogger case and explores the lives and families of the five Black and Latino male suspects who were falsely accused then prosecuted on charges related to the rape and assault of a white woman in Central Park, New York City. The series features an ensemble cast, including Jharrel Jerome, Asante Blackk, Jovan Adepo, Michael K. Williams, Logan Marshall-Green, Joshua Jackson, Blair Underwood, Vera Farmiga, John Leguizamo, Felicity Huffman, Niecy Nash, Aunjanue Ellis, Marsha Stephanie Blake, and Kylie Bunbury.\r\nWhen They See Us received critical acclaim, with particular praise for its cast. At the 71st Primetime Emmy Awards, it received 11 nominations; Jerome won for Outstanding Lead Actor in a Limited Series or Movie while it was nominated for Outstanding Limited Series and Ellis, Nash, Blackk, Leguizamo, Williams, Blake, and Farmiga all received acting nominations. The series also won the Critics' Choice Television Award for Best Limited Series.\r\nA companion special, titled Oprah Winfrey Presents When They See Us Now, in which the cast, the creator, and the exonerated five are interviewed, premiered on June 12, 2019, on Netflix and the Oprah Winfrey Network.\r\nPremise\r\nWhen They See Us is based on events of the April 19, 1989, Central Park jogger case and explores the lives of the five suspects who were prosecuted on charges related to the sexual assault of a female victim, and of their families. The five juvenile males of color, the protagonists of the series: Kevin Richardson (Asante Blackk), Antron McCray (Caleel Harris), Yusef Salaam (Ethan Herisse), Korey Wise (Jharrel Jerome), and Raymond Santana (Marquis Rodriguez), were divided by the prosecutor into two groups for trial. Each youth was convicted by juries of various charges related to the assault; four were convicted of rape. They were sentenced to maximum terms for juveniles except for Korey Wise. He had been held in facilities and served his time in prison.\r\nThey filed a suit against the city in 2003 for wrongful conviction and were awarded a settlement in 2014.\r\nCast and characters\r\nMain\r\nAsante Blackk as Kevin Richardson Justin Cunningham as adult Kevin Richardson\r\nJustin Cunningham as adult Kevin Richardson\r\nCaleel Harris as Antron McCray Jovan Adepo as adult Antron McCray\r\nJovan Adepo as adult Antron McCray\r\nEthan Herisse as Yusef Salaam Chris Chalk as adult Yusef Salaam\r\nChris Chalk as adult Yusef Salaam\r\nJharrel Jerome as Korey Wise\r\nMarquis Rodriguez as Raymond Santana Freddy Miyares as adult Raymond Santana\r\nFreddy Miyares as adult Raymond Santana\r\nMarsha Stephanie Blake as Linda McCray, Antron McCray's mother.\r\nKylie Bunbury as Angie Richardson, an older sister of Kevin Richardson.\r\nAunjanue Ellis as Sharonne Salaam, Yusef Salaam's mother.\r\nVera Farmiga as Elizabeth Lederer\r\nFelicity Huffman as Linda Fairstein\r\nJohn Leguizamo as Raymond Santana Sr., Raymond Santana's father.\r\nNiecy Nash as Delores Wise, Korey Wise's mother.\r\nMichael K. Williams as Bobby McCray, Antron McCray's father.\r\nRecurring\r\nOmar Dorsey as Elombe Brath, a community organizer and activist who appears in the media to defend the five\r\nSuzzanne Douglas as Grace Cuffe\r\nChristopher Jackson as Peter Rivera, lawyer who represented Raymond\r\nJoshua Jackson as Michael Joseph, lawyer who defended Antron\r\nFamke Janssen as Nancy Ryan, a Manhattan ADA originally assigned to the case before it was given to Lederer and later oversaw the overturning of the five's convictions\r\nAdepero Oduye as Nomsa Brath, a community organizer and activist who takes on her husband Elombe's cause after his death\r\nAurora Perrineau as Tanya, girlfriend of Raymond Santana Jr. (adult)\r\nStorm Reid as Lisa, girlfriend of Korey Wise\r\nWilliam Sadler as Michael Sheehan\r\nBlair Underwood as Bobby Burns, lawyer who represented Yusef\r\nLen Cariou as Robert Morgenthau\r\nChukwudi Iwuji as Colin Moore, lawyer who represented Korey\r\nFrank Pando as Detective Gonzalez\r\nAlexandra Templer as Trisha Meili\r\nJayce Bartok as Detective Hildebrandt\r\nDascha Polanco as Elena, new wife of Raymond Santana Sr.\r\nGuest\r\nAllan Greenberg as Howard Diller, lawyer who represented Kevin\r\nIsis King as Marci Wise, Korey's sister, who is a transgender woman\r\nLogan Marshall-Green as Roberts\r\nGary Perez as Manuel Santana\r\nReece Noi as Matias Reyes\r\nEpisodes\r\nSpecial\r\nProduction\r\nDevelopment\r\nOn July 6, 2017, it was announced that Netflix had given the production Central Park Five a series order consisting of five episodes. The series was created by Ava DuVernay who was also set to write and direct. Executive producers were expected to include DuVernay, Jeff Skoll, Jonathan King, Oprah Winfrey, Jane Rosenthal and Berry Welsh. Production companies involved with the series were set to include Participant Media, Harpo Films, and Tribeca Productions. On July 9, 2018, it was reported that the series would consist of four episodes, Bradford Young would serve as the series' cinematographer, and Robin Swicord, Attica Locke, and Michael Starrbury would cowrite each episode with DuVernay.\r\nOn March 1, 2019, DuVernay announced the series had been retitled When They See Us and would be released on May 31, 2019. The announcement was accompanied by the release of a teaser.\r\nCasting\r\nIn July 2018, it was announced that Michael K. Williams, Vera Farmiga, John Leguizamo, Felicity Huffman, Jharrel Jerome, and Jovan Adepo had joined the series' main cast. On August 3, 2018, it was reported that Niecy Nash, Aunjanue Ellis, Kylie Bunbury, Marsha Stephanie Blake, and Storm Reid had been cast in supporting roles. A week later, it was announced that Chris Chalk, Ethan Herisse, Marquis Rodriguez, Caleel Harris, Freddy Miyares, Justin Cunningham and Asante Blackk had filled out the main cast, both as adults and as teenagers. By the end of the month, it was reported that Joshua Jackson, Christopher Jackson, Adepero Oduye, Omar Dorsey, Blair Underwood, Famke Janssen, William Sadler, and Aurora Perrineau had also joined the cast.\r\nFilming\r\nPrincipal photography for the series began during the week of August 6, 2018, in New York City, with cinematography by Bradford Young. On August 10, 2018, filming took place on Madison Avenue in the East Harlem area of Manhattan.\r\nReception\r\nAudience viewership\r\nOn June 25, 2019, Netflix announced that the miniseries had been streamed by over 23 million viewers within its first month of release.\r\nCritical response\r\nWhen They See Us received widespread critical acclaim. On review aggregator Rotten Tomatoes, the miniseries has an approval rating of 97% based on 86 reviews, with an average rating of 8.4/10. The website's critics consensus reads: \"Ava DuVernay pulls no punches in When They See Us, laying out the harrowing events endured by the Central Park Five while adding a necessary layer of humanity to their story that challenges viewers to reconsider what it means to find justice in America.\" On Metacritic, it has a weighted average score of 86 out of 100, based on 27 critics, indicating \"universal acclaim\".\r\nDaniel D'Addario from Variety mentioned in a glowing review of the miniseries, that \"When They See Us immerses viewers in a tale with none of the gaudy fun that true crime often offers. It's an achievement and, given its pride of place on a streaming service despite its difficult subject matter, a worthy use of its director’s star power.\" Roger Ebert's Odie Henderson awarded the series a rating of 3 and 1/2 out of four stars, noting that \"there’s a lot to recommend When They See Us. It does as much as it can to recast the gaze on Black and brown people, eliciting empathy and the desire for justice. It demonizes the right people and demands your fury over the events presented.\" Daniel Fienberg from The Hollywood Reporter recommended the miniseries in his review by highlighting that \"When They See Us is a rigorous attempt to chronicle an epic legal failure and to help restore a sense of the men as individuals, rather than faceless members of a wrongfully accused collective.\" Commending DuVernay's thematic and thoughtful approach to the subject matter and content, he adds that the series avoids the \"typical triumph-over-adversity narrative tropes\".\r\nMatt Goldberg of Collider gave it a very positive review, writing: \"The emotional impact of When They See Us cannot be understated.\" He said further, \"I watched The Central Park Five earlier this month, and it's a good way to understand the case and its basic facts, but even though has interviews with all five men, it doesn't come close to what DuVernay does here with this cast, her craftsmanship, and Bradford Young's stunning cinematography.\" Lucy Mangan from The Guardian complimented the miniseries, saying it is\r\n dense, fast-moving series that examines not just the effects of systemic racism but the effects of all sorts of disenfranchisement (though you could argue they all have that same root cause) on people with the boys' background. The lack of money that leads to inadequate lawyers and mothers unable to visit their sons incarcerated in distant places. The lifetime of fear and vulnerability that causes one parent to encourage his son to sign the confession so they can leave the station and sort things out later. The powerlessness in the face of an authority that doesn't look like you or care about you.\r\nIn a positive review of the miniseries, Jen Chaney from Vulture wrote that, \"When They See Us, Ava DuVernay's sensitively wrought Netflix miniseries about what happened to those boys, strips away the dehumanizing tendency to bunch them together and instead shows what each of them dealt with individually when they were coerced into giving false confessions, forced to do time for a crime they did not commit, and, eventually, exonerated when their convictions were vacated in 2002.\"\r\nWilla Paskin of Slate gave the series a positive recommendation, writing that \"When They See Us may be making an appeal to our duty to attend to this not-at-all-ancient history—but is not, itself, dutiful. In one aspect, in particular, DuVernay's approach is refreshingly unencumbered.\" Robert Lloyd from Los Angeles Times praised the series, stating that it is \"a story about parents and children as much as it is about justice and race — the series has plenty of contemporary resonance on the latter account — and there is strong work from Niecy Nash, John Leguizamo, Aunjanue Ellis and Michael Kenneth Williams among the older generation.\"\r\nArmond White from National Review criticized the series in his review, unfavorably contrasting its portrayal of racial tension and violence to period films like Boyz n the Hood and Do the Right Thing.\r\nAccolades\r\nFairstein reaction and lawsuit\r\nLinda Fairstein, the original New York prosecutor of the case, wrote of the Netflix series in an op-ed for the Wall Street Journal that it was \"so full of distortions and falsehoods as to be an outright fabrication.\" The lawyer-turned-New York Times bestselling author said she agreed with exonerations of the rape charges against the five — but said \"the other charges, for crimes against other victims, should not have been vacated.\"\r\nJohn E. Reid & Associates took DuVernay, ARRA, and Netflix to court in October 2019 because the series called the company's once widely used trademark controversial interrogation technique as \"universally rejected.\" A federal judge dismissed the lawsuit \"Because the First Amendment protects non-factual assertions\". In March 2020, Fairstein filed suit in the U.S. District Court for the Middle District of Florida against Netflix, DuVernay, and Locke for defamation based on her portrayal in the series. In August 2021, the District Court ruled that some of Farstein's claims of defamation and civil conspiracy may proceed to trial.",
    "html": "<p>When They See Us is a 2019 American crime drama television miniseries created, co-written, and directed by Ava DuVernay for Netflix, that premiered in four parts on May 31, 2019. It is based on events of the 1989 Central Park jogger case and explores the lives and families of the five Black and Latino male suspects who were falsely accused then prosecuted on charges related to the rape and assault of a white woman in Central Park, New York City. The series features an ensemble cast, including Jharrel Jerome, Asante Blackk, Jovan Adepo, Michael K. Williams, Logan Marshall-Green, Joshua Jackson, Blair Underwood, Vera Farmiga, John Leguizamo, Felicity Huffman, Niecy Nash, Aunjanue Ellis, Marsha Stephanie Blake, and Kylie Bunbury.</p><p>When They See Us received critical acclaim, with particular praise for its cast. At the 71st Primetime Emmy Awards, it received 11 nominations; Jerome won for Outstanding Lead Actor in a Limited Series or Movie while it was nominated for Outstanding Limited Series and Ellis, Nash, Blackk, Leguizamo, Williams, Blake, and Farmiga all received acting nominations. The series also won the Critics' Choice Television Award for Best Limited Series.</p><p>A companion special, titled Oprah Winfrey Presents When They See Us Now, in which the cast, the creator, and the exonerated five are interviewed, premiered on June 12, 2019, on Netflix and the Oprah Winfrey Network.</p><br/><h3>Premise</h3><p>When They See Us is based on events of the April 19, 1989, Central Park jogger case and explores the lives of the five suspects who were prosecuted on charges related to the sexual assault of a female victim, and of their families. The five juvenile males of color, the protagonists of the series: Kevin Richardson (Asante Blackk), Antron McCray (Caleel Harris), Yusef Salaam (Ethan Herisse), Korey Wise (Jharrel Jerome), and Raymond Santana (Marquis Rodriguez), were divided by the prosecutor into two groups for trial. Each youth was convicted by juries of various charges related to the assault; four were convicted of rape. They were sentenced to maximum terms for juveniles except for Korey Wise. He had been held in facilities and served his time in prison.</p><p>They filed a suit against the city in 2003 for wrongful conviction and were awarded a settlement in 2014.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Asante Blackk as Kevin Richardson Justin Cunningham as adult Kevin Richardson</li><li>Justin Cunningham as adult Kevin Richardson</li><li>Caleel Harris as Antron McCray Jovan Adepo as adult Antron McCray</li><li>Jovan Adepo as adult Antron McCray</li><li>Ethan Herisse as Yusef Salaam Chris Chalk as adult Yusef Salaam</li><li>Chris Chalk as adult Yusef Salaam</li><li>Jharrel Jerome as Korey Wise</li><li>Marquis Rodriguez as Raymond Santana Freddy Miyares as adult Raymond Santana</li><li>Freddy Miyares as adult Raymond Santana</li><li>Marsha Stephanie Blake as Linda McCray, Antron McCray's mother.</li><li>Kylie Bunbury as Angie Richardson, an older sister of Kevin Richardson.</li><li>Aunjanue Ellis as Sharonne Salaam, Yusef Salaam's mother.</li><li>Vera Farmiga as Elizabeth Lederer</li><li>Felicity Huffman as Linda Fairstein</li><li>John Leguizamo as Raymond Santana Sr., Raymond Santana's father.</li><li>Niecy Nash as Delores Wise, Korey Wise's mother.</li><li>Michael K. Williams as Bobby McCray, Antron McCray's father.</li></ul><h4>Recurring</h4><ul><li>Omar Dorsey as Elombe Brath, a community organizer and activist who appears in the media to defend the five</li><li>Suzzanne Douglas as Grace Cuffe</li><li>Christopher Jackson as Peter Rivera, lawyer who represented Raymond</li><li>Joshua Jackson as Michael Joseph, lawyer who defended Antron</li><li>Famke Janssen as Nancy Ryan, a Manhattan ADA originally assigned to the case before it was given to Lederer and later oversaw the overturning of the five's convictions</li><li>Adepero Oduye as Nomsa Brath, a community organizer and activist who takes on her husband Elombe's cause after his death</li><li>Aurora Perrineau as Tanya, girlfriend of Raymond Santana Jr. (adult)</li><li>Storm Reid as Lisa, girlfriend of Korey Wise</li><li>William Sadler as Michael Sheehan</li><li>Blair Underwood as Bobby Burns, lawyer who represented Yusef</li><li>Len Cariou as Robert Morgenthau</li><li>Chukwudi Iwuji as Colin Moore, lawyer who represented Korey</li><li>Frank Pando as Detective Gonzalez</li><li>Alexandra Templer as Trisha Meili</li><li>Jayce Bartok as Detective Hildebrandt</li><li>Dascha Polanco as Elena, new wife of Raymond Santana Sr.</li></ul><h4>Guest</h4><ul><li>Allan Greenberg as Howard Diller, lawyer who represented Kevin</li><li>Isis King as Marci Wise, Korey's sister, who is a transgender woman</li><li>Logan Marshall-Green as Roberts</li><li>Gary Perez as Manuel Santana</li><li>Reece Noi as Matias Reyes</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#542D40;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#542D40\">Title</th><th scope=\"col\" style=\"background:#542D40\">Directed by</th><th scope=\"col\" style=\"background:#542D40\">Written by</th><th scope=\"col\" style=\"background:#542D40\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part One\"</td><td style=\"text-align:center\"><span>Ava DuVernay</span></td><td style=\"text-align:center\"><i>Teleplay by</i> : Ava DuVernay &amp; Julian Breece and <span>Robin Swicord</span><br><i>Story by</i> : Ava DuVernay &amp; Julian Breece</td><td style=\"text-align:center\">May 31, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #542D40\">Five adolescents (Raymond, Kevin, Korey, Yusef, and Antron) are shown in their comfortable, familiar residential neighborhood of Harlem, bantering with each other and playing. They are picked up by police in a sweep of the park after several assaults against other users that night, but it is not until later that the injured jogger is found, and pressure increases.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part Two\"</td><td style=\"text-align:center\">Ava DuVernay</td><td style=\"text-align:center\"><i>Teleplay by</i> : Ava DuVernay &amp; Julian Breece and <span>Attica Locke</span><br><i>Story by</i> : Ava DuVernay &amp; Julian Breece</td><td style=\"text-align:center\">May 31, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #542D40\">The New York City police are shown exerting pressure on the five youths to confess, setting them against one another, talking to them without parents or counsel present, and struggling with evidence. The brutal assault of the jogger has increased pressure on the police to solve the crime and on the prosecutor to take it to trial and gain convictions. Suggestions are made that the timelines, conflicting accounts, and lack of substantive evidence do not support the case, but the juries convict each of the youths of most charges.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part Three\"</td><td style=\"text-align:center\">Ava DuVernay</td><td style=\"text-align:center\"><i>Teleplay by</i> : Ava DuVernay and Robin Swicord<br><i>Story by</i> : Ava DuVernay</td><td style=\"text-align:center\">May 31, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #542D40\">Antron, Yusef, Kevin, and Raymond struggle with being in a juvenile facility. They eventually are released after serving time and have difficulty adjusting to life outside.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part Four\"</td><td style=\"text-align:center\">Ava DuVernay</td><td style=\"text-align:center\"><i>Teleplay by</i> : Ava DuVernay &amp; <span>Michael Starrbury</span><br><i>Story by</i> : Ava DuVernay</td><td style=\"text-align:center\">May 31, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #542D40\">Korey is in adult prison and has the most difficult experiences, choosing the difficulty of isolation cells over repeated assaults by fellow inmates, supported by the cell guards.  In 2002 the actual assailant confesses, his DNA matches the evidences that fit his account. The convictions of the five are vacated. They file a suit against the city, for which they receive a settlement in 2014. Their later lives, detailing marriages, work, social justice activism, and other activities, are summarized. Four of the five move away from the city to make their lives elsewhere.</td></tr></tbody></table><h4>Special</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#000000\">Title</th><th scope=\"col\" style=\"background:#000000\">Directed by</th><th scope=\"col\" style=\"background:#000000\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th class=\"summary\" scope=\"row\" rowspan=\"1\" style=\"text-align:left\">\"Oprah Winfrey Presents: When They See Us Now\"</th><td style=\"text-align:center\">Mark Ritchie</td><td style=\"text-align:center\">June 12, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #000000\"><span>Oprah Winfrey</span> interviews the main cast and executive producers of <i>When They See Us</i>, and the exonerated five.</td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>On July 6, 2017, it was announced that Netflix had given the production Central Park Five a series order consisting of five episodes. The series was created by Ava DuVernay who was also set to write and direct. Executive producers were expected to include DuVernay, Jeff Skoll, Jonathan King, Oprah Winfrey, Jane Rosenthal and Berry Welsh. Production companies involved with the series were set to include Participant Media, Harpo Films, and Tribeca Productions. On July 9, 2018, it was reported that the series would consist of four episodes, Bradford Young would serve as the series' cinematographer, and Robin Swicord, Attica Locke, and Michael Starrbury would cowrite each episode with DuVernay.</p><p>On March 1, 2019, DuVernay announced the series had been retitled When They See Us and would be released on May 31, 2019. The announcement was accompanied by the release of a teaser.</p><h4>Casting</h4><p>In July 2018, it was announced that Michael K. Williams, Vera Farmiga, John Leguizamo, Felicity Huffman, Jharrel Jerome, and Jovan Adepo had joined the series' main cast. On August 3, 2018, it was reported that Niecy Nash, Aunjanue Ellis, Kylie Bunbury, Marsha Stephanie Blake, and Storm Reid had been cast in supporting roles. A week later, it was announced that Chris Chalk, Ethan Herisse, Marquis Rodriguez, Caleel Harris, Freddy Miyares, Justin Cunningham and Asante Blackk had filled out the main cast, both as adults and as teenagers. By the end of the month, it was reported that Joshua Jackson, Christopher Jackson, Adepero Oduye, Omar Dorsey, Blair Underwood, Famke Janssen, William Sadler, and Aurora Perrineau had also joined the cast.</p><h4>Filming</h4><p>Principal photography for the series began during the week of August 6, 2018, in New York City, with cinematography by Bradford Young. On August 10, 2018, filming took place on Madison Avenue in the East Harlem area of Manhattan.</p><br/><h3>Reception</h3><h4>Audience viewership</h4><p>On June 25, 2019, Netflix announced that the miniseries had been streamed by over 23 million viewers within its first month of release.</p><h4>Critical response</h4><p>When They See Us received widespread critical acclaim. On review aggregator Rotten Tomatoes, the miniseries has an approval rating of 97% based on 86 reviews, with an average rating of 8.4/10. The website's critics consensus reads: \"Ava DuVernay pulls no punches in When They See Us, laying out the harrowing events endured by the Central Park Five while adding a necessary layer of humanity to their story that challenges viewers to reconsider what it means to find justice in America.\" On Metacritic, it has a weighted average score of 86 out of 100, based on 27 critics, indicating \"universal acclaim\".</p><p>Daniel D'Addario from Variety mentioned in a glowing review of the miniseries, that \"When They See Us immerses viewers in a tale with none of the gaudy fun that true crime often offers. It's an achievement and, given its pride of place on a streaming service despite its difficult subject matter, a worthy use of its director’s star power.\" Roger Ebert's Odie Henderson awarded the series a rating of 3 and 1/2 out of four stars, noting that \"there’s a lot to recommend When They See Us. It does as much as it can to recast the gaze on Black and brown people, eliciting empathy and the desire for justice. It demonizes the right people and demands your fury over the events presented.\" Daniel Fienberg from The Hollywood Reporter recommended the miniseries in his review by highlighting that \"When They See Us is a rigorous attempt to chronicle an epic legal failure and to help restore a sense of the men as individuals, rather than faceless members of a wrongfully accused collective.\" Commending DuVernay's thematic and thoughtful approach to the subject matter and content, he adds that the series avoids the \"typical triumph-over-adversity narrative tropes\".</p><p>Matt Goldberg of Collider gave it a very positive review, writing: \"The emotional impact of When They See Us cannot be understated.\" He said further, \"I watched The Central Park Five earlier this month, and it's a good way to understand the case and its basic facts, but even though has interviews with all five men, it doesn't come close to what DuVernay does here with this cast, her craftsmanship, and Bradford Young's stunning cinematography.\" Lucy Mangan from The Guardian complimented the miniseries, saying it is</p><blockquote> dense, fast-moving series that examines not just the effects of systemic racism but the effects of all sorts of disenfranchisement (though you could argue they all have that same root cause) on people with the boys' background. The lack of money that leads to inadequate lawyers and mothers unable to visit their sons incarcerated in distant places. The lifetime of fear and vulnerability that causes one parent to encourage his son to sign the confession so they can leave the station and sort things out later. The powerlessness in the face of an authority that doesn't look like you or care about you.</blockquote><p>In a positive review of the miniseries, Jen Chaney from Vulture wrote that, \"When They See Us, Ava DuVernay's sensitively wrought Netflix miniseries about what happened to those boys, strips away the dehumanizing tendency to bunch them together and instead shows what each of them dealt with individually when they were coerced into giving false confessions, forced to do time for a crime they did not commit, and, eventually, exonerated when their convictions were vacated in 2002.\"</p><p>Willa Paskin of Slate gave the series a positive recommendation, writing that \"When They See Us may be making an appeal to our duty to attend to this not-at-all-ancient history—but is not, itself, dutiful. In one aspect, in particular, DuVernay's approach is refreshingly unencumbered.\" Robert Lloyd from Los Angeles Times praised the series, stating that it is \"a story about parents and children as much as it is about justice and race — the series has plenty of contemporary resonance on the latter account — and there is strong work from Niecy Nash, John Leguizamo, Aunjanue Ellis and Michael Kenneth Williams among the older generation.\"</p><p>Armond White from National Review criticized the series in his review, unfavorably contrasting its portrayal of racial tension and violence to period films like Boyz n the Hood and Do the Right Thing.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Nominee(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><td align=\"center\"><span>British Academy Television Awards</span></td><td><span>Best International Programme</span></td><td><i>When They See Us</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Casting Society of America</span></td><td>Limited Series</td><td>Aisha Coley, Billy Hopkins and Ashley Ingram</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"6\"><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td><span>Best Limited Series</span></td><td><i>When They See Us</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"6\"></td></tr><tr><td><span>Best Actor in a Limited Series or Television Movie</span></td><td><span>Jharrel Jerome</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Best Supporting Actor in a Limited Series or Television Movie</span></td><td><span>Asante Blackk</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>John Leguizamo</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Best Supporting Actress in a Limited Series or Television Movie</span></td><td><span>Marsha Stephanie Blake</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Niecy Nash</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>Directors Guild of America Awards</span></td><td><span class=\"mw-redirect\">Outstanding Directing – Movies for Television and Limited Series</span></td><td><span>Ava DuVernay</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>GLAAD Media Awards</span></td><td><span class=\"mw-redirect\">Outstanding Limited Series</span></td><td rowspan=\"3\"><i>When They See Us</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Gotham Awards</span></td><td><span>Breakthrough Series – Long Form</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"6\"><span>NAACP Image Awards</span></td><td><span>Outstanding Television Movie, Limited-Series or Dramatic Special</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"6\" align=\"center\"></td></tr><tr><td rowspan=\"3\"><span>Outstanding Actor in a Television Movie, Limited-Series or Dramatic Special</span></td><td><span>Caleel Harris</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Ethan Henry Herisse</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Jharrel Jerome</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Outstanding Actress in a Television Movie, Limited-Series or Dramatic Special</span></td><td><span>Aunjanue Ellis</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Niecy Nash</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\"><span class=\"mw-redirect\">Peabody Awards</span></td><td>Entertainment</td><td><i>When They See Us</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"11\"><span>Primetime Emmy Awards</span></td><td><span class=\"mw-redirect\">Outstanding Limited Series</span></td><td>Ava DuVernay, <span class=\"mw-redirect\">Jeff Skoll</span>, Jonathan King, <span>Jane Rosenthal</span>, <span>Robert De Niro</span>, Berry Welsh and <span>Oprah Winfrey</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"16\"></td></tr><tr><td><span class=\"mw-redirect\">Outstanding Lead Actor in a Limited Series or Movie</span></td><td>Jharrel Jerome</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Outstanding Lead Actress in a Limited Series or Movie</span></td><td>Aunjanue Ellis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Niecy Nash</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span class=\"mw-redirect\">Outstanding Supporting Actor in a Limited Series or Movie</span></td><td>Asante Blackk</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>John Leguizamo</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Michael K. Williams</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Outstanding Supporting Actress in a Limited Series or Movie</span></td><td>Marsha Stephanie Blake</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Vera Farmiga</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Directing for a Limited Series, Movie, or Dramatic Special</span></td><td>Ava DuVernay</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Writing for a Limited Series, Movie, or Dramatic Special</span></td><td>Ava DuVernay and Michael Starrbury <small>(for \"Part Four\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\" rowspan=\"5\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span class=\"mw-redirect\">Outstanding Casting for a Limited Series, Movie, or Special</span></td><td>Aisha Coley, Billy Hopkins and Ashley Ingram</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Cinematography for a Limited Series or Movie</span></td><td><span>Bradford Young</span> <small>(for \"Part One\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Music Composition for a Limited Series, Movie, or Special (Original Dramatic Score)</span></td><td><span>Kris Bowers</span> <small>(for \"Part Two\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Sound Editing for a Limited Series, Movie, or Special</span></td><td>Suat Ayas, Bobbi Banks, John Benson, Susan Dudeck, Naaman Haynes, Chase Keene, Elliott Koretz, Dawn Lunsford, Jen Monnar, Jesse Pomeroy, Alicia Stevenson, Bruce Tanis and Matt Wilson <small>(for \"Part Four\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Sound Mixing for a Limited Series or Movie</span></td><td>Chris Carpenter, Joe DeAngelis and Jan McLaughlin <small>(for \"Part Four\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>Producers Guild of America Awards</span></td><td><span>Outstanding Producer of Limited Series Television</span></td><td>Jeff Skoll, Jonathan King, Jane Rosenthal, Robert De Niro, Berry Welsh, Oprah Winfrey, Ava DuVernay, Amy Kaufman and <span>Robin Swicord</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"4\"><span>Satellite Awards</span></td><td><span>Best Miniseries</span></td><td><i>When They See Us</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"4\"></td></tr><tr><td><span>Best Actor in a Miniseries or TV Film</span></td><td>Jharrel Jerome</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Best Actress in a Miniseries or TV Film</span></td><td>Aunjanue Ellis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Niecy Nash</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by a Male Actor in a Miniseries or Television Movie</span></td><td>Jharrel Jerome</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\">Society of Composers &amp; Lyricists Awards</td><td>Outstanding Original Score for a Television or Streaming Production</td><td>Kris Bowers</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"2\"><span>TCA Awards</span></td><td><span>Program of the Year</span></td><td rowspan=\"2\"><i>When They See Us</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td><span>Outstanding Achievement in Movies, Miniseries and Specials</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><h4>Fairstein reaction and lawsuit</h4><p>Linda Fairstein, the original New York prosecutor of the case, wrote of the Netflix series in an op-ed for the Wall Street Journal that it was \"so full of distortions and falsehoods as to be an outright fabrication.\" The lawyer-turned-New York Times bestselling author said she agreed with exonerations of the rape charges against the five — but said \"the other charges, for crimes against other victims, should not have been vacated.\"</p><p>John E. Reid & Associates took DuVernay, ARRA, and Netflix to court in October 2019 because the series called the company's once widely used trademark controversial interrogation technique as \"universally rejected.\" A federal judge dismissed the lawsuit \"Because the First Amendment protects non-factual assertions\". In March 2020, Fairstein filed suit in the U.S. District Court for the Middle District of Florida against Netflix, DuVernay, and Locke for defamation based on her portrayal in the series. In August 2021, the District Court ruled that some of Farstein's claims of defamation and civil conspiracy may proceed to trial.</p><br/>"
  },
  "errorMessage": ""
}