{
  "imDbId": "tt2861424",
  "title": "Rick and Morty",
  "fullTitle": "Rick and Morty (TV Series 2013– )",
  "type": "TVSeries",
  "year": "2013",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8808243",
      "warningSpoilers": false,
      "date": "18 January 2023",
      "rate": "8",
      "helpful": "24 out of 26 found this helpful.",
      "title": "Pretty Funny!",
      "content": "I've heard nothing but great things about Rick and Morty but still put off watching it for so long, I finally started it and boy am I glad I finally did. It's hilarious and original! My favorite animated series are Family Guy, Archer, Bojack Horsemen, shows like that and this is right there with them. It's definitely weird but in a good way, a way that will keep you laughing at every episode. You really become invested in it's world and characters like it's a thrilling drama, not an adult animated comedy. Each episode is funny, smart and weird. It's exactly what a science fiction comedy should be. Don't be like me and keep putting off...watch it, it really is as good as everyone says it is!"
    },
    {
      "username": "tabraham44",
      "userUrl": "https://www.imdb.com/user/ur28523636",
      "reviewLink": "https://www.imdb.com/review/rw2947261",
      "warningSpoilers": false,
      "date": "22 January 2014",
      "rate": "10",
      "helpful": "639 out of 755 found this helpful.",
      "title": "Easily the best show I've seen in a while",
      "content": "This show is honestly great. It is easily the best animation show I have seen in a while on any network. The second the show starts you can tell that the characters fit perfectly with each other, and involved with the craziness that happens in the universe with Rick and Morty, they are immediately hilarious and extremely creative at the same time. A couple episodes in and I could tell that this was a unique show, and that people need to be watching it because it has huge potential. And with Dan Harmon writing and directing at the helm of it all, the magic that this show brings is a rare gem in television that people need to watch.. So yeah I highly suggest this show to anyone who wants a true genuine laugh at least once a week."
    },
    {
      "username": "cherold",
      "userUrl": "https://www.imdb.com/user/ur0011762",
      "reviewLink": "https://www.imdb.com/review/rw3577748",
      "warningSpoilers": false,
      "date": "9 November 2016",
      "rate": "9",
      "helpful": "64 out of 80 found this helpful.",
      "title": "Funny and wonderfully ingenious",
      "content": "Rick and Morty is a very funny show. The humor is crazy and is hurled at the audience with breathless speed. Every joke doesn't hit, but there are so many of them that it hardly matters, and when they do hit, they hit hard.That makes it a good show, but what makes it a truly great series is the intelligence of the crazy sci-fi ideas that fuel the stories. Yes, a miniverse inside a miniverse inside a miniverse is ridiculous, but it's also wonderfully ingenious, especially as you see both the variety and consistency of these worlds. A being that insinuates itself into everyone's memories was beautifully done. An episode in which your mind can create your concept of your partner was smart from the beginning, but then kept expanding on the idea.Every idea is nonsensical, but every idea is ingenious and fully explored. This is not just good comedy, it's good sci-fi.I wish this show had lasted as long as the Simpsons (i.e. forever) but what there is is fantastic."
    },
    {
      "username": "Clive_W",
      "userUrl": "https://www.imdb.com/user/ur30888832",
      "reviewLink": "https://www.imdb.com/review/rw4987345",
      "warningSpoilers": false,
      "date": "10 July 2019",
      "rate": "10",
      "helpful": "122 out of 149 found this helpful.",
      "title": "Wubba Lubba Dub Dub!!!",
      "content": "There's not just one thing I love about this show, everything that goes into the show, how the creators treat their fans, to the characters created, to the writing, everything what makes this what it is I love."
    },
    {
      "username": "ericstevenson",
      "userUrl": "https://www.imdb.com/user/ur66601046",
      "reviewLink": "https://www.imdb.com/review/rw3462350",
      "warningSpoilers": false,
      "date": "2 May 2016",
      "rate": "10",
      "helpful": "51 out of 64 found this helpful.",
      "title": "Best Adult Swim show ever!",
      "content": "Scratch that. This may be the best Cartoon Network show period! Yeah, you don't normally group Adult Swim shows with other ones, but as someone who watches both, this is freaking awesome! The funniest thing is how I was introduced to this series. I was actually recommended by a friend at work to see it. I looked here on the IMDb and found out it had the highest rating of any animated show (not including anime) that I'd ever seen! And you know what? I think it completely deserves it.Apart from having good animation, the characters and stories in this show are just so freaking fun. Every single character is dysfunctional in some way, but never to the point where they're unlikeable. Rick of course steals the show. I believe it when I hear that Rick represents a cynical part of our personalities and Morty is the idealistic one. The fact that both of these characters are voiced by Justin Roiland makes it all the more obvious. I keep expecting Morty to say \"Unacceptable!\" at any time. I kept wondering who this guy was and why I kept hearing him in every cartoon I was watching.I have yet to find a single episode of this show I didn't like. Then again, the show hasn't gone on that long and I haven't seen all the episodes. I think my favorite is probably \"Lawnmower Dogs\". The two plots are so good and hilarious. Anything with Scary Terry is amusing. What sets this apart from lesser shows like \"Family Guy\" is that this show does work so much harder to make you laugh and doesn't try to just gross you out. It really does focus on character development and takes time to make jokes relevant to the story. It's still not quite as good as \"South Park\" but it's fairly close in terms of adult cartoons. I think my former favorite Adult Swim show was \"Robot Chicken\" or perhaps \"The Venture Bros.\".There's quite a lot of variety in Rick and Morty's adventures. There's quite a bit of creativity. There even are some truly heartwarming moments. I can always count on this to make me laugh or entertain me in any way. This just succeeds where so many adult cartoons have failed as they try to hard to be obscene or just aren't funny. The plot? Well, not really much except Rick travels through space and other dimensions with his grandson, Morty. The vocal range is great and it's nice and colorful.Watch this show and laugh like mad. Perfect ****!"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw9017814",
      "warningSpoilers": false,
      "date": "26 April 2023",
      "rate": "7",
      "helpful": "11 out of 12 found this helpful.",
      "title": "2/3 fantastic, 1/3 disappointing",
      "content": "That seems to be the general consensus regarding 'Rick and Morty' and this reviewer cannot disagree. Am a huge fan of animation, something that most people on here will most likely know about already (have made no secret of it) and appreciate all kinds of humour. Am not always the biggest fan of the cruder, grossout style of humour and have seen it done badly more times than can be counted, but when it's done well it is funny. Had heard nothing but great things of the show and finally decided to make my way through it quickly.On the most part, 'Rick and Morty' is well worth watching and there is a huge amount to like and enjoy. At the same time, part of me did feel that it didn't quite live up to the acclaimed hype. Seasons 1-3 deserve any ounce of the praise they get, as they make for some of the best animated television in recent years. Do have to agree completely with those saying that Seasons 4 and 5 don't feel the same, which is why my mostly positive opinion isn't here.Beginning with the good, Seasons 1-3 are brilliantly written. Namely the genuinely hilarious and clever humour that gets away with a lot, where even the cruder parts don't come over as too distasteful, timed impeccably. Which is balanced beautifully with poignant emotional elements, without falling into over sentimentality. The concept is a creative one and is done justice by the imaginative and wonderfully energetic storytelling, admittedly the atmosphere is bizarre and can be random but that was part of the charm (as someone who is used to this kind of storytelling it wasn't an issue at all).Characters have very individual and entertaining personalities, while the voice acting from all is spot on (something that didn't change when the show declined). The music is dynamic with the action and the theme song is infectious. Have seen criticisms of the animation, but while the character designs take some getting used to it is very richly detailed and vibrant.Really do wish that Seasons 4 and 5 were better than they were, but they were really disappointing. Where there is a lot of predictability and fatigued rehashing and the energy is noticeably slower and not near as lively. There is very little that is imaginative and it was like the creative concept had run its course.Furthermore, the writing is nowhere near as strong, with the humour, or more like the attempts at it (which is a lot fewer in quantity), being far too safe and careful rather than the bold risk taking that Seasons 1-3 had. It also gets really juvenile and the stupidity goes through the roof. Even the characters lose their spark, with Rick becoming dumbed down and annoying, as well as their chemistry.In summary, loved it to begin with and it had all the makings of a classic but it is a shame that it declined so significantly. 7/10."
    },
    {
      "username": "sophiamar",
      "userUrl": "https://www.imdb.com/user/ur74904016",
      "reviewLink": "https://www.imdb.com/review/rw4823003",
      "warningSpoilers": false,
      "date": "2 May 2019",
      "rate": "10",
      "helpful": "194 out of 238 found this helpful.",
      "title": "WE NEED MORE EPISODES!!!",
      "content": "Send help! I rewatched this 5 times already and it's still amazing, and I never rewatch anything."
    },
    {
      "username": "Jim_Screechy",
      "userUrl": "https://www.imdb.com/user/ur121044055",
      "reviewLink": "https://www.imdb.com/review/rw8735133",
      "warningSpoilers": false,
      "date": "14 December 2022",
      "rate": "7",
      "helpful": "18 out of 21 found this helpful.",
      "title": "Once great, now oddly... almost unwatchable.",
      "content": "When I first found Rick and Morty about five or so years ago I thought I'd found a gold mine! A mix of intelligent writing, complex concepts and narcissistic behaviour crammed into a crazy Sci-fi animated series. Well that's exactly what I'd found. Mostly 'loosely' but coherently contrived episodes that fit into the landscape of the insanity of the characters and the continuity of space, science and weird conceptual thinking.This largely changed with season 5-6 though latter episodes of season 4 started showing this trait. Well it hasn't been the same since. It's as though the people who are now writing don't really understand the concepts they are trying to portray and don't really 'get' the characters they are writing for. Remember when you were in school, and you didn't understand a theorem, concept or notion a teacher was explaining and asked (with your juvenile uncertainty and underlying fear) for clarity or elaboration? But the teacher just either repeated what they'd said previously or made a hash of trying to expand on an explanation they'd clearly learned, but never really understood? It's like that.The series five in particular and now six have an odd feeling of rushed complexity and abstract portrayal, almost like... you get in a film that was initially two hours long, but marketing determines by acceptable standards must not be over an hour and a half. So thirty minutes is cut, and the result is a shorter film no one understands and fewer end up seeing.I've watched series 1-4 maybe ten times each episode. It's my 'go to' series when I'm in bed at night before sleeping. There is simply no limit to the level of enjoyment I experience while watching, and aside from the half dozen t-shirts, two custom made sofa cushions, a portal gun on the shelf in my office, custom Halloween costumes last Halloween (including wigs) made last year for me and my nephew, I can't overstate how much of a fan I am. Suffice to say, my disappointment with the lack of cohesion in series five and six is palpable.How is it that something so different, refreshing and obtuse, something so inspiring and different has taken such a dismal turn? I just don't get the episodes anymore. They are convoluted, confusing and concocted. There is no enjoyment in watching. Anyway, not sure what's going on with the series but I'm actually finding myself both hoping the series isn't continued (my fear is it will be totally destroyed and along with it my unhealthy and irrational connection to it) and/or information is released that network execs (or whoever is calling the shots) are responsible for the poor standard of production that fans have recently had to suffer.I'm not one of these 'it was good before everyone else started liking it' nutcases, stuck in a bubble of perpetual continuity over a theme I'm latching onto for security or nostalgia. It's just not meeting the standard it did previously. Sadly."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7148625",
      "warningSpoilers": false,
      "date": "21 July 2021",
      "rate": "8",
      "helpful": "28 out of 36 found this helpful.",
      "title": "Lives up to all the hype!",
      "content": "I've heard nothing but great things about Rick and Morty but still put off watching it for so long, I finally started it and boy am I glad I finally did. It's hilarious and original! My favorite animated series are Family Guy, Archer, Bojack Horsemen, shows like that & this is right there with them! Don't be like me and keep putting off...watch it, it really is as good as everyone says it is!"
    },
    {
      "username": "johnnybravoctk",
      "userUrl": "https://www.imdb.com/user/ur135331896",
      "reviewLink": "https://www.imdb.com/review/rw8762658",
      "warningSpoilers": false,
      "date": "28 December 2022",
      "rate": "10",
      "helpful": "17 out of 20 found this helpful.",
      "title": "For me personally, this is the most cerebral, entertaining and funny tv series going",
      "content": "I mean Rick and Morty is SO good, that the writers of 'Everything, Everywhere, All at Once' basically copied (heavily influenced...If I'm being nice) the multiverse traveling premise of Rick and Morty and might win a Best Picture Oscar from it. Nothing is more creative or ingenius at this particular time and we should all be so grateful that such a show exists. I hope they never stop with episodes and go as long as The Simpsons and South Park did. I actually also love Solar Opposites but it's nowhere near the genius level of Rick and Morty in my opinion. Something about Harmon and Roiland as a team just make magic. So here's to them staying friends for a very long time."
    },
    {
      "username": "siebertws13",
      "userUrl": "https://www.imdb.com/user/ur24536545",
      "reviewLink": "https://www.imdb.com/review/rw3125899",
      "warningSpoilers": false,
      "date": "17 November 2014",
      "rate": "10",
      "helpful": "85 out of 115 found this helpful.",
      "title": "Hilarious, smart, fresh, original and unexpectedly emotionally resonant",
      "content": "There were only 11 episodes in the first season, so it seems a little premature and overenthusiastic to call this the funniest and best show on television, but I'm tossing it out there anyway. Too much of the Adult Swim programming is mean-spirited and ugly, but \"Rick & Morty\" balances its cynicism with moments of genuine familial and societal warmth. The characters are well-developed and evolve over the course of the season, and the voice talent is gifted -- Chris Parnell is the secret weapon as Morty's not-too-bright dad. The Pilot is the only episode I was Luke-warm on, because it's the only one where the nastiness overwhelms everything else, but it fits well into the course of the entire season because it gives the bitter alcoholic grandfather Rick something to grow away from, and the first year gets better and better as it rolls along.There isn't a lot of TV I can watch with my son, but this is just about the best of it. Can't wait for season 2, and I hope there will be more than 11 episodes."
    },
    {
      "username": "popyoshi-36312",
      "userUrl": "https://www.imdb.com/user/ur125662112",
      "reviewLink": "https://www.imdb.com/review/rw8894237",
      "warningSpoilers": false,
      "date": "26 February 2023",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Very weird, dark and funny",
      "content": "Season 4 and 5 have some very questionable episodes but it's still a very well made show. If you love movies and sci fi then you'll love this show a lot of episodes will have amazing unique concepts that can be confusing but are funny and well enough explained. Other episodes will spoof movies and shows while making there own thing with it and they usually do it in a funny way and make fun of the property instead of just referencing it. Some episodes will literally just be the voice actor getting drunk and saying the most random things and turning it into an episode which causes very weird and random scenarios. The show can be very dark, clever and funny but it can also be stupid and disgustingly weird. It's a great show to just watch it's funny and short episodes. The show does also have a story although only a small handful of episodes actually add to it. There is also a clear sense of continuity in the show but it can still work without knowing the context."
    },
    {
      "username": "ffionjackson",
      "userUrl": "https://www.imdb.com/user/ur130497566",
      "reviewLink": "https://www.imdb.com/review/rw8801944",
      "warningSpoilers": false,
      "date": "15 January 2023",
      "rate": "9",
      "helpful": "23 out of 23 found this helpful.",
      "title": "Fun",
      "content": "Great show, loved the fun sci-fi comedy plot mixed in with serious lore I'm definitely bias toward shows with this premise, it's rewatch able due to the foreshadowing (something I really appreciated as someone who rewatches shows religiously). I watched the entire show in a bit over two weeks, it consistently kept me entertained with its imaginative plots. But why so much incest? Probably my only complaint, I can deal with the odd joke but it felt like an odd running gag that was never really addressed properly. I put off watching Rick and Morty for a long time due to the fan reputation, but it definitely lived up to the hype and was well worth the watch."
    },
    {
      "username": "dholliday-imdb",
      "userUrl": "https://www.imdb.com/user/ur59092557",
      "reviewLink": "https://www.imdb.com/review/rw7163956",
      "warningSpoilers": false,
      "date": "26 July 2021",
      "rate": "",
      "helpful": "77 out of 114 found this helpful.",
      "title": "I'm giving up now",
      "content": "I've watched up to the leaked S5E7 ep and have given up on the show now.Seasons 1-3 are fantastic: intelligent, funny, weird and deep. Brimming with original ideas. Despite often having a fast-pace you could still follow what was going on, and feel invested. You'd wonder how Rick & Morty would save the day, and be impressed by how things turned out. There's even strong moments of drama and pathos, and a promising mythology build-up with Citadel of Ricks, Evil Morty etc. All 30 eps are worth watching. 9/10.Seasons 4-5 are a pale shadow: it's lost the intelligence, the wit and the depth. It's ditched the mythology, recycles ideas and replaced dramatic pathos with school-level family drama. Rick has gone from being one of the great cartoon characters to becoming a dull self-aware Deus Ex Machina tool (even meta-referencing this during one S5 ep...that's not smart, that just highlights how lazy the writing has become). Flanderization has affected the other characters too, All the show's got left is being weird, and upping the hectic up to 11...it's way too fast-paced, as a viewer it's just painful to follow now. From the 16 eps so far of Seasons 4 & 5 there's two, maybe three eps worth watching...a shockingly poor return, and frankly a waste of my time now. 3/10.Watch the first three seasons and pretend it ended then."
    },
    {
      "username": "Arcadia1701",
      "userUrl": "https://www.imdb.com/user/ur34110928",
      "reviewLink": "https://www.imdb.com/review/rw7188973",
      "warningSpoilers": false,
      "date": "2 August 2021",
      "rate": "5",
      "helpful": "78 out of 122 found this helpful.",
      "title": "Fire all the writers of season 4 and 5",
      "content": "Urgh why do great shows always collapse once they get popular?Seasons 1-3 are literally a 10, brilliant. Then it seems that they get a big 70 episode deal, bring in a bunch of new idiot writers and churn out garbage.Normally this would incur a vengeful 1 out of 10 out of spite for ruining such a great show but the first seasons were just so good I'll split the difference with a 5."
    },
    {
      "username": "sweetcommando",
      "userUrl": "https://www.imdb.com/user/ur35175508",
      "reviewLink": "https://www.imdb.com/review/rw2986952",
      "warningSpoilers": false,
      "date": "26 March 2014",
      "rate": "8",
      "helpful": "251 out of 337 found this helpful.",
      "title": "Just as TV started to go downhill...",
      "content": "Let me just say that I was very skeptical about this show. Judging from the sneak peaks and previews, I assumed this was going to be just another family guy/ Brikleberry lazily animated show with some cheap and low standards. Well gee wizz, I was very very wrong! Rick and Morty might seem like some stupid knock off of Back to the Future or some money laundering scheme as part of late night cable TV, but its not. Behind all the jokes, each episode surprisingly has a strong message and whether you can relate to it or not, you won't really feel like the end of each episode was a bummer.The weakest aspect is the animation. Its not pretty and seems out dated. Despite this, its hard to say that this pulls the show down. No, not even one bit. The absolutely clever writing and well designed character personalities are basically what this show floats upon. Unlike many other cartoons that have a sub plot in every episode, the ones in this show are actually relevant and memorable. They aren't just there as fillers and they are nearly as important as the main story. In fact, in most episodes its hard to tell which one is the sub plot and which one is the main plot.What I'm trying to say is that this show is near perfect. What are you still doing watching new Simpsons and Family guy, go watch this show if you haven't already. Its a great example of how TV hasn't turned to total crap."
    },
    {
      "username": "shifeili",
      "userUrl": "https://www.imdb.com/user/ur13830029",
      "reviewLink": "https://www.imdb.com/review/rw2953492",
      "warningSpoilers": false,
      "date": "2 February 2014",
      "rate": "9",
      "helpful": "117 out of 162 found this helpful.",
      "title": "Best new cartoon show 2013!",
      "content": "The show feels fidgety in the beginning. At first it makes you take a second to get used and into it. But it's as intelligent and hilarious a show as I haven't seen one since a long time! That's what I and hopeful many other viewers are going to realize after a couple of minutes. It'S one of those shows that wouldn't happen to be without Adult Swim. Not exactly a family show. Anyways - this show is brilliant. The humor is not as cheap as in most of the successful cartoons and the show is not as comfortable to watch, but that's one thing that makes it so hilarious. It's really dark sometimes, and the viewer with a good sense of humor will appreciate that. The only thing that might make the show a bit better is that the creators could make the characters a bit better known and thus more likable to the viewer. Like this a plot as in episode 6 (SE1) would work even better. Well, the characters maybe a bit flat still, but the plots and happenings are making all this acceptable. Amazingly funny and thoughtful story line for a 20min cartoon show. The sad part is, that it might not really be for the rank and file and as a result might not last for too long or even be recognized by too many people. I really hope this goes on for a while, though! I love this show - it's great. Keep up the good workPS.: I hope they take one or two scientists on board to help them with Grandpa Rick to keep him on track regarding scientific accuracy. But that'S just a personnel tic of mine..."
    },
    {
      "username": "Jake231098",
      "userUrl": "https://www.imdb.com/user/ur100946023",
      "reviewLink": "https://www.imdb.com/review/rw8837832",
      "warningSpoilers": false,
      "date": "30 January 2023",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Still a good series despite falling off between seasons 4 & 5",
      "content": "Now I'm not sure if any of you felt the same way but when I first saw this show back when it came out I didn't like it at all. However when I heard some people at school talking about this show and saying they liked it, I decided to give it another chance to see what all the fuss was about and having watched season 2 I changed my mind.The show revolves around an old scientist named Rick Sanchez who along with his grandson - Morty Smith - goes on all sorts of crazy adventures to different dimensions and planets through his portal gun or the flying saucer.Seasons 1 to 3 I think are definitely some of the best adult animation we've had in the past decade and I can understand what people love about this show, but sadly I feel as if the show fell off between seasons 4 and 5. Season 6 I think was alright but the spark this show once had is pretty much gone.I put this show at 7/10 because for one I used to get wound up in college for saying I liked this show and another reason is I saw it as a rip-off of Regular show (sounds silly I know but please understand).And why: because the main characters names start with an R and an M, one is taller and has blue hair while the other is shorter and has brown hair. Not to mention the animation style does look a bit familiar if you were to put both of these shows together.Despite all that however, Rick and morty is still a pretty good adult sitcom and worth the watch if you haven't seen it yet."
    },
    {
      "username": "bobthomp",
      "userUrl": "https://www.imdb.com/user/ur2072738",
      "reviewLink": "https://www.imdb.com/review/rw7191114",
      "warningSpoilers": false,
      "date": "3 August 2021",
      "rate": "3",
      "helpful": "58 out of 79 found this helpful.",
      "title": "This is why it sucks now..",
      "content": "If you look at timeline for the writers you can see all the writers from season 1-3 are gone. These new writers are very formulaic. They think \"this is what a Rick and Morty show must have in it\". Originality is gone. Also the new writers are trying to make this into a Simpsons/Family Guy cartoon with all the family.First three seasons are wonderful and you can watch them over and over. Season 4 and 5, are tolerable enough to watch once.I would strongly suggest they get back the old writers. Also cut back on having the family in the show. It's making the show Simpsons with crude jokes."
    },
    {
      "username": "fruhz",
      "userUrl": "https://www.imdb.com/user/ur19851320",
      "reviewLink": "https://www.imdb.com/review/rw2931515",
      "warningSpoilers": false,
      "date": "23 December 2013",
      "rate": "9",
      "helpful": "167 out of 224 found this helpful.",
      "title": "The Best New Adult Animated Series Around",
      "content": "I just finished watching the first three episodes and feel instantly hooked. I have the same feeling I had when I watched Family Guy for the first time, in which I felt like every single character was interesting and was contributing for the series in their own ways. In this show, things that will make you laugh are dark and awkward at times which succeed every time. I haven't found a single bad moment so far in the first three episodes and can't wait to watch the whole thing The first episode was awesome and got me straight to the next. The dog world domination episode is going to be a classic, go watch it. People will remember that episode."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw4344964",
      "warningSpoilers": false,
      "date": "17 September 2018",
      "rate": "10",
      "helpful": "26 out of 41 found this helpful.",
      "title": "May the Farce \"buuurp\" Be With You!",
      "content": "A dirty old scientist with a tendency to deliver one syllabus out of five with a raspy burp and who looks like a pale imitation (skin-wise) of Doc Emmet Brown literally grabs by the foot his fourteen years old cowardly and not-so-bright grandson named Morty to the craziest adventures outer space, on Earth, or somewhere in between.Now if that couple doesn't ring a bell, I don't see what king of appeal you'll ever find in this show, but since you've registered to IMDb, my guess is that you know what \"Rick and Morty\" is deliberately ripping off, but don't get it wrong, it's not a cheap ersatz of \"Back to the Future\" combined with the graphic quality (or lack of) of all these post-Simpsons animated sitcoms. And don't get it wrong, beneath its \"South Park\"-like affront to good taste and plot continuity, \"Rick and Morty\" isn't your typical \"no holds barred\" over-the-top cartoon either, like the aforementioned show and other gems such as \"Futurama\".I believe without any pompousness that there's more intelligence in one episode of the unlikely duo than in many wannabe legitimate sci-fi shows or movies. I'd go as far as saying that it is one of the most intelligent shows of the last ten years for both its timely relevance and the way it juggles with every possible scientific concept and pushes them all to the most hilarious extremes while maintaining some plausibility. In other words, this is the show that reconciled me with my geeky side, because it takes a geek to spot one and I'd rather believe that the Earth is as flat as calzone (with the olive oil next to it) than that neither of Dan Harmon or Justin Roiland (creators of the show) are geeks. If anything, these guys are proving the world that nerds rule the world because nerds rule period, only maths and humor can create so much irrationality through pure logic and since maths is the alphabet that wrote the universe (taking a shortcut from Galileo's quote), it kind of inflates any geek's ego to be able to get every single joke from \"Rick and Morty\" and see other audiences laugh at it, it's like a personal triumph because as a proud geek, I love this show because I understand that the power of humor is to transcend any barriers, just like science, and this is why humor is so precious, it appeals to our intellect, to what makes us humans. Geeks have a sense of humor!And as long as the show is funny, there's never enough sex or violence, as long as it doesn't venture in the realm of predictability, it's the kind of humor that trusts your intelligence and go as far as imagination can take you. Any plot can tend to the most infinite implications and just when you think you've seen everything; the film finds THE little twist. It even toyed with the parallel universes in a way that made me believe it could really happen, and after all, why not? The best thing about the show, and there are many good things, is that it manages to reassembles pieces of déja vu plot and combine them with scientific concepts and making fresh material out of familiar tropes. How many times did we see a family leaving the house to the kids and then they make a party, but how about two parties, one with teenage friends the older sister want to impress and Rick's inter-galactical buddies, how about mixing these two populations and see where it leads to... how about a mystery guest with the hilarious name of Abradolf Linker, the most unlikely hybrid a twisted mind could conceive..I could go on with that simple plot (the last of season 1) to highlight the writing's greatness but I could also mention the homage to \"Inception\", Morty experiencing parenthood, the way timeline is continuously screwed up leading to the unlikely scenario where the pair must bury their dead selves from another universe... or how about the portrayal of aliens and planets in other cartoons? \"Rick and Morty\" feels like a sort of Pandora Pox where any plot can basically unfold, where there's the humoristic resources are as infinite as the universe.Of course, Rick's crude manners and burping shtick or Morty's anxiety can get redundant and not every episode is a masterpiece but the sum of all the hilarity each one provides is superior to anything I've seen from comedic shows. Plus, it's never so scientifically inaccurate that you want to disqualify it as a good sci-fi program, there's never a moment where it feels like a fantasy except when it contributes to a funnier bit. And sometimes, it also explores the warmth side and portray Morty's family with genuine realism.From a father who's got too much prove and a mother works hard to conceal her hard feelings, you've got to wonder how Morty got so insecure, that he'd finally find more balance and advise to confront life with his cynical grandfather makes sense. I wonder too would whether trading all the family love for a burping alcoholic figure capable to take someone to the next galaxy like you go to Hector's Tacos' wouldn't be a better life deal. Morty sure learned one thing or two about life in these crazy adventures. And so did we.I would conclude this review of \"Rick and Morty\" with that quote from Bogart \"the problems of two people don't matter to a hill of a beans in this crazy world\", well, Rick and Morty make them matter more than the universe, and we empathize with them because the world and the universe, and even life have never been as funny without them. I just hope the writers won't run out of ideas, I kind of like their approach to creation, take your times guys, and may the farce be with you! \"Burp\"!"
    },
    {
      "username": "BadgerStorm4345",
      "userUrl": "https://www.imdb.com/user/ur113370202",
      "reviewLink": "https://www.imdb.com/review/rw5658130",
      "warningSpoilers": false,
      "date": "20 April 2020",
      "rate": "9",
      "helpful": "20 out of 30 found this helpful.",
      "title": "Creativity Maximized",
      "content": "Rick and Morty is the most creative show I've ever seen. Each episode brings in new concepts which are explored in a humorous way or in a deep way, most of the time it can even be both. With likable characters that you're invested in, Rick and Morty seems to be a joyride of a TV show that I can't wait to get more of."
    },
    {
      "username": "wifebanger",
      "userUrl": "https://www.imdb.com/user/ur103725404",
      "reviewLink": "https://www.imdb.com/review/rw4900984",
      "warningSpoilers": false,
      "date": "31 May 2019",
      "rate": "10",
      "helpful": "179 out of 224 found this helpful.",
      "title": "😍😍",
      "content": "10/10 Rick: Listen, Morty, I hate to break it to you, but what people call \"love\" is just a chemical reaction that compels animals to breed. It hits hard, Morty, then it slowly fades, leaving you stranded in a failing marriage. I did it. Your parents are gonna do it."
    },
    {
      "username": "isaacwest-66001",
      "userUrl": "https://www.imdb.com/user/ur155987197",
      "reviewLink": "https://www.imdb.com/review/rw8891311",
      "warningSpoilers": false,
      "date": "25 February 2023",
      "rate": "7",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Start It, But Don't Plan on Finishing",
      "content": "I highly recommend getting into this show, but unfortunately the enjoyment did not last for me. It it's genius, funny, and sometimes deep. It's also very imaginative in both comedy and design, and sometimes enjoyably dull, if you know what I mean. The voices for many of the characters especially Rick and Morty are fun too and well done. However my issue is that shows seemed to wear me down. Whenever the show tried to have a deep message, it was almost always a negative one. A negative message is by no means inherently a bad thing, but the show had little interest in moving on. Speaking of moving on, Rick and Morty were great characters but have no noticeable progression, which usually okay for a cartoon, you don't want characters to change too much, but the supporting cast around Rick and Morty did change and progress, whereas Rick and Morty don't so as weird as it is to suggest character development for cartoon characters, it feels just as weird that Rick and Morty don't progress. For me, Rick and Morty seemed oddly predictable by a few seasons; sure the settings were still incredibly exciting and unique, it always seemed to be the same kind of story to me where there's never if ever any kind message to take home. Like I said at the start, I highly recommend everyone give it a try because obviously a lot of people love it, and for a while I did too, but it eventually slowed down for me."
    },
    {
      "username": "cherylkyrandia",
      "userUrl": "https://www.imdb.com/user/ur93158866",
      "reviewLink": "https://www.imdb.com/review/rw8957770",
      "warningSpoilers": false,
      "date": "29 March 2023",
      "rate": "8",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Great series",
      "content": "Rick and Morty is a one of a kind adult animated series that follows a crazy scientist and his grandson as they go on some pretty whacky adventures, akin to Back to the Future. There are some pretty unique and unusual stories, some memorable tunes that come up in the series and cringy moments. The series definitely falls off in terms of momentum in the latter seasons. The episodes just aren't as compelling as they originally were. But never the less, you won't be able to help yourself and continue on with the adventures. My favourite episode by far is Pickle Rick - because if you know, you know!"
    }
  ],
  "errorMessage": ""
}