{
  "imDbId": "tt2861424",
  "title": "Rick and Morty",
  "fullTitle": "Rick and Morty (TV Series 2013– )",
  "type": "TVSeries",
  "year": "2013",
  "language": "en",
  "titleInLanguage": "Rick and Morty",
  "url": "https://en.wikipedia.org/wiki/Rick_and_Morty",
  "plotShort": {
    "plainText": "Rick and Morty is an American adult animated science fiction sitcom created by Justin Roiland and Dan Harmon for Cartoon Network's nighttime programming block Adult Swim. The series follows the misadventures of Rick Sanchez, a cynical mad scientist, and his good-hearted but fretful grandson Morty Smith, who split their time between domestic life and interdimensional adventures that take place across an infinite number of realities, often traveling to other planets and dimensions through portals and on Rick's flying saucer. The general concept of Rick and Morty relies on two conflicting scenarios: domestic family drama, and a misanthropic grandfather dragging his grandson into hijinks.\r\nRoiland voiced the eponymous characters, with Chris Parnell, Spencer Grammer, and Sarah Chalke voicing the rest of Rick and Morty's family. The series originated from an animated short parody film of Back to the Future created by Roiland for Channel 101, a short-film festival cofounded by Harmon. Since its debut, the series has received critical acclaim for its originality, creativity, and humor. It has been nominated for three Primetime Emmy Awards for Outstanding Animated Program and won the award in 2018 and 2020. The series has also received two Annie Awards. At times, the series has been the most viewed television comedy for adults between 18 and 24. The popularity of Rick and Morty has made it a hundred-million dollar merchandising and media franchise.\r\nThe sixth season premiered on September 4, 2022, and consists of ten episodes. A seventh season was confirmed as part of a long-term deal with Cartoon Network that ordered 70 new episodes, which renewed the series through to a tenth season. Adult Swim cut ties with Roiland in 2023 amid allegations of domestic abuse and announced it would be recasting his roles.",
    "html": "<p>Rick and Morty is an American adult animated science fiction sitcom created by Justin Roiland and Dan Harmon for Cartoon Network's nighttime programming block Adult Swim. The series follows the misadventures of Rick Sanchez, a cynical mad scientist, and his good-hearted but fretful grandson Morty Smith, who split their time between domestic life and interdimensional adventures that take place across an infinite number of realities, often traveling to other planets and dimensions through portals and on Rick's flying saucer. The general concept of Rick and Morty relies on two conflicting scenarios: domestic family drama, and a misanthropic grandfather dragging his grandson into hijinks.</p><p>Roiland voiced the eponymous characters, with Chris Parnell, Spencer Grammer, and Sarah Chalke voicing the rest of Rick and Morty's family. The series originated from an animated short parody film of Back to the Future created by Roiland for Channel 101, a short-film festival cofounded by Harmon. Since its debut, the series has received critical acclaim for its originality, creativity, and humor. It has been nominated for three Primetime Emmy Awards for Outstanding Animated Program and won the award in 2018 and 2020. The series has also received two Annie Awards. At times, the series has been the most viewed television comedy for adults between 18 and 24. The popularity of Rick and Morty has made it a hundred-million dollar merchandising and media franchise.</p><p>The sixth season premiered on September 4, 2022, and consists of ten episodes. A seventh season was confirmed as part of a long-term deal with Cartoon Network that ordered 70 new episodes, which renewed the series through to a tenth season. Adult Swim cut ties with Roiland in 2023 amid allegations of domestic abuse and announced it would be recasting his roles.</p>"
  },
  "plotFull": {
    "plainText": "Rick and Morty is an American adult animated science fiction sitcom created by Justin Roiland and Dan Harmon for Cartoon Network's nighttime programming block Adult Swim. The series follows the misadventures of Rick Sanchez, a cynical mad scientist, and his good-hearted but fretful grandson Morty Smith, who split their time between domestic life and interdimensional adventures that take place across an infinite number of realities, often traveling to other planets and dimensions through portals and on Rick's flying saucer. The general concept of Rick and Morty relies on two conflicting scenarios: domestic family drama, and a misanthropic grandfather dragging his grandson into hijinks.\r\nRoiland voiced the eponymous characters, with Chris Parnell, Spencer Grammer, and Sarah Chalke voicing the rest of Rick and Morty's family. The series originated from an animated short parody film of Back to the Future created by Roiland for Channel 101, a short-film festival cofounded by Harmon. Since its debut, the series has received critical acclaim for its originality, creativity, and humor. It has been nominated for three Primetime Emmy Awards for Outstanding Animated Program and won the award in 2018 and 2020. The series has also received two Annie Awards. At times, the series has been the most viewed television comedy for adults between 18 and 24. The popularity of Rick and Morty has made it a hundred-million dollar merchandising and media franchise.\r\nThe sixth season premiered on September 4, 2022, and consists of ten episodes. A seventh season was confirmed as part of a long-term deal with Cartoon Network that ordered 70 new episodes, which renewed the series through to a tenth season. Adult Swim cut ties with Roiland in 2023 amid allegations of domestic abuse and announced it would be recasting his roles.\r\nPremise and main characters\r\nThe show revolves around the adventures of the members of the Smith household, which consists of parents Jerry and Beth, their children Summer and Morty, and Beth's father, Rick Sanchez, who lives with them as a guest. According to Justin Roiland, the family lives outside of Seattle, Washington. The adventures of Rick and Morty, however, take place across an infinite number of realities, with the characters traveling to other planets and dimensions through portals and Rick's flying saucer.\r\nRick is an eccentric and alcoholic mad scientist, who eschews many ordinary conventions such as school, marriage, love, and family. He frequently goes on adventures with his 14-year-old grandson, Morty, a kind-hearted but easily distressed boy, whose naïve but grounded moral compass plays counterpoint to Rick's Machiavellian ego. Morty's 17-year-old sister, Summer, is a more conventional teenager who worries about improving her status among her peers and sometimes follows Rick and Morty on their adventures. The kids' mother, Beth, is a generally level-headed person and assertive force in the household, though self-conscious about her professional role as a horse surgeon. She is dissatisfied with her marriage to Jerry, a simple-minded and insecure person, who disapproves of Rick's influence over his family.\r\nDifferent versions of the characters inhabit other dimensions throughout the show's multiverse and their personal characteristics can vary from one reality to another. The show's original Rick identifies himself as \"Rick Sanchez of Earth Dimension C-137\", in reference to his original universe, but this does not apply to any other member of the Smith household. For instance, in the first-season episode \"Rick Potion #9\", after turning the entire world population into monsters, Rick and Morty move to a different dimension, leaving the original Summer, Beth and Jerry behind.\r\nProduction\r\nDevelopment\r\nRick and Morty was created by Justin Roiland and Dan Harmon. The duo first met at Channel 101, a non-profit monthly short film festival in Los Angeles co-founded by Harmon. At Channel 101, participants submit a short film in the format of a pilot, and a live audience decides which pilots continue as a series. Roiland, then a producer on reality programming, began submitting content to the festival a year after its launch, in 2004. His pilots typically consisted of shock value—\"sick and twisted\" elements that received a confused reaction from the audience. Nevertheless, Harmon took a liking to his humor and the two began collaborating. In 2006, Roiland was fired from working on a television series he regarded as creatively stifling, and funneled his creative energies into creating a webisode for Channel 101. The result was The Real Animated Adventures of Doc and Mharti, an animated short starring parodies of Doc Brown and Marty McFly, characters from the Back to the Future film trilogy. In the short, which Harmon would dub \"a bastardization, a pornographic vandalization\", Doc Smith urges Mharti to perform oral sex on him in order to go back in time. The audience reacted to it wildly, and Roiland began creating more shorts involving the characters, which soon evolved beyond his original intentions and their obvious origin within the film from which it was culled. Harmon would later create and produce Community, an NBC sitcom, while Roiland would work primarily in voice acting for Disney's Fish Hooks and Cartoon Network's Adventure Time.\r\nIn 2012, Harmon was briefly fired from Community. Adult Swim, searching for a more prime-time, \"hit\" show, shortly afterward approached Harmon, who initially viewed the channel as unfit for his style. He was also unfamiliar with animation and his process for creating television focused more heavily on dialogue, characters, and story. Instead, he phoned Roiland to inquire if he had any ideas for an animated series. Roiland immediately brought up the idea of using the Doc and Mharti characters, renamed Rick and Morty. At first, Roiland wanted the show's run time to consist of one eleven-minute segment, but Adult Swim pushed for a half-hour program. Harmon felt the best way to extend the voices into a program would be to build a family around the characters, while Adult Swim development executive Nick Weidenfeld suggested that Rick be Morty's grandfather. Having pitched multiple television programs that did not get off the ground, Roiland was initially very unreceptive to others attempting to give notes on his pitch. Prior to developing Rick and Morty, he had created three failed animated pilots for Fox, and he had begun to feel \"burned out\" with developing television.\r\nThe first draft was completed in six hours on the Paramount Pictures lot in Dan Harmon's unfurnished Community office. The duo had worked out the basics of the story that day, sold the pilot, and then sat down to write. Roiland, while acknowledging a tendency for procrastination, encouraged Harmon to stay and write the entire first draft. \"We were sitting on the floor, cross-legged with laptops and I was about to get up and go home and he said, 'Wait, if you go home, it might take us three months to write this thing. Stay here right now and we can write it in six hours.' He just had a premonition about that,\" recalled Harmon. In the beginning, Adult Swim was unsure of Roiland doing both voices, partially due to the undeveloped nature of the character of Morty. Harmon wrote four short premises in which Morty took a more assertive role and sent it to Mike Lazzo. Adult Swim placed a tamer TV-14 rating on the program, which was met with reluctance from the show's staff. The network's reason behind the rating was that it would soon begin broadcasting in prime-time, competing with major programs.\r\nThe theme song for Rick and Morty by Ryan Elder was originally used in a rejected Cartoon Network pilot Roiland made called \"Dog World\", which was referenced in the episode \"Lawnmower Dog\".\r\nWriting\r\nHarmon has noted that the writers' room at the show's studio bears a striking resemblance to the one used for Community. In comparing the two, he noted that the writing staff of Rick and Morty was significantly smaller, and more \"rough and tumble verbally\". The first season writing staff consisted of Roiland, Harmon, Tom Kauffman, Ryan Ridley, Wade Randolph, and Eric Acosta, while writer's assistant Mike McMahan was also given writing credit. Described as a \"very, very tiny little writers' room with a lot of heavy lifting from everybody,\" the show's writing staff, like many Adult Swim productions, is not unionized with the Writers Guild of America, though in 2022 production staff at Rick & Morty filed a petition for a union election with the National Labor Relations Board in a bid to join The Animation Guild. The writing staff first meets and discusses ideas, which evolve into a story. Discussions often include anecdotes from personal life as well as thoughts on the science fiction genre. After breaking the story—which consists of developing its consistency and logical beginning, middle, and conclusion—a writer is assigned to create an outline. Roiland and Harmon do a \"pass\" on the outline, and from there the episode undergoes several more drafts. The final draft of the script is last approved by either of the co-creators. Harmon has admitted that his perfectionism can sometimes be disruptive and cause writing schedule delays. For the most part, this was the reason why the third season of the show consisted of only 10 episodes instead of 14, as was initially intended.\r\nMany episodes are structured with use of a story circle, a Harmon creation based largely on Joseph Campbell's monomyth, or The Hero's Journey. Its two-act structure places the act break at an odd location in the stages of the monomyth: after The Meeting with the Goddess, instead of Atonement with the Father. Roiland has stated his and Harmon's intentions for the series to lack traditional continuity, opting for discontinuous storylines \"not bound by rules\". He has also confirmed that the writers avoid revisiting old tropes from the show's past, \"in fear of that coming off as disingenuous fan service.\" In producing the series' first season, episodes were occasionally written out of order. For example, \"Rick Potion #9\" was the second episode written for the series, but was instructed to be animated as the fifth, as it would make more sense within the series' continuity.\r\nAnimation and voice recording\r\nAnimation for the show is done using Toon Boom Harmony, a vector-based 2D puppet software, which is a more economical option than traditional hand-drawn animation. The post-production work is done in Adobe After Effects, and background art is done in Adobe Photoshop. Production of animation is handled by Bardel Entertainment in Vancouver, Canada.\r\nRoiland's cartooning style is heavily indebted to The Simpsons, a factor he acknowledged in a 2013 interview, while also comparing his style to that of Pendleton Ward (Adventure Time) and J. G. Quintel (Regular Show): \"You'll notice mouths are kind of similar and teeth are similar, but I think that's also a stylistic thing that ... all of us are kind of the same age, and we're all inspired by The Simpsons and all these other shows we're kind of subconsciously tapping into.\"\r\nJohn Kricfalusi's The Ren & Stimpy Show was another strong influence for Rick and Morty, which is why, according to Roiland, the small \"w-shaped mouths\" that the characters occasionally make is a reference to a similar expression that Ren frequently makes. Talking about the style guide the animators of the show have to follow, season three art director Jeffrey Thompson explained that the characters are often drawn with odd or asymmetrical features, in order to avoid looking \"too normal to live in the Rick and Morty universe.\" When recording dialogue, Roiland does a considerable amount of improvisation, in order to make the characters feel more natural.\r\nRoiland's firing\r\nIn January 2023, it was reported that Roiland was charged with felony domestic battery and false imprisonment in Orange County, California, in connection with an alleged incident in January 2020 toward an unnamed woman he was reportedly dating at the time. A hearing was scheduled for April 27, 2023. Following the public revelation of the indictment, allegations against Roiland's personal conduct regarding his behavior to minors on social media were made. The same month, Adult Swim announced that they had cut ties with Roiland and fired him from the show stating that the seventh season's production would continue and that his roles would be recast. In March 2023, the Orange County District Attorney's office dropped all criminal charges against Roiland due to insufficient evidence.\r\nBroadcast and ratings\r\nRick and Morty is distributed internationally by Warner Bros. Television.\r\nEpisodes\r\nIn May 2012, Adult Swim unveiled its development slate that included a Rick and Morty pilot from Harmon and Roiland, which was eventually picked up to series in October 2012, as one of the network's first primetime original shows. The first season premiered in December 2013 and concluded in April 2014. It comprised eleven episodes (including the pilot), and aired Mondays at 10:30 pm ET/PT.\r\nTwo months earlier, in February 2014, the show had been renewed for a second season, with the press release noting that Rick and Morty consistently outperformed direct competition in its time slot. Season two aired Sundays at 11:30 pm ET/PT, from July to October 2015, and comprised ten episodes. In an interview with The Hollywood Reporter, Roiland said that Rick and Morty will remain \"a big priority above anything else\" for him in the future, and expressed his intention to keep the show growing.\r\nAdult Swim renewed Rick and Morty for a third season in August 2015, shortly after a successful second-season premiere. The two co-creators and executive producers expressed their delight at the series' popularity. The season premiered unannounced on April 1, 2017, as part of an April Fools' Day prank. The remaining episodes began airing weekly almost four months later, continuing in the same time slot from season two, and the initial airing concluded in October 2017. Although it was originally intended for the season to consist of fourteen episodes, as a result of production delays it eventually comprised only ten.\r\nFollowing the conclusion of the show's third season, co-creators Harmon and Roiland wanted to have assurance that there would be many more seasons of Rick and Morty in the future, so that they would be able to focus on the show and minimize their involvement in other projects. Additionally, Harmon had expressed his wish for the upcoming fourth season to consist of more than ten episodes. In May 2018, after prolonged contract negotiations, Adult Swim announced a long-term deal with the creators, ordering 70 new episodes over an unspecified number of seasons. Roiland was confident that this big renewal deal would allow the creators to minimize the gaps between seasons to no more than a year, as they would be able to schedule their time around the show and \"keep the machine going.\" In January 2023, it was confirmed that the long-term deal had renewed the series through to a tenth season.\r\nIn May 2019, the fourth season of Rick and Morty was announced to debut in November 2019. The fourth season consisted of ten episodes split across two airings. The first five episodes began airing on November 10, 2019, while the remaining five episodes began airing on May 3, 2020. The sixth season premiered on September 4, 2022.\r\nRatings\r\nRick and Morty has been a ratings hit since season one, with viewership doubling and tripling over their first six episodes. The third season ended with the best ratings in Adult Swim history, an 81 percent increase in overall viewers over the second season. According to a Nielsen poll, the third season was the most watched television comedy of adults between the ages of 18 and 24. The president of Adult Swim said that Rick and Morty \"goes beyond just appealing to millennials,\" with statistics suggesting that people of every age tune in to the show.\r\nThe fourth season started relatively strong, with its premiere reaching 2.33 million viewers (the show's average is 2.51 million). However, interest soon appeared to taper off after the network decided to split the season in half causing a steep drop in the season's second half—about a 40% drop in viewership from the third season. The fourth episode of the fourth season saw 1.62 million viewers, which was noted to not be impressive in its own right, but in that it showed consistent viewership especially when competing against shows like The Walking Dead in the same time slot. The season five premier episode was posted on YouTube and had 1.7 million views within the first 12 hours. The television premier saw 1.9 million views.\r\nThe premier of season six was shown on September 4, 2022, and saw the highest ratings in telecast for women age 18 to 24 and 18 to 34 and non-sports telecast for male viewers age 18 to 24 and 18 to 34. The episode was also the number two most-viewed non-sports program overall for viewers age 18 to 49.\r\nStreaming service and home media\r\nThe show is available to watch in its entirety on Netflix in a number of countries, while the first four seasons are available to stream in the United States on both Hulu and HBO Max. Following the conclusion of the show's third season, Adult Swim made a livestream marathon of Rick and Morty available to watch on its official website in select regions, hoping to dissuade viewers from watching other illegal livestreams.\r\nIn the United Kingdom, public-service broadcaster Channel 4 outbid Netflix and began airing the series with season 4, which represents its first pickup by an international television channel. Season 4 was originally scheduled to premiere on Channel 4 in January 2020; viewer complaints resulted in the broadcaster moving the first episode forward to November 20 on E4.\r\nIn Canada, the series initially premiered on Adult Swim on January 10, 2016. In Quebec, it premiered on Télétoon's Télétoon la nuit block on May 18, 2018.\r\nThe 10-episode third season, was released on DVD (2-disc set) and Blu-ray (single BD-50 disc) on May 15, 2018. Special features include exclusive commentary and animatics for every episode, \"inside the episode\", the origins of Rick and Morty, and an exclusive \"inside the recording booth\" session.\r\nUncensored versions of the show are also available to purchase on various digital platforms, including iTunes and Amazon, with the digital releases of each season containing bonus material.\r\nThemes and analysis\r\nComedic style\r\nThe general formula of Rick and Morty consists of the juxtaposition of two conflicting scenarios: an extremely selfish, alcoholic grandfather dragging his grandson along for interdimensional adventures, intercut with domestic family drama. Co-creator Dan Harmon has described the series as a cross between Matt Groening's two shows The Simpsons and Futurama, balancing family life with heavy science fiction. Comparisons have been drawn to House of Cosbys, a show created by Justin Roiland, for having similar bits such as characters announcing themselves (Mr. Meeseeks/Curiosity Cosby). The series is inspired by British-style storytelling, as opposed to traditional American family TV stories. Harmon has stated that his inspiration behind much of the concept and humor for the series comes from various British television series, such as The Hitchhiker's Guide to the Galaxy and Doctor Who. He figures that the audience will only understand developments from Morty's point of view, but stated \"we don't want to be the companions. We want to hang out with the Doctor, we idolize the Doctor, but we don't think like him, and that's really interesting.\"\r\nOccasionally, characters will acknowledge an episode's narrative or hint at the presence of a fourth wall, suggesting that they are aware of the fact that they are characters of a TV show. Thereunder, Troy Patterson of The New Yorker notes that Rick and Morty \"supplies an artful answer to the question of what follows postmodernism: a decadent regurgitation of all its tropes, all at once, leavened by some humanistic wistfulness.\" Sean Sebastian of Junkee says that the show can be both hilarious and deeply disturbing at the same time as it excels at the \"intersection between big ideas, flippancy and wit.\"\r\nPhilosophy\r\nThe series addresses the insignificance of human existence as compared to the size of the universe, with no recognizable divine presence, as described by Lovecraft's philosophy of cosmicism. The characters of the show deal with cosmic horror and existential dread, either by asserting the utility of science over magic or by choosing a life in ignorant bliss. However, as Joachim Heijndermans of Geeks notes, none of them appear able to handle the absurd and chaotic nature of the universe, as Jerry gets by through denial, and Rick is a \"depressed, substance-addicted, suicidal mess\".\r\nHarmon describes Rick as a self-interested anarchist, who does not like being told what to do. He believes that the character's life on a larger scale has caused him mental illness, and opines that \"the knowledge that nothing matters—while accurate—gets you nowhere\". Mental illness is a theme that is drawn on several times throughout the show, one scene in particular has Rick's therapist deliver a fiery explanation of his fundamental immaturity. Matthew Bulger of The Humanist notes that the creators of the series are trying to communicate the message that we need to focus on human relationships and not preoccupy our minds with unanswerable questions, in order to find a sense of purpose and live a better life. Eric Armstrong of The New Republic notes that Morty represents the audience, as he is \"mostly there to react to Rick's deranged schemes\". The character is transformed by the truths he discovers during his interdimensional adventures with his grandfather. However, instead of sinking into depression, Morty accepts these truths that empower him to value his own life.\r\nReception\r\nCritical reception\r\nRick and Morty holds an average approval rating of 95% on review aggregator website Rotten Tomatoes for the entire series. David Weigand of San Francisco Chronicle described it as \"offbeat and occasionally coarse... the take-away here is that it works\". He praised the animation direction by James McDermott for being \"fresh, colorful and as wacky as the script\", and states that the series possesses \"shades of Futurama, South Park and even Beetlejuice\", ultimately opining that its humor felt \"entirely original\". Neil Genzlinger of The New York Times praised the series and stated that it was \"Grandparenting at its unhinged finest.\" In a review shortly after the second-season premiere, Sean Sebastian of Junkee said that although the crude animation and over-the-top voice acting might have discouraged some viewers to continue watching, Rick and Morty is \"exceptionally well-made\" and that \"the more you dissect it, the more you find it has to say.\"\r\nTodd Spangler of Variety gave the series a lukewarm review; saying that though it \"often seems … frenetic at the expense of being witty\", it represents \"a welcome attempt to dream just a little bigger\". David Sims of The A.V. Club gave the series an \"A−\". In reviewing the first two episodes, he praised its \"clean, simple style\" of animation, and said the series has \"a dark, sick sensibility\". He praised its \"effort to give each character a little bit of depth\", and applauded Roiland's voice talent.\r\nIndustry impact\r\nSeveral former Rick and Morty storyboard artists and crew members proceeded to develop their own shows or work on major new productions. Creator Justin Roiland and showrunner Mike McMahan have gone on to co-create Solar Opposites, an animated sci-fi sitcom that has been frequently compared to Rick and Morty. McMahan also went on to create Star Trek: Lower Decks. Writer Michael Waldron would go on to write for Loki, Doctor Strange in the Multiverse of Madness and Avengers: Secret Wars and has said that he and his colleagues are \"cashing in on our 'Rick and Morty' street cred.\" Show alumnus Jeff Loveness became a writer for Ant-Man and the Wasp: Quantumania and Avengers: The Kang Dynasty. Erica Hayes, the show's storyboard writer and director, went on to work for Netflix's Big Mouth. Alex Hirsch, who worked on the episode \"Big Trouble in Little Sanchez\", would become an executive producer of Inside Job, another show that has had comparisons drawn to Rick and Morty for being similarly themed. Pete Michels, director of over twenty Rick and Morty episodes, was also a director of two episodes of Inside Job.\r\nAwards and nominations\r\nOther media and products\r\nRick and Morty has a multi-million dollar merchandising franchise.\r\nPossible feature film\r\nShow creator Justin Roiland said in 2019 that he would love to make an R-rated Rick and Morty feature film. In June 2021, producer Scott Marder confirmed that the creators and crew hope to eventually produce a feature film, with Roiland stating that it is more a question of \"when\", rather than \"if\". In 2022, American filmmaker Zack Snyder expressed interest in directing a Rick and Morty science fiction movie.\r\nSpin-off series\r\nOn May 20, 2021, Adult Swim announced a short spin-off series centred on the Vindicators team (Supernova, Vance Maxiumus, Alan Rails, Crocubot and Noob Noob) previously seen on the episode, \"Vindicators 3: The Return of Worldender\" to be in development, alongside spin-offs from other Adult Swim shows like Aqua Teen Hunger Force, Robot Chicken, and Your Pretty Face Is Going to Hell. The 10-episode series, Vindicators 2 was released in July 2022.\r\nOn May 18, 2022, Adult Swim announced there would be a full spin-off series based on the anime shorts, directed by Takashi Sano.\r\nCameos\r\nFilm\r\nRick and Morty, both voiced by Roiland, have a cameo in 2021's Space Jam: A New Legacy, as they claim to have experimented on the Tasmanian Devil but say they were disgusted by the results; thus, they voluntarily give him back to LeBron and the Looney Tunes by dropping him on their rocket's windshield.\r\nTelevision\r\nRick and Morty were featured in the couch gag at the beginning of \"Mathlete's Feat\", the final episode of the twenty-sixth season of The Simpsons. Said opening involved Rick accidentally killing the family when he crash-lands into their living room causing Morty to go on a mission to bring them back to life.\r\nComics\r\nOn April 1, 2015, a Rick and Morty comic book adaptation debuted with its first monthly issue, entitled \"BAM!\" The series was initially written by Zac Gorman and illustrated by CJ Cannon. Artist Tom Fowler wrote a multi-issue story arc that began in March 2016. Using the television series' established premise of alternate timelines, the first two volumes of the comic book expressly features the Rick and Morty (and supporting cast) of a different timeline, allowing the comics to tell stories without conflicting with the canon of the show. From the third volume onwards, with the departure of Gorman as writer and his replacement with Kyle Starks, the series switched focus to display the off-screen adventures of the specific Rick and Morty of the television series, keeping in the canon of the show, with the Ricks and Mortys of different timelines forming the basis for backup stories.\r\nOn August 29, 2018, a four-issue crossover comic with the fantasy tabletop role-playing game Dungeons & Dragons was released. The series titled Rick and Morty vs. Dungeons & Dragons is co-written by Jim Zub and Patrick Rothfuss, and art by Troy Little. A sequel mini-series, titled Rick and Morty vs. Dungeons & Dragons: Chapter II: Painscape, was published in September 2018. It was written by Jim Zub and Sarah Stern with art by Troy Little. The Rick and Morty vs Dungeons and Dragons Deluxe Edition, by Rothfuss, Zub, and Little, was nominated for the 2022 \"Best Graphic Album—Reprint\" Eisner Award.\r\nProduct tie-ins\r\nMcDonald's Szechuan Sauce returned to their menu nearly twenty years later after being referenced numerous times in \"The Rickshank Rickdemption\", the Season 3 premiere. The sauce was announced to return to all McDonald's stores on February 26, 2018 due to popular demand from Rick and Morty fans. On March 31, 2022, it once again returned to stores, featured as an app-only exclusive until April 4.\r\nAdult Swim and Wendy's have collaborated to create commercials featuring the titular duo. They have also created Morty themed food trucks and restaurants. In 2022, Wendy's offered Rick and Morty-inspired combo meals exclusively on Uber Eats and brought back their \"Portal Time Lemon Lime\" soft drink to promote the series' sixth season. The promotion also featured a giveaway of Rick and Morty merchandise.\r\nAdult Swim released a promotional video advertising Death Stranding. The ad involves Rick and Morty traversing the world of Death Stranding to deliver packages to stations in order to rebuild human civilization while trying to avoid being harmed by hostiles.",
    "html": "<p>Rick and Morty is an American adult animated science fiction sitcom created by Justin Roiland and Dan Harmon for Cartoon Network's nighttime programming block Adult Swim. The series follows the misadventures of Rick Sanchez, a cynical mad scientist, and his good-hearted but fretful grandson Morty Smith, who split their time between domestic life and interdimensional adventures that take place across an infinite number of realities, often traveling to other planets and dimensions through portals and on Rick's flying saucer. The general concept of Rick and Morty relies on two conflicting scenarios: domestic family drama, and a misanthropic grandfather dragging his grandson into hijinks.</p><p>Roiland voiced the eponymous characters, with Chris Parnell, Spencer Grammer, and Sarah Chalke voicing the rest of Rick and Morty's family. The series originated from an animated short parody film of Back to the Future created by Roiland for Channel 101, a short-film festival cofounded by Harmon. Since its debut, the series has received critical acclaim for its originality, creativity, and humor. It has been nominated for three Primetime Emmy Awards for Outstanding Animated Program and won the award in 2018 and 2020. The series has also received two Annie Awards. At times, the series has been the most viewed television comedy for adults between 18 and 24. The popularity of Rick and Morty has made it a hundred-million dollar merchandising and media franchise.</p><p>The sixth season premiered on September 4, 2022, and consists of ten episodes. A seventh season was confirmed as part of a long-term deal with Cartoon Network that ordered 70 new episodes, which renewed the series through to a tenth season. Adult Swim cut ties with Roiland in 2023 amid allegations of domestic abuse and announced it would be recasting his roles.</p><br/><h3>Premise and main characters</h3><p>The show revolves around the adventures of the members of the Smith household, which consists of parents Jerry and Beth, their children Summer and Morty, and Beth's father, Rick Sanchez, who lives with them as a guest. According to Justin Roiland, the family lives outside of Seattle, Washington. The adventures of Rick and Morty, however, take place across an infinite number of realities, with the characters traveling to other planets and dimensions through portals and Rick's flying saucer.</p><p>Rick is an eccentric and alcoholic mad scientist, who eschews many ordinary conventions such as school, marriage, love, and family. He frequently goes on adventures with his 14-year-old grandson, Morty, a kind-hearted but easily distressed boy, whose naïve but grounded moral compass plays counterpoint to Rick's Machiavellian ego. Morty's 17-year-old sister, Summer, is a more conventional teenager who worries about improving her status among her peers and sometimes follows Rick and Morty on their adventures. The kids' mother, Beth, is a generally level-headed person and assertive force in the household, though self-conscious about her professional role as a horse surgeon. She is dissatisfied with her marriage to Jerry, a simple-minded and insecure person, who disapproves of Rick's influence over his family.</p><p>Different versions of the characters inhabit other dimensions throughout the show's multiverse and their personal characteristics can vary from one reality to another. The show's original Rick identifies himself as \"Rick Sanchez of Earth Dimension C-137\", in reference to his original universe, but this does not apply to any other member of the Smith household. For instance, in the first-season episode \"Rick Potion #9\", after turning the entire world population into monsters, Rick and Morty move to a different dimension, leaving the original Summer, Beth and Jerry behind.</p><br/><h3>Production</h3><h4>Development</h4><p>Rick and Morty was created by Justin Roiland and Dan Harmon. The duo first met at Channel 101, a non-profit monthly short film festival in Los Angeles co-founded by Harmon. At Channel 101, participants submit a short film in the format of a pilot, and a live audience decides which pilots continue as a series. Roiland, then a producer on reality programming, began submitting content to the festival a year after its launch, in 2004. His pilots typically consisted of shock value—\"sick and twisted\" elements that received a confused reaction from the audience. Nevertheless, Harmon took a liking to his humor and the two began collaborating. In 2006, Roiland was fired from working on a television series he regarded as creatively stifling, and funneled his creative energies into creating a webisode for Channel 101. The result was The Real Animated Adventures of Doc and Mharti, an animated short starring parodies of Doc Brown and Marty McFly, characters from the Back to the Future film trilogy. In the short, which Harmon would dub \"a bastardization, a pornographic vandalization\", Doc Smith urges Mharti to perform oral sex on him in order to go back in time. The audience reacted to it wildly, and Roiland began creating more shorts involving the characters, which soon evolved beyond his original intentions and their obvious origin within the film from which it was culled. Harmon would later create and produce Community, an NBC sitcom, while Roiland would work primarily in voice acting for Disney's Fish Hooks and Cartoon Network's Adventure Time.</p><p>In 2012, Harmon was briefly fired from Community. Adult Swim, searching for a more prime-time, \"hit\" show, shortly afterward approached Harmon, who initially viewed the channel as unfit for his style. He was also unfamiliar with animation and his process for creating television focused more heavily on dialogue, characters, and story. Instead, he phoned Roiland to inquire if he had any ideas for an animated series. Roiland immediately brought up the idea of using the Doc and Mharti characters, renamed Rick and Morty. At first, Roiland wanted the show's run time to consist of one eleven-minute segment, but Adult Swim pushed for a half-hour program. Harmon felt the best way to extend the voices into a program would be to build a family around the characters, while Adult Swim development executive Nick Weidenfeld suggested that Rick be Morty's grandfather. Having pitched multiple television programs that did not get off the ground, Roiland was initially very unreceptive to others attempting to give notes on his pitch. Prior to developing Rick and Morty, he had created three failed animated pilots for Fox, and he had begun to feel \"burned out\" with developing television.</p><p>The first draft was completed in six hours on the Paramount Pictures lot in Dan Harmon's unfurnished Community office. The duo had worked out the basics of the story that day, sold the pilot, and then sat down to write. Roiland, while acknowledging a tendency for procrastination, encouraged Harmon to stay and write the entire first draft. \"We were sitting on the floor, cross-legged with laptops and I was about to get up and go home and he said, 'Wait, if you go home, it might take us three months to write this thing. Stay here right now and we can write it in six hours.' He just had a premonition about that,\" recalled Harmon. In the beginning, Adult Swim was unsure of Roiland doing both voices, partially due to the undeveloped nature of the character of Morty. Harmon wrote four short premises in which Morty took a more assertive role and sent it to Mike Lazzo. Adult Swim placed a tamer TV-14 rating on the program, which was met with reluctance from the show's staff. The network's reason behind the rating was that it would soon begin broadcasting in prime-time, competing with major programs.</p><p>The theme song for Rick and Morty by Ryan Elder was originally used in a rejected Cartoon Network pilot Roiland made called \"Dog World\", which was referenced in the episode \"Lawnmower Dog\".</p><h4>Writing</h4><p>Harmon has noted that the writers' room at the show's studio bears a striking resemblance to the one used for Community. In comparing the two, he noted that the writing staff of Rick and Morty was significantly smaller, and more \"rough and tumble verbally\". The first season writing staff consisted of Roiland, Harmon, Tom Kauffman, Ryan Ridley, Wade Randolph, and Eric Acosta, while writer's assistant Mike McMahan was also given writing credit. Described as a \"very, very tiny little writers' room with a lot of heavy lifting from everybody,\" the show's writing staff, like many Adult Swim productions, is not unionized with the Writers Guild of America, though in 2022 production staff at Rick & Morty filed a petition for a union election with the National Labor Relations Board in a bid to join The Animation Guild. The writing staff first meets and discusses ideas, which evolve into a story. Discussions often include anecdotes from personal life as well as thoughts on the science fiction genre. After breaking the story—which consists of developing its consistency and logical beginning, middle, and conclusion—a writer is assigned to create an outline. Roiland and Harmon do a \"pass\" on the outline, and from there the episode undergoes several more drafts. The final draft of the script is last approved by either of the co-creators. Harmon has admitted that his perfectionism can sometimes be disruptive and cause writing schedule delays. For the most part, this was the reason why the third season of the show consisted of only 10 episodes instead of 14, as was initially intended.</p><p>Many episodes are structured with use of a story circle, a Harmon creation based largely on Joseph Campbell's monomyth, or The Hero's Journey. Its two-act structure places the act break at an odd location in the stages of the monomyth: after The Meeting with the Goddess, instead of Atonement with the Father. Roiland has stated his and Harmon's intentions for the series to lack traditional continuity, opting for discontinuous storylines \"not bound by rules\". He has also confirmed that the writers avoid revisiting old tropes from the show's past, \"in fear of that coming off as disingenuous fan service.\" In producing the series' first season, episodes were occasionally written out of order. For example, \"Rick Potion #9\" was the second episode written for the series, but was instructed to be animated as the fifth, as it would make more sense within the series' continuity.</p><h4>Animation and voice recording</h4><p>Animation for the show is done using Toon Boom Harmony, a vector-based 2D puppet software, which is a more economical option than traditional hand-drawn animation. The post-production work is done in Adobe After Effects, and background art is done in Adobe Photoshop. Production of animation is handled by Bardel Entertainment in Vancouver, Canada.</p><p>Roiland's cartooning style is heavily indebted to The Simpsons, a factor he acknowledged in a 2013 interview, while also comparing his style to that of Pendleton Ward (Adventure Time) and J. G. Quintel (Regular Show): \"You'll notice mouths are kind of similar and teeth are similar, but I think that's also a stylistic thing that ... all of us are kind of the same age, and we're all inspired by The Simpsons and all these other shows we're kind of subconsciously tapping into.\"</p><p>John Kricfalusi's The Ren & Stimpy Show was another strong influence for Rick and Morty, which is why, according to Roiland, the small \"w-shaped mouths\" that the characters occasionally make is a reference to a similar expression that Ren frequently makes. Talking about the style guide the animators of the show have to follow, season three art director Jeffrey Thompson explained that the characters are often drawn with odd or asymmetrical features, in order to avoid looking \"too normal to live in the Rick and Morty universe.\" When recording dialogue, Roiland does a considerable amount of improvisation, in order to make the characters feel more natural.</p><h4>Roiland's firing</h4><p>In January 2023, it was reported that Roiland was charged with felony domestic battery and false imprisonment in Orange County, California, in connection with an alleged incident in January 2020 toward an unnamed woman he was reportedly dating at the time. A hearing was scheduled for April 27, 2023. Following the public revelation of the indictment, allegations against Roiland's personal conduct regarding his behavior to minors on social media were made. The same month, Adult Swim announced that they had cut ties with Roiland and fired him from the show stating that the seventh season's production would continue and that his roles would be recast. In March 2023, the Orange County District Attorney's office dropped all criminal charges against Roiland due to insufficient evidence.</p><br/><h3>Broadcast and ratings</h3><p>Rick and Morty is distributed internationally by Warner Bros. Television.</p><h4>Episodes</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">11</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">December 2, 2013</td><td style=\"padding:0 8px\">April 14, 2014</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 26, 2015</td><td style=\"padding:0 8px\">October 4, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 1, 2017</td><td style=\"padding:0 8px\">October 1, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">November 10, 2019</td><td style=\"padding:0 8px\">May 31, 2020</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 20, 2021</td><td style=\"padding:0 8px\">September 5, 2021</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 4, 2022</td><td style=\"padding:0 8px\">December 11, 2022</td></tr></tbody></table><p>In May 2012, Adult Swim unveiled its development slate that included a Rick and Morty pilot from Harmon and Roiland, which was eventually picked up to series in October 2012, as one of the network's first primetime original shows. The first season premiered in December 2013 and concluded in April 2014. It comprised eleven episodes (including the pilot), and aired Mondays at 10:30 pm ET/PT.</p><p>Two months earlier, in February 2014, the show had been renewed for a second season, with the press release noting that Rick and Morty consistently outperformed direct competition in its time slot. Season two aired Sundays at 11:30 pm ET/PT, from July to October 2015, and comprised ten episodes. In an interview with The Hollywood Reporter, Roiland said that Rick and Morty will remain \"a big priority above anything else\" for him in the future, and expressed his intention to keep the show growing.</p><p>Adult Swim renewed Rick and Morty for a third season in August 2015, shortly after a successful second-season premiere. The two co-creators and executive producers expressed their delight at the series' popularity. The season premiered unannounced on April 1, 2017, as part of an April Fools' Day prank. The remaining episodes began airing weekly almost four months later, continuing in the same time slot from season two, and the initial airing concluded in October 2017. Although it was originally intended for the season to consist of fourteen episodes, as a result of production delays it eventually comprised only ten.</p><p>Following the conclusion of the show's third season, co-creators Harmon and Roiland wanted to have assurance that there would be many more seasons of Rick and Morty in the future, so that they would be able to focus on the show and minimize their involvement in other projects. Additionally, Harmon had expressed his wish for the upcoming fourth season to consist of more than ten episodes. In May 2018, after prolonged contract negotiations, Adult Swim announced a long-term deal with the creators, ordering 70 new episodes over an unspecified number of seasons. Roiland was confident that this big renewal deal would allow the creators to minimize the gaps between seasons to no more than a year, as they would be able to schedule their time around the show and \"keep the machine going.\" In January 2023, it was confirmed that the long-term deal had renewed the series through to a tenth season.</p><p>In May 2019, the fourth season of Rick and Morty was announced to debut in November 2019. The fourth season consisted of ten episodes split across two airings. The first five episodes began airing on November 10, 2019, while the remaining five episodes began airing on May 3, 2020. The sixth season premiered on September 4, 2022.</p><h4>Ratings</h4><p>Rick and Morty has been a ratings hit since season one, with viewership doubling and tripling over their first six episodes. The third season ended with the best ratings in Adult Swim history, an 81 percent increase in overall viewers over the second season. According to a Nielsen poll, the third season was the most watched television comedy of adults between the ages of 18 and 24. The president of Adult Swim said that Rick and Morty \"goes beyond just appealing to millennials,\" with statistics suggesting that people of every age tune in to the show.</p><p>The fourth season started relatively strong, with its premiere reaching 2.33 million viewers (the show's average is 2.51 million). However, interest soon appeared to taper off after the network decided to split the season in half causing a steep drop in the season's second half—about a 40% drop in viewership from the third season. The fourth episode of the fourth season saw 1.62 million viewers, which was noted to not be impressive in its own right, but in that it showed consistent viewership especially when competing against shows like The Walking Dead in the same time slot. The season five premier episode was posted on YouTube and had 1.7 million views within the first 12 hours. The television premier saw 1.9 million views.</p><p>The premier of season six was shown on September 4, 2022, and saw the highest ratings in telecast for women age 18 to 24 and 18 to 34 and non-sports telecast for male viewers age 18 to 24 and 18 to 34. The episode was also the number two most-viewed non-sports program overall for viewers age 18 to 49.</p><h4>Streaming service and home media</h4><p>The show is available to watch in its entirety on Netflix in a number of countries, while the first four seasons are available to stream in the United States on both Hulu and HBO Max. Following the conclusion of the show's third season, Adult Swim made a livestream marathon of Rick and Morty available to watch on its official website in select regions, hoping to dissuade viewers from watching other illegal livestreams.</p><p>In the United Kingdom, public-service broadcaster Channel 4 outbid Netflix and began airing the series with season 4, which represents its first pickup by an international television channel. Season 4 was originally scheduled to premiere on Channel 4 in January 2020; viewer complaints resulted in the broadcaster moving the first episode forward to November 20 on E4.</p><p>In Canada, the series initially premiered on Adult Swim on January 10, 2016. In Quebec, it premiered on Télétoon's Télétoon la nuit block on May 18, 2018.</p><p>The 10-episode third season, was released on DVD (2-disc set) and Blu-ray (single BD-50 disc) on May 15, 2018. Special features include exclusive commentary and animatics for every episode, \"inside the episode\", the origins of Rick and Morty, and an exclusive \"inside the recording booth\" session.</p><p>Uncensored versions of the show are also available to purchase on various digital platforms, including iTunes and Amazon, with the digital releases of each season containing bonus material.</p><br/><h3>Themes and analysis</h3><h4>Comedic style</h4><p>The general formula of Rick and Morty consists of the juxtaposition of two conflicting scenarios: an extremely selfish, alcoholic grandfather dragging his grandson along for interdimensional adventures, intercut with domestic family drama. Co-creator Dan Harmon has described the series as a cross between Matt Groening's two shows The Simpsons and Futurama, balancing family life with heavy science fiction. Comparisons have been drawn to House of Cosbys, a show created by Justin Roiland, for having similar bits such as characters announcing themselves (Mr. Meeseeks/Curiosity Cosby). The series is inspired by British-style storytelling, as opposed to traditional American family TV stories. Harmon has stated that his inspiration behind much of the concept and humor for the series comes from various British television series, such as The Hitchhiker's Guide to the Galaxy and Doctor Who. He figures that the audience will only understand developments from Morty's point of view, but stated \"we don't want to be the companions. We want to hang out with the Doctor, we idolize the Doctor, but we don't think like him, and that's really interesting.\"</p><p>Occasionally, characters will acknowledge an episode's narrative or hint at the presence of a fourth wall, suggesting that they are aware of the fact that they are characters of a TV show. Thereunder, Troy Patterson of The New Yorker notes that Rick and Morty \"supplies an artful answer to the question of what follows postmodernism: a decadent regurgitation of all its tropes, all at once, leavened by some humanistic wistfulness.\" Sean Sebastian of Junkee says that the show can be both hilarious and deeply disturbing at the same time as it excels at the \"intersection between big ideas, flippancy and wit.\"</p><h4>Philosophy</h4><p>The series addresses the insignificance of human existence as compared to the size of the universe, with no recognizable divine presence, as described by Lovecraft's philosophy of cosmicism. The characters of the show deal with cosmic horror and existential dread, either by asserting the utility of science over magic or by choosing a life in ignorant bliss. However, as Joachim Heijndermans of Geeks notes, none of them appear able to handle the absurd and chaotic nature of the universe, as Jerry gets by through denial, and Rick is a \"depressed, substance-addicted, suicidal mess\".</p><p>Harmon describes Rick as a self-interested anarchist, who does not like being told what to do. He believes that the character's life on a larger scale has caused him mental illness, and opines that \"the knowledge that nothing matters—while accurate—gets you nowhere\". Mental illness is a theme that is drawn on several times throughout the show, one scene in particular has Rick's therapist deliver a fiery explanation of his fundamental immaturity. Matthew Bulger of The Humanist notes that the creators of the series are trying to communicate the message that we need to focus on human relationships and not preoccupy our minds with unanswerable questions, in order to find a sense of purpose and live a better life. Eric Armstrong of The New Republic notes that Morty represents the audience, as he is \"mostly there to react to Rick's deranged schemes\". The character is transformed by the truths he discovers during his interdimensional adventures with his grandfather. However, instead of sinking into depression, Morty accepts these truths that empower him to value his own life.</p><br/><h3>Reception</h3><h4>Critical reception</h4><p>Rick and Morty holds an average approval rating of 95% on review aggregator website Rotten Tomatoes for the entire series. David Weigand of San Francisco Chronicle described it as \"offbeat and occasionally coarse... the take-away here is that it works\". He praised the animation direction by James McDermott for being \"fresh, colorful and as wacky as the script\", and states that the series possesses \"shades of Futurama, South Park and even Beetlejuice\", ultimately opining that its humor felt \"entirely original\". Neil Genzlinger of The New York Times praised the series and stated that it was \"Grandparenting at its unhinged finest.\" In a review shortly after the second-season premiere, Sean Sebastian of Junkee said that although the crude animation and over-the-top voice acting might have discouraged some viewers to continue watching, Rick and Morty is \"exceptionally well-made\" and that \"the more you dissect it, the more you find it has to say.\"</p><p>Todd Spangler of Variety gave the series a lukewarm review; saying that though it \"often seems … frenetic at the expense of being witty\", it represents \"a welcome attempt to dream just a little bigger\". David Sims of The A.V. Club gave the series an \"A−\". In reviewing the first two episodes, he praised its \"clean, simple style\" of animation, and said the series has \"a dark, sick sensibility\". He praised its \"effort to give each character a little bit of depth\", and applauded Roiland's voice talent.</p><h4>Industry impact</h4><p>Several former Rick and Morty storyboard artists and crew members proceeded to develop their own shows or work on major new productions. Creator Justin Roiland and showrunner Mike McMahan have gone on to co-create Solar Opposites, an animated sci-fi sitcom that has been frequently compared to Rick and Morty. McMahan also went on to create Star Trek: Lower Decks. Writer Michael Waldron would go on to write for Loki, Doctor Strange in the Multiverse of Madness and Avengers: Secret Wars and has said that he and his colleagues are \"cashing in on our 'Rick and Morty' street cred.\" Show alumnus Jeff Loveness became a writer for Ant-Man and the Wasp: Quantumania and Avengers: The Kang Dynasty. Erica Hayes, the show's storyboard writer and director, went on to work for Netflix's Big Mouth. Alex Hirsch, who worked on the episode \"Big Trouble in Little Sanchez\", would become an executive producer of Inside Job, another show that has had comparisons drawn to Rick and Morty for being similarly themed. Pete Michels, director of over twenty Rick and Morty episodes, was also a director of two episodes of Inside Job.</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th style=\"width:38%;\">Nominee(s)</th><th>Result</th><th class=\"unsortable\"><abbr title=\"Reference(s)\">Ref.</abbr></th></tr><tr><td style=\"text-align:center;\">2014</td><td><span class=\"mw-redirect\">IGN Awards</span></td><td>Best TV Animated Series</td><td rowspan=\"5\"><i>Rick and Morty</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\" style=\"text-align:center;\">2015</td><td><span>Annie Awards</span></td><td><span class=\"mw-redirect\">Best General Audience Animated TV/Broadcast Production</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>IGN Awards</td><td>Best Animated Series</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"6\" style=\"text-align:center;\">2017</td><td><span>Teen Choice Awards</span></td><td><span>Choice Animated TV Show</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"5\">IGN Awards</td><td>TV series of the year</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>Best TV Episode</td><td>\"<span>The Ricklantis Mixup</span>\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>Best Animated Series</td><td rowspan=\"2\"><i>Rick and Morty</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td>Best Comedy Series</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>Best Comedic TV Performance</td><td><span>Justin Roiland</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"8\" style=\"text-align:center;\">2018</td><td><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td><span>Best Animated Series</span></td><td><i>Rick and Morty</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\"><span>Annie Awards</span></td><td><span class=\"mw-redirect\">Best General Audience Animated Television/Broadcast Production</span></td><td>\"<span>Pickle Rick</span>\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td><span>Outstanding Achievement for Writing in an Animated Television/Broadcast Production</span></td><td>Ryan Ridley, Dan Guterman <span class=\"nowrap\">(for \"<span>The Ricklantis Mixup</span>\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Golden Reel Awards</span></td><td>Outstanding Achievement in Sound Editing – Animation Short Form</td><td>Hunter Curra, Kailand Reily, Andrew Twite, Joy Elett, Jeff Halbert and Konrad Pinon <span class=\"nowrap\">(for \"<span>Pickle Rick</span>\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Saturn Awards</span></td><td><span>Best Animated Series or Film on Television</span></td><td rowspan=\"2\"><i>Rick and Morty</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Teen Choice Awards</span></td><td><span>Choice Animated TV Show</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\"><span>Primetime Emmy Awards</span></td><td><span>Outstanding Animated Program</span></td><td><span>Dan Harmon</span>, <span>Justin Roiland</span>, Delna Bhesania, Barry Ward, <span>Keith Crofford</span>, <span>Mike Lazzo</span>, Ryan Ridley, <span>Dan Guterman</span>, <span>Mike McMahan</span>, Tom Kauffman, <span>Ollie Green</span>, <span>J. Michael Mendel</span>, <span>Jessica Gao</span>, <span>Wes Archer</span>, Anthony Chun and Nathan Litz <span class=\"nowrap\">(for \"<span>Pickle Rick</span>\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\" style=\"text-align:center;\"></td></tr><tr><td><span>Outstanding Creative Achievement in Interactive Media within a Scripted Program</span></td><td>\"<span>Rick and Morty: Virtual Rick-ality</span>\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td style=\"text-align:center;\">2020</td><td><span>Primetime Emmy Awards</span></td><td><span>Outstanding Animated Program</span></td><td>Dan Harmon, Justin Roiland, Mike McMahan, Scott Marder, Keith Crofford, Rick Mischel, Richard Grieve, Mike Lazzo, Rob Schrab, James Siciliano, Wes Archer, Michael Waldron, Nick Rutherford, Lee Harting, Ollie Green, Sydney Ryan, J. Michael Mendel, Jacob Hair, Nathan Litz, <span>Jeff Loveness</span> and Albro Lundy <span class=\"nowrap\">(for \"<span>The Vat of Acid Episode</span>\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\" style=\"text-align:center;\">2021</td><td rowspan=\"2\"><span>Critics' Choice Super Awards</span></td><td>Best Animated Series</td><td><i>Rick and Morty</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td>Best Voice Actor in an Animated Series</td><td>Justin Roiland</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Annie Awards</span></td><td><span class=\"mw-redirect\">Best General Audience Animated Television/Broadcast Production</span></td><td><i>Rick and Morty</i> <span class=\"nowrap\">(for \"<span>The Vat of Acid Episode</span>\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>American Cinema Editors Awards</span></td><td><span>Best Edited Animation (Non-Theatrical)</span></td><td>Lee Harting <span class=\"nowrap\">(for \"<span>Rattlestar Ricklactica</span>\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Saturn Awards</span></td><td><span>Best Animated Series on Television</span></td><td><i>Rick and Morty</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"4\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">2022</div></td><td><span>American Cinema Editors Awards</span></td><td><span>Best Edited Animation (Non-Theatrical)</span></td><td>Lee Harting (for \"Gotron Jerrysis Rickvangelion\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Hollywood Critics Association TV Awards</span></td><td>Best Broadcast Network or Cable Animated Series or Television Movie</td><td><i>Rick and Morty</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Primetime Emmy Awards</span></td><td><span>Outstanding Animated Program</span></td><td>Dan Harmon, Justin Roiland, Scott Marder, Keith Crofford, Ollie Green, Walter Newman, Richard Grieve, Rob Schrab, James Siciliano, Jeff Loveness, Sydney Ryan, J. Michael Mendel, Anne Lane, Albro Lundy, Nick Rutherford, Steve Levy, Lee Harting, David Marshall, Jacob Hair, Nathan Litz, and Wes Archer (for \"<span>Mort Dinner Rick Andre</span>\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Artios Awards</span></td><td>Outstanding Achievement in Casting – Animated Series</td><td>Ruth Lambert, Robert McGee</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">2023</div></td><td><span>Annie Awards</span></td><td><span class=\"mw-redirect\">Best Mature Audience Animated Television/Broadcast Production</span></td><td>\"<span>Night Family</span>\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr></tbody></table><br/><h3>Other media and products</h3><p>Rick and Morty has a multi-million dollar merchandising franchise.</p><h4>Possible feature film</h4><p>Show creator Justin Roiland said in 2019 that he would love to make an R-rated Rick and Morty feature film. In June 2021, producer Scott Marder confirmed that the creators and crew hope to eventually produce a feature film, with Roiland stating that it is more a question of \"when\", rather than \"if\". In 2022, American filmmaker Zack Snyder expressed interest in directing a Rick and Morty science fiction movie.</p><h4>Spin-off series</h4><p>On May 20, 2021, Adult Swim announced a short spin-off series centred on the Vindicators team (Supernova, Vance Maxiumus, Alan Rails, Crocubot and Noob Noob) previously seen on the episode, \"Vindicators 3: The Return of Worldender\" to be in development, alongside spin-offs from other Adult Swim shows like Aqua Teen Hunger Force, Robot Chicken, and Your Pretty Face Is Going to Hell. The 10-episode series, Vindicators 2 was released in July 2022.</p><p>On May 18, 2022, Adult Swim announced there would be a full spin-off series based on the anime shorts, directed by Takashi Sano.</p><h4>Cameos</h4><h4>Film</h4><p>Rick and Morty, both voiced by Roiland, have a cameo in 2021's Space Jam: A New Legacy, as they claim to have experimented on the Tasmanian Devil but say they were disgusted by the results; thus, they voluntarily give him back to LeBron and the Looney Tunes by dropping him on their rocket's windshield.</p><h4>Television</h4><p>Rick and Morty were featured in the couch gag at the beginning of \"Mathlete's Feat\", the final episode of the twenty-sixth season of The Simpsons. Said opening involved Rick accidentally killing the family when he crash-lands into their living room causing Morty to go on a mission to bring them back to life.</p><h4>Comics</h4><p>On April 1, 2015, a Rick and Morty comic book adaptation debuted with its first monthly issue, entitled \"BAM!\" The series was initially written by Zac Gorman and illustrated by CJ Cannon. Artist Tom Fowler wrote a multi-issue story arc that began in March 2016. Using the television series' established premise of alternate timelines, the first two volumes of the comic book expressly features the Rick and Morty (and supporting cast) of a different timeline, allowing the comics to tell stories without conflicting with the canon of the show. From the third volume onwards, with the departure of Gorman as writer and his replacement with Kyle Starks, the series switched focus to display the off-screen adventures of the specific Rick and Morty of the television series, keeping in the canon of the show, with the Ricks and Mortys of different timelines forming the basis for backup stories.</p><p>On August 29, 2018, a four-issue crossover comic with the fantasy tabletop role-playing game Dungeons & Dragons was released. The series titled Rick and Morty vs. Dungeons & Dragons is co-written by Jim Zub and Patrick Rothfuss, and art by Troy Little. A sequel mini-series, titled Rick and Morty vs. Dungeons & Dragons: Chapter II: Painscape, was published in September 2018. It was written by Jim Zub and Sarah Stern with art by Troy Little. The Rick and Morty vs Dungeons and Dragons Deluxe Edition, by Rothfuss, Zub, and Little, was nominated for the 2022 \"Best Graphic Album—Reprint\" Eisner Award.</p><h4>Product tie-ins</h4><p>McDonald's Szechuan Sauce returned to their menu nearly twenty years later after being referenced numerous times in \"The Rickshank Rickdemption\", the Season 3 premiere. The sauce was announced to return to all McDonald's stores on February 26, 2018 due to popular demand from Rick and Morty fans. On March 31, 2022, it once again returned to stores, featured as an app-only exclusive until April 4.</p><p>Adult Swim and Wendy's have collaborated to create commercials featuring the titular duo. They have also created Morty themed food trucks and restaurants. In 2022, Wendy's offered Rick and Morty-inspired combo meals exclusively on Uber Eats and brought back their \"Portal Time Lemon Lime\" soft drink to promote the series' sixth season. The promotion also featured a giveaway of Rick and Morty merchandise.</p><p>Adult Swim released a promotional video advertising Death Stranding. The ad involves Rick and Morty traversing the world of Death Stranding to deliver packages to stations in order to rebuild human civilization while trying to avoid being harmed by hostiles.</p><br/>"
  },
  "errorMessage": ""
}