{
  "imDbId": "tt5491994",
  "title": "Planet Earth II",
  "fullTitle": "Planet Earth II (TV Series 2016–2016)",
  "type": "TVSeries",
  "year": "2016",
  "items": [
    {
      "username": "Wentloog",
      "userUrl": "https://www.imdb.com/user/ur0362356",
      "reviewLink": "https://www.imdb.com/review/rw3575992",
      "warningSpoilers": false,
      "date": "6 November 2016",
      "rate": "10",
      "helpful": "161 out of 174 found this helpful.",
      "title": "At once awe-inspiring and terrifying!",
      "content": "I have just finished watching the first episode on BBC 1 and I am amazed to find that Planet Earth II appears to have bettered the original! The photography is perfect and Attenborough's narration, both content and delivery, is unparalleled. This initial outing is titled \"Islands\" and whilst I don't want to dwell on the individual segments, the Racer Snakes vs baby Iguanas is probably the most terrifying piece of natural history film I have ever witnessed, not for the fainthearted or squeamish!The \"making of segment at the end of the documentary proper was particularly enjoyable and informative.This is what the BBC does best and long may it last."
    },
    {
      "username": "john-m-madsen",
      "userUrl": "https://www.imdb.com/user/ur33816519",
      "reviewLink": "https://www.imdb.com/review/rw3576144",
      "warningSpoilers": false,
      "date": "6 November 2016",
      "rate": "10",
      "helpful": "128 out of 144 found this helpful.",
      "title": "Yet another masterpiece from BBC Nature & David Attenborough",
      "content": "What to say about Planet Earth II which has not already been said about so many other fantastic productions from BBC Nature?I've no idea.However: the production values are as always the very best in the business, the photography is likewise unmatched and it's all tied together with masterful insight and authority by David Attenborough, the man who through more than four decades has taught the planet more about the natural world than any ten others put together.Simply superb.The actual content? That you need to see for yourself."
    },
    {
      "username": "thespookybuz",
      "userUrl": "https://www.imdb.com/user/ur64238818",
      "reviewLink": "https://www.imdb.com/review/rw3578121",
      "warningSpoilers": false,
      "date": "10 November 2016",
      "rate": "10",
      "helpful": "109 out of 125 found this helpful.",
      "title": "Mesmerizing",
      "content": "The original Planet Earth back in 2006 was an astounding and refreshing series that tore down the limits of documentary making. It was universally lauded as exceptional, and if you haven't seen it then you're missing a genuine treat.Planet Earth II is everything its predecessor was. And more.Ultra sharp photography, iris-piercing colour and focus, and on a decent home set up, a superbly immersive experience. It is almost hypnotic the way the gorgeous landscapes and action scenes are interwoven with a sublime soundtrack by Hans Zimmer.The BBC receives criticism sometimes for the way it spends 'tax payers' money', but surely not for this. Whether you're aged 8 or 80, this is the highest quality television that will bewilder and astound.Truly wondrous, and David Attenborough is a legend."
    },
    {
      "username": "pjdickinson",
      "userUrl": "https://www.imdb.com/user/ur69264448",
      "reviewLink": "https://www.imdb.com/review/rw3576211",
      "warningSpoilers": false,
      "date": "6 November 2016",
      "rate": "10",
      "helpful": "108 out of 127 found this helpful.",
      "title": "Astounding",
      "content": "The professionalism of everyone involved in this glorious production is evident in every frame of what is seen and every second of what is heard. Most Hollywood blockbusters would struggle to compete with the cinematography on show here. Shot after shot seem almost impossible yet impossibly beautiful. Few things fill a viewer with simple awe but the first episode about islands does it and then some. The fact that it is all so enjoyable just adds to the experience. David Attenborough's narration is, as usual, superb.Whatever the cost it was worth it. The BBC has another hit."
    },
    {
      "username": "NeilBarnett",
      "userUrl": "https://www.imdb.com/user/ur4741264",
      "reviewLink": "https://www.imdb.com/review/rw3580042",
      "warningSpoilers": false,
      "date": "14 November 2016",
      "rate": "10",
      "helpful": "57 out of 71 found this helpful.",
      "title": "Best thing on TV since last Planet Earth",
      "content": "This is without doubt the best thing I have seen on television for years. The photography, narration and general story telling of the lives of the animals is simply breath-taking.Episode 1 was animals that live on islands. As others have mentioned I have never seen such a more terrifying piece of natural-history photography in my life. I won't spoil it for anyone who hasn't seen it or caught it on YouTube but I never thought I would be shouting at the TV for Iguana's to run. Episode 2 was mountain living wildlife from Grizzly Bears coming out of hibernation to Snow Leopards. This programme is one of the few examples which envelopes you in its documentary telling. You are seeing things for the first time and you are left with wanting more. Roll on episode 3, jungles."
    },
    {
      "username": "arjanhylkema",
      "userUrl": "https://www.imdb.com/user/ur24219677",
      "reviewLink": "https://www.imdb.com/review/rw3577042",
      "warningSpoilers": false,
      "date": "8 November 2016",
      "rate": "10",
      "helpful": "259 out of 278 found this helpful.",
      "title": ">10",
      "content": "As Planet Earth I was released about ten years ago, a visual improvement could have been expected due to the use of advanced technology, but man, did they up their game. The camera-work and the use of music were both truly superb, as well as the editing in which different sub- segments were all synced so well with the narrating of it by David Attenborough. It was nothing like a nature documentary, it was way beyond that. The short and different segments, were movies on itself. It contained all the different genres, from experiencing the thrill in a Hollywood-like impossible action-escape scenario to having a comical and truly euphoric moment of realization about the true extent of what nature has to offer. And this was all brought so incredibly well.If we had any more of such heavenly quality programs on TV, I would simply just glue my eyes to my TV and live out the rest of my life as a vegetable."
    },
    {
      "username": "dbijis33",
      "userUrl": "https://www.imdb.com/user/ur26410896",
      "reviewLink": "https://www.imdb.com/review/rw3577484",
      "warningSpoilers": false,
      "date": "9 November 2016",
      "rate": "10",
      "helpful": "73 out of 90 found this helpful.",
      "title": "Dangerously beautiful",
      "content": "Hello this is my first written review. Note that I haven't watched the first season (2006) so I can't compare both.This series will get you the feels when you read a good book, watched a good movie, or played a good game, because this is more than good.THIS IS A VERY BEAUTIFUL MASTERPIECE and of course with the danger of nature itself included.I don't know how they got those shots and the audio, even the music just like the rush when you first meet your crush, and the story with narration slaps you with the cold harsh of reality and the mesmerizing it gave. You are watching a book of life with enough drama and some bitter truth in every paradise, because life is never perfect.I'm very thankful for whomever people that makes this show to be realized, from the smallest task to the most dangerous.Thank you very much for this ineffable experience."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3830204",
      "warningSpoilers": false,
      "date": "13 October 2017",
      "rate": "10",
      "helpful": "14 out of 24 found this helpful.",
      "title": "Like the first 'Planet Earth', does for nature and our planet as 'Walking with Dinosaurs' did with the dinosaurs",
      "content": "Absolutely adore the first 'Planet Earth' from 2007, one of the best documentaries ever made and actually is more than that. David Attenborough (brother of director/actor Richard) is wisely considered a national treasure for very good reason, no matter how much he himself dislikes the term.So hearing that there was a second series nearly a decade later, there was absolutely no doubt as to whether to watch it. 'Planet Earth II' is as good as others have said and there is not much to add, it is along with its predecessor one of the best documentaries personally seen and most of the time it actually feels much more than that. Throughout it's an awe-inspiring, utterly transfixing experience where one forgets they're watching a documentary and instead feeling like they're watching art. This may sound like extreme hyperbole, but to me and many others 'Planet Earth II' is completely deserving of its praise and even deserving of more. To me as well, it is easily one of the best the BBC has done in years.'Planet Earth II' for starters looks amazing. It is gorgeously filmed, done in a completely fluid and natural, sometimes intimate (a great way of connecting even more with the animals), way and never looking static. In fact much of it is remarkably cinematic. The scenery and habitats are some of the most breath-taking personally seen anywhere, whether in visual media and real life, the mountains in \"Mountains\" in particular are spectacular and \"Jungles\" captures the colour, excitement and formidable danger of the jungle beautifully. The rich colours just leap out. For a composer that composes normally bombastic, rousing and pulse-racing music that is epic even in the quieter moments, Hans Zimmer's music here is a remarkably good fit, it's unmistakably Zimmer in style but throughout it not only complements the visuals but enhances them.What of the narrative aspects? Can't fault 'Planet Earth II' in this aspect either. The narration has a great well-balanced mix of facts that will be familiar to the viewer and others that will induce the right amount of surprise. In short, it's just fascinating, informative and thoughtful. This balance was even achieved in the \"Cities\" episode, that may have been the one that transfixed me the least due to being more invested in the animals and their habitats of the previous episodes.But the episode still managed to intrigue and illuminate, and credit has to go to 'Planet Earth II' for adhering to what made 'Planet Earth' work the first time and then bringing a freshness with a few nice ideas to avoid it being too stale. Attenborough delivers it beautifully, there's a soft-spoken enthusiasm and precision about his delivery and he never preaches.The animals themselves are a wonderful mix of the adorable (the penguins in \"Islands\") and the dangerous (the lions in \"Grasslands\" and \"Deserts\"), and one actually finds they're rooting for them in exactly the same way they would a human character. 'Planet Earth II' contains a good deal of suspense (especially in \"Deserts\") and emotional impact (\"Islands\"). Even the fights/conflicts against the animals are completely riveting, some epic moments in \"Jungles\".It doesn't feel like six episodes either, and none of the episodes feel episodic or repetitive. 'Planet Earth II' instead feels like a collection of six individual stories with real, complex emotions and conflicts and animal characters developed in a way a human character would in a film but does it better than several.Overall, utterly mesmerising. For documentary lovers or fans of 'Planet Earth', 'Planet Earth II' is not to be missed at all costs and has more than enough to entice one to watch it again and again, finding something new each time and never getting tired of it. 10/10 Bethany Cox"
    },
    {
      "username": "dhanrajjughead",
      "userUrl": "https://www.imdb.com/user/ur48520538",
      "reviewLink": "https://www.imdb.com/review/rw3582044",
      "warningSpoilers": false,
      "date": "18 November 2016",
      "rate": "10",
      "helpful": "68 out of 83 found this helpful.",
      "title": "Greatest documentary ever created.",
      "content": "By far the greatest and best nature documentaries ever made. Everyone needs to watch this. I have no idea how many hours it must have taken to film this, and it seems like the people who made this are totally out of their minds. The snow leopard scenes in episode 2 are so brilliant it's amazing. It's one of the rarest animals ever shot on film and they've managed to shoot so much of it. It's crazy. They deserve every little credit they get. I'm thoroughly impressed by the work put into this and i'm sure it surpasses the work put into any Hollywood action film ever created. I think I learned a lot more from these people, more than how much I learned from the content itself."
    },
    {
      "username": "farshidkarimi",
      "userUrl": "https://www.imdb.com/user/ur69859630",
      "reviewLink": "https://www.imdb.com/review/rw3584806",
      "warningSpoilers": false,
      "date": "23 November 2016",
      "rate": "10",
      "helpful": "15 out of 25 found this helpful.",
      "title": "What a Beautiful Planet- Bewitching !",
      "content": "This is my first comment and I hope I am not bungling it.I have been watching nature documentaries for many years. Everyone of them has been a depiction of beauty of nature and the planet we are living in.With all the bloodshed and cruelty that is unfolding all around, committed by US human beings, it is a relief to the heart, so soothing to the mind and calming to the eye to see such an enthralling master piece. The mesmerizing scenes of birds, soaring in the blue sky, their sleek feathers glimmering in the sun, the captivating green of leaves trembling in wake of monkeys jumping over them, the enchanting scene of Nubian Ibex baby deftly climbing down the cliff, dodging the red fox, the eye relieving sight of flamingos parading in a single line and all the grandeur of mountains superimposed by the stars in the time lapse, specks of ice swaying down in the winter scene and all enrapturing beauties of nature playing out right in front of our eyes, it is all a reminder of how majestic this world is.The trance is culminated by the legendary voice of the gem, Sir. David Attenborough. He is a major part of all this beauty. All this fragile beauty and all the majesty of these creatures invokes a feeling in the viewers mind and heart that this world, nature, animals and human beings living in it are mystically intertwined, connected and linked. I also bow in respect to the crew involved in the creation of this priceless jewel, especially the cameramen, honing it to perfection. I hope more people watch such stunning documentaries so that they will admire life on Planet Earth."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw8795753",
      "warningSpoilers": false,
      "date": "13 January 2023",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Brilliant documentary series",
      "content": "A documentary series on the wildlife found on Earth. Each episode covers a different habitat: islands, mountains, jungles, deserts, grasslands and cities. Narrated by David Attenborough (of course). This series follows on from Planet Earth (TV Mini Series 2006).Planet Earth I, released in 2006, was excellent. It showed the wildlife of Earth: their habitats, seasonal patterns, how they survive and thrive (or sometimes don't). By breaking down the series into episodes that each cover a different habitat you could see how the different species compete and are often dependent on each other. This also highlighted how these different species are suited to those habitats.Planet Earth II is more focussed and more detailed: rather than trying to capture as many different species as possible, it focuses on a few in great detail. For this the camera work has improved several fold with several camera angles, excellent resolution and cameras in just the right places.This enables narrator David Attenborough and the director to create dramatic stories around each animal, and what drama it is. Incredibly engaging and tension-filled as animals struggle for survival. The Komodo Dragon fight in Episode 1 could have been straight out of a Godzilla movie!It's these dramatic narratives with unbelievable camera angles and placements that sets Planet Earth II above Planet Earth I. The inclusion of cities as a habitat is also a major positive for Planet Earth II: novel, yet something that seems so obvious to include, in hindsight. This also gives a fantastic example how animals are able to adapt to changing environments and even take advantage of them.The only negative is that, unlike Planet Earth I, there is nothing on sea animals. Blue Planet II was released a year after this and so covers that, I guess."
    },
    {
      "username": "ianrobo",
      "userUrl": "https://www.imdb.com/user/ur69576825",
      "reviewLink": "https://www.imdb.com/review/rw3583353",
      "warningSpoilers": false,
      "date": "20 November 2016",
      "rate": "10",
      "helpful": "42 out of 74 found this helpful.",
      "title": "In times of climate deniers, hope",
      "content": "Plant Earth 2 was everything you would expect and more. Every scene, every vista shows that humans are the real parasites on this planet and the animals should rule us, not the other way round.However it gives me hope, it says to me people will watch this, hear about it and see the folly of our actions at some time.Hope is far better than despair.Oh David Attenborough, you are the king of us all"
    },
    {
      "username": "andrewchristianjr",
      "userUrl": "https://www.imdb.com/user/ur79190944",
      "reviewLink": "https://www.imdb.com/review/rw7463109",
      "warningSpoilers": false,
      "date": "20 October 2021",
      "rate": "10",
      "helpful": "3 out of 4 found this helpful.",
      "title": "SPECTACULAR!",
      "content": "The sequel of the 2006 documentary is a much more advanced and technical spectacle -- with just as amazing views of our beloved world. The sheer beauty of this planet, different wildlife species shown closer than ever, the emotional score for each episode makes it one great experience. A true masterpiece."
    },
    {
      "username": "areatw",
      "userUrl": "https://www.imdb.com/user/ur66517869",
      "reviewLink": "https://www.imdb.com/review/rw3608642",
      "warningSpoilers": false,
      "date": "29 December 2016",
      "rate": "",
      "helpful": "7 out of 14 found this helpful.",
      "title": "Breathtaking",
      "content": "I never thought the original 'Planet Earth' could be topped, but 10 years on and Attenborough has given us something that is every bit as good, if not even better, than the first series.'Planet Earth II' is everything I had hoped it would be and more. Visually breathtaking, mesmerising and at times unbelievable, with expert narration by the legendary David Attenborough. Documentaries as awe-inspiring as this don't come about very often.I always enjoy the 'making of' at the end of each episode, giving us an insight into the lengths that the crew go to capture the footage. They deserve a lot more credit than they get. 'Planet Earth' is, without question, the greatest documentary ever made and a must see."
    },
    {
      "username": "rtoac1",
      "userUrl": "https://www.imdb.com/user/ur43463690",
      "reviewLink": "https://www.imdb.com/review/rw8029709",
      "warningSpoilers": false,
      "date": "3 April 2022",
      "rate": "10",
      "helpful": "4 out of 6 found this helpful.",
      "title": "An excellent watch - encourage your children",
      "content": "I would call this a must watch for children and adults alike.. If we want to genuine empathy in humanity towards nature, they should watch series like these. For the true environment protection begins with practices at home!So well made with advanced remote camera technology, when watching this series, you start feeling the throb of nature within you. There are 6 episodes in all, each less than an hour. The anchoring voice over by David Attenborough is - as usual - superb.And while the first series had more episodes and farther reach, this Part 2 also does an excellent job."
    },
    {
      "username": "panagiotiskatsanos",
      "userUrl": "https://www.imdb.com/user/ur31984591",
      "reviewLink": "https://www.imdb.com/review/rw3610324",
      "warningSpoilers": false,
      "date": "1 January 2017",
      "rate": "10",
      "helpful": "22 out of 30 found this helpful.",
      "title": "One of the best documentaries I 've ever seen",
      "content": "One of the best documentaries I 've ever seen. Every episode is a new wonderful experience,getting to know the world that surrounds us. David Attenborough is the best narrator out there and this is his latest masterpiece. The crew has worked hard and managed to capture a large aspect of wild life whether it lives on a remote island in the arctic ocean or deep in one of the large human cities in India or United States of America. It shows that they put a lot of effort and time filming this under harsh conditions,but the close up captures of wild animals in their natural environment was worth the effort. Watched it already twice and will watch it again! This is something to watch again and again with your children, until the next Planet Earth arrives. Well done!"
    },
    {
      "username": "salmanu-27386",
      "userUrl": "https://www.imdb.com/user/ur69639386",
      "reviewLink": "https://www.imdb.com/review/rw3576875",
      "warningSpoilers": false,
      "date": "7 November 2016",
      "rate": "10",
      "helpful": "42 out of 61 found this helpful.",
      "title": "Excellent",
      "content": "The opening image of Planet Earth II contained the promise of everything to come. It was spectacular, it was beautiful, it was magical. A hot air balloon floated like a snowflake, two miles abovean Alpine.The theme of the episode was \"Islands\", and we got off to a winningly cute start with a visit to idyllic Escudo, off Panama. Its star attraction is a three-toed pygmy sloth spurred into slow motion action by the cry of a potential mate. But no doubt what most people will remember, and talk about today, were the baby iguanas running the gauntlet of swarms of racer snakes on the Galapagos island of Fernandina.how beautiful our world and its living thing .....and how beautiful and big the creator of this whole universe ....I think people have to watch this types of films which is real one ."
    },
    {
      "username": "BobFillmore",
      "userUrl": "https://www.imdb.com/user/ur1603603",
      "reviewLink": "https://www.imdb.com/review/rw3819367",
      "warningSpoilers": false,
      "date": "30 September 2017",
      "rate": "10",
      "helpful": "9 out of 13 found this helpful.",
      "title": "Should be required viewing in schools",
      "content": "This is probably the most intimate documentary I have seen of our fellow species on earth. Awesome. After having a bad day... watch this. Your problems will seem insignificant compared to life in general. We may be the top of the food chain. but this will illustrate the type of struggles we had to endure to get here. Humbling. Young people need to know their place in nature."
    },
    {
      "username": "jack_o_hasanov_imdb",
      "userUrl": "https://www.imdb.com/user/ur55640799",
      "reviewLink": "https://www.imdb.com/review/rw7201519",
      "warningSpoilers": false,
      "date": "6 August 2021",
      "rate": "10",
      "helpful": "2 out of 3 found this helpful.",
      "title": "Part II",
      "content": "This is one of the best documentaries I've ever watched. In fact, according to today's technology, it is old but very beautiful."
    },
    {
      "username": "fierceeagle-40009",
      "userUrl": "https://www.imdb.com/user/ur107475714",
      "reviewLink": "https://www.imdb.com/review/rw5671006",
      "warningSpoilers": false,
      "date": "24 April 2020",
      "rate": "10",
      "helpful": "5 out of 7 found this helpful.",
      "title": "Absolutely amazing.",
      "content": "Let me say the score, the music, the scenery, the animals and all the detail is like nothing you have seen before. When I'm dying in my bed i hope 60 years from now on my death bed this is what i want to be watching. It will give me peace on my way out of this magical and beautiful world. Just watch and see. Unfortunately for me i won't be able to go to certain parts of the world but seeing this makes me feel like I'm there."
    },
    {
      "username": "myersei-165-4350",
      "userUrl": "https://www.imdb.com/user/ur56623684",
      "reviewLink": "https://www.imdb.com/review/rw3592216",
      "warningSpoilers": false,
      "date": "5 December 2016",
      "rate": "10",
      "helpful": "11 out of 18 found this helpful.",
      "title": "This masterpiece deserves higher scores",
      "content": "It's a shame I can only give this breathtaking masterpiece 10 out of 10, it really deserves more. It is the single most astounding cinematic experience I have ever witnessed. The cinematography, narration, and score are hands down the best I have ever seen. Never has my entire family been so excited to watch the next episode of a program or movie.Planet Earth II lays out in 5 episodes life on earth in 6 separate Earth habitats: Islands, Mountains, Jungles, Deserts, Grasslands, and Cities. Each one dives into live and it's will to survive in a level you've never seen before. Truly remarkable cinematography and color will literally make you gasp for air and your eyes open wide. It truly is the greatest nature documentary ever made and possibly the greatest documentary of all time."
    },
    {
      "username": "chubarova",
      "userUrl": "https://www.imdb.com/user/ur106184494",
      "reviewLink": "https://www.imdb.com/review/rw6455400",
      "warningSpoilers": false,
      "date": "8 January 2021",
      "rate": "10",
      "helpful": "2 out of 3 found this helpful.",
      "title": "Outstanding!",
      "content": "I don't want to say too much. This documentary is amazing, outstanding, awesome and other synonyms. Also I kile that they show how they made this film, the work of cameramen. This film is reminder that out planet and nature is the thing that we must save for next generation."
    },
    {
      "username": "RahulM007",
      "userUrl": "https://www.imdb.com/user/ur47264037",
      "reviewLink": "https://www.imdb.com/review/rw6426953",
      "warningSpoilers": false,
      "date": "31 December 2020",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Entertaining and informative-Documentary of your dreams",
      "content": "The documentary titled \"Planet Earth: Part II\" is a TV Mini-Series showcasing life on planet earth. The narrator David Attenborough returns in this breathtaking documentary. It will literally knock your socks off. The documentary is entertaining, informative and worth watching for a number of reasons.Firstly, the cinematography in this documentary is perfect and David Attenborough's narration is on point. He could not have delivered better content because it is truly flawless and of the highest quality and ranking. When watching this documentary one can clearly see how many professionals were involved in the making of it. There are in total six episodes, each one hour long. From the very first episode, I became hooked and could not stop watching until it was over.Secondly, this documentary makes you want to see the world and study wildlife in greater detail. While watching the documentary, I am seeing things for the first time and after finishing it, I start to want more episodes. I am thoroughly impressed by the work put into this riveting and enthralling documentary about islands, mountains, jungles, deserts, grasslands and cities.Finally, I cannot believe that the documentary was filmed in 40 different countries. The filming crew did a terrific job and made around 117 film trips and counted in total 2089 filming days. Kudos to the production crew for investing long hours to capture these astonishing images. No wonder that the documentary received two Emmys and worldwide recognition.In a nutshell, \"Planet Earth: Part II\" was the best documentary I have ever seen. In my humble opinion, it is actually better than the first documentary by David Attenborough released 14 years ago. I doubt that there will be a third part, but who knows what the future holds."
    },
    {
      "username": "cgtam",
      "userUrl": "https://www.imdb.com/user/ur113586051",
      "reviewLink": "https://www.imdb.com/review/rw5478157",
      "warningSpoilers": true,
      "date": "12 February 2020",
      "rate": "10",
      "helpful": "3 out of 5 found this helpful.",
      "title": "Gorgeous truth. Must be made mandatory viewing at every educational school syste.m",
      "content": "David Attenborough's narration completes the fascinating cinematography, and dire need for immediate action to save our HUMAN species and HUMAN environment. Several sequences are too short, so one needs to pause to revel at nature's artistry. The entire series BBC planet earth Nature documentaries subtly proves we are quickly destroying our only home in the universe due mostly to GREED & unawareness. All the incredible sentient intelligent creatures shown are rapidly suffering & disappearing forever due to our actions. Humans must stop living in video games, trivial social media, & being apathetic in order to realize & process the brutal truth. We are allowing steady annihilation of our entire planet. Only then can we alone choose to stop it by demanding alternative ways to sustain our lives & habitats. This message is NOT strongly emphasized enough. The status quo of the 20th Century can no longer be maintained in THIS century. We are making our own hell to permanently reside in."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw4073053",
      "warningSpoilers": false,
      "date": "24 February 2018",
      "rate": "10",
      "helpful": "3 out of 7 found this helpful.",
      "title": "One of the best things I've had the privilege to watch.",
      "content": "I can't think of a show I miss more then Planet Earth II, it remains one of the most visually impressive shows I've ever seen. Each moment is awe inspiring and jaw dropping. For anyone considering the Blu ray I would recommend absolutely, loaded with moments you'll wish to watch and re-watch. Incredible filming, breathtaking views, an incredible insight into this planet we live in, the dangers it faces, as well as some of the positive things going on. Best thing of course is the narration by legendary Sir David Attenborough, who is as incredible as ever.Quite simply put this is one of the best things I've ever watched, has been a privilege to revisit. 10/10"
    }
  ],
  "errorMessage": ""
}