{
  "imDbId": "tt5491994",
  "title": "Planet Earth II",
  "fullTitle": "Planet Earth II (TV Series 2016–2016)",
  "type": "TVSeries",
  "year": "2016",
  "language": "en",
  "titleInLanguage": "Planet Earth II",
  "url": "https://en.wikipedia.org/wiki/Planet_Earth_II",
  "plotShort": {
    "plainText": "Planet Earth II is a 2016 British nature documentary series produced by the BBC as a sequel to Planet Earth, which was broadcast in 2006. The series is presented and narrated by Sir David Attenborough with the main theme music composed by Hans Zimmer.\r\nAnnounced in 2013, Planet Earth II is the first television series produced by the BBC in Ultra-high-definition (4K), and set out to utilise new filmmaking technologies that had been developed since the first series.\r\nThe first trailer was released on 9 October 2016, and the series premiered on 6 November 2016 in the United Kingdom on BBC One and BBC One HD. It aired internationally on BBC Earth and other networks.\r\nThe series received universal critical acclaim, with many reviewers commending the use of new filmmaking technology and declaring it among the best nature documentaries of all time. It won two Television Awards and two Television Craft Awards from the British Academy of Film and Television Arts, and two Primetime Emmy Awards.\r\nA sequel titled Planet Earth III is scheduled to air in 2023.",
    "html": "<p>Planet Earth II is a 2016 British nature documentary series produced by the BBC as a sequel to Planet Earth, which was broadcast in 2006. The series is presented and narrated by Sir David Attenborough with the main theme music composed by Hans Zimmer.</p><p>Announced in 2013, Planet Earth II is the first television series produced by the BBC in Ultra-high-definition (4K), and set out to utilise new filmmaking technologies that had been developed since the first series.</p><p>The first trailer was released on 9 October 2016, and the series premiered on 6 November 2016 in the United Kingdom on BBC One and BBC One HD. It aired internationally on BBC Earth and other networks.</p><p>The series received universal critical acclaim, with many reviewers commending the use of new filmmaking technology and declaring it among the best nature documentaries of all time. It won two Television Awards and two Television Craft Awards from the British Academy of Film and Television Arts, and two Primetime Emmy Awards.</p><p>A sequel titled Planet Earth III is scheduled to air in 2023.</p>"
  },
  "plotFull": {
    "plainText": "Planet Earth II is a 2016 British nature documentary series produced by the BBC as a sequel to Planet Earth, which was broadcast in 2006. The series is presented and narrated by Sir David Attenborough with the main theme music composed by Hans Zimmer.\r\nAnnounced in 2013, Planet Earth II is the first television series produced by the BBC in Ultra-high-definition (4K), and set out to utilise new filmmaking technologies that had been developed since the first series.\r\nThe first trailer was released on 9 October 2016, and the series premiered on 6 November 2016 in the United Kingdom on BBC One and BBC One HD. It aired internationally on BBC Earth and other networks.\r\nThe series received universal critical acclaim, with many reviewers commending the use of new filmmaking technology and declaring it among the best nature documentaries of all time. It won two Television Awards and two Television Craft Awards from the British Academy of Film and Television Arts, and two Primetime Emmy Awards.\r\nA sequel titled Planet Earth III is scheduled to air in 2023.\r\nProduction\r\nThe series was announced by the BBC in 2013 with the working title One Planet, but the title was later changed to Planet Earth II.\r\nThe BBC trailer for the series used the same music featured in the trailer for the original Planet Earth, \"Hoppípolla\" by Icelandic post-rock band Sigur Rós.\r\nThe original Planet Earth, airing in 2006, was one of the first natural documentary series to be made in high definition (HD) and Planet Earth II utilised new technologies developed since the first series, including ultra high definition (4K), improved camera stabilisation, remote recording and aerial drone technology.\r\nBroadcast\r\nBritish television\r\nThe premiere of Planet Earth II took place at Bristol's Cinema de Lux on 2 November 2016 with special guest appearance by Attenborough. Bristol has been the global home of BBC's Natural History programme making for almost 60 years. The series debuted on BBC One and BBC One HD the following Sunday (6 November) from 8pm to 9pm. Each of the six episodes included a 10-minute making-of documentary called Planet Earth II Diaries. The previous week's episode was repeated in an earlier time slot the following Sunday.\r\nInternational\r\nThe series was broadcast internationally on BBC Earth channel with a few exceptions for some countries.\r\nThe series aired in Belgium on the Flemish channel Canvas, narrated in Dutch by Vic De Wachter, with episodes airing each Wednesday from 7 December 2016. In the Netherlands the series is airing on the Dutch channel NPO 1, narrated by Peter Drost, with episodes airing each Sunday from 1 January 2017.\r\nIn Japan, the series aired on NHK – with four special episodes aired on 23 December 2016 and concluded on 19 February 2017 respectively, while all the six original episodes were broadcast from 29 March 2017 until 6 May 2017.\r\nIn Australia, the series premiered on 15 February 2017 on the Nine Network. As for New Zealand, it aired from 9 July 2017 at Prime channel.\r\nThe series debuted in Canada and the United States on 18 February 2017, with the Canadian broadcast on the local BBC Earth channel (which recently launched). In the United States, the series premiered with a three-network simulcast across BBC America, AMC, and SundanceTV (owned by AMC Networks, who manages BBC America on behalf of BBC Worldwide).\r\nIn Israel, the series premiered on 20 May 2017 on the new public broadcasting network KAN 11.\r\nIn the Philippines, the series premiered on 17 June 2018 on GMA Network through its version Amazing Earth for the first season.\r\nIn Greece, all the six original episodes were broadcast daily from 12 April 2020 until 17 April 2020 at 09.30pm on the free-to-air television network Skai TV.\r\nIn India, all the episodes are available for streaming through Amazon Prime. All the episodes are also available in Discovery Plus.\r\nEpisodes\r\nThe series comprises six episodes plus the compilation episode \"A World of Wonder\". Official episode viewing figures are from BARB. The first episode gained 12.26 million viewers in the United Kingdom, which broke the record for the highest under the current system of viewing figures for a nature documentary.\r\n\"It's been ten years since we explored these wonders in the first series of Planet Earth, and since then much has changed. We can now show live on our planet in entirely new ways; bring you closer to animals than ever before and reveal new wildlife dramas for the very first time. But that is not all; the planet has changed too. Never have our wildernesses been as fragile and as precious as they are today. At this crucial time for the natural world we will journey to every corner of the globe; to explore the greatest treasures of our living planet, and reveal the extreme lengths animals go to to survive.\"— David Attenborough's opening words\r\n\"Now, over half of us live in an urban environment. My home, too, is here, in the city of London. Looking down on this great metropolis, the ingenuity with which we continue to reshape the surface of our planet is very striking. But it's also sobering. It reminds me of just how easy it is for us to lose our connection with the natural world. Yet, it's on this connection that the future of both humanity and the natural world will depend. And surely, it is our responsibility to do everything within our power to create a planet that provides a home not just for us, but for all life on Earth.\"— David Attenborough, in closing\r\nReception\r\nCritical reception\r\nOn the review aggregator website Rotten Tomatoes, 100% of 28 critics' reviews are positive, with an average rating of 9.7/10. The website's consensus reads: \"Planet Earth II offers a spectacular, moving, unprecedented account of the natural world.\"\r\nThe Independent's Christopher Hooton said of the series: \"It is undoubtedly the greatest TV nature documentary to date and there's a strong case for it being one of the best TV series full stop.\" Michael Hogan from The Telegraph compared this series to the original Planet Earth series and said that \"advances in technology have enabled intimate high-definition close-ups and gasp-inducing aerial shots\" and said \"It has become predictable to heap superlatives upon the BBC Natural History Unit and wax lyrical about Attenborough's status. But both institutions should be treasured while we're lucky enough to still have them.\" Gerard O'Donovan gave the series 5 out of 5 stars in The Telegraph, calling it \"one of the most stunningly vivid and engaging natural history films I've ever seen\".\r\nIn The New York Times, Neil Glenzinger said \"nature photography has rarely been as spectacular as it is in Planet Earth II.\" The Hollywood Reporter's Tim Goodman called the series a \"truly sublime accomplishment, an epic achievement that everyone should watch.\"\r\nSeveral outlets particularly highlighted the racer snake and marine iguana sequence from \"Islands\" as a memorable highlight of the series.\r\nHowever, The Guardian's Martin Hughes-Games, while calling the series \"spectacular and fascinating\", accused programmes such as this of breeding complacency about the destruction of wildlife by painting a misleading picture of the planet. He wrote that series such as Planet Earth had \"become a disaster for the world's wildlife\" and that while world animal populations are decreasing, \"the producers continue to go to the fast shrinking parks and reserves to make their films – creating a beautiful, beguiling fantasy world\".\r\nAs of 2023, the series is the highest rated television series of all time on IMDb's list of Top Rated TV Shows. The Guardian listed the series as the best television show of 2016 and in 2019 ranked it along with the first Planet Earth series 72nd on a list of the 100 best TV shows of the 21st century.\r\nAwards and nominations\r\nMerchandise\r\nDVD and Blu-ray\r\nIn the UK, the series was released as a two-disc DVD or Blu-ray set on 5 December 2016, while a four-disc 4K UHD Blu-ray + Blu-ray set was released later on 13 March 2017. These releases were distributed by BBC Worldwide.\r\nIn the US and Canada, the DVD, Blu-ray, and 4K UHD Blu-ray sets were released on 28 March 2017 and distributed by BBC Worldwide Americas. Each of the six episodes includes the 10-minute segment of the making-of documentary Planet Earth II: Diaries that had followed the original broadcast of each episode.\r\nIn Australia and New Zealand, the DVD, Blu-ray, and 4K UHD Blu-ray sets were released by ABC DVD/Village Roadshow on 29 March 2017.\r\nBooks\r\nAn accompanying hardback book was written by Steven Moss with a foreword by David Attenborough and published by BBC Books (ISBN 978-1849909655). It was released on 6 October 2016 in the UK, and on 15 February 2017 for the US release.\r\nSoundtrack\r\nThe soundtrack was released with a compilation of the incidental music specially commissioned for Planet Earth II. The main theme was composed by Hans Zimmer, with the original music for each episode composed by Jacob Shea and Jasha Klebe for Bleeding Fingers Music. A digital soundtrack was released worldwide on 11 November 2016, while a two-disc soundtrack became available on 2 December 2016 in the UK.\r\nTrack listing",
    "html": "<p>Planet Earth II is a 2016 British nature documentary series produced by the BBC as a sequel to Planet Earth, which was broadcast in 2006. The series is presented and narrated by Sir David Attenborough with the main theme music composed by Hans Zimmer.</p><p>Announced in 2013, Planet Earth II is the first television series produced by the BBC in Ultra-high-definition (4K), and set out to utilise new filmmaking technologies that had been developed since the first series.</p><p>The first trailer was released on 9 October 2016, and the series premiered on 6 November 2016 in the United Kingdom on BBC One and BBC One HD. It aired internationally on BBC Earth and other networks.</p><p>The series received universal critical acclaim, with many reviewers commending the use of new filmmaking technology and declaring it among the best nature documentaries of all time. It won two Television Awards and two Television Craft Awards from the British Academy of Film and Television Arts, and two Primetime Emmy Awards.</p><p>A sequel titled Planet Earth III is scheduled to air in 2023.</p><br/><h3>Production</h3><p>The series was announced by the BBC in 2013 with the working title One Planet, but the title was later changed to Planet Earth II.</p><p>The BBC trailer for the series used the same music featured in the trailer for the original Planet Earth, \"Hoppípolla\" by Icelandic post-rock band Sigur Rós.</p><p>The original Planet Earth, airing in 2006, was one of the first natural documentary series to be made in high definition (HD) and Planet Earth II utilised new technologies developed since the first series, including ultra high definition (4K), improved camera stabilisation, remote recording and aerial drone technology.</p><br/><h3>Broadcast</h3><h4>British television</h4><p>The premiere of Planet Earth II took place at Bristol's Cinema de Lux on 2 November 2016 with special guest appearance by Attenborough. Bristol has been the global home of BBC's Natural History programme making for almost 60 years. The series debuted on BBC One and BBC One HD the following Sunday (6 November) from 8pm to 9pm. Each of the six episodes included a 10-minute making-of documentary called Planet Earth II Diaries. The previous week's episode was repeated in an earlier time slot the following Sunday.</p><h4>International</h4><p>The series was broadcast internationally on BBC Earth channel with a few exceptions for some countries.</p><p>The series aired in Belgium on the Flemish channel Canvas, narrated in Dutch by Vic De Wachter, with episodes airing each Wednesday from 7 December 2016. In the Netherlands the series is airing on the Dutch channel NPO 1, narrated by Peter Drost, with episodes airing each Sunday from 1 January 2017.</p><p>In Japan, the series aired on NHK – with four special episodes aired on 23 December 2016 and concluded on 19 February 2017 respectively, while all the six original episodes were broadcast from 29 March 2017 until 6 May 2017.</p><p>In Australia, the series premiered on 15 February 2017 on the Nine Network. As for New Zealand, it aired from 9 July 2017 at Prime channel.</p><p>The series debuted in Canada and the United States on 18 February 2017, with the Canadian broadcast on the local BBC Earth channel (which recently launched). In the United States, the series premiered with a three-network simulcast across BBC America, AMC, and SundanceTV (owned by AMC Networks, who manages BBC America on behalf of BBC Worldwide).</p><p>In Israel, the series premiered on 20 May 2017 on the new public broadcasting network KAN 11.</p><p>In the Philippines, the series premiered on 17 June 2018 on GMA Network through its version Amazing Earth for the first season.</p><p>In Greece, all the six original episodes were broadcast daily from 12 April 2020 until 17 April 2020 at 09.30pm on the free-to-air television network Skai TV.</p><p>In India, all the episodes are available for streaming through Amazon Prime. All the episodes are also available in Discovery Plus.</p><br/><h3>Episodes</h3><p>The series comprises six episodes plus the compilation episode \"A World of Wonder\". Official episode viewing figures are from BARB. The first episode gained 12.26 million viewers in the United Kingdom, which broke the record for the highest under the current system of viewing figures for a nature documentary.</p><blockquote>\"It's been ten years since we explored these wonders in the first series of Planet Earth, and since then much has changed. We can now show live on our planet in entirely new ways; bring you closer to animals than ever before and reveal new wildlife dramas for the very first time. But that is not all; the planet has changed too. Never have our wildernesses been as fragile and as precious as they are today. At this crucial time for the natural world we will journey to every corner of the globe; to explore the greatest treasures of our living planet, and reveal the extreme lengths animals go to to survive.\"— David Attenborough's opening words</blockquote><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#000000;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#000000\">Title</th><th scope=\"col\" style=\"background:#000000\">Produced by</th><th scope=\"col\" style=\"background:#000000\">Original air date</th><th scope=\"col\" style=\"background:#000000;width:10%\">UK viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Islands\"</td><td style=\"text-align:center\">Elizabeth White</td><td style=\"text-align:center\">6 November 2016</td><td style=\"text-align:center\">12.26</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\"><p>The first episode illustrates the wildlife settlement of coastal islands, in which thousands of them worldwide where animals struggle for survival reflects challenges for all life on Earth. Somewhere on the island of <span>Escudo</span> off the coast of <span>Panama</span>, a male <span>pygmy three-toed sloth</span> heard the distant mating call as he swims across the shallow mangrove seas in search of a lone female. On the <span>Komodo</span> island of <span>Indonesia</span>, male <span>Komodo dragons</span> compete with each other to earn the sole mating right. Isolated from the continent of Africa, <span>Madagascar</span> provides a home to several species of <span class=\"mw-redirect\">lemurs</span> which include giant endangered <span>indris</span>, a conspiracy of <span>ring-tailed lemurs</span>, small <span>bamboo lemurs</span>, and leaping <span>sifakas</span>. At the <span>Fernandina Island</span> of the <span>Galápagos</span>, a newly hatched <span>marine iguana</span> miraculously escapes the onslaught of predatory <span>Galapagos racers</span> before climbing to the cliff top for safety. From the sub-Antarctic of <span>New Zealand</span> inhabited by thousands of birds, <span>Snares penguins</span> perform their sub-breeding season, <span>shearwaters</span> fly off to collect food for their young, and a male <span>Buller's albatross</span> tries to find a female to mate. A female <span>white tern</span> from <span>Seychelles</span> nestles her egg on a bare branch and incubates it while <span>brown noddies</span> settles their nest on a <span>pisonia</span> tree. A <span>Seychelles fody</span> consumes the tern's egg and the young noddy is entangled by the pisonia's seeds. Located on the <span>Indian Ocean</span>, <span>Christmas Island</span> is infested with numerous species of crabs, including a cast of million <span>Christmas Island red crabs</span> as they migrate across the island to reach the feeding shore. Some are attacked by a swarm of invasive <span>yellow crazy ants</span>. Millions of <span>chinstrap penguins</span> settle on an isolated volcanic island called the <span>Zavodovski Island</span> off the coast of the <span>Southern Ocean</span>, enduring hostile environments such as extreme mass waves, violent storms, ravaging <span class=\"mw-redirect\">skuas</span>, and noxious volcanic gases. The mother penguin guards her chicks against the skuas while her partner returns to their nesting place with food after his fifty miles journey from fishing before she switches places.</p>The <i>Planet Earth II Diaries</i> explains the teams' one-year expedition camp on Zavodovski Island while filming penguins before they departed from harsh weather.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Mountains\"</td><td style=\"text-align:center\">Justin Anderson</td><td style=\"text-align:center\">13 November 2016</td><td style=\"text-align:center\">13.14</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\"><p>The second episode starts with the <span>Himalayas</span> where endangered <span class=\"mw-redirect\">snow leopards</span> roam across the range for survival. Across the steep sun-baked mountains of the <span>Arabian Peninsula</span>, <span>Nubian ibexes</span> settles on the steepest cliff to raise their young while avoiding predators. The ibexes climb down the slope to drink while the kids learn to evade <span>Arabian red foxes</span>. A female <span>golden eagle</span> glides 100 miles across the <span>Alps</span> slopes in a single day to find food in winter before spotting fox carrion, infested with scavenging crows, that can sustain her days. However, the carrion attracts other eagles forcing her to continue her search. Meanwhile, thousands of <span>avalanches</span> from the <span>Rocky Mountains</span> occur every year resulting in catastrophic effects of debris; <span>grizzly bears</span> make their dens for hibernation at 10,000 feet in the deep snow of leeward slope. In spring, a mother bear and her cubs descend into the valley in search of food and to evade avalanche debris. As <span>marmots</span> make warning calls, the bears scratch themselves on trees, marking their scents before they continue their foraging. Winter in the <span>Rockies</span> will reach at least -54° Celsius after the creation of diamond dust. A <span>bobcat</span> leaves its territory to hunt and finds a suitable valley where the river doesn't freeze and volcanic hot springs where other animals have arrived to feed. From the equator of Africa lies the snowy <span>Mount Kenya</span> which is 30 degrees colder than the African savanna, and is also the home of <span>giant heathers</span>, <span>Lobelias</span>, and <span>groundsels</span> growing on the upper slope as they adapt hot summer day and freezing night. As the sun rises on the <span>Andes</span> of <span>Bolivia</span>, <span>southern viscachas</span> settle at the sun's ray to get warm while the largest colonies of <span>Andean flamingos</span> are trapped in the icy alkali lake at night as they struggle to break free. But as the sun gets hotter, the viscachas retreat towards the shade, and the flamingoes who are immune to the sun's heat start parading across the lake for breeding. Human activities and climate changes start to affect the mountainous ecosystem, resulting in infrastructure buildings in the Alps, shortening hibernation seasons in the Rockies, and melting glaciers in the Andes, including snow decline in the Himalayas. Somewhere in the Himalayas, the mother snow leopard fends off against two male leopards while protecting her adolescent cub, resulting in her injuries. After months of recovery, the mother ventures off across the Himalayan slopes on her own while departing her cub, who is now old enough to fend for herself. The narrator states that they will soon be reunited before facing their time alone.</p>The <i>Planet Earth II Diaries</i> reveals the team's exploration of the Alps while filming golden eagles. The teams use paragliders to follow the eagle's flight pattern while wearing a helmet camera to focus on the eagle's perspective. Due to unpredictable weather and mountainous terrains, the paragliders face difficult obstacles of avoiding peaks and clouds before they safely land.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Jungles\"</td><td style=\"text-align:center\">Emma Napper</td><td style=\"text-align:center\">20 November 2016</td><td style=\"text-align:center\">11.60</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\"><p>The third episode introduces the jungle ecosystem that covers less than 6% of the earth's surface, where plants and animals live. An indri roams across the jungles of Madagascar while facing the competition of survival based on niche. High up on the treetops in <span>Guatemala</span>, a curious young <span>spider monkey</span> gets stuck and is rescued by her father. A young <span>Draco lizard</span> searches for ants on a tree but larger male challenges him, to which the young male chooses to glide to safety. 300 years ago, a giant <span>hura tree</span> began to grow taller as it races to absorb water and sunlight for survival, which it carries 1000 other plants within its branches. Hundreds of <span>hummingbird</span> species in <span>Ecuador</span> compete with each other to feed nectar. <span>Sword-billed hummingbirds</span> avoid competition with other hummingbirds by using their long beaks to reach the nectar in the deepest flowers which are inaccessible to the other hummingbirds. The rainforest trees provide transpiration as the moisture vaporized causing rainfall, and supporting all life. Deep in the <span class=\"mw-redirect\">Amazon Rainforest</span> of <span>Brazil</span>, the trees are suddenly submerged from flooding caused by seasonal rainfall while <span>Araguaian river dolphins</span>, a newly discovered species, use their sonars to hunt in the murky waters. Even though the rainfall cause mass flooding, the jungle provides abundant food within a shallow margin for large animals that thrive through lush vegetation like the mighty <span>jaguar</span>, which ambushes and kills a <span>caiman</span>.  Deep in the jungle, animals provide camouflage and mimicry to help evade predators, such as a <span>leaf-tailed gecko</span> which disguises itself as lichen. A male <span>glass frog</span> from <span>Costa Rica</span> fiercely protects his eggs from predatory <span>wasps</span>. Some of the newly hatched tadpoles escape by falling into the stream below. At night, insects glow to search for mates while fungi use bioluminescent light to attract insects like <span>click beetles</span> to disperse their spores. A <span>railroad worm</span> hunts <span>millipedes</span> by turning off its bioluminescence light and deceive it. In <span>Papua New Guinea</span>, several male <span>red birds-of-paradise</span> perform their mating dance to attract females on the canopy while a solitary <span>Wilson's bird-of-paradise</span> seeks his mate on the forest floor by furbishing his <i>display court</i> and enacting his colorful display. Back in Madagascar, the family of indris gather together as they sing to deter other indris from their territory in which the narrator specifies that the Jungle is their sanctuary and their protection for all life on Earth.</p>The <i>Planet Earth II Diaries</i> reveals that the jungle is the least explored place to visit for simple reasons. The teams' exploration of Brazil took them five weeks of finding the rare Araguaian river dolphins while filming them both on the surface and underwater.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Deserts\"</td><td style=\"text-align:center\">Ed Charles</td><td style=\"text-align:center\">27 November 2016</td><td style=\"text-align:center\">11.88</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\"><p>The fourth episode focuses on deserts which cover one-third of the planet as plants and animals perform survival strategies. A pride of <span>lions</span> in the <span>Namib</span> desert attempt to hunt a herd of <span>gemsbok</span> and a <span>giraffe</span> but fail. In the <span>American West</span>, thunderstorms arrive after two months of drought causing multiple floods. Million years ago, the formation of <span>slot canyons</span> and mountain-type canyons were the results of ravage floodwaters and soil erosions, making them one of the most iconic landscapes on the planet. In the <span>Sonoran Desert</span> of <span>Arizona</span>, <span>cacti</span> are able to store water within their stems and sport spines for defense. <span>Harris's hawks</span>, however, are able to perch on a cactus' spines while hunting <span>round-tailed ground squirrels</span> in packs. The <span>loggerhead shrike</span> or butcherbird hangs its prey on the cactus' spines for storage. Amongst the driest deserts in <span>Peru</span>, plants began to flourish due to seasonal changes which provide a land of opportunity for all life. In south-west Madagascar, billion swarm of <span>migratory locusts</span>, affected by heavy rainfall, began to flourish from breeding as they savagely infest the entire area of farmlands and consume mass amounts of vegetation. In the arid shrublands of the <span>Kalahari Desert</span>, herds of <span class=\"mw-redirect\">plains zebras</span> and <span>desert elephants</span> gather at a waterhole to drink after their long migration. Male <span>sandgrouse</span> fly 120 miles every morning to provide water for their families.  They can soak up water in their breast feathers, but also have to escape the talons of a <span>gabar goshawk</span>. At the <span>Mojave Desert</span> during <span>July</span>, a herd of wild <span>mustangs</span> gather at a waterhole, in which the lead stallion tries to assert its dominance before his confrontation by his newly rival. Standing on the scorching dunes, a <span>shovel-snouted lizard</span> raises each foot off the ground one at a time to cool itself. At night, a nocturnal <span>golden mole</span> stalks across the sand dunes to locate <span>termites</span> with its hearing. In the <span>Negev</span> desert of <span>Israel</span>, a <span>desert long-eared bat</span> hunts on the ground, defeating a venomous <span>deathstalker</span> scorpion after a short confrontation. At dawn, fog from the Atlantic coast is blown over to the dunes, creating a source of moisture which causes the <span>darkling beetles</span> to extract it and attract predators such as the neighboring <span>Namib web-footed gecko</span> and a hungry <span>Namaqua chameleon</span>.</p>The <i>Planet Earth II Diaries</i> reviews the teams' two weeks encounter with migratory locusts in Madagascar which were easy to find but elusive for filming. With the <span>UN</span>'s <span>Food and Agriculture Organization</span>'s and localist aid, the team manage to film both the swarms of nymphs and the winged adults.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Grasslands\"</td><td style=\"text-align:center\">Chadden Hunter</td><td style=\"text-align:center\">4 December 2016</td><td style=\"text-align:center\">11.54</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\"><p>The penultimate episode focuses on grasslands that cover one-quarter of Earth's land. At the <span>Terai–Duar savanna and grasslands</span> in <span>India</span>, the tallest grassland in the world, herds of <span>Indian elephants</span> plow through tall grasses providing an open area for other large animals to roam during seasonal change. During spring, herds of endangered <span>saiga antelope</span> migrate across <span>Eurasian Steppe</span> in search of fresh grass while two newly born twins are left hidden in the grass waiting for their mother's nourishment. During the rainy season, thunderstorms occur rapidly in grassland which became more sporadic for forests to thrive allowing the grasses to grow annually for rainfall. In <span>Botswana</span>, the flooded rainwater from the storm transforms the grassland into the lush <span>Okavango Delta</span>. Within the delta, A pride of lions, however, find it more challenging to run down their prey in flooded areas of the delta as they attempt to hunt an <span>African buffalo</span>. A female <span>Eurasian harvest mouse</span> leaves her nest as she treks across the meadows foraging for food until she escapes a <span>barn owl</span>'s grasp before she returns home safely to her offsprings. In the African <span class=\"mw-redirect\">savannah</span>, <span>southern carmine bee-eaters</span> struggle to catch insects hidden within grass while a <span>kori bustard</span> and <span>ostriches</span> provide lack of support. While flying in front of a bull <span>African bush elephant</span>, the bee-eaters gain a perfect opportunity to grab their prizes before the dry season begins. During the dry season, the grasslands begin to wither providing less food for the herbivores, while specialised predators find another opportunity. A <span>serval</span> uses her large ears to detect prey like <span>Southern African vlei rats</span>. In the <span>Serengeti</span>, herds consisting of millions of <span>blue wildebeest</span> migrate across the savanna in pursuit of rain along with <span>Jackson's widowbirds</span>, not only to seek food but to mate. A male widowbird tears off grasses to create an even surface and a centerpiece stage to attract females while facing competition with rivals. <span>Leafcutter ant</span> colonies in South America continuously harvest vast amounts of grasses to furnish their horticulture with fungi providing enough nutrients to feed for the entire colony. In northern <span>Australia</span>, colonies of <span>compass termites</span> build multiple giant mounds that serve as a compass facing the north-south axis, which also protects them from mass flooding and extreme heat. On the plains of <span>South America</span>, a <span>giant anteater</span> digs up a termite mound and consumes 2000 of them a day. As fire ravages the grassland, the grass stems survive underground and continue to recover before raining season. In the <span>prairies</span> of North America during winter, <span>American bison</span> wrestle with starvation and endure frigid conditions as they shovel thick snow for buried grasses while a <span>red fox</span> finds a <span>vole</span> hidden within the snow. In the <span>Arctic</span> <span>tundra</span> during spring, 500 miles from the prairies, female <span>caribous</span> migrate to the north to give birth as the calves learn to sprint and gallop while joining their mothers for their ongoing migration. Unaware the danger the herds are heading to, a pack of <span>Arctic wolves</span> ambush them and one of the wolves manages to separate a calf but the calf uses its stamina to outrun the wolf before rejoining the herd. As the caribous travel onward to find their feeding ground, the narrator speculates that the grassland provides a great gathering of wildlife on Earth.</p>The <i>Planet Earth II Diaries</i> reveal the teams' exploration in <span class=\"mw-redirect\">Kaziranga</span> of <span>North India</span>, using hidden camera traps to avoid their encounter with Indian elephants, <span>water buffalos</span>, <span>Bengal tigers</span> and <span>Indian rhinoceros</span> while filming them.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Cities\"</td><td style=\"text-align:center\">Fredi Devas</td><td style=\"text-align:center\">11 December 2016</td><td style=\"text-align:center\">11.10</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\"><p>The last episode focuses on the urban environment as animals struggle to contend with their coexistence with humans. In <span>Jodhpur</span>, a bachelor gang of <span>gray langurs</span> jump across the rooftops to compete with an alpha male as he successfully expels them from his territory. Aftermath, they settle on the sacred temple garden which serves as a feeding ground for them and peaceful coexistence with <span>Hindus</span> resulting in increased breeding. <span>Peregrine falcons</span> settle on the highest perches in <span>New York City</span> as they soar across the street to hunt down <span class=\"mw-redirect\">pigeons</span>. At night, an <span>Indian leopard</span> prowls across the streets of <span>Mumbai</span> as it stalks on feral urban <span>pigs</span>. During the hot summer of <span>Rome</span>, a flock of one million <span>common starlings</span> gather in the evening after feeding as they return to their roosting tree while performing aerobatic murmurations. While building a bower for glamour to impress a female, a male <span>great bowerbird</span> settles on the golf course of <span>Townsville</span> to collect man-made objects for support as it raids the rival's collection before being deceived. During springtime in <span>Toronto</span>, a family of urban <span>raccoons</span> settle in the chimney for warmth as they explore urban areas while searching for their new home, under their mother's supervision. A troop of <span>rhesus macaques</span> settles in the crowded marketplace of <span>Jaipur</span>, as they raid food from the market. At night, a clan of competitive <span>spotted hyenas</span> ventures into the walled city of <span>Harar</span> which they provide a traditional coexistence with the <span>Harari people</span> during their 400 years of feeding carcasses and leftovers. Pigeons gather at the river near <span>Albi</span> to preen their feathers before they were ambushed by a <span>wels catfish</span>, a species that was introduced in the area since the 1970s. As cities began to expand, they also provide electricity resulting in light pollution that affect wildlife activities. On the coastline of <span>Barbados</span> at night, endangered <span>hawksbill sea turtle</span> hatchlings used their instinct to follow the moonlight before reaching the sea while others wander aimlessly into the city streets because of the confusion of city lights. Unlike other cities that decimated wildlife, there are other urban areas that cope with nature's coexistence. In <span>Milan</span>, residents present a solution to support nature by building urban forestation like the <span>Bosco Verticale</span> that contains more than 900 trees. In <span>Singapore</span>, two million trees have been planted over 45 years in urban areas, including the Supertree Grove in <span>Gardens by the Bay</span>, which are home to several exotic ferns and vines among other plants. It is also a suitable settlement for wildlife, such as <span>smooth-coated otters</span>. The episode ends with <span>David Attenborough</span> standing at the top of <span>The Shard</span> in <span>London</span> discussing the future for all life on Earth.</p>The <i>Planet Earth II Diaries</i> shows the teams' work in Jaipur while filming rhesus macaques raiding marketplaces.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"\" style=\"text-align:center\">–</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A World of Wonder\"</td><td style=\"text-align:center\">Elizabeth White</td><td style=\"text-align:center\">1 January 2017</td><td style=\"text-align:center\">12.02</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\">A compilation of the wildlife series presented by <span>David Attenborough</span>.</td></tr></tbody></table><blockquote>\"Now, over half of us live in an urban environment. My home, too, is here, in the city of London. Looking down on this great metropolis, the ingenuity with which we continue to reshape the surface of our planet is very striking. But it's also sobering. It reminds me of just how easy it is for us to lose our connection with the natural world. Yet, it's on this connection that the future of both humanity and the natural world will depend. And surely, it is our responsibility to do everything within our power to create a planet that provides a home not just for us, but for all life on Earth.\"— David Attenborough, in closing</blockquote><br/><h3>Reception</h3><h4>Critical reception</h4><p>On the review aggregator website Rotten Tomatoes, 100% of 28 critics' reviews are positive, with an average rating of 9.7/10. The website's consensus reads: \"Planet Earth II offers a spectacular, moving, unprecedented account of the natural world.\"</p><p>The Independent's Christopher Hooton said of the series: \"It is undoubtedly the greatest TV nature documentary to date and there's a strong case for it being one of the best TV series full stop.\" Michael Hogan from The Telegraph compared this series to the original Planet Earth series and said that \"advances in technology have enabled intimate high-definition close-ups and gasp-inducing aerial shots\" and said \"It has become predictable to heap superlatives upon the BBC Natural History Unit and wax lyrical about Attenborough's status. But both institutions should be treasured while we're lucky enough to still have them.\" Gerard O'Donovan gave the series 5 out of 5 stars in The Telegraph, calling it \"one of the most stunningly vivid and engaging natural history films I've ever seen\".</p><p>In The New York Times, Neil Glenzinger said \"nature photography has rarely been as spectacular as it is in Planet Earth II.\" The Hollywood Reporter's Tim Goodman called the series a \"truly sublime accomplishment, an epic achievement that everyone should watch.\"</p><p>Several outlets particularly highlighted the racer snake and marine iguana sequence from \"Islands\" as a memorable highlight of the series.</p><p>However, The Guardian's Martin Hughes-Games, while calling the series \"spectacular and fascinating\", accused programmes such as this of breeding complacency about the destruction of wildlife by painting a misleading picture of the planet. He wrote that series such as Planet Earth had \"become a disaster for the world's wildlife\" and that while world animal populations are decreasing, \"the producers continue to go to the fast shrinking parks and reserves to make their films – creating a beautiful, beguiling fantasy world\".</p><p>As of 2023, the series is the highest rated television series of all time on IMDb's list of Top Rated TV Shows. The Guardian listed the series as the best television show of 2016 and in 2019 ranked it along with the first Planet Earth series 72nd on a list of the 100 best TV shows of the 21st century.</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Nominee</th><th>Result</th><th class=\"unsortable\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><td rowspan=\"26\">2017</td><td rowspan=\"2\"><span>British Academy Television Awards</span></td><td><span>Huw Wheldon Award for Specialist Factual</span></td><td><i>Planet Earth II</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td>Virgin's Must-See Moments</td><td>Snakes vs. Iguanas chase</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"9\"><span>British Academy Television Craft Awards</span></td><td rowspan=\"4\"><span>Best Photography: Factual</span></td><td>John Aitchison, <span>Rob Whitworth</span>, Mark MacEwen (Episode: \"Cities\")</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"9\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td>John Shier, Jonathan Jones, Barrie Britton (Episode: \"Deserts\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>John Shier, Mateo Willis, Barrie Britton (Episode: \"Mountains\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Tom Crowley, Mark MacEwen, John Brown (Episode: \"Jungles\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Best Editing: Factual</span></td><td>Dave Pearce (Episode: \"Deserts\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Matt Meech (Episode: \"Islands\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Best Sound: Factual</span></td><td>Graham Wild, Kate Hopkins, Tim Owens (Episode: \"Cities\")</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Kate Hopkins, Graham Wild (Episode: \"Jungles\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Television Music</span></td><td><span>Hans Zimmer</span>, Jacob Shea, Jasha Klebe</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>TCA Awards</span></td><td><span>Outstanding Achievement in News and Information</span></td><td rowspan=\"2\"><i>Planet Earth II</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"11\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td rowspan=\"10\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Documentary or Nonfiction Series</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Outstanding Cinematography for Nonfiction Programming</span></td><td>Cinematography team (Episode: \"Cities\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Cinematography team (Episode: \"Islands\")</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Outstanding Directing for Nonfiction Programming</span></td><td>Fredi Devas (Episode: \"Cities\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Elizabeth White (Episode: \"Islands\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Music Composition for a Series (Original Dramatic Score)</span></td><td>Jacob Shea and Jasha Klebe (Episode: \"Islands\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Outstanding Picture Editing for a Nonfiction Program</span></td><td>Dave Pearce (Episode: \"Cities\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Matt Meech (Episode: \"Islands\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Sound Editing for Nonfiction Programming (Single or Multi-Camera)</span></td><td>Kate Hopkins, Tim Owens (Episode: \"Cities\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Sound Mixing for a Nonfiction Program (Single or Multi-Camera)</span></td><td>Graham Wild (Episode: \"Cities\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span>Royal Television Society Craft &amp; Design Awards</span></td><td>Editing - Documentary / Factual</td><td rowspan=\"4\">Production Team</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\"></td></tr><tr><td>Photography - Documentary / Factual &amp; Non Drama</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Sound - Entertainment and Non-Drama</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Judges' Award</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>2018</td><td><span>Royal Television Society Awards</span></td><td>Science &amp; Natural History</td><td><i>Planet Earth II</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr></tbody></table><br/><h3>Merchandise</h3><h4>DVD and Blu-ray</h4><p>In the UK, the series was released as a two-disc DVD or Blu-ray set on 5 December 2016, while a four-disc 4K UHD Blu-ray + Blu-ray set was released later on 13 March 2017. These releases were distributed by BBC Worldwide.</p><p>In the US and Canada, the DVD, Blu-ray, and 4K UHD Blu-ray sets were released on 28 March 2017 and distributed by BBC Worldwide Americas. Each of the six episodes includes the 10-minute segment of the making-of documentary Planet Earth II: Diaries that had followed the original broadcast of each episode.</p><p>In Australia and New Zealand, the DVD, Blu-ray, and 4K UHD Blu-ray sets were released by ABC DVD/Village Roadshow on 29 March 2017.</p><h4>Books</h4><p>An accompanying hardback book was written by Steven Moss with a foreword by David Attenborough and published by BBC Books (ISBN 978-1849909655). It was released on 6 October 2016 in the UK, and on 15 February 2017 for the US release.</p><br/><h3>Soundtrack</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Planet Earth II</th></tr><tr><td colspan=\"2\" class=\"infobox-image\"></td></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\"><span>Hans Zimmer</span>, Jasha Klebe, Jacob Shea</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">11 November 2016 (Digital)<br>2 December 2016 (Audio CD)</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Soundtrack</span>, <span>Classical music</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"h\">2</span>:<span class=\"min\">13</span>:<span class=\"s\">09</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\">Silva Screen Records</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\"><span>BBC Worldwide</span><br><span>BBC Earth</span></td></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Hans Zimmer</span>, Jasha Klebe, Jacob Shea chronology</th></tr><tr><td colspan=\"2\" class=\"infobox-full-data\"><table style=\"background: transparent; width: 100%; min-width: 100%; border-collapse: collapse; display: inline-table;\"><tbody><tr style=\"line-height: 1.4em;\"><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em .2em 0\"><i><span>Planet Earth</span></i><br>(2006)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em\"><i><b>Planet Earth II</b></i><br>(2016)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em 0 .2em .1em\"></td></tr></tbody></table></td></tr></tbody></table><p>The soundtrack was released with a compilation of the incidental music specially commissioned for Planet Earth II. The main theme was composed by Hans Zimmer, with the original music for each episode composed by Jacob Shea and Jasha Klebe for Bleeding Fingers Music. A digital soundtrack was released worldwide on 11 November 2016, while a two-disc soundtrack became available on 2 December 2016 in the UK.</p><h4>Track listing</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th style=\"width:12em; text-align:left\">DISC 1</th><th></th></tr><tr><td colspan=\"2\" style=\"width:95%\"><style data-mw-deduplicate=\"TemplateStyles:r1091054432\">.mw-parser-output .tracklist{border-spacing:0}.mw-parser-output .tracklist tr{background-color:#fff}.mw-parser-output .tracklist tr:nth-child(2n-1){background-color:#f7f7f7}.mw-parser-output .tracklist caption{text-align:left;font-weight:bold}.mw-parser-output .tracklist td,.mw-parser-output .tracklist th{vertical-align:top}.mw-parser-output .tracklist th{text-align:left;background-color:#eee}.mw-parser-output .tracklist th.tracklist-length-header,.mw-parser-output .tracklist th.tracklist-number-header,.mw-parser-output .tracklist th,.mw-parser-output .tracklist-length,.mw-parser-output .tracklist-total-length td{padding-right:10px;text-align:right}.mw-parser-output .tracklist th{font-weight:normal}.mw-parser-output .tracklist-number-header{width:2em;padding-left:10px}.mw-parser-output .tracklist-length-header{width:4em}.mw-parser-output .tracklist tr.tracklist-total-length{background-color:transparent}.mw-parser-output .tracklist .tracklist-total-length th{padding:0;font-weight:bold}.mw-parser-output .tracklist-total-length th>span{float:right;padding:0 10px;background-color:#eee}.mw-parser-output .tracklist-total-length td{background-color:#eee;font-weight:bold;padding:0 10px 0 0}</style><div class=\"track-listing\"><table class=\"tracklist\"><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:60%\">Title</th><th scope=\"col\" style=\"width:40%\">Episode Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Planet Earth II Suite\"</td><td> </td><td class=\"tracklist-length\">4:31</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"The Sloth\"</td><td>\"Islands\"</td><td class=\"tracklist-length\">3:40</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Home to Dragons\"</td><td>\"Islands\"</td><td class=\"tracklist-length\">5:00</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Albatross Dance\"</td><td>\"Islands\"</td><td class=\"tracklist-length\">4:00</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Racer Snakes vs. Iguanas\"</td><td>\"Islands\"</td><td class=\"tracklist-length\">4:59</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Chinstrap Penguins\"</td><td>\"Islands\"</td><td class=\"tracklist-length\">3:20</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Singing Indri\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">2:41</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Competing Hummingbirds\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">3:11</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Life in the Canopy\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">2:41</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Jungle Weather\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">1:40</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Night Crawlers\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">1:59</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"World of Bioluminescence\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">2:50</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Wilson's Bird-of-Paradise\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">3:28</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Something Worth Protecting\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">2:16</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Life Without Water\"</td><td>\"Deserts\"</td><td class=\"tracklist-length\">2:39</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Monsoon Deserts – Canyonlands\"</td><td>\"Deserts\"</td><td class=\"tracklist-length\">3:19</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"Lion vs. Giraffe\"</td><td>\"Deserts\"</td><td class=\"tracklist-length\">3:30</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"The Butcher Bird\"</td><td>\"Deserts\"</td><td class=\"tracklist-length\">1:07</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"Wild Horses\"</td><td>\"Deserts\"</td><td class=\"tracklist-length\">2:44</td></tr><tr><th id=\"track20\" scope=\"row\">20.</th><td>\"Desert Nightlife – Golden Mole\"</td><td>\"Deserts\"</td><td class=\"tracklist-length\">3:39</td></tr><tr><th id=\"track21\" scope=\"row\">21.</th><td>\"Long-Eared Bat vs. Scorpion\"</td><td>\"Deserts\"</td><td class=\"tracklist-length\">3:12</td></tr><tr><th id=\"track22\" scope=\"row\">22.</th><td>\"Early Morning Fog\"</td><td>\"Deserts\"</td><td class=\"tracklist-length\">2:53</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"3\" scope=\"row\"><span>Total length:</span></th><td>69:19</td></tr></tbody></table></div></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th style=\"width:12em; text-align:left\">DISC 2</th><th></th></tr><tr><td colspan=\"2\" style=\"width:95%\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1091054432\"><div class=\"track-listing\"><table class=\"tracklist\"><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:60%\">Title</th><th scope=\"col\" style=\"width:40%\">Episode Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Roof of the World\"</td><td>\"Mountains\"</td><td class=\"tracklist-length\">0:52</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Peaks of North America\"</td><td>\"Mountains\"</td><td class=\"tracklist-length\">1:59</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"The Ibex\"</td><td>\"Mountains\"</td><td class=\"tracklist-length\">1:40</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"The Himalayas\"</td><td>\"Mountains\"</td><td class=\"tracklist-length\">2:16</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Flight Over Alps\"</td><td>\"Mountains\"</td><td class=\"tracklist-length\">2:17</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Ice Skating Flamingos\"</td><td>\"Mountains\"</td><td class=\"tracklist-length\">1:18</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Dancing Bears\"</td><td>\"Mountains\"</td><td class=\"tracklist-length\">1:38</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Tenacious Bobcat\"</td><td>\"Mountains\"</td><td class=\"tracklist-length\">1:54</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Garden of Ice\"</td><td>\"Mountains\"</td><td class=\"tracklist-length\">2:04</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Snow Leopards\"</td><td>\"Mountains\"</td><td class=\"tracklist-length\">5:14</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Savage Beauty\"</td><td>\"Mountains\"</td><td class=\"tracklist-length\">1:43</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Normadic Life\"</td><td>\"Grasslands\"</td><td class=\"tracklist-length\">1:57</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Hunting Buffalo Herds\"</td><td>\"Grasslands\"</td><td class=\"tracklist-length\">4:16</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"The Okavango\"</td><td>\"Grasslands\"</td><td class=\"tracklist-length\">1:39</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Carmine Bee Eaters\"</td><td>\"Grasslands\"</td><td class=\"tracklist-length\">2:40</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Industrious Insects\"</td><td>\"Grasslands\"</td><td class=\"tracklist-length\">3:38</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"The Great Migration\"</td><td>\"Grasslands\"</td><td class=\"tracklist-length\">5:45</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"The Unnatural Habitat\"</td><td>\"Cities\"</td><td class=\"tracklist-length\">1:16</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"Langurs of Jodhpur\"</td><td>\"Cities\"</td><td class=\"tracklist-length\">2:35</td></tr><tr><th id=\"track20\" scope=\"row\">20.</th><td>\"Temple Gardens\"</td><td>\"Cities\"</td><td class=\"tracklist-length\">2:10</td></tr><tr><th id=\"track21\" scope=\"row\">21.</th><td>\"Market Thieves\"</td><td>\"Cities\"</td><td class=\"tracklist-length\">3:10</td></tr><tr><th id=\"track22\" scope=\"row\">22.</th><td>\"Illuminated\"</td><td>\"Cities\"</td><td class=\"tracklist-length\">1:31</td></tr><tr><th id=\"track23\" scope=\"row\">23.</th><td>\"City Skylines\"</td><td>\"Cities\"</td><td class=\"tracklist-length\">1:27</td></tr><tr><th id=\"track24\" scope=\"row\">24.</th><td>\"Starlings\"</td><td>\"Cities\"</td><td class=\"tracklist-length\">1:52</td></tr><tr><th id=\"track25\" scope=\"row\">25.</th><td>\"Toronto Raccoons\"</td><td>\"Cities\"</td><td class=\"tracklist-length\">2:52</td></tr><tr><th id=\"track26\" scope=\"row\">26.</th><td>\"We are the Designers\"</td><td>\"Cities\"</td><td class=\"tracklist-length\">2:48</td></tr><tr><th id=\"track27\" scope=\"row\">27.</th><td>\"Epilogue\"</td><td>\"Cities\"</td><td class=\"tracklist-length\">1:19</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"3\" scope=\"row\"><span>Total length:</span></th><td>63:50</td></tr></tbody></table></div></td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}