{
  "imDbId": "tt3718778",
  "title": "Over the Garden Wall",
  "fullTitle": "Over the Garden Wall (TV Series 2014–2014)",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw3318141",
      "warningSpoilers": false,
      "date": "16 September 2015",
      "rate": "10",
      "helpful": "62 out of 69 found this helpful.",
      "title": "an awesome work of imagination for kids and adults",
      "content": "As I was watching Over the Garden Wall with some friends, I found myself commenting, more than once, how charming this would be/is for kids. It's got anthropomorphic creations (birds and horses and other things that talk, pumpkin-headed farmers, frogs in a band on a river-bank, magical and funny and weird dreams, or a dream, from a child), and yet it has a sophistication to the writing that kids appreciate; one might think that they will only take in the lowest-common denominator - put on whatever, it's fine, it's for kids - but this is smart stuff. This is also really great for adults, the ones at least who can tap a little into their childhood sense of awe, because of the humor and irreverence. Over the Garden Wall is like taking Adventure Time, transferring the other-worldly into early 20th century Americana, folk tales, even some Alice in Wonderland (the structure for me is very Wonderland, especially with a young character getting lost and on a series of episodes), and adding some songs as well that are reflective of the period.The story follows Wirt and Gregory (Elijah Wood and the young Collin Dean, who has been on Adventure Time a couple of times), brothers who seem to be lost in the woods and are trying to find their way home. Their main adversary appears to be 'The Beast', who is being stalked by the Woodsman (Christopher Lloyd in a wonderful part - you can't always tell if he's good or bad or both). As one can imagine, or hope for, a lot of wild and crazy things happen to these young people, such as the pumpkin farmers (what are they digging for in the farm?), the frogs on the boat (and suddenly there may be some singing from Gregory's frog, who's name always changes), and John Cleese as both the possibly deranged landowner of a spooky mansion and an old woman. Even Tim Curry gets a good character as 'Auntie Whispers', who is 'protecting' her niece, a possessed girl.The creators of 'Garden Wall' suffuse many scenes with some nightmarish moments, but it's all with a light, absurd touch, and a lot of this is helped immensely by Collin Dean's performance and the writing for the character of Gregory. This is a little kid who has zero filter; he'll say the truth of something no matter what, even if it's a moment (especially if it is) when the smart thing would be to lie or shut up. That's where so much humor comes in - also watch and listen how he sings ever so cheerfully at times - since in many scenes Wert is trying to get by on a fib or a lie or a trick, or doesn't have that sense of boundless optimism. It's one of the most charming acting voices for an animated character in as long as I can remember, and accentuated by the gigantic pupils - made to make him look cute as a button - and head-gear (he's an elephant, after all!) There's a real sense of play and, equally, danger (the final episode with the Beast, Auntie Curry), and I found myself laughing a lot, but I also found I took this story a little more seriously than I would an Adventure Time or something else with Patrick McHale's name on it. It takes from some folk tales and fairy tales, but it has an identity all its own. It's creepy and weird and adorable and heartfelt, and it carries both the awe and innocence of being a little kid and the disillusionment of being a teenager like Wert. And did I mention the songs are a lot of fun and contribute to the atmosphere? It's like taking in old ragtime songs (some of the time) and giving them an animated, pop-up book feel. It's tremendous, semi-subversive stuff for kids, and a joy for adults."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw5141264",
      "warningSpoilers": true,
      "date": "24 September 2019",
      "rate": "10",
      "helpful": "28 out of 30 found this helpful.",
      "title": "There's really nothing like it.",
      "content": "\"Over the Garden Wall\" is a highly unusual mini-series which was shown on Cartoon Network a few years ago. This story is a highly metaphorical tale about two brothers trapped in an alternate reality....and many of the things that occur throughout the show allude to death and the afterlife. The series was unusual for many reasons, actually. First, Cartoon Network didn't normally show mini-series...and in this case they showed two episodes a night for five days. Second, the show is NOT for young kids, as there is a lot of creepy imagery and subject matter....so it's best for kids 10 and older but more for teens and adults. Third, the quality of the production was amazing....with lovely music and backgrounds.Overall, a mini-series with tremendous production values and a neat story with highly engaging characters....well worth seeing provided you are NOT a young child."
    },
    {
      "username": "ikrani",
      "userUrl": "https://www.imdb.com/user/ur47173999",
      "reviewLink": "https://www.imdb.com/review/rw3118696",
      "warningSpoilers": false,
      "date": "6 November 2014",
      "rate": "10",
      "helpful": "100 out of 116 found this helpful.",
      "title": "Cartoon Network's Triumphant Return",
      "content": "In May 2014, Stuart Snyder, the man responsible for single-handedly destroying Toonami, bringing in live-action schlock to CARTOON Network, establishing the \"NO GIRLS ALLOWED\"* policy for cartoons, declaring that boys only like comedy (as a member of that demographic, I can assure you that such a statement is completely asinine), and ultimately killing every good show the network made resigned as the President of the Network. And oh what glorious day it was.If Cartoon Network made this series as an apology for the sins of Snyder, then it succeeded. This series is dark, atmospheric, weird and pretty scary at times. It's not bright, it's not dumbed-down, it doesn't hold back on the creep factor, especially for Tim Curry's character, Auntie Whispers, and it takes its audience seriously. And even though the cast has a lot of celebrity actors (aside from Tim Curry, they also got Christopher Lloyd and cast Elijah Wood as one of the two main leads), they got them because they knew these guys were perfect for the roles. The story is revealed a snippet at a time and from what little I've gathered from the two episodes it strikes me as being just as dark as the setting and atmosphere.Oh, and just to put icing on the cake, they stuck the old Cartoon Network Studios animated logo on to the end of it like they used to for shows like Samurai Jack and Power Puff Girls, followed by the classic Cartoon Network logo with the Cartoon Cartoons theme dubbed over it.They're back, and this is only the beginning of what I hope is another era akin to that of the late-90s/early-2000s.*IMDb does not allow me to spell the word \"GIRLS\" with a backwards \"R\". Please pretend that it did."
    },
    {
      "username": "FairlyAnonymous",
      "userUrl": "https://www.imdb.com/user/ur25126113",
      "reviewLink": "https://www.imdb.com/review/rw3155692",
      "warningSpoilers": true,
      "date": "4 January 2015",
      "rate": "10",
      "helpful": "37 out of 44 found this helpful.",
      "title": "A Perfect show that knew exactly how long it needed to be",
      "content": "Over the Garden Wall is really something special. Not only is it good on its own merit, but it also breaks some of the barriers of animation. Over the Garden Wall proves that not everything animated needs to be either a TV show or a movie... animation can tell a simpler story without having to stay longer than necessary. Yet, it doesn't need to be a \"movie\" in terms of structure. That is what makes Over the Garden Wall so interesting... in total length, it is only 100 minutes... a movie length... but it feels like it is much longer than that (in a good way) because it is structured into 10 minute chapters. This gives the miniseries a very unique feel for animation.The atmosphere in this show is spot-on. The music fits its melancholy Americana fairy-tale setting, the colors and drawings fits with the bitter autumn tone, and the dialogue is never forced or drawing more attention than it needs to. That is another aspect I like about this series: It never really draws attention to itself. Nothing in it is really big or massive and the jokes are never really forced. Almost everything in it is subtle and quiet. Even when strange things happen, they aren't quite as upfront about it such as in other Cartoon Network shows like Adventure Time (which is still a great show).The plot to the show is also a fairly strong point. At first, nothing seems incredibly attached, but once the show reaches its last two episodes, everything starts to make sense. Fortunately, this show has a lot of strong characters. All of them are voiced excellently except for Fred the Horse. Fred the Horse wasn't a bad character, but his voice... stuck out a little too much. He seemed like a character that was intentionally trying to be a cartoon; though thankfully he only talks in oneish episode.The main characters: Wirt, Greg, and Beatrice are all likable. Wirt has an incredibly low self-esteem and is into a lot of unique interests but is also pessimistic and blames Greg for everything. Greg is his little step-brother who is always several steps behind everyone, but is still very useful in his optimism and resourcefulness. What is really nice about this series is that Wirt is not shown as \"the brains\" or the guy who has it all together. He truly is lost and he really is pathetic. The other nice thing is that Greg isn't always childishly dumb. Sometimes he really does have his act together. Both characters are strong. Beatrice is nice because she may not be pessimistic, but she doesn't care about fun or getting distracted. She simply wants to be finished with the issues at hand.Without giving anything away, the show is unique in its ability to constantly surprise. I always think that I know where the show is going, but it always takes a clever twist. To make things better, all of the plot-twists (except for maybe one) all make sense upon watching the series a second time. If anything, the series IS BETTER the second time through because it is scattered with little hints and secrets that fit together.All in all, a very good series that needs some recognition. I'm surprised how little attention this show has even though when it was first released everyone was talking about it. It is clever, smart, mellow, and beautifully crafted.I hope to see more mini-series from Cartoon Network like this. And that's a rock fact."
    },
    {
      "username": "ilapierre",
      "userUrl": "https://www.imdb.com/user/ur37759912",
      "reviewLink": "https://www.imdb.com/review/rw3119857",
      "warningSpoilers": false,
      "date": "8 November 2014",
      "rate": "10",
      "helpful": "209 out of 225 found this helpful.",
      "title": "Easiest 10 I've Given in a Long Time...",
      "content": "Oh my goodness, oh my goodness, this show, this sweet little mini series, this golden show! I am always looking for good cartoons, in a weird way the shorter the better (short and sweet right). However, most short cartoons were canceled (for example: Clone High or Mission Hill). This is not the case for OTGW, which plays like a movie, 10 episodes multiplied by each episode's 11 minute run time is only 110 minutes (or an hour 50 minutes). Yet what I imagined would simply be some odd Adventure Time show about two brothers in the woods turned out to be so much more. The animation is sweet, dark and fluid. The backgrounds are very well done, especially because they are of nature. This really helps keep a deep and real feeling throughout the show, as these two simple cartoons are traveling through a dark and dementedly palpable world. Speaking of the world may I mention that it has two great things going for it (and these two things blend well together). One: it takes aspects form the 1700's, 1800's and early 1900's and Two: this fantasy world is American. I'm not some horn tooting nephew of Uncle Sam, but I am proud to see any show or animation really take advantage of 350 odd some years of \"American\" (Europeans in America) history, music, culture and atmosphere. This can add to the creep factor, but also grows on you. This show feels like it was made by an American Hayao Miyazaki; in the same way HM uses his Japanese culture to heighten the world. The magic and old time world in this show and Hayao's worlds are so familiar in a completely different way. Plus the two have old women with giant heads, spirits, magic, nature, human like frogs, adventure, strong females, and young protagonists in a fairytale environment. The world actually feels like the \"Frog and Toad\" books I read as a child. Don't let me forget that this show is also a musical in a sense. As many cartoons do now (I'm looking at you Adventure Time) the characters sing in every episode, accompanied by fantastic music (that matches the various American eras), and I quite enjoy the opening song as well. The voice acting is superb with Elijah Wood, an actual child (which I appreciate in animation) by the name of Collin Dean, and Melanie Lynesky taking center stage. Yet Christopher Lloyd and many others provide there talents too. The characters themselves are very real and multidimensional. Wirt is one of the best heroes in a long time, with a fantastic arc and a very unsure demeanor, Greg (his brother) is an adorable, optimistic and surprisingly bright boy who lives in his own cute little world, but not so cute that he doesn't also live in the real world, and Beatrice is a sassy, brave and loyal friend. I also like the clean character designs, I mean they're simple but also fluid, fresh and different. I don't want to spoil any part of the story, but I will say all your questions are answered and everything wraps up beautifully. The episodes are unique but they are all touched upon again, connect, and add to this singular plot. Sometimes you will start somewhere unexpectedly new (or rather without precise context) and this can be disconcerting, yet it does make sense. And more importantly the episode will start somewhere and stay somewhere, 11 minutes never flew by so quickly on a river ferry or a grammar school (the music also contributes to the speed of the episodes). Nod of course to writers: Tom Herpich, Amalia Levari, and Patrick McHale. Also the director Nate Cash (this show also has great directing) Over the Garden Wall is so great, and I'm writing this right after finishing the show, that's how great it is. It is dark and bizarre at times (not too dark for most children), but it is also a true adventure with lots of light and hope inside bleakness. And it is the perfect blend of real and surreal that fantasy deserves, there's plenty wacko s@#$ but the story and motives aren't wacko. By episode 2 I was definitely hooked, and by episode 6 I was pretty sure it was going to get my 10/10. I had some doubts with episode 8, yet I was won over during the episode and of course with the show's end. An end that perfectly wraps up everything in a neat bow. Episode 9's \"surprise\" is also so exciting and sets up the tenth to be a sort of finale, but again this is really just a movie, and its so short that there is no fear that one wouldn't finish it and consequently love it.And that's its beauty and why it is a ten starred masterpiece. Kids movies are very rarely so, long, weird, and have such a unique flow (and all the other great stuff from earlier), children's shows will have extra stories and characters than they often need (and again not have all that stuff from earlier). This is like the \"True Detective\" of children's animated television shows. And the world, oh my gosh the world, I know I already talked about this but whatever. I've just never seen anything like this, and when you wrap all these great elements together you get a perfect show. I recommend everyone see this show and I will be going back over the Garden Wall very soon, to enjoy it even more...p.s I forgot to mention it's funny too"
    },
    {
      "username": "indusolara",
      "userUrl": "https://www.imdb.com/user/ur88310520",
      "reviewLink": "https://www.imdb.com/review/rw4908624",
      "warningSpoilers": false,
      "date": "3 June 2019",
      "rate": "10",
      "helpful": "45 out of 46 found this helpful.",
      "title": "Beautiful and Dark",
      "content": "From the first second the dark and enchanting atmosphere pulls you right in. Greg's fearlessness and Wirt's worries, their love for each other creates a wonderful dynamic. Maybe it's not everyone's cup of tea, but I'd advise you to give it a try. Ten 10-12 minutes episodes, it takes about 2 hours to finish the whole series. Watching it like a film is reccomended."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3256594",
      "warningSpoilers": false,
      "date": "12 June 2015",
      "rate": "10",
      "helpful": "35 out of 45 found this helpful.",
      "title": "A Cartoon Network gem, one of their best in a long time",
      "content": "Cartoon Network were responsible for some really fantastic childhood-favourite(that still hold up) shows like Dexter's Laboratory, Courage the Cowardly Dog and The Powerpuff Girls, but have over the years gone downhill. Not completely because the first three Ben 10 shows, Regular Show and Adventure Time are good, Young Justice is great and Amazing World of Gumball has a few weak spots and several good ones, but Johnny Test, Uncle Grandpa and Ben 10: Omniverse are three of the Network's worst and sadly are two of the shows that are on often on daytime TV.And then here comes the 10-part mini-series Over the Garden Wall, and while it's not one of Cartoon Network's all-time greatest it is a gem of a show and one of their best in a long time. It's really beautifully animated, with the handsome and very smoothly detailed backgrounds coming off particularly strongly and the mystery of The Unknown setting is realised brilliantly. Think Adventure Time but with more detail, darkness, sweetness and colour. As well as being good-looking animation, what the animation also does so brilliantly is two things, one being that it sets the melancholic but sweet folksy atmosphere of the stories very effectively and maintains that quality consistently and the other being how well it transports one to another world completely and draws one into the world to utter transfixing effect.The series throughout is very charmingly and hauntingly scored, having a real presence while also allowing the atmosphere to speak, which it wouldn't have done as effectively if the scoring was louder, brasher and more constant, the stories was I feel going to benefit from having a more melancholic, lilting and sometimes sparse approach to the music, and the music in Over the Garden Wall is exactly that. The main theme is very memorable too. The very unique stories are paced perfectly; feeling swift but never rushed and gentle while never dragging, and are very imaginatively and compellingly told even when episodic in nature(and with a couple of random spots like the end of the third episode). While the series always did get off to a strong start, it kept getting stronger until by episode 4 the quality was better than anything that Cartoon Network has been airing in recent years and came close to rivalling the Network at its best. Like with the animation, the atmosphere is melancholic, quirky and folksy, these qualities coming over in a gentle and very touching way and never getting silly or confusing, the series also gets dark with characters like The Beast but in a creepy way rather than traumatising.Over the Garden Wall succeeds wonderfully in the writing department too. It's funny, suspenseful and remarkably poignant, but it's not just that these qualities are present; it's also how they're balanced and written that made the writing strong. The humour never felt juvenile or too much, in fact especially with Greg(who has at least 3 funny moments an episode) some of the writing is adorable and at its best hilarious, the numerous emotional moments which can be primarily found in the characterisation of Wirt don't make the mistake of dragging the stories down and really succeed in allowing one to relate to Wirt and his troubles and the suspense is nail-biting but should not unsettle younger viewers too much. All this without one of them over-powering the other, this easily could have had too much humour of the wrong kind jarring with the atmosphere or been too scary, but I didn't find that to be the case with Over the Garden Wall. The characters are very well written, looking like and having the personalities of folk fairy tale figures. The protagonists are very easy to relate to, especially Wirt and it is easy to be endeared by the resourcefulness and cute optimism of Greg. The Beast is a very memorable main villain with a suitably scary appearance, and Beatrice, Woodsman, Auntie Whispers, Adelaide, Endicott et al make good impressions within their stories.The voice work is excellent from all involved; there are some truly talented names here and they don't disappoint and have strong material to work from. Elijah Wood's Wirt is very deeply felt and Colin Dean's chirpy enthusiasm contrasts most endearingly. Melanie Lynksey brings plenty of sass to Beatrice, John Cleese and Christopher Lloyd voice with sympathy and demeanour, Tim Curry has been better(understandably as apparently this was post-stroke voice work) but is effectively grotesque, Deborah Voigt is sympathetically mysterious and Samuel Ramey is devilishly creepy as the Beast. The series ends on a perfect note, feeling complete.Overall, a Cartoon Network gem, and one of their best in a long time. 10/10 Bethany Cox"
    },
    {
      "username": "doomedmac",
      "userUrl": "https://www.imdb.com/user/ur111092901",
      "reviewLink": "https://www.imdb.com/review/rw5381701",
      "warningSpoilers": false,
      "date": "4 January 2020",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Best thing Cartoon Network ever made",
      "content": "This show is amazing. Everything about it is fantastic. The characters, story, script, villain, and atmosphere are all excellently executed. I love this show."
    },
    {
      "username": "Animany94",
      "userUrl": "https://www.imdb.com/user/ur78948186",
      "reviewLink": "https://www.imdb.com/review/rw4486029",
      "warningSpoilers": false,
      "date": "29 November 2018",
      "rate": "9",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Pretty great actually.",
      "content": "What can I say about this show? It has to be expirienced to grasp it, because of all these interesting characters which appear in the different episodes.The main characters Wirt and Greg make up this pair of brothers of which Wirt is an insecure but straight one and Greg is a goofball with high spirits. Even though both serve a purpose in the series I kind of hated Greg most of the time, because the goofball role came of not as comedic but just stupid like a no-brain moron most of the time, but he gets better over time.We encounter many interesting characters and scenarios through the episodes on their journey through the forest. Creepy stuff happens and they somehow solve it.An unsetteling feeling hangs over every episode and the gorgeous backgrounds are made with great attention to detail to suit every feeling we're supposed to feel and that is the core purpose of art! One of the highlights of this mini-series.Worth watching for everyone who enjoys well crafted animation and fairy-tales."
    },
    {
      "username": "customcraftedkicks",
      "userUrl": "https://www.imdb.com/user/ur56300085",
      "reviewLink": "https://www.imdb.com/review/rw3121227",
      "warningSpoilers": false,
      "date": "6 November 2014",
      "rate": "10",
      "helpful": "95 out of 103 found this helpful.",
      "title": "Beautifully crafted, very funny, eerie, amazing twists, cool characters",
      "content": "I recommend Over the Garden Wall to kids, teens, and adults, (maybe a little scary for tiny tots) looking for a super fun, aesthetically-pleasing fairy-tale-Halloween mystery. The unique characters are likable and break a lot of cookie-cutter-character clichés. The atmosphere is dark and eerie while humorous and exciting. Each episode contains its own cool twist, and the series overall contains several bigger twists. I don't wanna drop any spoilers but there's lots of super awesome twists. You will love it! It's wonderful! I want to watch it again right now. I also recommend watching all ten episodes in one sitting like a movie."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw3130953",
      "warningSpoilers": true,
      "date": "25 November 2014",
      "rate": "10",
      "helpful": "26 out of 39 found this helpful.",
      "title": "Amazingly weird and unlike anything I've seen on the Cartoon Network.",
      "content": "I am not the target audience for this series. Because of that, I am not going to give the show a score--just talk about it and what other 'oldsters' like me might think of it.\"Over the Garden Wall\" is a cartoon movie that's been split into 10 segments. Because of this, you may just want to watch it all at once. The story is about a boy (probably about 12-13 years-old) named Wirt and his little brother, Gregory. The story is about their weird quest to find their way home from a strange and magical land--which is sort of like a dystopian version of Wonderland. It's all very dark and EXTREMELY confusing. In fact, what it's all about isn't even apparent until episodes 9 and 10! In the interim, you'll no doubt be very confused. I say it's best NOT to try to think about what you're watching--just watch and enjoy the occasional laughs.So is it worth seeing? Well, yes if you have a VERY high tolerance for the strange and confusing. If you demand that the show explain itself and be normal, then don't watch. The story, while convoluted and weird, is worth while by the end. The background animations are very nice and there are a few familiar voices such as Elijah Wood and Christopher Lloyd. The bottom line is that it is nice to see Cartoon Network trying something different--and it certainly is different."
    },
    {
      "username": "sharky_55",
      "userUrl": "https://www.imdb.com/user/ur33734362",
      "reviewLink": "https://www.imdb.com/review/rw3302951",
      "warningSpoilers": false,
      "date": "23 August 2015",
      "rate": "9",
      "helpful": "10 out of 13 found this helpful.",
      "title": "You will love this Cartoon Network miniseries, the ringing of the bell commands you",
      "content": "From the first wistful violin tune that gracefully unveils the episode title, Over the Garden Wall entranced me. Of course, the very first episode starts with that excellent intro sequence that begins bizarrely with a spinning piano on which a singing frog delivers the first half of the theme song, The Loveliest Lies of All. The second half isn't delivered until the very end of the series but both are filled with gorgeous little vignettes that have even more significance and nostalgic meaning the second time around. That frog's beautifully rich voice belongs to Jack Jones, renowned pop and jazz singer, who is just one of the voice actors that lend the cast of wonderfully bizarre and colourful characters that much more depth. The main two characters of OTGW are brothers Wirt and Greg, who are trying to find their way home but inadvertently get lost in the woods. Wirt, the elder brother, is voiced by Elijah Wood, who is wears a pointy red hat (shaped after his nose) and is a bundle of social anxiousness and nervousness, not overly so, but in a more endearing way. The second last episode in particular focuses on this aspect of him. The younger brother Greg is voiced by Collin Dean, who provides that childlike delight, wonder, imagination and naivety that only a real child voice actor can produce (looking at you Wreck It Ralph). He wears an upside down tea-kettle on his head, and is the source for much of the humour in OTGW, with his curiosity and innocence that clashes with Wirt's seriousness of their plight. His adorable sing-song voice (and later song) are instantly appealing. Together they set off into the unknown as they meet a whole variety of odd situations and characters. The animation style perfectly blends the mellow beauty and the more sinister eerie settings they encounter. At times the painted backgrounds remind you of Miyazkai films with their attention to detail and captivating beauty. The art direction is phenomenal. As time goes on, autumn becomes winter and the colour palette shits from that of earthly browns and oranges to a colder, darker atmosphere of blues and snowy whites. Although the characters are designed with a more cartoonish appearance, this never derails them from the serious and ominous scenes that showcase real danger for the brothers. There's an assortment of weird and wonderful fairytale fantasy characters that provide laughs but also contemplation and emotion. They feature some impressive voice actors that turn the peculiar, the creepy and the charming beyond a cartoon's expectations. Some familiar names include John Cleese, Tim Curry, Christopher Lloyd and Thomas Lennon, but don't be surprised if you don't immediately recognise them. Over the Garden Wall is dished out in 10 episodes, each about 10-11 minutes long. The brothers go from setting to setting and meet new characters along the way, but it never feels rushed or confusing. They even jump between time periods of old America with a melancholic and fitting soundtrack to match, but lend an eager hand to the audience. Without spoiling anything, often you'll expect the story to go one way but it will go in a completely different and unique direction, but always keeping within its tone. Bits and pieces of their journey may seem insignificant but are quite important later, and the emotional punch of the last episode is one that builds upon the previous stories to great effect. The very last shot is particularly poignant. If you have a spare 2 hours, give this miniseries a watch. Over the Garden Wall will draw you into its magical world."
    },
    {
      "username": "lawrencewright39",
      "userUrl": "https://www.imdb.com/user/ur58475686",
      "reviewLink": "https://www.imdb.com/review/rw3179459",
      "warningSpoilers": false,
      "date": "8 February 2015",
      "rate": "10",
      "helpful": "86 out of 96 found this helpful.",
      "title": "One if not the best cartoon i've ever watched",
      "content": "Over the Garden Wall is a masterpiece. Recently i have been binge watching cartoons to try and find one which i was instantly hooked on. So far i have enjoyed the excellent Cowboy Bebop and other shows such as Rick and Morty and the wonderful Gravity Falls but none yet have been up to the standard that i now have after watching Over the Garden Wall which masterfully tells the tale of two brothers in the land called 'The Unknown' as we see them try and keep up faith that they will ever return home.Firstly, the characters are truly amazing, Wirt (voiced by Elijah Wood) a sullen boy with low self esteem issues struggles with his overly excitable brother Greg who is always messing up and seeing himself in often worse situations than in the beginning. We also get to meet up with the mysterious cast of characters that this show brings such as Beatrice a bluebird trying to help her family also the mysterious and creepy antagonist the beast who is always seems to be playing at the strings of our heroes trying to make them lose all hope and faith of ever returning home. Each character brings something that we can all relate to and overly helps to form a truly compelling story.OMG the style of animation. It is fluid, dark and creepy and helps bring the eerie feeling of mystery that is present in every episode. The simplistic character design helps them 'pop' out against the highly detailed and aesthetically pleasing background done in a autumn forest style. Helping to portray the tones as our antagonists wandered through the dark and creepily palpable world. This is assisted by the music which in turn helps to create at some times a light atmosphere but also transforming the world into a eerie and mysterious place which makes you fear for Wirt and Gregory. Also if all of the music in this was put onto an album i would instantly buy it *hint hint Disney* because of how much i was enthralled by the show. One of the factors that attracted me to this was it knew when to end, other shows such as Adventure Time and the Amazing World of Gumball (although being brilliant) seemed to drag on a bit too much. Over the Garden Wall lasting 10 episodes still manages to develop the characters to an extent that i have not seen in other shows whilst still retaining humour and also atmosphere. Overall, would highly recommend this to anyone who is interested in a cartoon which can entrance you and make you hope for a journey back into The Unknown and in the future I hope for more masterpieces like what i found in Over the Garden Wall."
    },
    {
      "username": "jkushwar",
      "userUrl": "https://www.imdb.com/user/ur56388122",
      "reviewLink": "https://www.imdb.com/review/rw3120684",
      "warningSpoilers": false,
      "date": "9 November 2014",
      "rate": "10",
      "helpful": "74 out of 83 found this helpful.",
      "title": "A new golden age of TV animation ?",
      "content": "Over the Garden Wall is brilliant. Thank you Cartoon Network for allowing it to happen. Beautifully animated, wonderfully paced with just the right blend of humor and creepiness. Also - kudos to using the mini series format, I hope this is only a sign of things to come and more self contained short events are on the way. I'm tired of watching several seasons of a series that started strong end up wandering aimlessly with no clear endgame in sight. The voice cast was exceptional, and the resolution handled perfectly. A big thanks to the other reviewer that gave the Cartoon Network programming history perspective above, explains a lot. Now if only CN could find a way to apologize for and right the wrongs done to all of the terrific DC nation series that were unceremoniously canceled."
    },
    {
      "username": "effectator",
      "userUrl": "https://www.imdb.com/user/ur47335498",
      "reviewLink": "https://www.imdb.com/review/rw3155795",
      "warningSpoilers": false,
      "date": "4 January 2015",
      "rate": "10",
      "helpful": "76 out of 89 found this helpful.",
      "title": "I thought Gravity Falls would be unsurpassed. I was dead wrong.",
      "content": "This series, without a doubt, is a treasure of animation. Never once has a series or movie ever gotten me so interested. It isn't too long, it perfectly runs its course, unlike other fantastic shows like Adventure Time or Regular Show that can be hard to keep up with. Ten episodes, each about ten minutes, giving practically a feature- length movie that is certainly going to strike you as wonderful. Elijah Wood gives an amazing and realistic depiction of the average modern teen, and Greg provides the comical child-like wonder that we all could relate to our past as kids. Lessons in trust, family, friends, love, and honor perfectly blend with the simplistic yet entrancing artwork, and not since Gravity Falls has a cartoon ever amazed me with its genius concept and plot devices. The series is short and wonderful, and it needs more exploitation. And just as I was growing worried for animation on television like Clarence or Uncle Grandpa which leave little to be desired. If you like the creativity of Regular Show, the quirkiness of Adventure Time, and the art of Steven Universe, coupled with the humor of Amazing World of Gumball, this is without a doubt the best animated creation that has been put out in decades."
    },
    {
      "username": "samxxxul",
      "userUrl": "https://www.imdb.com/user/ur40889724",
      "reviewLink": "https://www.imdb.com/review/rw5736709",
      "warningSpoilers": false,
      "date": "14 May 2020",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "\"Just as good the 6th time as it is the first\"",
      "content": "I've always loved this miniseries and revisited it again during the quarantine, Just, the sight of this show makes me smile! This mini-series follows half-brothers Wirt and Greg as they try to find their way back home from the woods. This series is whimsical, musical, and story driven. This is my favourite art design of any cartoon ever. It got my attention when Elijah Wood was announced as a voice actor, I'm a huge fan of his films and love his choices, his contribution to the horror genre as an actor and also as a producer too in his SpectreVision. So, I remember the time I watched it and did not want the miniseries to end. It's amazing because of the animation, the storyline, the characters, emotional experience, it is just so damn beautiful in my opinion. Oh, have I mentioned the music? the soundtrack and the songs are just beautiful and amazing, every single one of them. The songs composed for the series also play a part in this paradigm shift. Since the first melancholic/americana opening theme to the songs that follow, it is impossible to resist the songs on the soundtrack. The dialog is witty and matured, a joy to listen to and all the characters are engaging to watch. The Beast, Wirt, Greg, the Frog, Beatrice, you will fall madly in love with your fellow travellers as you watch this now beloved series. Even the fantastic art of the world sucks you in and I dare you to resist singing along with the Greg.So, without spoiling it too much, the story is based on Dante's Inferno and is cute as hell while remaining grimly dark. It is about two hours total. Highly recommended this series which is an incredible achievement in animation and it's a must for the genre fans including Studio Ghibli audience. The characters, world, and story will easily steal your heart as you journey with Wirt and Greg into, \"The Unknown.\""
    },
    {
      "username": "JudgeChaos",
      "userUrl": "https://www.imdb.com/user/ur55843750",
      "reviewLink": "https://www.imdb.com/review/rw3347611",
      "warningSpoilers": false,
      "date": "2 November 2015",
      "rate": "9",
      "helpful": "10 out of 13 found this helpful.",
      "title": "How Did I Miss This?",
      "content": "Last year, I saw the commercials for \"Over the Garden Wall\", and I thought, \"Looks nice, maybe I'll check it out.\" One year later, Cartoon Network reran the show for Halloween, and after hearing so much praise for it, I recorded the entire series. And, holy cow, was it amazing! This is probably the darkest I've seen Cartoon Network get. The acting was spot on! Everyone does a fantastic job! I also like how they didn't use these big names as promotion for the show. They got Christopher Lloyd, John Cleese, and Tim Curry and I had no idea they were in this until after I did some research. The animation, spectacular! I think the best piece of animation in this is the Highwayman's song, so cool! I'm glad they didn't take the \"Teen Titians GO!\" approach and use Flash animation. If I did have one problem it'd have to be \"the liar revealed\" cliché. But that's just nit picking. Overall, if you want a new fall tradition, go buy this on DVD and watch it every Halloween or Thanksgiving."
    },
    {
      "username": "hellraiser7",
      "userUrl": "https://www.imdb.com/user/ur24931284",
      "reviewLink": "https://www.imdb.com/review/rw3318486",
      "warningSpoilers": false,
      "date": "16 September 2015",
      "rate": "10",
      "helpful": "7 out of 11 found this helpful.",
      "title": "Strange Garden",
      "content": "The fantasy genre has always been my favorite because one of the best things about it is in the world that it takes place. The fantasy world is always fascinating because there is just so much that is different and similar that contrasts to the modern day reality. It's a nice form of escapism because it's just always fun to want to see or find something different constantly as opposed to what we are use to every day.This mini series is one of my favorite TV shows of all time, it was just one of those surprises I've been looking for.The story I think is great, it's imaginative and original despite being nothing new in format it's similar to Lewis Caroll's \"Alice in Wonderland\" and \"Through the Looking Glass\". Like in those stories it's about an individual that gets lost in an disorienting fantasy world. But why this story stands out is in it's execution and the fact that it uses this kind of format shows the timeless quality of the fantasy genre. The animation I personally think is excellent, I like the character animation which fits them perfectly, however it's really the background animation that stands out the most which I think look just beautiful. From the woods where just mere panels could be another background painting for an art gallery. I really love the fantasy world created, it seems to be a mixture of decades from the 1700s, 1800s, to the early 1900. From certain housing structures, customs, clothing, music, just about everything you see along the way. It is so rich in depth, I always wished there could of been more episodes to explore this world more. The atmosphere is always wondrous, unpredictable, strange, and really creepy/eerie all at once which makes this all the more great. The show knows when to be fun but also knows when to be dark which I really love, there's no water down bull crap, this show really behaves and acts like a really fairy tale/fantasy story.I even like the music which I think is great, most of the music sounds like the kind you would play on a gramophone. The style of music they used is late 1800's and early 1900's music, it perfectly fits the world it takes place and the songs are memorable like \"Potatoes and Molases\" and my favorite which is one of my favorite theme songs of all \"The Lovelyest lies of all.\"The characters are excellent, from the main characters to some of the supporting characters they run into. I really love the dynamics going on from Wurt and Greg whom felt like real brothers and in a way you could say it's almost a Freudian dynamic in a way Wurt is the superego and Greg is the id. I also like the dynamic they have with Betrice, where she is both a guide and a foil at the same time.Wurt (Eliah Wood) is true to his name as his character as he is pretty much a worry wort throughout the journey. He's ill confidant, non assertive and practically has some low self esteem issues. This character really does have a fascinating character arc, because deep down he really does have strong confidence he just needs to climb a few step more to get there. As the journey goes on you do see him grow a little as we see him take charge more and do what he has to do because there's no one else that will except him.Greg he is really funny and fun. He is a highly imaginative kid just high in spirits you can never bring him down. What I love about him and it's something I can emphasize with is that he just loves to do whatever he feels like doing, he doesn't care what other people think of him if something makes him happy he acts on in, some would say this would make Greg ridiculous and mad well in the words of the Cheshere Cat from \"Alice in Wonderland\" \"I'm mad your mad, were all mad.\" However really does contribute and help out in whatever way he can and that's another thing I love about the character is he's selfless, he really does care and love his brother. In a way he's sort of the rock for Wurt and even Betrice as their spirits are somewhat low he reinforces their by keeping his up and lightening things up.Berice (Melanie Lynskey) she is really funny. Her character comes off a tad unlikeable at first as she is kinda guilty of anti social behavior she's kinda off putting, a bit self centered. But what I like about her is that the grumpier she gets in her desperation and lothing of being a bluebird she gets sweeter. We also see her also have a fascinating character arc, throughout the journey she learns to be more courteous, admits to her own faults and even begins to open up to Wurt a little and also does what she has to do.One thing that really interesting is throughout the show you begin to discover in a way this is really more Wurt's journey and it's really about him finding himself, which in a way is sort of the theme of this show. Each of the characters have lost something or have gotten lost somewhere along the line. It all about finding what is lost in your life or within yourself in order to live life with more fulfillment than before.This is a garden with plenty of strange beauty to get lost in.Rating: 4 stars"
    },
    {
      "username": "jfnshit",
      "userUrl": "https://www.imdb.com/user/ur117872032",
      "reviewLink": "https://www.imdb.com/review/rw6357939",
      "warningSpoilers": false,
      "date": "12 December 2020",
      "rate": "7",
      "helpful": "13 out of 17 found this helpful.",
      "title": "All the elements of a great show but...",
      "content": "This show's been on my radar for quite some time now. And to be fair, I was quite excited to sit down and watch it. I've heard nothing but great things about it, so when I sat down to watch it, I got those things. From the crisp, smooth animation, to great voice acting, characters, creepy gothic atmosphere, settings etc, this has the elements to a great gothic kids show. But something is off in my opinion. The show feels kind of lackluster in presentation, and both the writing and direction sometimes fall in this category. That's my guess on what I think is up. it might just be my high expectations but that's my flaw with this show."
    },
    {
      "username": "shipporox73",
      "userUrl": "https://www.imdb.com/user/ur56825526",
      "reviewLink": "https://www.imdb.com/review/rw3133284",
      "warningSpoilers": false,
      "date": "30 November 2014",
      "rate": "10",
      "helpful": "48 out of 61 found this helpful.",
      "title": "Age range",
      "content": "This story was a piece of artwork. I loved how thick the plot was, but all it needed was 10 episodes, 5 if you want to make them 30 minutes each. Yes i agree this show isn't really meant for the younger crowd but then again since when was Cartoon network only for children? Since when did they agree to only design shows for a certain age group? Cartoon network has always been for everyone, all ages. So seeing them make a show like this that was more targeted by my age group, made me happy to know that a network channel is also appeasing to the older range group. The story has a lot of symbolism and does teach us all a powerful lesson, but you must be old enough to understand. If a 6 year old watches this, they won't understand much, but if someone my age were to watch it, they would understand the powerful meaning behind every character. Behind the show. And would truly understand what is Over the Garden Wall."
    },
    {
      "username": "elicopperman",
      "userUrl": "https://www.imdb.com/user/ur81864032",
      "reviewLink": "https://www.imdb.com/review/rw5237987",
      "warningSpoilers": false,
      "date": "5 November 2019",
      "rate": "9",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Remains Mysteriously Enchanting after Five Years",
      "content": "For over five years, Cartoon Network amazed audiences worldwide with their first ever mini-series known as Over the Garden Wall. Released in the fall of 2014, this show remains one of the more unique experiments from the television station for it's contained structure, creepy atmosphere and bizarre visuals. Imagine a mix between the mysterious subtlety of 19th century children's book illustrations, the macabre surrealism of the Fleischer cartoons and the sophisticated fantasy of Hayao Miyazaki, set in fall no less. What seems like a mysterious tale of childhood wonderment has so much more than meets the eyes.The essential storyline revolves around half-siblings Wirt and Greg as they wonder off in a distant land called the Unknown and encounter all sorts of strange creatures along their journey back home. These include a talking bluebird named Beatrice, a woodsman who is under a beast's control, witches, pumpkin skeletons and more. While bizarre just in concept alone, what makes the series stand out is the theme of despair. All throughout the show, there are symbols that indicate death and the loss of hope given the dark bleak environment the characters end up in. With Wirt being the pessimistic pushover and Greg being the naive goofball, their relationship actually represents the cynic and the carefree, which makes for strong character interactions as they desperately seek for a way out of the Unknown. Depending on where they end up at or what danger lurks beyond their reach, the perilous journey is fraught with severe consequences, evil entities and idiosyncratic characters, making the experience unpredictable with whatever comes their way.As for the other characters, Beatrice is the most sympathetic of the supporting cast due to her infamous backstory, and while she can be rather moody at times, she still cares for the well being of others and even refuses to let anything happen to the half-brothers. The woodsman may seem crazy at first glance, but that's only because he is consumed with paranoia regarding the beast's dominance to keep it alive through manipulation, creating him as an example of one sacrificing their sanity for delusional faith. Even Greg's pet frog offers some surprising depth in the show's themes of isolation and blind hope once it has a chance to sing. The others are reserved for specific episodes, from the skeleton pumpkins, to the fearful Quincy Endicott, to the angelic Queen of the Clouds and even the deathly sick Lorna. While many of them don't appear past their respected time slots, their presences alone give just enough insight into the disturbingly odd atmosphere around the Unknown. We only know so much about their lives, yet we needn't delve any deeper to keep the story going.Out of all the animated shows Cartoon Network has ever made, this could very well be their creepiest looking one. The color palette is appropriately neutralized to recreate the somber feeling of fall, the character designs are simplistic yet spooky with their rigged details and macabre elements, and the environments display a rich gloominess with retro New England foliage and vintage homes that would not be out of place in a fairy tale. Some sequences even pay homage to Golden Age cartoons with colorful dreams and frightening musical numbers. Speaking of the music, the songs themselves range from charmingly simple to subtly introspective, as many of them are written around the idea that the world has more to offer than a bleak outlook on life. The score itself feels reminiscent to those old-timey records you would hear when you'd want to relax. In many ways, the series is a modern day replica of what the fall season was viewed as back in the late 19th century, with the appropriate darkness and haunting atmosphere to elevate the material.It may not be as long as other acclaimed TV shows that the network has given us, but the story itself could not have been executed in a more intriguing way. With a folksy tone, creepy visuals and fascinating characters, Over the Garden Wall remains a staple of autumn worth revisiting again and again for years to come. If you are yet to view the show in its entirety, then by all means give it a watch. Unless you prefer something more action packed and relatable like Adventure Time or Steven Universe, you will be in for a treat that will make you question everything it offers in all the right ways."
    },
    {
      "username": "tinytots2",
      "userUrl": "https://www.imdb.com/user/ur144605672",
      "reviewLink": "https://www.imdb.com/review/rw7595491",
      "warningSpoilers": false,
      "date": "28 November 2021",
      "rate": "8",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Charming in its unique strangeness",
      "content": "I don't think I have seen another show like Over the Garden Wall. With an unsettling autumnal Halloween feel to the setting and stories, the gorgeous art and animation alone make the series worth the watch. There are numerous horror elements that keep this from being a simple child's cartoon, and the plots within each episode and over the course of the series keep the show engaging and enthralling. Even with only ten episodes just over ten minutes each, a compelling narrative is spun and presented along with introducing the watchers to the fascinating (and rather creepy) world of The Unknown.It is only my desire for more vignettes and a wish that there was greater inter-connectedness between the episodes that keeps me from rating this show higher. In my rating, I also have not taken into account my perusal of the companion book \"Art of Over the Garden Wall\" which instilled in me a greater appreciation for this series; I would definitely recommend lovers of this show to get a copy of that!"
    },
    {
      "username": "CamdenGregware",
      "userUrl": "https://www.imdb.com/user/ur63609836",
      "reviewLink": "https://www.imdb.com/review/rw4831242",
      "warningSpoilers": false,
      "date": "6 May 2019",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "AMAZING",
      "content": "Over the Garden Wall is an amazing miniseries that EVERYONE should take a halloween night to watch. This series has a very comforting yet eerie overtone, with lovable characters and a great sense of mystery. Over the Garden Wall only takes a little under 2 hours to watch, and if you haven't seen it already, go watch it in one sitting. You will not be disappointed."
    },
    {
      "username": "benjaminburt",
      "userUrl": "https://www.imdb.com/user/ur73643551",
      "reviewLink": "https://www.imdb.com/review/rw3774578",
      "warningSpoilers": false,
      "date": "7 August 2017",
      "rate": "9",
      "helpful": "8 out of 12 found this helpful.",
      "title": "Nothing's perfect, but this comes close.",
      "content": "Over the Garden Wall is a very impressive show. Almost everything is pitch-perfect. It has excellent voice acting, a unique and permeating mood, and it didn't over-stay its welcome. What most impressed me about Over the Garden Wall is both the atmosphere and themes that the show holds. It has a very Kafka-esque feel to it, and the show is excellent at asking existentialist questions. We are purposefully never told Wirt's motivation, aside from 'getting home,' and each episode begins with little-to-no segue from the previous episode, leading us to question if we are going forward or moving backward from our goal. The dreamlike tone matches perfectly, with odd and off-putting parts of the universe just taken at face value, with no explanation. Just for example, there is an episode where a school-teacher runs a school for animals. After class, she instructs the students to go to bed. The animals pass through a doorway, then there's a cut-away to them entering a doorway wearing nighties. Wirt, too, is there, but the transition is so quick and so dreamlike, yet we take it at face value. Consider another thing: we never see Wirt eat, and Greg eats only once - a spoonful of potatoes. What a small touch, but despite witnessing several shot of food set before them, we only once see any put into their mouths. Eating, surprisingly enough, often grounds a person in reality. Another moment that impressed was when Wirt and Greg entered the tavern with people who identified themselves by an occupation or label. The people identify Wirt as 'the Pilgrim, master of his own destiny,' yet this contradicts what we have seen over and over, that Wirt doesn't take control of situations, and is mostly stumbling along from one place to another and playing it by ear.The only thing I could critique the show on is the animation. It espouses the modern style of having your computer-generated characters walk across mostly still backgrounds. It makes the main characters seem a little rubbery and lifeless at times. But, that's pretty typical for modern animation. I guess I also rolled my eyes at the 'liar-reveal' story of Beatrice, but it didn't take away much from the miniseries as a whole. I don't believe that any piece of art should ever be considered perfect, as there are always ways to improve. Nevertheless, I believe Over the Garden Wall is superb, telling a charming, folksy story with excellent voice acting, mood, setting, direction, and music."
    },
    {
      "username": "milograham123",
      "userUrl": "https://www.imdb.com/user/ur47827605",
      "reviewLink": "https://www.imdb.com/review/rw3219666",
      "warningSpoilers": false,
      "date": "13 April 2015",
      "rate": "10",
      "helpful": "30 out of 38 found this helpful.",
      "title": "A beautiful and harrowing Fairytale",
      "content": "\"Over the Garden Wall\" is a Cartoon Network miniseries that was shown on TV in the November of 2014. It is a beautifully crafted tale of friendship , love and courage that follows the adventures of Wirt and his brother Gregory as they attempt to travel home in the mysterious world , \" the unknown\". The series as a whole is a perfect blend of light hearted comedy and dark, creepy setting. For one thing the comedy and jokes are actually funny, hilarious at some points very reminiscent of the weird humor of adventure time ( I will touch on that later), this comes as no surprise as writer, story boarder and creator Patrick McHale worked with Pendelton Ward in the first two, arguably best, series of adventure time . Wards craft and love of character has clearly rubbed off on McHale who here creates a series so supremely beautiful and touching , there really hasn't been anything like it before in the world of cartoons . The characters for one are extremely likable and memorable all throughout , Wirt representing the cynical teenager ( without overdoing the cliché) and his little step brother Gregory is wonderfully memorable and funny throughout , if you have a younger sibling I guarantee you will find similarities . To be honest I feel the plot of the series is best to let you discover as it feels to me like true magic watching it, bringing me back to my childhood whilst still feeling like an complex show. Now to the craftmanship of the show, the title cards at the start of each episode add to the literary narrative reminiscent of the best silent films shown on old grainy, projected screens in an old cinema . Credit should go to art directors Nick Cross and Nate Cash as the series subtley blends from beautiful colour in the lighter scenes to pitch black terror in the darker ones invoking a sense of fear and dread inside us all. The music also deserves a special mention , written by McHale and performed by \" The Petrojvic blasting company\", a gypsy folk band . The score is elegant and delightful invoking nostalgia as well as adding to the mystery and whimsical comedy of each chapter . The setting of the unknown is hauntingly beautiful and surreal ranging from fantastical colour backgrounds to dark, murky forest reminiscent of Snow White . Each chapter invokes a different aesthetic , for instance the whimsical episode, \" Schooltime follies \" brings into mind the work of children's illustrator Richard Scarry in the style of the animals , whereas the episode , \"Songs of the Dark lantern \" brings into mind the everlasting animation of Max Fleischer . The series as a whole seems to be inspired by a whole lot of classic and fantastic things , for instance the world , \"the unknown\" seems to be a beautiful mix of Walt Disneys Snow White and Miyazakis Prince Monokoke . Two animation pioneers , the steamboat in chapter 3 is a not so subtle reference to Disney . Similarly the old witch \" Lady Whispers\" could be taken directly out of \" Spirited Away\" .The miniseries as a whole reminded me of a stronger , more fleshed out version of the classic Adventure time Episode \"Finn the Human\" in terms of the characters and animation style . This work of art fits in perfectly with the new wave of seeming \"adult shows\" from Cartoon Network, with adult back stories yet all the traits of a fantastic kids show. The ending is a heartbreaking one that is best left unspoiled . The miniseries as a whole shows a deft range of emotional anguish and is overall the story of two brothers , demonstrating the power of friendship always shines through . Overall the series is a haunting fairy tale for our generation similar to the brothers Grimm in that two children get lost in a terrifying, fantastical world , and like any good fairy tale this one runs it's course perfectly. Overall this beautiful crafted blend of Disney and Miyazaki is a gem not to be dismissed as \"Just a kids show\"."
    }
  ],
  "errorMessage": ""
}