{
  "imDbId": "tt3718778",
  "title": "Over the Garden Wall",
  "fullTitle": "Over the Garden Wall (TV Series 2014–2014)",
  "type": "TVSeries",
  "year": "2014",
  "language": "en",
  "titleInLanguage": "Over the Garden Wall",
  "url": "https://en.wikipedia.org/wiki/Over_the_Garden_Wall",
  "plotShort": {
    "plainText": "Over the Garden Wall is an American animated television miniseries created by Patrick McHale for Cartoon Network. The series centers on two half-brothers who travel across a mysterious forest to find their way home, encountering a variety of strange and fantastical things on their journey. The show is based on McHale's animated short film Tome of the Unknown, which was produced as part of Cartoon Network Studios' shorts development program. Elijah Wood and Collin Dean voice the protagonists Wirt and Greg, and Melanie Lynskey voices Beatrice, a bluebird. The series' voice cast also includes Christopher Lloyd, Tim Curry, Bebe Neuwirth, Chris Isaak, Shirley Jones, Thomas Lennon, Jack Jones, Jerron Paxton, John Cleese and Samuel Ramey. The Blasting Company composed the soundtrack. Over the Garden Wall was broadcast throughout the week of November 3 to November 7, 2014.\r\nThe show was the first miniseries on the network. McHale first envisioned it in 2004 and pitched it to the network in 2006. After working on other Cartoon Network shows including The Marvelous Misadventures of Flapjack and Adventure Time, the network expressed interest in McHale pitching a pilot. That pilot, Tome of the Unknown, became the catalyst for Over the Garden Wall. Production of the show began in March 2014 and was largely done in Burbank, California, but many of the show's storyboard artists worked from other U.S. cities, while the program's animation was outsourced to South Korean studio Digital eMation. The series' environment evokes 19th- and 20th-century Americana, while its digital backgrounds are designed to resemble brunaille paintings.\r\nThe series was well-received by television critics, who praised its atmosphere and characters. In 2015, the series won an Emmy Award for Outstanding Animated Program. A one-shot comic book adaptation penned by McHale has been produced, with four further issues commissioned. This was later expanded into an ongoing comic series that ran for 20 issues and continued in a series of graphic novels and comic book miniseries.",
    "html": "<p>Over the Garden Wall is an American animated television miniseries created by Patrick McHale for Cartoon Network. The series centers on two half-brothers who travel across a mysterious forest to find their way home, encountering a variety of strange and fantastical things on their journey. The show is based on McHale's animated short film Tome of the Unknown, which was produced as part of Cartoon Network Studios' shorts development program. Elijah Wood and Collin Dean voice the protagonists Wirt and Greg, and Melanie Lynskey voices Beatrice, a bluebird. The series' voice cast also includes Christopher Lloyd, Tim Curry, Bebe Neuwirth, Chris Isaak, Shirley Jones, Thomas Lennon, Jack Jones, Jerron Paxton, John Cleese and Samuel Ramey. The Blasting Company composed the soundtrack. Over the Garden Wall was broadcast throughout the week of November 3 to November 7, 2014.</p><p>The show was the first miniseries on the network. McHale first envisioned it in 2004 and pitched it to the network in 2006. After working on other Cartoon Network shows including The Marvelous Misadventures of Flapjack and Adventure Time, the network expressed interest in McHale pitching a pilot. That pilot, Tome of the Unknown, became the catalyst for Over the Garden Wall. Production of the show began in March 2014 and was largely done in Burbank, California, but many of the show's storyboard artists worked from other U.S. cities, while the program's animation was outsourced to South Korean studio Digital eMation. The series' environment evokes 19th- and 20th-century Americana, while its digital backgrounds are designed to resemble brunaille paintings.</p><p>The series was well-received by television critics, who praised its atmosphere and characters. In 2015, the series won an Emmy Award for Outstanding Animated Program. A one-shot comic book adaptation penned by McHale has been produced, with four further issues commissioned. This was later expanded into an ongoing comic series that ran for 20 issues and continued in a series of graphic novels and comic book miniseries.</p>"
  },
  "plotFull": {
    "plainText": "Over the Garden Wall is an American animated television miniseries created by Patrick McHale for Cartoon Network. The series centers on two half-brothers who travel across a mysterious forest to find their way home, encountering a variety of strange and fantastical things on their journey. The show is based on McHale's animated short film Tome of the Unknown, which was produced as part of Cartoon Network Studios' shorts development program. Elijah Wood and Collin Dean voice the protagonists Wirt and Greg, and Melanie Lynskey voices Beatrice, a bluebird. The series' voice cast also includes Christopher Lloyd, Tim Curry, Bebe Neuwirth, Chris Isaak, Shirley Jones, Thomas Lennon, Jack Jones, Jerron Paxton, John Cleese and Samuel Ramey. The Blasting Company composed the soundtrack. Over the Garden Wall was broadcast throughout the week of November 3 to November 7, 2014.\r\nThe show was the first miniseries on the network. McHale first envisioned it in 2004 and pitched it to the network in 2006. After working on other Cartoon Network shows including The Marvelous Misadventures of Flapjack and Adventure Time, the network expressed interest in McHale pitching a pilot. That pilot, Tome of the Unknown, became the catalyst for Over the Garden Wall. Production of the show began in March 2014 and was largely done in Burbank, California, but many of the show's storyboard artists worked from other U.S. cities, while the program's animation was outsourced to South Korean studio Digital eMation. The series' environment evokes 19th- and 20th-century Americana, while its digital backgrounds are designed to resemble brunaille paintings.\r\nThe series was well-received by television critics, who praised its atmosphere and characters. In 2015, the series won an Emmy Award for Outstanding Animated Program. A one-shot comic book adaptation penned by McHale has been produced, with four further issues commissioned. This was later expanded into an ongoing comic series that ran for 20 issues and continued in a series of graphic novels and comic book miniseries.\r\nPlot\r\nThe series follows two half-brothers, Wirt and Greg (voiced by Elijah Wood and Collin Dean respectively), who become lost in a strange forest called the Unknown. To find their way home, the two must travel across the seemingly supernatural forest with the occasional help of the wandering, mysterious and elderly Woodsman (Christopher Lloyd) and Beatrice (Melanie Lynskey), an irritable bluebird who travels with the boys to find a woman called Adelaide, who can supposedly undo the curse on Beatrice and her family and show the half-brothers the way home.\r\nWirt, the older brother, is a worry-prone teenager who would rather keep to himself than have to make a decision. His passions include playing the clarinet and writing poetry, but he usually keeps these private out of fear of being mocked. On the other hand, Greg, the younger brother, is more naïve and carefree, much to Wirt's chagrin. Greg carries a frog (Jack Jones) that he found; Greg's attempts to give the frog a name are a running gag. Stalking the main cast is the Beast (Samuel Ramey), an ancient creature who leads lost souls astray until they lose their hope and willpower and turn into \"Edelwood trees\". Once they find Adelaide, Wirt discovers that she intends only to enslave the boys; outraged that Beatrice misled them, Wirt takes Greg and abandons her.\r\nFinal chapters\r\nThe penultimate episode reveals that Wirt and Greg are modern children who entered the Unknown after falling into a pond on Halloween. Wirt, attempting to take back some embarrassing poetry and clarinet tape he made for a girl he is infatuated with, had followed her to a ghost story party in a graveyard, where a police officer scares him and Greg into jumping over the cemetery's garden wall. On the other side of the wall, they landed on a train track. To save Greg from being hit by a train, Wirt pulled him into a nearby pond, knocking them both unconscious in the process and sending them to a Limbo-like realm between life and death.\r\nIn the final episode, Wirt saves Greg from being turned into an Edelwood tree by the Beast. At the end of the episode, Wirt and Greg wake up in a hospital back in their hometown. As the scene ends, Greg's frog, which swallowed a magic bell in the Unknown, begins to glow, suggesting that their experience in the Unknown may have been real. The series ends with a montage of how Wirt and Greg affected the inhabitants of the Unknown.\r\nProduction\r\nOver the Garden Wall was first envisioned in 2004 with a scarier and more adventure-based storyline. Before working as a storyboard artist on The Marvelous Misadventures of Flapjack, artist Patrick McHale pitched the show in 2006, then known under the title Tome of the Unknown. The series would follow two brothers—Walter and Gregory—who, after signing themselves into a Faustian deal with a devil named Old Scratch, journey across the Land of the In-Between to track down the pages of a book of forgotten stories.\r\nMcHale saw it as \"a possible Halloween special\", but had trouble adapting the premise with a larger story arc. After his work for Flapjack, McHale moved on to co-develop Adventure Time, where he served as creative director, and subsequently as a writer. The network later asked him if he had interest in developing a pilot, which led to him returning to Tome of the Unknown, polishing it and pitching it again to the network.: 29 After creating a pilot episode, Tome of the Unknown: Harvest Melody, McHale and the network settled upon the miniseries format for the ensuing series, as McHale felt that it would lead to \"something that felt higher quality than what we could do with a regular series\". McHale abandoned the original idea centered around chapters of a mystical tome and the series' title became Over the Garden Wall.\r\nProduction for Over the Garden Wall commenced in late 2013. McHale initially envisioned eighteen chapters in the series, but the episode count was brought to ten to accommodate budget and time constraints. Early drafts of episodes from the show's pitch bible included a skinless witch character and a villain who carves dice from the bones of kidnapped children, as well a running plot throughout four episodes in which Wirt and Gregory are transformed into animals (Gregory being a duck and Wirt being \"either a bear or a dog ... Nobody can tell which\").\r\nThe ten episodes marked the first miniseries on the Cartoon Network. The show features Wood and Dean (reprising their roles from the short), along with Lynskey as the main voice cast. McHale and his crew tried to maintain a balance between frightening imagery and \"episodes that are just light and funny\".: 24 For the music, McHale drew inspiration from \"classic American, opera singing\". Nick Cross served as art director and Nate Cash as supervising director; both worked with McHale alongside storyboard artists located in New York and Chicago. This distance proved difficult for McHale, who found it \"particularly daunting considering the idiosyncratic nature of the production\".\r\nThe series' art was inspired by a variety of sources, including the 1890s McLoughlin Brothers board game Game of Frog Pond, illustrations by Gustave Doré for Cervantes's Don Quixote, old illustrations for the Hans Christian Andersen story \"The Tinderbox\", the Cheshire Cat illustration by John Tenniel from Alice's Adventures in Wonderland, and the \"Dogville Comedies\" short films. McHale referenced chromolithography, vintage Halloween postcards, magic lantern slides, and photographs of New England foliage to create the show's style.\r\nCast\r\nMain voices\r\nElijah Wood as Wirt\r\nCollin Dean as Gregory (Greg)\r\nMelanie Lynskey as Beatrice\r\nChristopher Lloyd as the Woodsman\r\nJack Jones as Greg's Frog\r\nSamuel Ramey as the Beast\r\nVarious voices\r\nEmily Brundige as Sara\r\nMark Bodnar as the North Wind\r\nJohn Cleese as Quincy Endicott and Adelaide\r\nTim Curry as Auntie Whispers\r\nNoureen DeWulf as Pumpkin Gal\r\nFrank Fairfield as the Toy Maker\r\nChris Isaak as Enoch\r\nShirley Jones as Beatrice's Mother\r\nJanet Klein as Miss Langtree\r\nThomas Lennon as Jimmy Brown\r\nSam Marin as Mr. Langtree\r\nJudah Nelson as the Cloud City Reception Committee\r\nBebe Neuwirth as Margueritte Grey\r\nJerron \"Blind Boy\" Paxton as the Highwayman\r\nCole Sanchez as Jason Funderberker\r\nShannyn Sossamon as Lorna\r\nFred Stoller as Fred the Horse\r\nDeborah Voigt as Queen of the Clouds\r\nAudrey Wasilewski as the Tavern Keeper\r\nEpisodes\r\nSeries overview\r\nPilot (2013)\r\nMiniseries (2014)\r\nBroadcast\r\nMcHale's original short, Tome of the Unknown, was screened at the 2014 Santa Barbara International Film Festival, where McHale earned the Bruce Corwin Award for best animated short film. It also received an honorable mention at the 2013 Ottawa International Animation Festival.\r\nAt the 2014 San Diego Comic-Con International, a preview of the show was screened along with various panels for other shows on the network. Episode 2 was previewed at the 2014 New York Comic Con, which McHale and the main cast attended. The show made its premiere on November 3, 2014 on Cartoon Network, and ran over five consecutive nights. The entirety of it was published on iTunes preceding its broadcast.\r\nThe series aired on Cartoon Network in Australia from December 15 to 19, 2014 and on Cartoon Network in the United Kingdom and Ireland from April 6 to 10, 2015.\r\nMusic\r\nVarious melodies and songs based on pre-1950s music are heard throughout the series. Elijah Wood, the voice actor for Wirt, has said that \"if this show were a record, it would be played on a phonograph\". Songs from the series include \"Into the Unknown\", its title song, composed by Patrick McHale and sung by Jack Jones; \"A Courting Song\", composed by the Petrojvic Blasting Company and performed by Frank Fairfield; and \"Come Wayward Souls\", sung by Samuel Ramey as the Beast.\r\nThe majority of the series' songs have been officially uploaded to YouTube. On the DVD release they can be heard, along with visuals and without dialogue, in a special feature known as the Composer's Cut. An extended version of the soundtrack, featuring 32 tracks and totaling around 44 minutes in length, was released in the form of a 180-gram vinyl record by Mondo in August 2016. The extended soundtrack debuted at the San Diego Comic-Con, with a limited 1,000 copies, featuring a cover designed by Sam Wolfe Connelly. The extended vinyl is also available as a webstore exclusive from Mondo.\r\nIn September 2015, Mondo released an audio cassette tape titled \"For Sara\", based on the cassette tape labelled with the same name seen in the series. The cassette features over twenty minutes of poetry spoken by Elijah Wood (in character as Wirt) and music performed by the Blasting Company. In September 2017, Mondo released the cassette a second time, with the subtitle \"(Back-Up Master)\".\r\nHome media\r\nOver the Garden Wall (with the short film Tome of the Unknown) was released on DVD in Australia on July 8, 2015 by Cartoon Network and Madman Entertainment and by Cartoon Network and its sister company Warner Home Video on September 8, 2015, in the United States. The DVD features all ten episodes of the show, commentaries, the original pilot, alternate title cards, and deleted animatics. Other extras on the DVD include a \"Composer's Cut,\" an option wherein a viewer can watch the show with only the visuals and the background music; and the mini-documentary Behind Over the Garden Wall.\r\nOn April 6, 2016, Madman Entertainment released the miniseries on Blu-ray exclusively in Australia and New Zealand with the same bonus content as the DVD release. On March 2, 2020, Manga Entertainment released it in the UK on Blu-Ray and DVD.\r\nReception\r\nCritical reception\r\nOver the Garden Wall was critically acclaimed. On review aggregator Rotten Tomatoes, the series has an approval rating of 93% based on 15 reviews, with an average rating of 8.60/10. The website's critics consensus reads, \"Over the Garden Wall's modern sensibilities mix well with its fairy-tale setting, creating a whimsically witty series for viewers of all ages.\"\r\nPreceding its premiere, Patrick Kevin Day of the Los Angeles Times called it \"funny, creepy\" and, from the premise, \"not as simple as it sounds\". In TV Guide and also before the premiere, Megan Walsh-Boyle felt that the show's fictional universe \"sounds like a world worth getting lost in\".: 24 Meredith Woerner of io9 called a preview of the show \"amazing\", \"weird, and cute and great\", reflecting \"all the things we love about this oddball animation renaissance we are currently living in\". Conversely, Amid Amidi of Cartoon Brew judged from the same preview that the animation was lacking. While not discounting its storytelling, music, and production design, he felt that production skimped on animation; he was still looking forward to the series.\r\nRobert Lloyd of the Los Angeles Times wrote that it was \"a little too folksy and fairy story\" at times, but that its \"contemporary strangeness wins out\", and concluded that \"it is throughout something to behold\". Lloyd later wrote that it evoked \"a kind of artisanal quality\", both in its design and setting, and though the writing felt \"a little too intent on its own folksiness\", it became more enjoyable throughout. In The New York Times, Mike Hale also felt the writing was sometimes weak and the stories \"perilously thin\", but concluded that McHale developed an environment worth visiting.\r\nBrian Moylan of The Guardian wrote that the visuals were \"absolutely stunning\", and that the stories contained \"a certain darkness to it that is both mellow and twee at the same time, with a fair amount of anxiety creeping around the edges\". Brian Lowry of Variety wrote that Garden Wall was \"an admirable experiment\", but not one to sustain \"the five-night commitment\", calling it \"slightly mismatched\" while praising a departure from \"the more abrasive characteristic\" of the network's primetime content. Kevin McDonough of the Illinois Daily Journal criticized some of the writing, but summed it up as \"an ambitious cartoon\" for both younger and older audiences. Jason Bree of the website Agents of Geek called the miniseries \"the greatest thing Cartoon Network has ever produced\". Kevin Johnson of The A.V. Club praised the series, giving it a grade of \"A\" and writing that \"with such a perfect blend of mood, atmosphere, story, and characterization, Over the Garden Wall's 10-episode run will leave you wanting more, but like every great fairy tale, it's a story that knows when it's over.\"\r\nAwards and nominations\r\nComic book adaptation\r\nA one-shot comic book adaptation of the show was announced in October 2014. Produced by KaBoom!, an imprint of Boom! Studios, the comic was released on November 5, 2014. The comic was supervised by McHale and was produced as an oversized special. The comic was illustrated by Jim Campbell, a writer/storyboard artist on the television series. A special variant cover, by McHale, was also released. The success of the standalone comic led to further issues being commissioned in May 2015 and began to be released in August 2015. According to McHale, the comic books would be similar to the one-shot comic, detailing the events that occurred in between certain episodes and would expand on the television miniseries. The success of the series of one-shots led to an ongoing series of comics, serving as both a sequel and prequel to the series, rather than telling adventures that happened between episodes. The stories are told parallel, with half the comic detailing Greg returning to mysterious dreamlands in his sleep. The other half chronicles the Woodsman's daughter, Anna, and how she became lost in the Unknown. After the ongoing series ended in November 2017, the Over the Garden Wall comics continued as a series of miniseries and original graphic novels.",
    "html": "<p>Over the Garden Wall is an American animated television miniseries created by Patrick McHale for Cartoon Network. The series centers on two half-brothers who travel across a mysterious forest to find their way home, encountering a variety of strange and fantastical things on their journey. The show is based on McHale's animated short film Tome of the Unknown, which was produced as part of Cartoon Network Studios' shorts development program. Elijah Wood and Collin Dean voice the protagonists Wirt and Greg, and Melanie Lynskey voices Beatrice, a bluebird. The series' voice cast also includes Christopher Lloyd, Tim Curry, Bebe Neuwirth, Chris Isaak, Shirley Jones, Thomas Lennon, Jack Jones, Jerron Paxton, John Cleese and Samuel Ramey. The Blasting Company composed the soundtrack. Over the Garden Wall was broadcast throughout the week of November 3 to November 7, 2014.</p><p>The show was the first miniseries on the network. McHale first envisioned it in 2004 and pitched it to the network in 2006. After working on other Cartoon Network shows including The Marvelous Misadventures of Flapjack and Adventure Time, the network expressed interest in McHale pitching a pilot. That pilot, Tome of the Unknown, became the catalyst for Over the Garden Wall. Production of the show began in March 2014 and was largely done in Burbank, California, but many of the show's storyboard artists worked from other U.S. cities, while the program's animation was outsourced to South Korean studio Digital eMation. The series' environment evokes 19th- and 20th-century Americana, while its digital backgrounds are designed to resemble brunaille paintings.</p><p>The series was well-received by television critics, who praised its atmosphere and characters. In 2015, the series won an Emmy Award for Outstanding Animated Program. A one-shot comic book adaptation penned by McHale has been produced, with four further issues commissioned. This was later expanded into an ongoing comic series that ran for 20 issues and continued in a series of graphic novels and comic book miniseries.</p><br/><h3>Plot</h3><p>The series follows two half-brothers, Wirt and Greg (voiced by Elijah Wood and Collin Dean respectively), who become lost in a strange forest called the Unknown. To find their way home, the two must travel across the seemingly supernatural forest with the occasional help of the wandering, mysterious and elderly Woodsman (Christopher Lloyd) and Beatrice (Melanie Lynskey), an irritable bluebird who travels with the boys to find a woman called Adelaide, who can supposedly undo the curse on Beatrice and her family and show the half-brothers the way home.</p><p>Wirt, the older brother, is a worry-prone teenager who would rather keep to himself than have to make a decision. His passions include playing the clarinet and writing poetry, but he usually keeps these private out of fear of being mocked. On the other hand, Greg, the younger brother, is more naïve and carefree, much to Wirt's chagrin. Greg carries a frog (Jack Jones) that he found; Greg's attempts to give the frog a name are a running gag. Stalking the main cast is the Beast (Samuel Ramey), an ancient creature who leads lost souls astray until they lose their hope and willpower and turn into \"Edelwood trees\". Once they find Adelaide, Wirt discovers that she intends only to enslave the boys; outraged that Beatrice misled them, Wirt takes Greg and abandons her.</p><h4>Final chapters</h4><p>The penultimate episode reveals that Wirt and Greg are modern children who entered the Unknown after falling into a pond on Halloween. Wirt, attempting to take back some embarrassing poetry and clarinet tape he made for a girl he is infatuated with, had followed her to a ghost story party in a graveyard, where a police officer scares him and Greg into jumping over the cemetery's garden wall. On the other side of the wall, they landed on a train track. To save Greg from being hit by a train, Wirt pulled him into a nearby pond, knocking them both unconscious in the process and sending them to a Limbo-like realm between life and death.</p><p>In the final episode, Wirt saves Greg from being turned into an Edelwood tree by the Beast. At the end of the episode, Wirt and Greg wake up in a hospital back in their hometown. As the scene ends, Greg's frog, which swallowed a magic bell in the Unknown, begins to glow, suggesting that their experience in the Unknown may have been real. The series ends with a montage of how Wirt and Greg affected the inhabitants of the Unknown.</p><br/><h3>Production</h3><p>Over the Garden Wall was first envisioned in 2004 with a scarier and more adventure-based storyline. Before working as a storyboard artist on The Marvelous Misadventures of Flapjack, artist Patrick McHale pitched the show in 2006, then known under the title Tome of the Unknown. The series would follow two brothers—Walter and Gregory—who, after signing themselves into a Faustian deal with a devil named Old Scratch, journey across the Land of the In-Between to track down the pages of a book of forgotten stories.</p><p>McHale saw it as \"a possible Halloween special\", but had trouble adapting the premise with a larger story arc. After his work for Flapjack, McHale moved on to co-develop Adventure Time, where he served as creative director, and subsequently as a writer. The network later asked him if he had interest in developing a pilot, which led to him returning to Tome of the Unknown, polishing it and pitching it again to the network.: 29 After creating a pilot episode, Tome of the Unknown: Harvest Melody, McHale and the network settled upon the miniseries format for the ensuing series, as McHale felt that it would lead to \"something that felt higher quality than what we could do with a regular series\". McHale abandoned the original idea centered around chapters of a mystical tome and the series' title became Over the Garden Wall.</p><p>Production for Over the Garden Wall commenced in late 2013. McHale initially envisioned eighteen chapters in the series, but the episode count was brought to ten to accommodate budget and time constraints. Early drafts of episodes from the show's pitch bible included a skinless witch character and a villain who carves dice from the bones of kidnapped children, as well a running plot throughout four episodes in which Wirt and Gregory are transformed into animals (Gregory being a duck and Wirt being \"either a bear or a dog ... Nobody can tell which\").</p><p>The ten episodes marked the first miniseries on the Cartoon Network. The show features Wood and Dean (reprising their roles from the short), along with Lynskey as the main voice cast. McHale and his crew tried to maintain a balance between frightening imagery and \"episodes that are just light and funny\".: 24 For the music, McHale drew inspiration from \"classic American, opera singing\". Nick Cross served as art director and Nate Cash as supervising director; both worked with McHale alongside storyboard artists located in New York and Chicago. This distance proved difficult for McHale, who found it \"particularly daunting considering the idiosyncratic nature of the production\".</p><p>The series' art was inspired by a variety of sources, including the 1890s McLoughlin Brothers board game Game of Frog Pond, illustrations by Gustave Doré for Cervantes's Don Quixote, old illustrations for the Hans Christian Andersen story \"The Tinderbox\", the Cheshire Cat illustration by John Tenniel from Alice's Adventures in Wonderland, and the \"Dogville Comedies\" short films. McHale referenced chromolithography, vintage Halloween postcards, magic lantern slides, and photographs of New England foliage to create the show's style.</p><br/><h3>Cast</h3><h4>Main voices</h4><ul><li>Elijah Wood as Wirt</li><li>Collin Dean as Gregory (Greg)</li><li>Melanie Lynskey as Beatrice</li><li>Christopher Lloyd as the Woodsman</li><li>Jack Jones as Greg's Frog</li><li>Samuel Ramey as the Beast</li></ul><h4>Various voices</h4><ul><li>Emily Brundige as Sara</li><li>Mark Bodnar as the North Wind</li><li>John Cleese as Quincy Endicott and Adelaide</li><li>Tim Curry as Auntie Whispers</li><li>Noureen DeWulf as Pumpkin Gal</li><li>Frank Fairfield as the Toy Maker</li><li>Chris Isaak as Enoch</li><li>Shirley Jones as Beatrice's Mother</li><li>Janet Klein as Miss Langtree</li><li>Thomas Lennon as Jimmy Brown</li><li>Sam Marin as Mr. Langtree</li><li>Judah Nelson as the Cloud City Reception Committee</li><li>Bebe Neuwirth as Margueritte Grey</li><li>Jerron \"Blind Boy\" Paxton as the Highwayman</li><li>Cole Sanchez as Jason Funderberker</li><li>Shannyn Sossamon as Lorna</li><li>Fred Stoller as Fred the Horse</li><li>Deborah Voigt as Queen of the Clouds</li><li>Audrey Wasilewski as the Tavern Keeper</li></ul><br/><h3>Episodes</h3><h4>Series overview</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Pilot</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">September 9, 2013</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">November 3, 2014</td><td style=\"padding:0 8px\">November 7, 2014</td></tr></tbody></table><h4>Pilot (2013)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#979797\">Title</th><th scope=\"col\" style=\"background:#979797\">Written, Storyboarded and Directed by</th><th scope=\"col\" style=\"background:#979797\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th class=\"summary\" scope=\"row\" rowspan=\"1\" style=\"text-align:left\">\"<span>Tome of the Unknown: Harvest Melody</span>\"</th><td style=\"text-align:center\"><span>Patrick McHale</span></td><td style=\"text-align:center\">September 9, 2013 <small>(<span>LA Shorts Fest</span>)</small><br>May 18, 2015 <small>(Online)</small></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #979797\">Wirt and Gregory grow tired of walking, so they borrow a car made of vegetables from a romantic songwriter named John Crops. They travel to a town of dancing vegetable people, unknowingly bringing crows and other dangerous animals along with them, but they manage to escape while John Crops finds a lover.</td></tr></tbody></table><h4>Miniseries (2014)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#804060;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#804060\">Title</th><th scope=\"col\" style=\"background:#804060\">Written and Storyboarded by</th><th scope=\"col\" style=\"background:#804060\">Original air date</th><th scope=\"col\" style=\"background:#804060;width:10%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Old Grist Mill\"</td><td style=\"text-align:center\"><span>Steve Wolfhard</span>, <span>Natasha Allegri</span>, and Zac Gorman</td><td style=\"text-align:center\">November 3, 2014</td><td style=\"text-align:center\">1.19</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #804060\">Wirt and Greg, along with a frog that Greg attempts to name, are lost in a forest and are met by a talking bluebird and later a woodsman. They are informed by the old Woodsman that they are lost in the Unknown and warns them of \"The Beast\". Taking them to his oil mill, Wirt and Greg decide to stay for the night but problems arise when Greg leaves a trail of candy that a wolf, which they mistakenly believe to be the Beast, follows them. Greg knocks out the Woodsman, the two brothers run from the wolf, resulting in the destruction of the mill and the wolf being squeezed and returned to its original form, a dog. The Woodsman, angry at their actions but still forgiving, tells them to follow the path but warns them to beware the Beast, as he and the two brothers go their different ways. The brothers keep on rambling as they walk through the woods as a bluebird watches them in the trees.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Hard Times at the Huskin' Bee\"</td><td style=\"text-align:center\">Bert Youn, Aaron Renier, and <span>Patrick McHale</span></td><td style=\"text-align:center\">November 3, 2014</td><td style=\"text-align:center\">1.19</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #804060\">Beatrice, a talking bluebird, joins the brothers and their frog after they help her out of a bush. The trio arrive in a strange town, Pottsfield, that appears to be deserted. They find that the town is holding their annual harvest festival in a barn, which is disrupted by their arrival. The residents, who seem to be living pumpkins at first but are actually skeletons, sentence the trio to a few hours of manual labor. After being freed, the brothers decide to follow Beatrice to a woman named Adelaide, who she claims can help them get home.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Schooltown Follies\"</td><td style=\"text-align:center\"><span>Jim Campbell</span> and Laura Park</td><td style=\"text-align:center\">November 4, 2014</td><td style=\"text-align:center\">1.24</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #804060\">Wirt and Beatrice come across a school full of animal students being taught by a human teacher, Miss Langtree. She mistakes them for students and tells them to join the class, which Wirt does. Meanwhile, Greg and some of his new-found animal friends are chased by a gorilla and they hide in the school. Greg cheers everyone up by adding molasses to the potatoes that they're having for lunch. The next day, a benefit concert is organized for the school, which earns enough money to keep it open. Wirt trips over the gorilla, revealing that it was Miss Langtree's missing fiancé, Jimmy Brown, stuck in a costume.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Songs of the Dark Lantern\"</td><td style=\"text-align:center\"><span>Pendleton Ward</span>, Bert Youn, and Steve McLeod</td><td style=\"text-align:center\">November 4, 2014</td><td style=\"text-align:center\">1.24</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #804060\">Wirt and Greg visit a tavern to ask for directions to Adelaide's house. The tavern people warn the brothers about the Beast and reveal that the creature turns people into trees of oil to burn in his lantern. Wirt steals a talking horse named Fred and finds Beatrice unconscious next to the Woodsman, and Wirt and Greg ride off with her. Meanwhile, the Beast reminds the Woodsman that the flame inside his lantern contains his daughter's soul, and that he must cut down Edelwood trees so the fire can keep her alive.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Mad Love\"</td><td style=\"text-align:center\">Natasha Allegri and Zac Gorman</td><td style=\"text-align:center\">November 5, 2014</td><td style=\"text-align:center\">1.55</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #804060\">Wirt and Greg claim to be the nephews of the wealthy and eccentric Quincy Endicott so they can steal two cents from him to pay for a ferry that will cross the river. In order to distract him, Greg, Greg's frog, and Fred convince Quincy to search for a ghost he supposedly saw one night. Beatrice reveals to Wirt she was once human, but she and her family were cursed by a bluebird. She explains that Adelaide is the only one who can change them back. Wirt reveals he has a crush on a girl back home named Sara. The groups reunite and discover that the ghost was in fact Quincy's neighbor and that their two mansions were actually connected. The two embrace each other and award Greg a cent each for his help.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Lullaby in Frogland\"</td><td style=\"text-align:center\">Bert Youn and Nick Edwards</td><td style=\"text-align:center\">November 5, 2014</td><td style=\"text-align:center\">1.55</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #804060\">Wirt, Greg, Beatrice, and Greg's frog sneak aboard the ferry, which is filled with clothed frogs. They disguise themselves as a member of the ferry's band, which soon starts performing, with Wirt reluctantly playing the bassoon. Greg's frog unexpectedly starts to sing. When they arrive at their destination, Beatrice, who had been acting strangely throughout the ferry ride, tries to convince them to stay in the Unknown and not to visit Adelaide. That night, Beatrice flies away and is unknowingly followed by Wirt and Greg to Adelaide's house. Beatrice had originally planned to give them both to Adelaide as slaves in exchange for a pair of scissors that would lift the curse off herself and her family, but she had a change of heart as she grew attached to the brothers. Adelaide attempts to capture Wirt and Greg, but is killed by Beatrice. Beatrice attempts to explain the situation, but Wirt is hurt by her betrayal and runs away with Greg.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Ringing of the Bell\"</td><td style=\"text-align:center\">Patrick McHale, Bert Youn, and <span>Tom Herpich</span></td><td style=\"text-align:center\">November 6, 2014</td><td style=\"text-align:center\">1.19</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #804060\">Greg, Wirt, and Greg's frog encounter the Woodsman, who warns them that the Beast is ready to claim them. They run from the Woodsman and come across a lonely cottage in which they come across a young girl named Lorna who warns them to hide, as her caregiver Auntie Whispers (Adelaide's sister) is coming. Auntie Whispers uses a bell that can control Lorna with its ringing. Auntie Whispers reminds Lorna that she makes her constantly work so that \"she won't become wicked\". The brothers help Lorna to escape by helping her finish her housework early. Just before they leave, Greg and his frog accidentally awaken Auntie Whispers, who warns them to stay away from Lorna or they will be eaten. Lorna suddenly transforms into a horrific demon. Greg shakes his frog, who has eaten Auntie Whispers' bell, and Wirt commands the demon to leave Lorna's body and never return. Lorna decides to stay with Auntie Whispers. After leaving Lorna and Auntie Whispers, Wirt begins to lose hope of ever leaving the Unknown, which pleases the Beast who is watching from afar.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Babes in the Wood\"</td><td style=\"text-align:center\">Mark Bodnar, Jim Campbell, and Bert Youn</td><td style=\"text-align:center\">November 6, 2014</td><td style=\"text-align:center\">1.19</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #804060\">The brothers and Greg's frog sail down a lake, where they hear the Beast's singing, and Greg remains hopeful while Wirt has given up. They reach land and sleep under a tree for the night. Greg has a dream of an angelic cloud city, where he is welcomed by its residents. The festivities are cut short when the North Wind is released and starts destroying the city, but Greg manages to defeat it. The Queen of the Clouds appears to Greg, allowing him one wish as a reward. He wishes to find his way home, but the Queen informs him he cannot return home with Wirt as the Beast has already claimed Wirt, who is covered in Edelwood branches. Greg instead wishes to take Wirt's place, and leaves with the Beast. Wirt awakens and chases after them, but falls through the ice and nearly drowns before being saved by a fishing net.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Into the Unknown\"</td><td style=\"text-align:center\"><span>Cole Sanchez</span>, Vi Nguyen, and Zac Gorman</td><td style=\"text-align:center\">November 7, 2014</td><td style=\"text-align:center\">1.13</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #804060\"><p>Taking place before the events of the first episode, on Halloween, Wirt has just finished making an audio cassette tape for his crush, Sara. He fashions a costume out of an old Santa Claus hat and a marching band cloak. Greg gives the tape to Sara's friends, who tell Wirt that he should hurry, because another boy, Jason Funderberker, was planning on asking her out at a party that night. Trying to retrieve the tape, they end up at the party. Wirt meets up with Sara, who invites him to go to the graveyard with her and her friends. He declines and tries to get the tape from her jacket. However, Sara comes back for it, leading Wirt and Greg to sneak after her and her friends.</p>At the graveyard, the group is telling ghost stories when Greg tries to cause a distraction for Wirt. A police car pulls up and jokingly tells them off for being in the graveyard, but they take him seriously and run off, with Wirt and Greg scaling a wall at the edge of the graveyard. At the top, Wirt notices Sara finding the tape in her jacket and he panics. They jump off the wall and onto a set of train tracks on the other side. Wirt blames Greg and his stepfather for ruining his life, but Greg pays no attention and picks up a frog in the bushes. A train comes down the tracks, heading straight for them. Wirt and Greg jump out of the way, but roll down a steep hill and into a lake, knocking them both unconscious. Wirt then wakes up after the events of the previous episode, and finds himself in a nest with Beatrice's family. He thanks them and heads off with Greg's frog into a <span class=\"mw-redirect\">snowstorm</span> to look for his brother.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The Unknown</span>\"</td><td style=\"text-align:center\">Natasha Allegri, Jim Campbell, and Tom Herpich</td><td style=\"text-align:center\">November 7, 2014</td><td style=\"text-align:center\">1.13</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #804060\"><p>After leaving Wirt with her family, Beatrice navigates through the storm to find Greg, who she sees performing meaningless tasks for the Beast. She is whisked away by the strong wind and crashes into Wirt, who was wandering in the storm holding Greg's frog, and leads him to where she last saw Greg. As the sun sets, having used up what little Edelwood he had left, the Woodsman ventures into the woods and finds Greg transforming into a new Edelwood tree. The Woodsman attempts to free Greg before fighting the Beast away from the clearing as Wirt and Beatrice arrive. He asks Wirt to return his \"rock fact\" rock that he stole from Mrs. Daniel's garden for him once he is gone, to which Wirt refuses, and decides to name Greg's frog \"Jason Funderburker\" to cheer him up as he tries to break the Edelwood branches off. Wirt then sees the Woodsman knocked down at his feet as the Beast appears, offering to keep Greg's soul alive inside the lantern in exchange for Wirt taking over the Woodsman's duties in keeping it lit. Wirt is tempted to accept this offer, but he realizes that the flame within the lantern is actually the Beast's own source of life.</p>After explaining this to everyone in the clearing, Wirt frees Greg and asks Beatrice to come with them. She declines, wanting to return home and admit to her family she is responsible for their curse. Wirt gives Beatrice Adelaide's magic scissors, sheepishly admitting he kept them from her out of spite. They head off as the Woodsman, mortified to learn that Edelwood trees grew from the bodies of the lost and that he had never been keeping his daughter alive, resists the Beast's lies and extinguishes the lantern, ending the Beast's life. After Wirt and Beatrice say their goodbyes, Wirt wakes up under the pond and pulls Greg and his frog to the surface, passing out as the police and his friends show up. The brothers are taken by ambulance to the hospital. Wirt wakes up next to Greg, Sara, and her friends. Sara tells Wirt that she had not listened to the tape yet, as she does not own a <span>cassette player</span>. Wirt offers for her to listen to it at his house, which she accepts. Greg starts telling everyone about the events they had experienced, and his frog's stomach glows with the magic bell still inside. Back in the Unknown, the Woodsman is sitting on his porch in melancholy when his daughter comes out of his home, having come back to life along with the other lost souls. The other Unknown residents are shown to be living happier lives as a result of Wirt and Greg's influence, including Beatrice and her family, who have been restored to human form. Greg's frog plays the piano and sings, and Greg returns the stolen rock back to Mrs. Daniel's garden.</td></tr></tbody></table><br/><h3>Broadcast</h3><p>McHale's original short, Tome of the Unknown, was screened at the 2014 Santa Barbara International Film Festival, where McHale earned the Bruce Corwin Award for best animated short film. It also received an honorable mention at the 2013 Ottawa International Animation Festival.</p><p>At the 2014 San Diego Comic-Con International, a preview of the show was screened along with various panels for other shows on the network. Episode 2 was previewed at the 2014 New York Comic Con, which McHale and the main cast attended. The show made its premiere on November 3, 2014 on Cartoon Network, and ran over five consecutive nights. The entirety of it was published on iTunes preceding its broadcast.</p><p>The series aired on Cartoon Network in Australia from December 15 to 19, 2014 and on Cartoon Network in the United Kingdom and Ireland from April 6 to 10, 2015.</p><br/><h3>Music</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Over the Garden Wall (Original Television Soundtrack)</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\">various artists</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">September 19, 2017</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Jazz</span>, <span>folk</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">53</span>:<span class=\"s\">13</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\">Cartoon Network</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\">The Blasting Company</td></tr></tbody></table><p>Various melodies and songs based on pre-1950s music are heard throughout the series. Elijah Wood, the voice actor for Wirt, has said that \"if this show were a record, it would be played on a phonograph\". Songs from the series include \"Into the Unknown\", its title song, composed by Patrick McHale and sung by Jack Jones; \"A Courting Song\", composed by the Petrojvic Blasting Company and performed by Frank Fairfield; and \"Come Wayward Souls\", sung by Samuel Ramey as the Beast.</p><p>The majority of the series' songs have been officially uploaded to YouTube. On the DVD release they can be heard, along with visuals and without dialogue, in a special feature known as the Composer's Cut. An extended version of the soundtrack, featuring 32 tracks and totaling around 44 minutes in length, was released in the form of a 180-gram vinyl record by Mondo in August 2016. The extended soundtrack debuted at the San Diego Comic-Con, with a limited 1,000 copies, featuring a cover designed by Sam Wolfe Connelly. The extended vinyl is also available as a webstore exclusive from Mondo.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Over the Garden Wall (Original Television Soundtrack)</i></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Prelude\"</td><td class=\"tracklist-length\">1:31</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Into the Unknown\"</td><td class=\"tracklist-length\">1:27</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"You Have Beautiful Eyes\"</td><td class=\"tracklist-length\">1:31</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Pottsfield C.M.\"</td><td class=\"tracklist-length\">1:30</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Patient is the Night\"</td><td class=\"tracklist-length\">1:27</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Adelaide Parade\"</td><td class=\"tracklist-length\">1:37</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Money for School\"</td><td class=\"tracklist-length\">1:15</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Ms. Langtree's Lament\"</td><td class=\"tracklist-length\">2:27</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Potatoes &amp; Molasses\"</td><td class=\"tracklist-length\">1:11</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Off to Bed\"</td><td class=\"tracklist-length\">1:05</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"The Beast is Out There\"</td><td class=\"tracklist-length\">0:45</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"The Highwayman\"</td><td class=\"tracklist-length\">0:31</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"A Courting Song\"</td><td class=\"tracklist-length\">1:20</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Endicott Manor\"</td><td class=\"tracklist-length\">1:02</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"The Journey Begins\"</td><td class=\"tracklist-length\">0:50</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Half-Moon River\"</td><td class=\"tracklist-length\">0:57</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"McLaughlin Bros. Jug Band\"</td><td class=\"tracklist-length\">0:40</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"Over the Garden Wall\"</td><td class=\"tracklist-length\">1:45</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"Send Me a Peach\"</td><td class=\"tracklist-length\">2:02</td></tr><tr><th id=\"track20\" scope=\"row\">20.</th><td>\"Adelaide's Trap\"</td><td class=\"tracklist-length\">2:11</td></tr><tr><th id=\"track21\" scope=\"row\">21.</th><td>\"Like Ships\"</td><td class=\"tracklist-length\">0:29</td></tr><tr><th id=\"track22\" scope=\"row\">22.</th><td>\"More Bones to Sort\"</td><td class=\"tracklist-length\">0:50</td></tr><tr><th id=\"track23\" scope=\"row\">23.</th><td>\"Old North Wind\"</td><td class=\"tracklist-length\">1:03</td></tr><tr><th id=\"track24\" scope=\"row\">24.</th><td>\"Forward, Oneiroi\"</td><td class=\"tracklist-length\">1:31</td></tr><tr><th id=\"track25\" scope=\"row\">25.</th><td>\"The Fight is Over\"</td><td class=\"tracklist-length\">1:17</td></tr><tr><th id=\"track26\" scope=\"row\">26.</th><td>\"Tiny Star\"</td><td class=\"tracklist-length\">1:42</td></tr><tr><th id=\"track27\" scope=\"row\">27.</th><td>\"Old Black Train\"</td><td class=\"tracklist-length\">2:13</td></tr><tr><th id=\"track28\" scope=\"row\">28.</th><td>\"The Old Mill\"</td><td class=\"tracklist-length\">1:24</td></tr><tr><th id=\"track29\" scope=\"row\">29.</th><td>\"Come Wayward Souls\"</td><td class=\"tracklist-length\">1:51</td></tr><tr><th id=\"track30\" scope=\"row\">30.</th><td>\"Potatus et Molassus\"</td><td class=\"tracklist-length\">2:18</td></tr><tr><th id=\"track31\" scope=\"row\">31.</th><td>\"One is a Bird\"</td><td class=\"tracklist-length\">1:40</td></tr><tr><th id=\"track32\" scope=\"row\">32.</th><td>\"Black Train / End Credits\"</td><td class=\"tracklist-length\">0:37</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>43:59</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Digital bonus tracks</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track33\" scope=\"row\">33.</th><td>\"The Clouded Annals of History\"</td><td class=\"tracklist-length\">0:34</td></tr><tr><th id=\"track34\" scope=\"row\">34.</th><td>\"Can't You See I'm Lonely\"</td><td class=\"tracklist-length\">1:19</td></tr><tr><th id=\"track35\" scope=\"row\">35.</th><td>\"Shine On\"</td><td class=\"tracklist-length\">2:18</td></tr><tr><th id=\"track36\" scope=\"row\">36.</th><td>\"Everything is Nice and Fine\"</td><td class=\"tracklist-length\">1:21</td></tr><tr><th id=\"track37\" scope=\"row\">37.</th><td>\"Halloween Halftime\"</td><td class=\"tracklist-length\">2:17</td></tr><tr><th id=\"track38\" scope=\"row\">38.</th><td>\"Two Old Cat\"</td><td class=\"tracklist-length\">0:56</td></tr><tr><th id=\"track39\" scope=\"row\">39.</th><td>\"The Jolly Woodsman\"</td><td class=\"tracklist-length\">0:48</td></tr><tr><th id=\"track40\" scope=\"row\">40.</th><td>\"Tome of the Unknown\"</td><td class=\"tracklist-length\">0:16</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>53:48</td></tr></tbody></table><p>In September 2015, Mondo released an audio cassette tape titled \"For Sara\", based on the cassette tape labelled with the same name seen in the series. The cassette features over twenty minutes of poetry spoken by Elijah Wood (in character as Wirt) and music performed by the Blasting Company. In September 2017, Mondo released the cassette a second time, with the subtitle \"(Back-Up Master)\".</p><br/><h3>Home media</h3><p>Over the Garden Wall (with the short film Tome of the Unknown) was released on DVD in Australia on July 8, 2015 by Cartoon Network and Madman Entertainment and by Cartoon Network and its sister company Warner Home Video on September 8, 2015, in the United States. The DVD features all ten episodes of the show, commentaries, the original pilot, alternate title cards, and deleted animatics. Other extras on the DVD include a \"Composer's Cut,\" an option wherein a viewer can watch the show with only the visuals and the background music; and the mini-documentary Behind Over the Garden Wall.</p><p>On April 6, 2016, Madman Entertainment released the miniseries on Blu-ray exclusively in Australia and New Zealand with the same bonus content as the DVD release. On March 2, 2020, Manga Entertainment released it in the UK on Blu-Ray and DVD.</p><br/><h3>Reception</h3><h4>Critical reception</h4><p>Over the Garden Wall was critically acclaimed. On review aggregator Rotten Tomatoes, the series has an approval rating of 93% based on 15 reviews, with an average rating of 8.60/10. The website's critics consensus reads, \"Over the Garden Wall's modern sensibilities mix well with its fairy-tale setting, creating a whimsically witty series for viewers of all ages.\"</p><p>Preceding its premiere, Patrick Kevin Day of the Los Angeles Times called it \"funny, creepy\" and, from the premise, \"not as simple as it sounds\". In TV Guide and also before the premiere, Megan Walsh-Boyle felt that the show's fictional universe \"sounds like a world worth getting lost in\".: 24 Meredith Woerner of io9 called a preview of the show \"amazing\", \"weird, and cute and great\", reflecting \"all the things we love about this oddball animation renaissance we are currently living in\". Conversely, Amid Amidi of Cartoon Brew judged from the same preview that the animation was lacking. While not discounting its storytelling, music, and production design, he felt that production skimped on animation; he was still looking forward to the series.</p><p>Robert Lloyd of the Los Angeles Times wrote that it was \"a little too folksy and fairy story\" at times, but that its \"contemporary strangeness wins out\", and concluded that \"it is throughout something to behold\". Lloyd later wrote that it evoked \"a kind of artisanal quality\", both in its design and setting, and though the writing felt \"a little too intent on its own folksiness\", it became more enjoyable throughout. In The New York Times, Mike Hale also felt the writing was sometimes weak and the stories \"perilously thin\", but concluded that McHale developed an environment worth visiting.</p><p>Brian Moylan of The Guardian wrote that the visuals were \"absolutely stunning\", and that the stories contained \"a certain darkness to it that is both mellow and twee at the same time, with a fair amount of anxiety creeping around the edges\". Brian Lowry of Variety wrote that Garden Wall was \"an admirable experiment\", but not one to sustain \"the five-night commitment\", calling it \"slightly mismatched\" while praising a departure from \"the more abrasive characteristic\" of the network's primetime content. Kevin McDonough of the Illinois Daily Journal criticized some of the writing, but summed it up as \"an ambitious cartoon\" for both younger and older audiences. Jason Bree of the website Agents of Geek called the miniseries \"the greatest thing Cartoon Network has ever produced\". Kevin Johnson of The A.V. Club praised the series, giving it a grade of \"A\" and writing that \"with such a perfect blend of mood, atmosphere, story, and characterization, Over the Garden Wall's 10-episode run will leave you wanting more, but like every great fairy tale, it's a story that knows when it's over.\"</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><style data-mw-deduplicate=\"TemplateStyles:r1152813436\">.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);clip-path:polygon(0px 0px,0px 0px,0px 0px);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px;white-space:nowrap}</style><span class=\"sr-only\">Awards and nominations received by Over the Garden Wall</span></caption><tbody><tr><th scope=\"col\">Year</th><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Nominee</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference(s)\">Ref.</abbr></th></tr><tr><th scope=\"row\" rowspan=\"6\">2015</th><td rowspan=\"2\"><span class=\"mw-redirect\">Annie Award</span></td><td><span>Best Animated TV/Broadcast Production for Children's Audience</span></td><td><i>Over the Garden Wall</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\" rowspan=\"2\"></td></tr><tr><td>Outstanding Achievement, Directing in an Animated TV/Broadcast Production</td><td><span>Robert Alvarez</span>, Ken Bruce, and <span>Larry Leichliter</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Reuben Award</span></td><td>TV Animation</td><td>Patrick McHale</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\"><span>Primetime Creative Arts Emmy</span></td><td><span>Outstanding Animated Program</span></td><td><i>Over the Garden Wall</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td>Outstanding Individual Achievement in Animation</td><td><span>Nick Cross</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Ottawa International Animation Festival</span></td><td>Best Animated Feature</td><td><i>Over the Garden Wall</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\">2016</th><td><span>Teen Choice Award</span></td><td><span>Choice TV Show: Animated</span></td><td><i>Over the Garden Wall</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr></tbody></table><br/><h3>Comic book adaptation</h3><p>A one-shot comic book adaptation of the show was announced in October 2014. Produced by KaBoom!, an imprint of Boom! Studios, the comic was released on November 5, 2014. The comic was supervised by McHale and was produced as an oversized special. The comic was illustrated by Jim Campbell, a writer/storyboard artist on the television series. A special variant cover, by McHale, was also released. The success of the standalone comic led to further issues being commissioned in May 2015 and began to be released in August 2015. According to McHale, the comic books would be similar to the one-shot comic, detailing the events that occurred in between certain episodes and would expand on the television miniseries. The success of the series of one-shots led to an ongoing series of comics, serving as both a sequel and prequel to the series, rather than telling adventures that happened between episodes. The stories are told parallel, with half the comic detailing Greg returning to mysterious dreamlands in his sleep. The other half chronicles the Woodsman's daughter, Anna, and how she became lost in the Unknown. After the ongoing series ended in November 2017, the Over the Garden Wall comics continued as a series of miniseries and original graphic novels.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Title</th><th>Issue</th><th>Release Date</th><th>Story</th><th>Art</th><th>Collection</th></tr><tr><td colspan=\"6\" style=\"background:#bc4026\"></td></tr><tr><td><i>Over the Garden Wall</i><br>(special)</td><td>#1</td><td>Nov. 5, 2014</td><td>Pat McHale</td><td>Jim Campbell</td><td rowspan=\"6\"><i>Tome of the Unknown</i><br>Trade paperback<br><style data-mw-deduplicate=\"TemplateStyles:r1133582631\">.mw-parser-output cite.citation{font-style:inherit;word-wrap:break-word}.mw-parser-output .citation q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output .citation:target{background-color:rgba(0,127,255,0.133)}.mw-parser-output .id-lock-free a,.mw-parser-output .citation .cs1-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/6/65/Lock-green.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-limited a,.mw-parser-output .id-lock-registration a,.mw-parser-output .citation .cs1-lock-limited a,.mw-parser-output .citation .cs1-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/d/d6/Lock-gray-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-subscription a,.mw-parser-output .citation .cs1-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/a/aa/Lock-red-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/4/4c/Wikisource-logo.svg\")right 0.1em center/12px no-repeat}.mw-parser-output .cs1-code{color:inherit;background:inherit;border:none;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;color:#d33}.mw-parser-output .cs1-visible-error{color:#d33}.mw-parser-output .cs1-maint{display:none;color:#3a3;margin-left:0.3em}.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right{padding-right:0.2em}.mw-parser-output .citation .mw-selflink{font-weight:inherit}</style><span>9781608868360</span></td></tr><tr><td colspan=\"5\" style=\"background:#bc4026\"></td></tr><tr><td rowspan=\"4\"><i>Over the Garden Wall</i><br>(miniseries)</td><td>#1</td><td>Aug. 26, 2015</td><td rowspan=\"4\">Pat McHale</td><td rowspan=\"4\">Jim Campbell</td></tr><tr><td>#2</td><td>Sep. 23, 2015</td></tr><tr><td>#3</td><td>Oct. 28, 2015</td></tr><tr><td>#4</td><td>Nov. 25, 2015</td></tr><tr><td colspan=\"6\" style=\"background:#bc4026\"></td></tr><tr><td rowspan=\"24\"><i>Over the Garden Wall</i><br>(ongoing series)</td><td>#1</td><td>Apr. 27, 2016</td><td rowspan=\"4\">Jim Campbell<br>Amalia Levari</td><td rowspan=\"4\">Jim Campbell<br>Cara McGee</td><td rowspan=\"4\"><i>Volume 1</i><br>Trade paperback<br><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>9781608869404</span></td></tr><tr><td>#2</td><td>May 25, 2016</td></tr><tr><td>#3</td><td>Jun. 22, 2016</td></tr><tr><td>#4</td><td>Jul. 27, 2016</td></tr><tr><td colspan=\"5\" style=\"background:#bc4026\"></td></tr><tr><td>#5</td><td>Aug. 24, 2016</td><td colspan=\"2\">George Mager</td><td rowspan=\"4\"><i>Volume 2</i><br>Trade paperback<br><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>9781684150069</span></td></tr><tr><td>#6</td><td>Sep. 28, 2016</td><td rowspan=\"3\">Jim Campbell<br>Amalia Levari</td><td rowspan=\"3\">Jim Campbell<br>Cara McGee</td></tr><tr><td>#7</td><td>Oct. 26, 2016</td></tr><tr><td>#8</td><td>Nov. 23, 2016</td></tr><tr><td colspan=\"5\" style=\"background:#bc4026\"></td></tr><tr><td>#9</td><td>Dec. 28, 2016</td><td rowspan=\"3\">Danielle Burgos<br>Kiernan Sjursen-Lien</td><td rowspan=\"3\">Jim Campbell<br>Cara McGee</td><td rowspan=\"4\"><i>Volume 3</i><br>Trade paperback<br><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>9781684150601</span></td></tr><tr><td>#10</td><td>Jan. 25, 2017</td></tr><tr><td>#11</td><td>Feb. 22, 2017</td></tr><tr><td>#12</td><td>Apr. 5, 2017</td><td colspan=\"2\">George Mager</td></tr><tr><td colspan=\"5\" style=\"background:#bc4026\"></td></tr><tr><td>#13</td><td>May 10, 2017</td><td rowspan=\"2\">Danielle Burgos<br>Kiernan Sjursen-Lien</td><td rowspan=\"2\">James Campbell<br>Kiernan Sjursen-Lien</td><td rowspan=\"4\"><i>Volume 4</i><br>Trade paperback<br><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>9781684151851</span></td></tr><tr><td>#14</td><td>May 31, 2017</td></tr><tr><td>#15</td><td>Jun. 28, 2017</td><td>Danielle Burgos<br>Kiernan Sjursen-Lien</td><td>James Campbell<br>Cara McGee</td></tr><tr><td>#16</td><td>Jul. 26, 2017</td><td>George Mager</td><td>Kiernan Sjursen-Lien</td></tr><tr><td colspan=\"5\" style=\"background:#bc4026\"></td></tr><tr><td>#17</td><td>Aug. 23, 2017</td><td colspan=\"2\" rowspan=\"3\">Kiernan Sjursen-Lien</td><td rowspan=\"4\"><i>Volume 5</i><br>Trade paperback<br><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>9781684152421</span></td></tr><tr><td>#18</td><td>Sep. 27, 2017</td></tr><tr><td>#19</td><td>Oct. 25, 2017</td></tr><tr><td>#20</td><td>Nov. 15, 2017</td><td>Kiernan Sjursen-Lien</td><td>Jim Campbell</td></tr><tr><td colspan=\"6\" style=\"background:#bc4026\"></td></tr><tr><td rowspan=\"5\"><i>Over the Garden Wall:<br>Hollow Town</i></td><td>#1</td><td>Sep. 19, 2018</td><td rowspan=\"5\">Celia Lowenthal</td><td rowspan=\"5\">Jorge Monlongo</td><td rowspan=\"5\">Trade paperback<br><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>9781684153831</span></td></tr><tr><td>#2</td><td>Oct. 24, 2018</td></tr><tr><td>#3</td><td>Nov. 28, 2018</td></tr><tr><td>#4</td><td>Dec. 19, 2018</td></tr><tr><td>#5</td><td>Jan. 23, 2019</td></tr><tr><td colspan=\"6\" style=\"background:#bc4026\"></td></tr><tr><td colspan=\"2\"><i>Over the Garden Wall:<br>Distillatoria</i></td><td>Nov. 21, 2018</td><td>Jonathan Case</td><td>Jim Campbell</td><td>Original graphic novel<br><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>9781684152681</span></td></tr><tr><td colspan=\"2\"><i>Over the Garden Wall:<br>Circus Friends</i></td><td>Oct. 2, 2019</td><td>Jonathan Case</td><td>John Golden</td><td>Original graphic novel</td></tr><tr><td colspan=\"2\"><i>Over the Garden Wall:<br>The Benevolent Sisters of Charity</i></td><td>Oct. 21, 2020</td><td>Sam Johns</td><td>Jim Campbell</td><td>Original graphic novel</td></tr><tr><td colspan=\"6\" style=\"background:#bc4026\"></td></tr><tr><td rowspan=\"5\"><i>Over the Garden Wall:<br>Soulful Symphonies</i><br>(miniseries)</td><td>#1</td><td>Aug. 7, 2019</td><td rowspan=\"5\">Birdie Willis</td><td rowspan=\"5\">Rowan MacColl</td><td rowspan=\"5\">Trade paperback</td></tr><tr><td>#2</td><td>Sep. 4, 2019</td></tr><tr><td>#3</td><td>Oct. 2, 2019</td></tr><tr><td>#4</td><td>Nov. 6, 2019</td></tr><tr><td>#5</td><td>Dec. 4, 2019</td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}