{
  "imDbId": "tt3530232",
  "title": "Last Week Tonight with John Oliver",
  "fullTitle": "Last Week Tonight with John Oliver (TV Series 2014– )",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "blowfly13",
      "userUrl": "https://www.imdb.com/user/ur15802681",
      "reviewLink": "https://www.imdb.com/review/rw3028565",
      "warningSpoilers": false,
      "date": "4 June 2014",
      "rate": "10",
      "helpful": "157 out of 240 found this helpful.",
      "title": "intelligent, fair, and hilarious",
      "content": "Loved John Oliver on Community and love him on this show. He's intelligent and sarcastic, and somehow manages to make topics that are completely horrific (e.g., the U.S. government's actions) not thoroughly depressing. I love how he will make fun of ANY political party; so many shows just spend their time panning Republicans, losing half the country as a result. Oliver must be a libertarian, because he very fairly simply makes fun of anyone who is doing something stupid, regardless of political affiliation. This is something that cannot be said of the unbearable John Stewart, or SNL, for example, but can be said of the awesome Lewis Black as well.I also like his way of poking fun at the U.S. - it's not condescending or rude, it's just good humored teasing. The segment in which he shows the globe with countries marked as Not the U.S. is priceless.Oliver's topics are well chosen, and his take on them is unique. I greatly hope HBO will continue this show as it's the best comedy late night hosted whatever genre you call this currently on TV."
    },
    {
      "username": "cherold",
      "userUrl": "https://www.imdb.com/user/ur0011762",
      "reviewLink": "https://www.imdb.com/review/rw7125916",
      "warningSpoilers": false,
      "date": "15 July 2021",
      "rate": "9",
      "helpful": "27 out of 43 found this helpful.",
      "title": "So much more than the Daily Show clone it started out as",
      "content": "The first few weeks of Last Week Tonight, it was pretty much The Daily Show on HBO. Which was fine; it was funny and smart and you can never get too much of that.But then the show began to find itself, dropping the interviews and devoting itself primarily to long pieces that are funny and insightful and often represent the best commentary on a particular subject, like their take on Ferguson and the militarization of the police, which was brilliant both as comedy and as advocacy.I'm not sure how much good the advocacy does - the audience for this show probably goes in agreeing with Oliver - but it's nice to see something both so smart and so entertaining."
    },
    {
      "username": "rmassey21",
      "userUrl": "https://www.imdb.com/user/ur17153189",
      "reviewLink": "https://www.imdb.com/review/rw7965466",
      "warningSpoilers": false,
      "date": "15 March 2022",
      "rate": "10",
      "helpful": "22 out of 31 found this helpful.",
      "title": "He is the spoonful of sugar",
      "content": "I, unfortunately, pay attention to the news and constantly have to pause and breath and calm down. This show makes it easier to hear the news of the week and be pissed but also not let it completely break my spirit."
    },
    {
      "username": "angelorwez",
      "userUrl": "https://www.imdb.com/user/ur150272282",
      "reviewLink": "https://www.imdb.com/review/rw8106505",
      "warningSpoilers": false,
      "date": "1 May 2022",
      "rate": "9",
      "helpful": "17 out of 25 found this helpful.",
      "title": "phenomenal",
      "content": "While it is true that later episodes have kind of lost the vigour the umpf the magic touch the wow factor of the earlier seasons...it doesn't take anything away from it...John is funny...lovable and very effective...you wanna laugh at what he says but you also feel the weight of it...he has done this comedy info-tainment wonderfullythis one is a classic and will be the reference point for other shows like this."
    },
    {
      "username": "ikata-49417",
      "userUrl": "https://www.imdb.com/user/ur131993380",
      "reviewLink": "https://www.imdb.com/review/rw7928652",
      "warningSpoilers": false,
      "date": "7 March 2022",
      "rate": "7",
      "helpful": "15 out of 21 found this helpful.",
      "title": "I never miss an episode",
      "content": "This is the best comedy on TV. I appreciate how they take an in-depth look at the week's topic. Also, I enjoy John's sense of humor. He's funnier on this show than back when he was on TDS. The only part of the show I don't care for is the \"And Now This\" segment. It's annoying listening to people repeat the same phrase over and over. I get the point he's making with it, but still, it's annoying. Yep, \"And Now This\" is annoying."
    },
    {
      "username": "meltinzone",
      "userUrl": "https://www.imdb.com/user/ur23617721",
      "reviewLink": "https://www.imdb.com/review/rw3015120",
      "warningSpoilers": false,
      "date": "12 May 2014",
      "rate": "10",
      "helpful": "122 out of 193 found this helpful.",
      "title": "Weekly awesome energy infused injection of peace and discussion!",
      "content": "The insane level of awesome energy John Oliver feeds the viewer can almost be felt! John cuts through the bullshit and touches on real news.There's something about this show that I really genuinely like (and I'm an Australian). Perhaps it's the way most of us would like to already live in a world that does good and makes fun of the stupid and absurd, a bit like Japan perhaps!? Well John Oliver has us covered. Each week a much needed hit of vitality and rejuvenation gets subtly unveiled, then straight up sucker punched to us.The views on issues are sublime, as though John has been on our planet in a future time of peace, then come back to help lube us all through the hole we're already headed for, the peace hole. The energy and views on the show are just like a pick me up to make us go a tiny bit faster.I've just watched episode 3 and that episode alone sums up the type of people, media and just the general positive peaceful way I'd like to see humanity head.10/10 for the sole fact we need to take a look at ourselves in a mirror and thankfully John Oliver's right there, holding up the mirror for us! If you enjoyed Chasers War On Everything, Newsroom, Real Time with Bill Maher or a slew of other 'younger trend news~ish' shows, I'd say this is well worth a look!"
    },
    {
      "username": "Flattered_Flatulated",
      "userUrl": "https://www.imdb.com/user/ur28207382",
      "reviewLink": "https://www.imdb.com/review/rw3016549",
      "warningSpoilers": false,
      "date": "15 May 2014",
      "rate": "9",
      "helpful": "136 out of 199 found this helpful.",
      "title": "Takes a Brit to bring US TV some wit",
      "content": "No great offense meant to U.S TV, but most of its shows with hosts trying to make some fun of the recent affairs, politicians and all that jazz are usually crappy and saved by the \"bring a funny and/or weird celebrity\" bell. Of course, \"The Colbert Report\" and a few bits of the \"Daily Show\" are exceptions, but overall one must admit that even these don't really dwell too long in deep waters (meaning grave issues of major concern) like \"Last Week Tonight\" does. A couple of examples of serious satire from the first episodes are the death penalty, the hypocritical stance of politicians towards people like the Sultan of Brunei or even the fun'n'serious interview of the ex-chief of the NSA. The fact alone that such significant and highly debatable subjects are discussed is a huge win for the show. The end result airing on HBO, comes as no surprise to me. Their only commitment I have seen so far show-wise, is quality and creativity, two traits this show seems to possess.I am taken in by the first three episodes and honestly believe that this show has the potential to stimulate the brain and instigate belly-aching laughs at the same time. Hopefully, the creators will not take steps back, when possible pressure to \"lighten\" their material may arise - if and when a lot of people start watching the show. {Quick note to those who may feel offended by the approach John Oliver has on the ignorance of some people from the States, when it comes to the rest of the world: If you know your way around a world map and have an idea of what is happening elsewhere in this vast place called Earth, lay back and enjoy the sarcasm. If you can't do that, take the bitter pill.}"
    },
    {
      "username": "briancham1994",
      "userUrl": "https://www.imdb.com/user/ur5788055",
      "reviewLink": "https://www.imdb.com/review/rw5795913",
      "warningSpoilers": false,
      "date": "3 June 2020",
      "rate": "9",
      "helpful": "22 out of 36 found this helpful.",
      "title": "Much needed infotainment",
      "content": "John Oliver uses his biting humour to bring light to important issues and events. His style involves a lot of mockery and rude jokes that alienated me a bit, but overall his incisiveness led me to want more."
    },
    {
      "username": "CarmaChan",
      "userUrl": "https://www.imdb.com/user/ur17802863",
      "reviewLink": "https://www.imdb.com/review/rw3032655",
      "warningSpoilers": false,
      "date": "12 June 2014",
      "rate": "10",
      "helpful": "86 out of 152 found this helpful.",
      "title": "More rare than a lamb chop in Hell's Kitchen",
      "content": "After the season finale of Game of Thrones, Veep, and Silicon Valley (whichever comes last), I was going to cancel my subscription to HBO. Now comes Last Week Tonight with John Oliver, and I'm in a quandary. The history of television and big belly laughs for me is a rare combination. The best sitcoms every have mostly merely amused me. Laughing out loud so hard I can't stop and I have to get online and tell my friends to add this to their watch list is more rare than a lamb chop in Hell's Kitchen. John Oliver made The Daily Show funnier. It's great to see talent like that finally get its due share of hate mail.So now, what to do... cancel HBO and pay $1.99 per episode to watch it on Roku? Yeah, that's how frugal I can be. But can I wait 24 hours for that kind of laughter? Therein lies the quandary.I must take a moment to thank John Oliver and his creative team. Laughter is the best medicine. You're saving the planet--perhaps the multiverse. Boredom is hell. Torture is preferable to boredom. At least torture is something. So thank Fox for 24 hours of torture. But boredom will kill you to death. I didn't know what I was going to do after Dexter ended. Being Human relieves me for a few months, then it's agony. Hannibal comes along and I'm mesmerized for a few months, then I have to wait like a pregnant woman for the next amazing moment. OK, I admit, Wednesday nights in the summer are delicious because of the people who think they can dance. But you, sir, you are the kind of jester who comes along once in the history of an empire, and where would we be without you? Perish the thought."
    },
    {
      "username": "hasansevik",
      "userUrl": "https://www.imdb.com/user/ur62924340",
      "reviewLink": "https://www.imdb.com/review/rw7721055",
      "warningSpoilers": false,
      "date": "4 January 2022",
      "rate": "9",
      "helpful": "23 out of 36 found this helpful.",
      "title": "Love the \"I used to like it, but...\" reviews.",
      "content": "Especially because most of those reviews, conveniently mostly post-2016, will say things like 'He used to be balanced but now it's leftist/woke/agenda-driven. I've watched every episode of this show and it's ALWAYS been left-leaning. Social justice, pro-healthcare, anti-gun... That's what the US needs to hear specifically because the US is none of those things at the moment. Don't pretend that people like John Oliver used to represent everyone equally and then suddenly went Left. That's like suggesting that Tucker Carlson used to be more Centre and then suddenly, out of nowhere, he's become Right, when he's always been Right.In saying that, I love that he provokes conversation and forces audiences to think beyond just the acceptable alternatives. Rather than increase funding in this, why not scrap it entirely and go with that instead? Sure, some will watch it and think, \"Nup, that's going too far\" or \"That's so un-American\" or even \"He's pandering to this group or that ideal\", but sometimes Americans need to hear those extreme views, especially when their own leaders are happy to implement even more extreme measures (like locking up kids because of their skin colour, building a wall much like the Berlin Wall, and labelling all Mexicans as \"rapists and murders...and some, I assume, are good people\").I, for one, love that John is willing to push his views so far that it'll piss many people off, because, if nothing else, it starts a conversation. Since the US has seen absolutely no major social, political or financial reform in the last 50 years, the country needs to be shoved out of its racist, elitist apathy and shaken vigorously until actual change becomes part of the conversation."
    },
    {
      "username": "sese19",
      "userUrl": "https://www.imdb.com/user/ur38229078",
      "reviewLink": "https://www.imdb.com/review/rw6826886",
      "warningSpoilers": false,
      "date": "18 April 2021",
      "rate": "10",
      "helpful": "19 out of 29 found this helpful.",
      "title": "Great show with intelligence and humor",
      "content": "This show is a rare gem; it talks about problems of the world - not necessarily the biggest problems, although sometimes it tells commonly known issues that affect so many people -, it's sarcastic and very funny. John Oliver is a great comedian and an amazing presenter, he performed very well during the pandemic as well although he had to do the show from his 'void' without audience or staff members. Although I'm not from US, I find the presentation of topics related to US issues interesting as well, but my favorites are the episodes dealing with international problems. I also respect the producers and John Oliver because of crazy things they do to respond to corrupt people or authoritarians. It deserves all Emmys it got."
    },
    {
      "username": "greg-goremykin",
      "userUrl": "https://www.imdb.com/user/ur36802151",
      "reviewLink": "https://www.imdb.com/review/rw8415504",
      "warningSpoilers": false,
      "date": "8 August 2022",
      "rate": "10",
      "helpful": "17 out of 27 found this helpful.",
      "title": "Wow!",
      "content": "I don't know if I've ever reviewed a show, I don't think I have (my late wife and I shared this account). I've watched this show sporadically but as I've become both more culturally and politically aware I've grown to adore this show, the highlight with delight was his just skewering of Alex Jones, a pure parasite not caring what he hath wrought with his hate-filled speech, not even believing his own rhetoric. I'm seeing the potential, both for ill like Tucker Carlson (who God-forbid but I fear may be POTUS someday), and a brilliantly intelligent and insightful presenter and writer like Mr. Oliver is such a deep contrast, and to someone who doesn't follow the news much I'm awake now to the possibilities and incredible power one media star holds. This show gets a 10/10 for me, we need many more like it. <3."
    },
    {
      "username": "RainbowVic",
      "userUrl": "https://www.imdb.com/user/ur70522550",
      "reviewLink": "https://www.imdb.com/review/rw8191512",
      "warningSpoilers": false,
      "date": "31 May 2022",
      "rate": "10",
      "helpful": "14 out of 23 found this helpful.",
      "title": "Sadly on point",
      "content": "This show is such a silly, silly, guilty pleasure. Funny and good vibes but also very sadly on point. The segments are all the key of all the show. Anger, fun and comedy in all one show."
    },
    {
      "username": "ambros-710-460987",
      "userUrl": "https://www.imdb.com/user/ur44196840",
      "reviewLink": "https://www.imdb.com/review/rw8853967",
      "warningSpoilers": false,
      "date": "5 February 2023",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "If there is a show with a 10,0 rating, here it is",
      "content": "There is just one thing that bothers me. The availability, especially globally. Here in Germany you just can see the shortened and censored episodes on youtube and that sucks.This show is high end history education with intellectual entertainment, so it should be upped to some free accessable media servers that teachers can use this in school/university.Everything else is just perfect. Sure, USA and Britain have more topics than Germany, but weirdly those German stories mentioned were mostly ignored here, so there is even in this sector real news for the viewer.Thanks a lot to Mr. Oliver, HBO and the brilliant team of authors. Awesome."
    },
    {
      "username": "suspect20",
      "userUrl": "https://www.imdb.com/user/ur23497196",
      "reviewLink": "https://www.imdb.com/review/rw8386632",
      "warningSpoilers": false,
      "date": "31 July 2022",
      "rate": "9",
      "helpful": "15 out of 22 found this helpful.",
      "title": "Welcome welcome... welcome",
      "content": "It's hard to listen to those words he uses at the beginning of each show and not smile, and that's hard to do late on a Sunday night. He breaks down a lot of thick complicated issues and somehow makes it entertaining. The only reason I can't give it a 10 is because sometimes the musical bits he does at the end of a lot of shows just seems like it's trying to hard."
    },
    {
      "username": "rzajac",
      "userUrl": "https://www.imdb.com/user/ur1517556",
      "reviewLink": "https://www.imdb.com/review/rw3050082",
      "warningSpoilers": false,
      "date": "14 July 2014",
      "rate": "10",
      "helpful": "45 out of 100 found this helpful.",
      "title": "Verrry innaresting development in the progressive comedy news ecosphere",
      "content": "I think the most important way to describe the emergence of Last Week Tonight (LWT) is to characterize how it alters the progressive comedy news ecosystem.Here's my take, in a nutshell: The Daily Show (TDS) and The Colbert Report (TCR) do what they do and do it fairly well... and yet, LWT shows that a niche remains, and it can be summed up in these two points: 1) LWT shows that it's possible to dispense with the pop culture marketing accretion disk that has come to sort of weigh down TDS. I'm referring to the fact that, a) tho he still can \"bite\", Jon has become noticeably saddled with too much \"lite\" content--occasional bits involving current events that really don't have much relevance to the concerns of progressive political folk, and b) the occasional kowtow to absolute dawg flicks of Hollywood \"hot properties\". Oliver shows that you can resolutely dispense with this and still be total laff riot! He has put the lie to the assumptions of the suits that inflict their marketing-think on TDS.And, 2) Oliver has put a fresh and long-overdue \"world news\" spin on the structure of his show. In fact (am I hallucinating?), it appears that TDS has, of late, responded to Oliver's spin, and has been injecting a little more global perspective into his content... too little, too late?Note that I haven't mentioned TCR; and that's because, relatively speaking, it inhabits a separate space from both TDS and LWT.Anyway, the crux, from my perspective, is that it appears Oliver found that \"grail\"; a portal to another media political content space which is exciting, while amazingly failing to be redundant! A tall order, but he fills it!Add to this the arguable assessment that, while his first few episodes seemed to be struggling to get airborne, it's safe to say he is now properly aloft. Congrats! As long as Oliver keeps running as fast as he can to stay in one place (a la Carroll; and apologies for the mixed metaphor), he should continue to deliver a quality product."
    },
    {
      "username": "kidmusic-54542",
      "userUrl": "https://www.imdb.com/user/ur105563003",
      "reviewLink": "https://www.imdb.com/review/rw8028182",
      "warningSpoilers": false,
      "date": "2 April 2022",
      "rate": "10",
      "helpful": "23 out of 40 found this helpful.",
      "title": "If the facts are against your views, you have the wrong views",
      "content": "Sure, call it biased but he has all his sources listed, you can fact check it yourself. Far more than Faux News could say. The usage of humour is brilliant and the perfect amount and the show is very educational. Should be required viewing for all."
    },
    {
      "username": "nicole_graham-13840",
      "userUrl": "https://www.imdb.com/user/ur96778661",
      "reviewLink": "https://www.imdb.com/review/rw5494104",
      "warningSpoilers": false,
      "date": "18 February 2020",
      "rate": "10",
      "helpful": "14 out of 22 found this helpful.",
      "title": "Love this show",
      "content": "I've been endlessly entertained for the last seven years, but I've also been educated. No, I don't trust everything John says. But I do prefer the comedic twist on introducing me to topics I never knew about and really should have than the normal angry anchor fear mongering at me. I will watch this show until it one day sadly ends."
    },
    {
      "username": "breeanalaine",
      "userUrl": "https://www.imdb.com/user/ur132439710",
      "reviewLink": "https://www.imdb.com/review/rw6935725",
      "warningSpoilers": false,
      "date": "17 May 2021",
      "rate": "10",
      "helpful": "15 out of 25 found this helpful.",
      "title": "Consistently the best",
      "content": "John Oliver is consistently the best in his field. If I had one complaint it's that he takes a lot of weeks off, but you know what, he deserves it."
    },
    {
      "username": "hasansevik",
      "userUrl": "https://www.imdb.com/user/ur62924340",
      "reviewLink": "https://www.imdb.com/review/rw5138308",
      "warningSpoilers": false,
      "date": "23 September 2019",
      "rate": "9",
      "helpful": "20 out of 38 found this helpful.",
      "title": "Thank Jebus for John Oliver",
      "content": "I know a lot of the lower ratings are from people complaining about the show being too \"left-wing\" or anti-Trump, so here's my take on that: there are currently a grand total of ZERO news-related that are completely apolotical. Some are far right, some far left, and some are varying degrees of right or left while pretending to be neutral.I watch this show because it appeals to my sensibility while providing intelligent insights into subjects I'm otherwise unfamiliar with. Conversely, I don't watch Fox and Friends because their views disagree with mine. However, I'd be a hypocrite if I searched for that show on this site just to give it a low score because it doesn't appeal to my viewpoints.Enjoy what you enjoy."
    },
    {
      "username": "djzisumbo-652-811293",
      "userUrl": "https://www.imdb.com/user/ur42440436",
      "reviewLink": "https://www.imdb.com/review/rw4969803",
      "warningSpoilers": false,
      "date": "1 July 2019",
      "rate": "10",
      "helpful": "18 out of 31 found this helpful.",
      "title": "Totally thinking outside the box",
      "content": "Love how he exposes, explain and dares to talk about issues that need to be heard."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw3567413",
      "warningSpoilers": false,
      "date": "23 October 2016",
      "rate": "9",
      "helpful": "18 out of 39 found this helpful.",
      "title": "This show cracks me up",
      "content": "John Oliver's show is one in which he intersperses current events with comedy. And to keep your audience laughing while looking at such events today is quite a feat. I've only been familiar with Oliver and his show since March of 2016, so I didn't know about the kerfuffle raised when he was not picked to host The Daily Show after Jon Stewart left. However, I think things turned out for the best because John in a weekly show where he gets to go deeper on issues is probably more useful and funnier than John only getting a monologue and a few one liners in on a nightly show.John rarely has guests of any kind, so he has to be imaginative in his main segment or he risks getting preachy, which usually just consists of John talking to the audience with clips to illustrate the point he is making. Oliver always maintains a sense of humor even when he is discussing some of the more heinous institutions of American life such as the concept of medical debt and medical debt collections. He doesn't sport a condescending smile but rather a \"isn't it ridiculous that we do things this way\" smile. He is quite unpretentious, describing himself as a \"rat faced Brit\" and his show as \"a petting zoo with a desk\".Since I only started watching the show since 2016, John has been blessed with having Donald J. Trump as an unfortunate wealth of comic material. So far in the 15-18 months I have been watching the show, John has highlighted some really oddball third party presidential candidates in 2016, and in the most recent season he transformed his desk into a French Bistro to explain to the French people in their own tongue - while smoking! - why they should not vote for far right wing candidate Marine Le Pen, given a new train set to a local news show in Scranton - John is somewhat obsessed with local US news programs, and traveled to Pennsylvania to buy five wax figures of presidents from a presidential wax museum that was closing, one of them being Warren G. Harding. He then proceeded to show a trailer of a movie entitled \"Harding\" that could be made if one had access to a wax figure of the president, which his show did. It was actually the only trailer I've seen in the past two years that made me want to buy a movie ticket - and the film doesn't even exist! Highly recommended if you want to see some horrifying things about American political and economic trends that you will definitely not see on the 24 hour news cycle, and get some creative laughs to somewhat counteract that horror. Highly recommended."
    },
    {
      "username": "promind",
      "userUrl": "https://www.imdb.com/user/ur16472496",
      "reviewLink": "https://www.imdb.com/review/rw5617838",
      "warningSpoilers": false,
      "date": "7 April 2020",
      "rate": "10",
      "helpful": "14 out of 22 found this helpful.",
      "title": "Exceptional genius",
      "content": "I've never missed a show and I miss it when the season ends. With every new show, John Oliver proves his intelligence, stylishness and talent. He leaves me speechless how many deficiencies he finds in our society that are not on the front page, but still it is sad that they exist. He seems the only person noticing and caring about everything and everyone. I am wondering why HBO does not give him more time. He is forced to talk so fast that doesn't give us time to absorb the news. His show should be in prime time, not at 11pm ET Sunday. HBO give him more time - he is the only one you have! There is nothing wrong for viewers to have lower level of intelligence, but don't rate 1 star just because intellectually you are not up to him. It is a pity that there are so many people brain washed who don't make the efforts to open their eyes and be objective. I wish John Oliver and his show to be forever."
    },
    {
      "username": "Johnny-the-Film-Sentinel-2187",
      "userUrl": "https://www.imdb.com/user/ur24085266",
      "reviewLink": "https://www.imdb.com/review/rw3806683",
      "warningSpoilers": false,
      "date": "16 September 2017",
      "rate": "9",
      "helpful": "17 out of 36 found this helpful.",
      "title": "One of TV's Best Comedic News Shows! And Perfect Commentary on Trump's America!",
      "content": "HBO's had quite the renaissance since the 2000s: with shows the likes of The Sopranos, Band of Brothers, True Blood, Boardwalk Empire, Game of Thrones, True Detective, The Wire, WestWorld and Last Week Tonight With John Oliver. All these shows are masterpieces in television-culture and have become staples in American entertainment. John Oliver is a nice and more uniquely contemporary addition to those shows in that it's a talk-show that tackles things which the modern world finds confronting: and shows us the funny side of it all, and easing our collective pain.Since 2017, specifically since Donald 'Grab 'em by the Pussy' Trump became President, John Oliver has been doing beautiful and 110% true fact-attacks on Trump and his supporters, ranging from Steve Bannon, David Duke, Alex Jones and many others. And even though these segments cover modern events, they're done in a way that can be told as a story which can still be seen as interesting and entertaining down the track. We ALL have a voice and should NEVER do the hateful things of the people John Oliver is rightfully chastising.This show is a classic and as long as there's an imbalance in modern politics, John Oliver will be there to adjust the scales making sure everyone has the same amount of social power regardless of who they are or where they come from."
    }
  ],
  "errorMessage": ""
}