{
  "imDbId": "tt3530232",
  "title": "Last Week Tonight with John Oliver",
  "fullTitle": "Last Week Tonight with John Oliver (TV Series 2014– )",
  "type": "TVSeries",
  "year": "2014",
  "language": "en",
  "titleInLanguage": "Last Week Tonight with John Oliver",
  "url": "https://en.wikipedia.org/wiki/Last_Week_Tonight_with_John_Oliver",
  "plotShort": {
    "plainText": "Last Week Tonight with John Oliver (often abridged as Last Week Tonight) is an American late-night talk and news satire television program hosted by comedian John Oliver. The half-hour-long show premiered in April 2014 on HBO. Last Week Tonight shares some similarities with Comedy Central's The Daily Show (where Oliver was previously featured as a correspondent and fill-in host), as the show takes a satirical look at news, politics and current events, but on a weekly basis.\r\nOliver's initial contract with HBO was for two years with an option for extension. In September 2020, HBO announced that the show had been renewed for three additional seasons of 30 episodes each, keeping the show on the air through 2023. The show's ninth season premiered on February 20, 2022. The show's tenth season premiered on February 19, 2023. However, the show went on hiatus in May 2023 due to the Writers Guild of America strike.",
    "html": "<p>Last Week Tonight with John Oliver (often abridged as Last Week Tonight) is an American late-night talk and news satire television program hosted by comedian John Oliver. The half-hour-long show premiered in April 2014 on HBO. Last Week Tonight shares some similarities with Comedy Central's The Daily Show (where Oliver was previously featured as a correspondent and fill-in host), as the show takes a satirical look at news, politics and current events, but on a weekly basis.</p><p>Oliver's initial contract with HBO was for two years with an option for extension. In September 2020, HBO announced that the show had been renewed for three additional seasons of 30 episodes each, keeping the show on the air through 2023. The show's ninth season premiered on February 20, 2022. The show's tenth season premiered on February 19, 2023. However, the show went on hiatus in May 2023 due to the Writers Guild of America strike.</p>"
  },
  "plotFull": {
    "plainText": "Last Week Tonight with John Oliver (often abridged as Last Week Tonight) is an American late-night talk and news satire television program hosted by comedian John Oliver. The half-hour-long show premiered in April 2014 on HBO. Last Week Tonight shares some similarities with Comedy Central's The Daily Show (where Oliver was previously featured as a correspondent and fill-in host), as the show takes a satirical look at news, politics and current events, but on a weekly basis.\r\nOliver's initial contract with HBO was for two years with an option for extension. In September 2020, HBO announced that the show had been renewed for three additional seasons of 30 episodes each, keeping the show on the air through 2023. The show's ninth season premiered on February 20, 2022. The show's tenth season premiered on February 19, 2023. However, the show went on hiatus in May 2023 due to the Writers Guild of America strike.\r\nProduction\r\nOliver described his preparations for the show to an interviewer for The Wire: \"... I basically have to watch everything. The only thing I kind of watch for pleasure is Fareed Zakaria's show on Sundays ... That and 60 Minutes I watch for pleasure, or maybe Frontline ... I have a TV on in my office all the time and I'll generally flick around on that from CNN, Fox, MSNBC, Bloomberg, CNBC, Al Jazeera ... I'm watching with a certain thing in mind and that is how to see a story told badly.\"\r\nHe said to another interviewer that he is concerned about dealing with old news:\r\nIf something happens on a Monday, realistically all the meat is going to be picked off that bone by the time it gets to us – there's probably barely a point in doing it ... I think we'll be attracted to some extent by stories that are off the grid ... Our show may end up skewing more international in terms of stories.\r\nTim Carvell, executive producer of Last Week Tonight, explained in an interview how the cast and crew deal with a half hour of Oliver speaking without any commercial breaks.\r\nStructural considerations are leading to changes in the content in the show that will inherently make it different from The Daily Show ... We realized early on, you don't necessarily want to hear anybody talk to you for a half an hour straight – even John, who is very charming – so we are constructing these little, produced comedy elements that will serve the function of commercial breaks throughout the show, which will let us get out of the studio, get us away from John's voice and break the show up a bit.\r\nCarvell also revealed that HBO gave them freedom in choosing guests for the show, advising them not to feel obligated to feature celebrities. When asked by an interviewer about \"correspondents\" such as those featured on The Daily Show, Oliver replied, \"we're not going to be a parody news show, so no people pretending to be journalists.\"\r\nAfter the fifth episode of season 7, Oliver stated that the studio and the show's offices were shut down after employees tested positive for COVID-19 and that the show would go on temporary hiatus. The show returned on March 29, 2020, being filmed in Oliver's home with no studio audience due to the COVID-19 pandemic, and produced largely by virtual communication. The show remained there until it resumed filming, in a new studio, in September 2021.\r\nOliver has stated that he has \"full creative freedom, including free rein to criticize corporations\", and frequently pokes fun at HBO's (now former) parent company AT&T, referring to it as the show's \"business daddy\".\r\nFormat\r\nUnlike The Daily Show, which followed recent news, Oliver tends to explore one concept in depth. The show is taped in front of a studio audience, and HBO offers a limited number of free tickets to attend each week's Last Week Tonight taping. Taping takes place on Sunday at 7p.m.\r\nThe show's theme starts off every episode containing images relating to it or the world at large with satirical captions written in dog Latin (e.g., a photo of a gun labelled \"deus ex machina\", a picture of Vladimir Putin labelled \"POTUS Operandi\", a photo of Oliver himself labelled \"hostus mostus\"). Each episode contains a small handful of shorter segments, and then one main segment. While the short segments almost always relate to recent news, the episode's main segment usually covers in length and detail a political issue, even if that issue did not have news media attention during the preceding week. On occasion, the short segments are omitted and the main segment takes up the entirety of the episode. Some of the episodes will follow up the main segment with another video compilation or news story. Oliver's speech is broken up with video compilations of recent news clips, or recurring segments, into which Oliver segues with the slogan, \"And now, this.\" Oliver has also ended some segments with mock trailers for fictional TV shows or commercials that satirize the subject of his speech.\r\nOliver injects humor into his presentation, including satirical analogies, and allusions to popular culture and celebrities. The show includes a panel in the upper-left corner that frequently displays a photo or graphic for that accompanies subject at hand, as a comedic aid. A full-screen graphic will show and play a video clip (such as excerpts from news show or documentaries) when Oliver is citing it. He often coins hashtags related to his segment for use in social media, some of which go viral.\r\nA recurring element of the show is Oliver's use of mascots. The mascots used in the show include Jeff the Diseased Lung in a Cowboy Hat, Hoots the NSA Owl, Taryn the Tinder Chicken, and the Last Week Tonight puppets. Oliver told Vulture in February 2019 that \" Tim Carvell and I – I think we've always seen the show as our attempt to make The Muppet Show and failing to do so. But occasionally, just occasionally, you get the kind of Muppet Show adoration in the ludicrous mascots.\"\r\nThe show frequently features one or more celebrity guests in its segments to help Oliver better get his point on the week's topic across. Guests have featured in many different capacities including giving monologues directly to camera, being interviewed by Oliver, playing musical numbers, participating in comedic skits with or without Oliver, or starring in fictitious parody PSAs. On the show, guests are sometimes seen in the Last Week Tonight studio itself doing their part during the show's main taping, while at other times they are seen in video clips that were pre-recorded at a different location and later included in the show. Oliver often interviews personalities who were directly involved in or impacted by the issues being discussed in the show to get their first-hand experiences and viewpoints on the issue. Some of the famous personalities Oliver has interviewed include Edward Snowden, the 14th Dalai Lama, Anita Hill, Stephen Hawking, and Monica Lewinsky.\r\nPurpose\r\nWhile broadly within the categories of political satire and late-night talk shows, Last Week Tonight has taken a more specific approach to deeper dives into systemic issues which intend to illustrate both the wider socio-political context and the complex interconnections and embeddedness of public policies in social outcomes.\r\nInternational broadcasting\r\nLast Week Tonight with John Oliver episode clips can be seen internationally on YouTube. It is broadcast on premium channel HBO Canada that is simulcast with HBO in the U.S.; around the same time it is shown on the international HBO channels. It airs in Australia on The Comedy Channel hours after the U.S. airing and airs in New Zealand on SoHo. In the United Kingdom and Ireland, it is broadcast on Mondays on Sky Comedy. In Belgium, it is broadcast on Thursdays by the Telenet cable-only channel PRIME Series. It airs in South Africa on M-Net and in Portugal on RTP3. In India, the show is streamed on Disney+ Hotstar. In Greece, the show airs on Cosmote TV's Cosmote Series HD.\r\nSocial media\r\nOliver often makes use of joke hashtags to facilitate the viral spread of his videos on Twitter and Facebook, as with the hashtag #NotMyChristian, which he used in 2014 to complain about the casting of actor Jamie Dornan as Christian Grey in the feature film adaptation of Fifty Shades of Grey. The hashtag became a recurring punchline on the show, mentioned in both serious stories and casual segues.\r\nYouTube channel\r\nLast Week Tonight has a YouTube channel where videos are intermittently (depending on series) added after a show has aired. Most of the videos are of the main segment from each episode. Some extended clips are also available on the show's YouTube channel, as are \"Web Exclusives\" that are produced solely for the channel, such as a July 2016 video in which Oliver responded to negative comments left on the channel itself.\r\nA YouTube video of a segment on the show supporting the UK remaining in the EU was found to be the single most shared video clip on Twitter during the run-up to the 2016 EU membership referendum.\r\nThe show's production has also created content specifically for fan use. For the March 19, 2017, episode, which reported on Bolivia's growing coalition of workers clad in zebra suits to educate civilians about traffic laws, the show's production recorded 23 minutes of a person in a zebra costume dancing and gesticulating before a green screen so that viewers could edit it into other videos for humorous effect. A similar video called \"Real Animals, Fake Paws\" for use in reenacting U.S. Supreme Court cases was released after the October 19, 2014, episode where dogs were used instead of justices to make listening to oral court cases more amusing to the general public and to increase interest in the subject.\r\nBy April 2015, the channel had attained over a million subscribers. That number had risen to 3.6 million by July 2016, and over 5 million by May 2017. As of January 2023, the channel has over 9 million subscribers and more than 3.5 billion views.\r\nEpisodes\r\nReception\r\nAudience viewership\r\nOliver's debut show garnered 1.11 million viewers. The number of viewers online, through websites such as YouTube showing extended clips of different segments, have steadily climbed into multiple millions. The show's YouTube channel also features Web Exclusives which are occasionally posted when the main show is taking a week off. Across the TV airings, DVR, on-demand and HBO Go, Last Week Tonight averaged 4.1 million weekly viewers in its first season.\r\nCritical response\r\nLast Week Tonight has received widespread critical acclaim. Matthew Jacobs of The Huffington Post named Oliver's program as 2014's best television show, writing \"the year's most surprising contribution to television is a show that bucked conventional formats, left us buzzing and paved the way for a burgeoning dynasty. Last Week Tonight with John Oliver is 2014's crowning achievement.\"\r\nHank Stuever of The Washington Post compared Oliver's program with The Daily Show several times in his review of Oliver's debut:\r\nAnother scathing, stick-it-to-'em critique of American mass media and politics shellacked in satire and delivered by a funny if almost off-puttingly incredulous man with a British accent ... Exactly like The Daily Show, the goal is to make elected and appointed officials, as well as just about any corporate enterprise, look foolish and inept while slyly culling together television news clips that make the media look equally inept at covering such evident truths.\r\nJames Poniewozik of Time similarly compared Last Week with The Daily Show, but also wrote that the \"full half-hour gives Oliver the room to do more,\" and praised Oliver's \"sharper tone and his globalist, English-outsider perspective,\" as well as his \"genuine passion over his subjects.\" Poniewozik wrote that Oliver's debut was \"a funny, confident start.\"\r\nThe Entertainment Weekly review began by ringing the same changes: \"The fear with Last Week Tonight is that it's The Daily Show except once a week – a staggered timeline that would rob the basic news-punning format of its intrinsic topical punch ... The first episode of his HBO series didn't stray far from the Stewart mothership, stylistically ...\" However, the reviewer, Darren Franich, liked that Oliver has \"a half-hour of television that is simultaneously tighter and more ambitious, that the extra production time leads to sharper gags but also the ability to present more context\" and thought that the debut had \"plenty of funny throwaway lines.\" Franich appreciated Oliver's coverage of the 2014 Indian election, which the American press was largely ignoring, and, like Poniewozik, praised Oliver's \"passion.\" Franich concluded that Last Week Tonight \"suggested the sharpest possible version of its inspiration\" and that it \"should feel like an experiment\" but \"felt almost fully formed.\"\r\nDavid Haglund of Slate was ambivalent, writing that the show is \"obviously a work in progress\" and that one segment \"felt like misplaced overkill,\" but also that it is \"good use of a weekly show, and it was funny to boot.\" Gawker's Jordan Sargent claimed Last Week Tonight was \"the new Daily Show,\" while simultaneously criticizing the Daily Show for abandoning those \"who have moved on from caring about Fox and Republicans.\" By the series' fourth season, some commentators Haaretz, indicated that show has become increasingly focused on then-president President Donald Trump, noting the \"show had exhausted itself and its supply of jokes about the president\", becoming repetitively focused on Trump's scandal-ridden presidency to a somewhat tiresome degree.\r\nA number of commentators from mainstream media outlets, including The New York Times, The Huffington Post, Time, and Associated Press, have described Oliver's style of reporting as journalism or even investigative journalism. Oliver himself disagrees, stating that \"it's not journalism, it's comedy – it's comedy first, and it's comedy second.\"\r\nAccolades\r\nLast Week Tonight has received critical acclaim and won numerous major awards, including 26 Primetime Emmy Awards, two Peabody Awards, eight Producers Guild Awards, six Writers Guild of America Awards, three Critics' Choice Television Awards, four TCA Awards, and has been nominated for six Directors Guild of America Awards.\r\nReaction and influence\r\nAccording to a document obtained by Vice, the military government of Thailand listed Oliver as \"undermining the royal institution\" for calling Crown Prince Vajiralongkorn a \"buffoon\" and an \"idiot.\"\r\nDuring the June 17, 2018, episode, Oliver spoke at length about Xi Jinping, General Secretary of the Chinese Communist Party, in part criticizing his censorship of Chinese media, his dictatorship and consolidation of power. Both \"John Oliver\" and \"Last Week Tonight\" were blocked from Chinese social media platform Sina Weibo immediately following the segment. The HBO website and content from the network were also blocked, although Last Week Tonight had already been excluded from HBO Asia.\r\nThe John Oliver Effect\r\nOn several occasions, show segments on major societal issues, such as the \"Chickens\" or \"Bail\" segments, were soon followed by real-world change and action on said issues by the public, policymakers and/or other institutions. Several media outlets, noticing this pattern, suggested that attention from the show had instigated these changes, going so far as to dub the phenomenon the \"John Oliver Effect\".\r\nA June 2014 segment about net neutrality in the United States was thought to spur over 45,000 comments on the Federal Communications Commission's electronic filing page about a net neutrality proposal that, if implemented, would have priority \"lanes\" for certain internet traffic. The FCC also received an extra 300,000 comments in an email inbox designated specifically for the proposal. It was thought that Oliver's segment had a major role in the FCC's ultimate reversal of stance on that proposal, with the FCC instead implementing net-neutrality rules that prohibited priority \"lanes\". A sequel in 2017 inspired over 150,000 comments on a subsequent proposal to scrap the new net neutrality rules.\r\nIn a segment about public defenders and how some offices are extremely underfunded, the New Orleans Public Defense office's crowdfunding efforts to improve their conditions were featured. In the days following the episode's broadcast, thousands of dollars were donated to the office by the show's fans, helping them reach their goal four days after the show aired.\r\nOliver himself does not believe the effect to be real and has openly ridiculed the idea on the show, even calling the term \"completely meaningless\".\r\nTobacco\r\n\"Tobacco\" is a segment about the tobacco industry, which aired on February 15, 2015, as part of the second episode of the second season. During the eighteen-minute segment, Oliver discusses tobacco industry trends and practices. He also introduces Jeff the Diseased Lung, a mascot he created for the American global cigarette and tobacco company Philip Morris International, the makers of Marlboro brand of cigarettes. The anthropomorphic diseased lung, who smokes and coughs, has been compared to Joe Camel and the Marlboro Man. Oliver and his team promoted the cartoon character by sending shirts with Jeff's image to Togo and displaying billboards in Uruguay, and by encouraging use of the hashtag #JeffWeCan, which trended on Twitter following the broadcast.\r\nThe segment received widespread media coverage, with several outlets praising Oliver's ability to launch successful marketing campaigns and change perceptions about smoking through the creation of the mascot. The mascot later made an appearance at a protest organized by the \"Campaign for Tobacco-Free Kids\" in New York City in May 2015.\r\nPhilip Morris International issued a response to the segment, stating that it included \"many mischaracterizations\" of the company.\r\nOur Lady of Perpetual Exemption\r\nIn August 2015, after delivering his \"Televangelists\" segment, Oliver hired a professional tax lawyer to set up a church called Our Lady of Perpetual Exemption as a legal entity. He did this partly as a way to demonstrate how \"disturbingly easy\" it is, in terms of paperwork, to set up a tax-exempt religious organization as viewed by the Internal Revenue Service. As Oliver explained, the requirements needed to be defined as a \"church\" are quite broad. Since regulatory guidelines require an established location for a church, Oliver chose his studio location in New York City as its official location, although he registered the nonprofit organization in the state of Texas. Oliver's \"megachurch\" had a toll-free phone number which allowed callers to donate to the church, and said that any money collected would be redistributed to the charitable relief organization Doctors Without Borders. Oliver announced the formation of his church on the episode of the show that aired on August 16, 2015.\r\nMatt Wilstein, writing for Mediaite, saw Oliver's stunt as being along the same lines as comedian Stephen Colbert's setting up of a 501(c)(4) organization – Colbert Super PAC – as a way to \"test the absurd limits of the Supreme Court's Citizens United decision\"; Oliver's megachurch, in contrast, is a way to test whether the IRS might view his \"megachurch\" as a tax-exempt organization. Steve Thorngate, writing in The Christian Century, suggested that the question of the religious exemption from taxation was more difficult and nuanced than Oliver portrayed, and not a simple matter of government regulation, describing Oliver's pivot to IRS policy as \"unhelpful.\" However, Thorngate agreed that Oliver's exposure and criticism of \"manipulative sleazeballs\" who \"fleece the faithful\" is \"spot-on\". Leonardo Blair, writing for Christian Post, described Oliver's segment as a \"brutal takedown\" of televangelists and churches which preach \"the prosperity gospel,\" a message that dupes people into thinking that cash donations will solve medical or financial problems, while in fact the donations go to the personal aggrandizement of televangelists who buy expensive jets or large mansions.\r\nA week later, on the following episode, Oliver devoted a short segment to the donations the church had received, which included money from around the world. Oliver said he had received \"thousands of envelopes with thousands of dollars\" from donors. Displayed were several US Post Office containers full of mail. Oliver told viewers that the more money they sent in, the more \"blessings\" would be returned to them, adding that \"that is still something I'm – amazingly – legally allowed to say.\"\r\nOliver announced that the Church would be shutting down during his show on September 13, 2015. All monetary donations have been forwarded to Doctors Without Borders.\r\nDonald Trump\r\n\"Donald Trump\" is a segment discussing American businessman Donald Trump. It aired on February 28, 2016, as part of the third episode of the third season. During the 22-minute segment, Oliver discusses Trump's 2016 presidential campaign and his long career in business. He also reveals that the Trump family name was changed at one point from the ancestral name 'Drumpf'. Although the changing of names was once a common practice among many non-English immigrants to the United States, the segment popularized the term \"Donald Drumpf\" and started a campaign urging viewers to \"Make Donald Drumpf Again,\" a play on Trump's own campaign slogan, \"Make America Great Again.\" The segment garnered more than 85 million views on Facebook and YouTube combined which, an HBO spokesman has said, \"is a record for any piece of HBO content.\" Throughout the 2016 presidential election and following Trump's inauguration, Oliver made additional segments regarding Trump.\r\nDebt buyers\r\n\"Debt Buyers\" is a segment discussing the business and questionable practice of debt buyers. It aired on June 5, 2016, as part of the fourteenth episode of the third season. Oliver announced he had purchased nearly $15 million in medical debt that belonged to 9,000 debtors. He did this through a company he had created, called \"Central Asset Recovery Professionals Inc.\" (CARP), which he described as being \"for the bottom-feeding fish.\" Oliver stated that it was \"pretty clear by now debt buying is a grimy business, and badly needs more oversight\" and went to point out that starting such a business was \"disturbingly easy.\" It cost him $50 to register the business in Mississippi, while it cost less than $60,000 to purchase almost $15 million in bad debt, medical debt from Texas. Oliver forgave the debt in its entirety, and claimed that it was the largest single giveaway in the American television history, eclipsing that of General Motors on The Oprah Winfrey Show in 2004 where it gifted cars to Winfrey's studio audience, worth an estimated $8 million in total. Writing for Slate, Jordan Weissmann disputed the $15 million figure: \" says CARP paid around $60,000 ... for its paper, which was 'out-of-statute' – meaning the debts were so old that creditors technically couldn't even sue over them anymore. That suggests the seller thought the debts were worth no more than, well, $60,000.\" The show partnered with RIP Medical Debt, Inc. to abolish the debt.\r\nCoal mining and Bob Murray\r\nOn June 18, 2017, Last Week Tonight's main segment was about coal mining and Bob Murray. In his segment, Oliver talked about safety conditions inside coal mines, specifically the 2007 Crandall Canyon Mine collapse, which killed six miners. Oliver criticized Murray for claiming the collapse was caused by an earthquake, despite all evidence demonstrating otherwise. The show ended with a costumed squirrel named \"Mr. Nutterbutter\", portrayed by Noel MacNeal, offering Murray with an oversized check for \"3 acorns and 18 cents\" with the phrase \"Eat Shit, Bob\" in response to Murray's company presenting its employees with low sums of money as bonuses – to which many retaliated by returning the checks, including one who returned theirs with that exact phrase written on it – and in reference to a claim that Murray supposedly got the idea to start his company from a talking squirrel. On June 22, Bob Murray presented a lawsuit against Oliver, HBO, and Time Warner for defamation. HBO believed Last Week Tonight had done nothing wrong, with a First Amendment lawyer describing the lawsuit as \"frivolous.\" In February 2018, a West Virginia judge stated that he planned to dismiss the lawsuit filed by Murray as unfounded.\r\nAfter Murray's appeal to the West Virginia Supreme Court was delayed due to the impeachment of its judges, Murray offered to drop the charges and HBO accepted. On November 10, 2019, Oliver discussed the case in a segment about SLAPP suits, revealing that the suit cost HBO $200,000 in legal costs and tripled the show's libel insurance fees. Oliver acknowledged that, despite the segment being vetted, the content would likely lead to another lawsuit, and that he would stand behind his team if it were to happen. The segment ended with a five-minute, Times Square-set musical number featuring crude and ludicrous fictional anecdotes about Murray. The musical number, entitled \"Eat Shit, Bob\", was later nominated for the Primetime Emmy Award for Outstanding Original Music and Lyrics in 2020.\r\nA Day in the Life of Marlon Bundo\r\nOn March 18, 2018, Oliver announced the publication of a children's book, A Day in the Life of Marlon Bundo, which parodies a book that Mike Pence's family wrote about their family rabbit, Marlon Bundo. Oliver used his book as a platform to criticize Pence's positions on LGBT issues, as it featured a rabbit in a same-sex relationship. The book became the number-one book and e-book on Amazon the next day, and the top-selling audiobook on Audible.\r\nRussell Crowe's jockstrap\r\nRussell Crowe's jockstrap was purchased by the Last Week Tonight with John Oliver and then donated to a Blockbuster Video shop. The jockstrap reappeared in a skit in the final episode of the 2018 season of the show.\r\nGuinness World Records\r\nThe main story of the August 11, 2019, episode was Turkmenistan and its autocratic leader Gurbanguly Berdimuhamedow. The last portion of the segment centered around Berdimuhamedow's obsession with Guinness World Records, with the Turkmen capital of Ashgabat being home to the most buildings with white marble cladding, the largest indoor Ferris wheel, and the largest statue of a horse's head, among others. Oliver found that Guinness World Records received sums of money ranging from US$12,000 to US$500,000 from companies and authoritarian nations to set records for publicity. He ended the show with a 600 square foot marble cake adorned with a picture of Berdimuhamedow falling from a horse; he had requested a Guinness adjudicator to certify it as the world's largest marble cake, a record previously set by Betty Crocker in Saudi Arabia in 2017. Guinness refused, stating that because their brand was \"aligned with kids and families\", they would not send an adjudicator; Oliver mockingly commented that he did not \"run a brutal enough dictatorship to meet Guinness World Records' high ethical standards\". Oliver claimed that Guinness offered to certify it after the fact only if he signed an agreement not to criticize their practices on the show, which Oliver dismissed as \"ridiculous\". Guinness called Oliver's allegations \"false and unfair\", claiming that they did not send an adjudicator because they felt the cake was specifically for the purpose of mocking a record holder, stating it was their policy \"not to partake in any activities which may belittle their achievements or subject them to ridicule\".\r\nNarendra Modi\r\nJohn Oliver extensively satirized Indian prime minister Narendra Modi in a segment which was broadcast on February 23, 2020, calling him a \"temporary symbol of hate.\" This was during a visit of US president Donald Trump to India, and in an organized rally that coincided with large-scale violence in Delhi. He criticized Modi's \"increasingly controversial reputation and widespread protests against his government's citizenship measures\", as well as the BJP's condoning of widespread violence against Muslims in India.\r\nDisney+ Hotstar, an Indian streaming service who holds rights to HBO programming in the country, refused to stream the episode, leading to criticism by local viewers (including Hotstar's apps being review bombed with 1-star reviews). Oliver addressed the censorship in the March 8, 2020, episode, also noting that since the acquisition of Hotstar by The Walt Disney Company (which occurred as part of its acquisition of 21st Century Fox), Hotstar had begun to censor jokes regarding Disney characters from the program, such as his \"factually-accurate\" claim that Donald Duck had a corkscrew penis.\r\nDanbury, Connecticut\r\nJohn Oliver satirized the city of Danbury, Connecticut on a broadcast that aired on August 16, 2020, by making fun of the general quaintness of the town, starting a feud with the town that would last a few weeks, involving the Mayor of Danbury Mark Boughton, the city's hockey team called Danbury Hat Tricks, and other various content creators in Danbury. The mayor of Danbury, in response, revealed that they would rename their sewer plant, which makes up more than 80% of their $127 million budget, the \"John Oliver Memorial Sewer Plant\", saying \"it's full of crap, just like you\". The mayor reneged on this statement later in the week, claiming it was a joke, but after John Oliver offered $55,000 to local charities on a broadcast that aired on August 30, 2020, in exchange for the sewage plant actually being named after him, Danbury accepted the offer.",
    "html": "<p>Last Week Tonight with John Oliver (often abridged as Last Week Tonight) is an American late-night talk and news satire television program hosted by comedian John Oliver. The half-hour-long show premiered in April 2014 on HBO. Last Week Tonight shares some similarities with Comedy Central's The Daily Show (where Oliver was previously featured as a correspondent and fill-in host), as the show takes a satirical look at news, politics and current events, but on a weekly basis.</p><p>Oliver's initial contract with HBO was for two years with an option for extension. In September 2020, HBO announced that the show had been renewed for three additional seasons of 30 episodes each, keeping the show on the air through 2023. The show's ninth season premiered on February 20, 2022. The show's tenth season premiered on February 19, 2023. However, the show went on hiatus in May 2023 due to the Writers Guild of America strike.</p><br/><h3>Production</h3><p>Oliver described his preparations for the show to an interviewer for The Wire: \"... I basically have to watch everything. The only thing I kind of watch for pleasure is Fareed Zakaria's show on Sundays ... That and 60 Minutes I watch for pleasure, or maybe Frontline ... I have a TV on in my office all the time and I'll generally flick around on that from CNN, Fox, MSNBC, Bloomberg, CNBC, Al Jazeera ... I'm watching with a certain thing in mind and that is how to see a story told badly.\"</p><p>He said to another interviewer that he is concerned about dealing with old news:</p><blockquote>If something happens on a Monday, realistically all the meat is going to be picked off that bone by the time it gets to us – there's probably barely a point in doing it ... I think we'll be attracted to some extent by stories that are off the grid ... Our show may end up skewing more international in terms of stories.</blockquote><p>Tim Carvell, executive producer of Last Week Tonight, explained in an interview how the cast and crew deal with a half hour of Oliver speaking without any commercial breaks.</p><blockquote>Structural considerations are leading to changes in the content in the show that will inherently make it different from The Daily Show ... We realized early on, you don't necessarily want to hear anybody talk to you for a half an hour straight – even John, who is very charming – so we are constructing these little, produced comedy elements that will serve the function of commercial breaks throughout the show, which will let us get out of the studio, get us away from John's voice and break the show up a bit.</blockquote><p>Carvell also revealed that HBO gave them freedom in choosing guests for the show, advising them not to feel obligated to feature celebrities. When asked by an interviewer about \"correspondents\" such as those featured on The Daily Show, Oliver replied, \"we're not going to be a parody news show, so no people pretending to be journalists.\"</p><p>After the fifth episode of season 7, Oliver stated that the studio and the show's offices were shut down after employees tested positive for COVID-19 and that the show would go on temporary hiatus. The show returned on March 29, 2020, being filmed in Oliver's home with no studio audience due to the COVID-19 pandemic, and produced largely by virtual communication. The show remained there until it resumed filming, in a new studio, in September 2021.</p><p>Oliver has stated that he has \"full creative freedom, including free rein to criticize corporations\", and frequently pokes fun at HBO's (now former) parent company AT&T, referring to it as the show's \"business daddy\".</p><br/><h3>Format</h3><p>Unlike The Daily Show, which followed recent news, Oliver tends to explore one concept in depth. The show is taped in front of a studio audience, and HBO offers a limited number of free tickets to attend each week's Last Week Tonight taping. Taping takes place on Sunday at 7p.m.</p><p>The show's theme starts off every episode containing images relating to it or the world at large with satirical captions written in dog Latin (e.g., a photo of a gun labelled \"deus ex machina\", a picture of Vladimir Putin labelled \"POTUS Operandi\", a photo of Oliver himself labelled \"hostus mostus\"). Each episode contains a small handful of shorter segments, and then one main segment. While the short segments almost always relate to recent news, the episode's main segment usually covers in length and detail a political issue, even if that issue did not have news media attention during the preceding week. On occasion, the short segments are omitted and the main segment takes up the entirety of the episode. Some of the episodes will follow up the main segment with another video compilation or news story. Oliver's speech is broken up with video compilations of recent news clips, or recurring segments, into which Oliver segues with the slogan, \"And now, this.\" Oliver has also ended some segments with mock trailers for fictional TV shows or commercials that satirize the subject of his speech.</p><p>Oliver injects humor into his presentation, including satirical analogies, and allusions to popular culture and celebrities. The show includes a panel in the upper-left corner that frequently displays a photo or graphic for that accompanies subject at hand, as a comedic aid. A full-screen graphic will show and play a video clip (such as excerpts from news show or documentaries) when Oliver is citing it. He often coins hashtags related to his segment for use in social media, some of which go viral.</p><p>A recurring element of the show is Oliver's use of mascots. The mascots used in the show include Jeff the Diseased Lung in a Cowboy Hat, Hoots the NSA Owl, Taryn the Tinder Chicken, and the Last Week Tonight puppets. Oliver told Vulture in February 2019 that \" Tim Carvell and I – I think we've always seen the show as our attempt to make The Muppet Show and failing to do so. But occasionally, just occasionally, you get the kind of Muppet Show adoration in the ludicrous mascots.\"</p><p>The show frequently features one or more celebrity guests in its segments to help Oliver better get his point on the week's topic across. Guests have featured in many different capacities including giving monologues directly to camera, being interviewed by Oliver, playing musical numbers, participating in comedic skits with or without Oliver, or starring in fictitious parody PSAs. On the show, guests are sometimes seen in the Last Week Tonight studio itself doing their part during the show's main taping, while at other times they are seen in video clips that were pre-recorded at a different location and later included in the show. Oliver often interviews personalities who were directly involved in or impacted by the issues being discussed in the show to get their first-hand experiences and viewpoints on the issue. Some of the famous personalities Oliver has interviewed include Edward Snowden, the 14th Dalai Lama, Anita Hill, Stephen Hawking, and Monica Lewinsky.</p><h4>Purpose</h4><p>While broadly within the categories of political satire and late-night talk shows, Last Week Tonight has taken a more specific approach to deeper dives into systemic issues which intend to illustrate both the wider socio-political context and the complex interconnections and embeddedness of public policies in social outcomes.</p><h4>International broadcasting</h4><p>Last Week Tonight with John Oliver episode clips can be seen internationally on YouTube. It is broadcast on premium channel HBO Canada that is simulcast with HBO in the U.S.; around the same time it is shown on the international HBO channels. It airs in Australia on The Comedy Channel hours after the U.S. airing and airs in New Zealand on SoHo. In the United Kingdom and Ireland, it is broadcast on Mondays on Sky Comedy. In Belgium, it is broadcast on Thursdays by the Telenet cable-only channel PRIME Series. It airs in South Africa on M-Net and in Portugal on RTP3. In India, the show is streamed on Disney+ Hotstar. In Greece, the show airs on Cosmote TV's Cosmote Series HD.</p><h4>Social media</h4><p>Oliver often makes use of joke hashtags to facilitate the viral spread of his videos on Twitter and Facebook, as with the hashtag #NotMyChristian, which he used in 2014 to complain about the casting of actor Jamie Dornan as Christian Grey in the feature film adaptation of Fifty Shades of Grey. The hashtag became a recurring punchline on the show, mentioned in both serious stories and casual segues.</p><h4>YouTube channel</h4><p>Last Week Tonight has a YouTube channel where videos are intermittently (depending on series) added after a show has aired. Most of the videos are of the main segment from each episode. Some extended clips are also available on the show's YouTube channel, as are \"Web Exclusives\" that are produced solely for the channel, such as a July 2016 video in which Oliver responded to negative comments left on the channel itself.</p><p>A YouTube video of a segment on the show supporting the UK remaining in the EU was found to be the single most shared video clip on Twitter during the run-up to the 2016 EU membership referendum.</p><p>The show's production has also created content specifically for fan use. For the March 19, 2017, episode, which reported on Bolivia's growing coalition of workers clad in zebra suits to educate civilians about traffic laws, the show's production recorded 23 minutes of a person in a zebra costume dancing and gesticulating before a green screen so that viewers could edit it into other videos for humorous effect. A similar video called \"Real Animals, Fake Paws\" for use in reenacting U.S. Supreme Court cases was released after the October 19, 2014, episode where dogs were used instead of justices to make listening to oral court cases more amusing to the general public and to increase interest in the subject.</p><p>By April 2015, the channel had attained over a million subscribers. That number had risen to 3.6 million by July 2016, and over 5 million by May 2017. As of January 2023, the channel has over 9 million subscribers and more than 3.5 billion views.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">24</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 27, 2014</td><td style=\"padding:0 8px\">November 9, 2014</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">35</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 8, 2015</td><td style=\"padding:0 8px\">November 22, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">30</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 14, 2016</td><td style=\"padding:0 8px\">November 13, 2016</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">30</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 12, 2017</td><td style=\"padding:0 8px\">November 12, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">30</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 18, 2018</td><td style=\"padding:0 8px\">November 18, 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">30</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 17, 2019</td><td style=\"padding:0 8px\">November 17, 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">30</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 16, 2020</td><td style=\"padding:0 8px\">November 15, 2020</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>8</span></span></span></span></th><td colspan=\"2\">30</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 14, 2021</td><td style=\"padding:0 8px\">November 14, 2021</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>9</span></span></span></span></th><td colspan=\"2\">30</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 20, 2022</td><td style=\"padding:0 8px\">November 20, 2022</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>10</span></span></span></span></th><td colspan=\"2\">30</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 19, 2023</td><td data-sort-value=\"\" class=\"table-na\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center; ;padding:0 8px\">TBA</td></tr></tbody></table><br/><h3>Reception</h3><h4>Audience viewership</h4><p>Oliver's debut show garnered 1.11 million viewers. The number of viewers online, through websites such as YouTube showing extended clips of different segments, have steadily climbed into multiple millions. The show's YouTube channel also features Web Exclusives which are occasionally posted when the main show is taking a week off. Across the TV airings, DVR, on-demand and HBO Go, Last Week Tonight averaged 4.1 million weekly viewers in its first season.</p><h4>Critical response</h4><p>Last Week Tonight has received widespread critical acclaim. Matthew Jacobs of The Huffington Post named Oliver's program as 2014's best television show, writing \"the year's most surprising contribution to television is a show that bucked conventional formats, left us buzzing and paved the way for a burgeoning dynasty. Last Week Tonight with John Oliver is 2014's crowning achievement.\"</p><p>Hank Stuever of The Washington Post compared Oliver's program with The Daily Show several times in his review of Oliver's debut:</p><blockquote>Another scathing, stick-it-to-'em critique of American mass media and politics shellacked in satire and delivered by a funny if almost off-puttingly incredulous man with a British accent ... Exactly like The Daily Show, the goal is to make elected and appointed officials, as well as just about any corporate enterprise, look foolish and inept while slyly culling together television news clips that make the media look equally inept at covering such evident truths.</blockquote><p>James Poniewozik of Time similarly compared Last Week with The Daily Show, but also wrote that the \"full half-hour gives Oliver the room to do more,\" and praised Oliver's \"sharper tone and his globalist, English-outsider perspective,\" as well as his \"genuine passion over his subjects.\" Poniewozik wrote that Oliver's debut was \"a funny, confident start.\"</p><p>The Entertainment Weekly review began by ringing the same changes: \"The fear with Last Week Tonight is that it's The Daily Show except once a week – a staggered timeline that would rob the basic news-punning format of its intrinsic topical punch ... The first episode of his HBO series didn't stray far from the Stewart mothership, stylistically ...\" However, the reviewer, Darren Franich, liked that Oliver has \"a half-hour of television that is simultaneously tighter and more ambitious, that the extra production time leads to sharper gags but also the ability to present more context\" and thought that the debut had \"plenty of funny throwaway lines.\" Franich appreciated Oliver's coverage of the 2014 Indian election, which the American press was largely ignoring, and, like Poniewozik, praised Oliver's \"passion.\" Franich concluded that Last Week Tonight \"suggested the sharpest possible version of its inspiration\" and that it \"should feel like an experiment\" but \"felt almost fully formed.\"</p><p>David Haglund of Slate was ambivalent, writing that the show is \"obviously a work in progress\" and that one segment \"felt like misplaced overkill,\" but also that it is \"good use of a weekly show, and it was funny to boot.\" Gawker's Jordan Sargent claimed Last Week Tonight was \"the new Daily Show,\" while simultaneously criticizing the Daily Show for abandoning those \"who have moved on from caring about Fox and Republicans.\" By the series' fourth season, some commentators Haaretz, indicated that show has become increasingly focused on then-president President Donald Trump, noting the \"show had exhausted itself and its supply of jokes about the president\", becoming repetitively focused on Trump's scandal-ridden presidency to a somewhat tiresome degree.</p><p>A number of commentators from mainstream media outlets, including The New York Times, The Huffington Post, Time, and Associated Press, have described Oliver's style of reporting as journalism or even investigative journalism. Oliver himself disagrees, stating that \"it's not journalism, it's comedy – it's comedy first, and it's comedy second.\"</p><h4>Accolades</h4><p>Last Week Tonight has received critical acclaim and won numerous major awards, including 26 Primetime Emmy Awards, two Peabody Awards, eight Producers Guild Awards, six Writers Guild of America Awards, three Critics' Choice Television Awards, four TCA Awards, and has been nominated for six Directors Guild of America Awards.</p><br/><h3>Reaction and influence</h3><p>According to a document obtained by Vice, the military government of Thailand listed Oliver as \"undermining the royal institution\" for calling Crown Prince Vajiralongkorn a \"buffoon\" and an \"idiot.\"</p><p>During the June 17, 2018, episode, Oliver spoke at length about Xi Jinping, General Secretary of the Chinese Communist Party, in part criticizing his censorship of Chinese media, his dictatorship and consolidation of power. Both \"John Oliver\" and \"Last Week Tonight\" were blocked from Chinese social media platform Sina Weibo immediately following the segment. The HBO website and content from the network were also blocked, although Last Week Tonight had already been excluded from HBO Asia.</p><h4>The John Oliver Effect</h4><p>On several occasions, show segments on major societal issues, such as the \"Chickens\" or \"Bail\" segments, were soon followed by real-world change and action on said issues by the public, policymakers and/or other institutions. Several media outlets, noticing this pattern, suggested that attention from the show had instigated these changes, going so far as to dub the phenomenon the \"John Oliver Effect\".</p><p>A June 2014 segment about net neutrality in the United States was thought to spur over 45,000 comments on the Federal Communications Commission's electronic filing page about a net neutrality proposal that, if implemented, would have priority \"lanes\" for certain internet traffic. The FCC also received an extra 300,000 comments in an email inbox designated specifically for the proposal. It was thought that Oliver's segment had a major role in the FCC's ultimate reversal of stance on that proposal, with the FCC instead implementing net-neutrality rules that prohibited priority \"lanes\". A sequel in 2017 inspired over 150,000 comments on a subsequent proposal to scrap the new net neutrality rules.</p><p>In a segment about public defenders and how some offices are extremely underfunded, the New Orleans Public Defense office's crowdfunding efforts to improve their conditions were featured. In the days following the episode's broadcast, thousands of dollars were donated to the office by the show's fans, helping them reach their goal four days after the show aired.</p><p>Oliver himself does not believe the effect to be real and has openly ridiculed the idea on the show, even calling the term \"completely meaningless\".</p><h4>Tobacco</h4><p>\"Tobacco\" is a segment about the tobacco industry, which aired on February 15, 2015, as part of the second episode of the second season. During the eighteen-minute segment, Oliver discusses tobacco industry trends and practices. He also introduces Jeff the Diseased Lung, a mascot he created for the American global cigarette and tobacco company Philip Morris International, the makers of Marlboro brand of cigarettes. The anthropomorphic diseased lung, who smokes and coughs, has been compared to Joe Camel and the Marlboro Man. Oliver and his team promoted the cartoon character by sending shirts with Jeff's image to Togo and displaying billboards in Uruguay, and by encouraging use of the hashtag #JeffWeCan, which trended on Twitter following the broadcast.</p><p>The segment received widespread media coverage, with several outlets praising Oliver's ability to launch successful marketing campaigns and change perceptions about smoking through the creation of the mascot. The mascot later made an appearance at a protest organized by the \"Campaign for Tobacco-Free Kids\" in New York City in May 2015.</p><p>Philip Morris International issued a response to the segment, stating that it included \"many mischaracterizations\" of the company.</p><h4>Our Lady of Perpetual Exemption</h4><p>In August 2015, after delivering his \"Televangelists\" segment, Oliver hired a professional tax lawyer to set up a church called Our Lady of Perpetual Exemption as a legal entity. He did this partly as a way to demonstrate how \"disturbingly easy\" it is, in terms of paperwork, to set up a tax-exempt religious organization as viewed by the Internal Revenue Service. As Oliver explained, the requirements needed to be defined as a \"church\" are quite broad. Since regulatory guidelines require an established location for a church, Oliver chose his studio location in New York City as its official location, although he registered the nonprofit organization in the state of Texas. Oliver's \"megachurch\" had a toll-free phone number which allowed callers to donate to the church, and said that any money collected would be redistributed to the charitable relief organization Doctors Without Borders. Oliver announced the formation of his church on the episode of the show that aired on August 16, 2015.</p><p>Matt Wilstein, writing for Mediaite, saw Oliver's stunt as being along the same lines as comedian Stephen Colbert's setting up of a 501(c)(4) organization – Colbert Super PAC – as a way to \"test the absurd limits of the Supreme Court's Citizens United decision\"; Oliver's megachurch, in contrast, is a way to test whether the IRS might view his \"megachurch\" as a tax-exempt organization. Steve Thorngate, writing in The Christian Century, suggested that the question of the religious exemption from taxation was more difficult and nuanced than Oliver portrayed, and not a simple matter of government regulation, describing Oliver's pivot to IRS policy as \"unhelpful.\" However, Thorngate agreed that Oliver's exposure and criticism of \"manipulative sleazeballs\" who \"fleece the faithful\" is \"spot-on\". Leonardo Blair, writing for Christian Post, described Oliver's segment as a \"brutal takedown\" of televangelists and churches which preach \"the prosperity gospel,\" a message that dupes people into thinking that cash donations will solve medical or financial problems, while in fact the donations go to the personal aggrandizement of televangelists who buy expensive jets or large mansions.</p><p>A week later, on the following episode, Oliver devoted a short segment to the donations the church had received, which included money from around the world. Oliver said he had received \"thousands of envelopes with thousands of dollars\" from donors. Displayed were several US Post Office containers full of mail. Oliver told viewers that the more money they sent in, the more \"blessings\" would be returned to them, adding that \"that is still something I'm – amazingly – legally allowed to say.\"</p><p>Oliver announced that the Church would be shutting down during his show on September 13, 2015. All monetary donations have been forwarded to Doctors Without Borders.</p><h4>Donald Trump</h4><p>\"Donald Trump\" is a segment discussing American businessman Donald Trump. It aired on February 28, 2016, as part of the third episode of the third season. During the 22-minute segment, Oliver discusses Trump's 2016 presidential campaign and his long career in business. He also reveals that the Trump family name was changed at one point from the ancestral name 'Drumpf'. Although the changing of names was once a common practice among many non-English immigrants to the United States, the segment popularized the term \"Donald Drumpf\" and started a campaign urging viewers to \"Make Donald Drumpf Again,\" a play on Trump's own campaign slogan, \"Make America Great Again.\" The segment garnered more than 85 million views on Facebook and YouTube combined which, an HBO spokesman has said, \"is a record for any piece of HBO content.\" Throughout the 2016 presidential election and following Trump's inauguration, Oliver made additional segments regarding Trump.</p><h4>Debt buyers</h4><p>\"Debt Buyers\" is a segment discussing the business and questionable practice of debt buyers. It aired on June 5, 2016, as part of the fourteenth episode of the third season. Oliver announced he had purchased nearly $15 million in medical debt that belonged to 9,000 debtors. He did this through a company he had created, called \"Central Asset Recovery Professionals Inc.\" (CARP), which he described as being \"for the bottom-feeding fish.\" Oliver stated that it was \"pretty clear by now debt buying is a grimy business, and badly needs more oversight\" and went to point out that starting such a business was \"disturbingly easy.\" It cost him $50 to register the business in Mississippi, while it cost less than $60,000 to purchase almost $15 million in bad debt, medical debt from Texas. Oliver forgave the debt in its entirety, and claimed that it was the largest single giveaway in the American television history, eclipsing that of General Motors on The Oprah Winfrey Show in 2004 where it gifted cars to Winfrey's studio audience, worth an estimated $8 million in total. Writing for Slate, Jordan Weissmann disputed the $15 million figure: \" says CARP paid around $60,000 ... for its paper, which was 'out-of-statute' – meaning the debts were so old that creditors technically couldn't even sue over them anymore. That suggests the seller thought the debts were worth no more than, well, $60,000.\" The show partnered with RIP Medical Debt, Inc. to abolish the debt.</p><h4>Coal mining and Bob Murray</h4><p>On June 18, 2017, Last Week Tonight's main segment was about coal mining and Bob Murray. In his segment, Oliver talked about safety conditions inside coal mines, specifically the 2007 Crandall Canyon Mine collapse, which killed six miners. Oliver criticized Murray for claiming the collapse was caused by an earthquake, despite all evidence demonstrating otherwise. The show ended with a costumed squirrel named \"Mr. Nutterbutter\", portrayed by Noel MacNeal, offering Murray with an oversized check for \"3 acorns and 18 cents\" with the phrase \"Eat Shit, Bob\" in response to Murray's company presenting its employees with low sums of money as bonuses – to which many retaliated by returning the checks, including one who returned theirs with that exact phrase written on it – and in reference to a claim that Murray supposedly got the idea to start his company from a talking squirrel. On June 22, Bob Murray presented a lawsuit against Oliver, HBO, and Time Warner for defamation. HBO believed Last Week Tonight had done nothing wrong, with a First Amendment lawyer describing the lawsuit as \"frivolous.\" In February 2018, a West Virginia judge stated that he planned to dismiss the lawsuit filed by Murray as unfounded.</p><p>After Murray's appeal to the West Virginia Supreme Court was delayed due to the impeachment of its judges, Murray offered to drop the charges and HBO accepted. On November 10, 2019, Oliver discussed the case in a segment about SLAPP suits, revealing that the suit cost HBO $200,000 in legal costs and tripled the show's libel insurance fees. Oliver acknowledged that, despite the segment being vetted, the content would likely lead to another lawsuit, and that he would stand behind his team if it were to happen. The segment ended with a five-minute, Times Square-set musical number featuring crude and ludicrous fictional anecdotes about Murray. The musical number, entitled \"Eat Shit, Bob\", was later nominated for the Primetime Emmy Award for Outstanding Original Music and Lyrics in 2020.</p><h4>A Day in the Life of Marlon Bundo</h4><p>On March 18, 2018, Oliver announced the publication of a children's book, A Day in the Life of Marlon Bundo, which parodies a book that Mike Pence's family wrote about their family rabbit, Marlon Bundo. Oliver used his book as a platform to criticize Pence's positions on LGBT issues, as it featured a rabbit in a same-sex relationship. The book became the number-one book and e-book on Amazon the next day, and the top-selling audiobook on Audible.</p><h4>Russell Crowe's jockstrap</h4><p>Russell Crowe's jockstrap was purchased by the Last Week Tonight with John Oliver and then donated to a Blockbuster Video shop. The jockstrap reappeared in a skit in the final episode of the 2018 season of the show.</p><h4>Guinness World Records</h4><p>The main story of the August 11, 2019, episode was Turkmenistan and its autocratic leader Gurbanguly Berdimuhamedow. The last portion of the segment centered around Berdimuhamedow's obsession with Guinness World Records, with the Turkmen capital of Ashgabat being home to the most buildings with white marble cladding, the largest indoor Ferris wheel, and the largest statue of a horse's head, among others. Oliver found that Guinness World Records received sums of money ranging from US$12,000 to US$500,000 from companies and authoritarian nations to set records for publicity. He ended the show with a 600 square foot marble cake adorned with a picture of Berdimuhamedow falling from a horse; he had requested a Guinness adjudicator to certify it as the world's largest marble cake, a record previously set by Betty Crocker in Saudi Arabia in 2017. Guinness refused, stating that because their brand was \"aligned with kids and families\", they would not send an adjudicator; Oliver mockingly commented that he did not \"run a brutal enough dictatorship to meet Guinness World Records' high ethical standards\". Oliver claimed that Guinness offered to certify it after the fact only if he signed an agreement not to criticize their practices on the show, which Oliver dismissed as \"ridiculous\". Guinness called Oliver's allegations \"false and unfair\", claiming that they did not send an adjudicator because they felt the cake was specifically for the purpose of mocking a record holder, stating it was their policy \"not to partake in any activities which may belittle their achievements or subject them to ridicule\".</p><h4>Narendra Modi</h4><p>John Oliver extensively satirized Indian prime minister Narendra Modi in a segment which was broadcast on February 23, 2020, calling him a \"temporary symbol of hate.\" This was during a visit of US president Donald Trump to India, and in an organized rally that coincided with large-scale violence in Delhi. He criticized Modi's \"increasingly controversial reputation and widespread protests against his government's citizenship measures\", as well as the BJP's condoning of widespread violence against Muslims in India.</p><p>Disney+ Hotstar, an Indian streaming service who holds rights to HBO programming in the country, refused to stream the episode, leading to criticism by local viewers (including Hotstar's apps being review bombed with 1-star reviews). Oliver addressed the censorship in the March 8, 2020, episode, also noting that since the acquisition of Hotstar by The Walt Disney Company (which occurred as part of its acquisition of 21st Century Fox), Hotstar had begun to censor jokes regarding Disney characters from the program, such as his \"factually-accurate\" claim that Donald Duck had a corkscrew penis.</p><h4>Danbury, Connecticut</h4><p>John Oliver satirized the city of Danbury, Connecticut on a broadcast that aired on August 16, 2020, by making fun of the general quaintness of the town, starting a feud with the town that would last a few weeks, involving the Mayor of Danbury Mark Boughton, the city's hockey team called Danbury Hat Tricks, and other various content creators in Danbury. The mayor of Danbury, in response, revealed that they would rename their sewer plant, which makes up more than 80% of their $127 million budget, the \"John Oliver Memorial Sewer Plant\", saying \"it's full of crap, just like you\". The mayor reneged on this statement later in the week, claiming it was a joke, but after John Oliver offered $55,000 to local charities on a broadcast that aired on August 30, 2020, in exchange for the sewage plant actually being named after him, Danbury accepted the offer.</p><br/>"
  },
  "errorMessage": ""
}