{
  "imDbId": "tt5897304",
  "title": "Mob Psycho 100",
  "fullTitle": "Mob Psycho 100 (TV Series 2016–2022)",
  "type": "TVSeries",
  "year": "2016",
  "items": [
    {
      "username": "WeAreLive",
      "userUrl": "https://www.imdb.com/user/ur79460801",
      "reviewLink": "https://www.imdb.com/review/rw4281325",
      "warningSpoilers": true,
      "date": "12 August 2018",
      "rate": "10",
      "helpful": "24 out of 24 found this helpful.",
      "title": "Mob Psycho 100%",
      "content": "If you love One Punch Man you will definitely enjoy. As it is created by the same creator.This show is about a Middle School student by the name of Shigeo Kageyama also known as Mob for short who discovers he has psychic powers and being able to see spirits/ghost so one day goes for help from a con artist by the name of Arataka Reigen who claim to know a lot about spirts but secretly he doesn't.You might think oh what a boring and simple plot... No! as you watch along it gets better as his Ritesu gets his abilities and when they discover an organisation by the name of C.L.A.W. We also introduced to other psychic wilders and we have a lot of backstory about the characters.The animation is good, the intro is interesting and the voice acting from the dubbing department is excellent. Long story short, if you love one punch man you will for sure enjoy this."
    },
    {
      "username": "Irishchatter",
      "userUrl": "https://www.imdb.com/user/ur23577930",
      "reviewLink": "https://www.imdb.com/review/rw4985025",
      "warningSpoilers": false,
      "date": "9 July 2019",
      "rate": "9",
      "helpful": "29 out of 30 found this helpful.",
      "title": "Brilliant anime show that i just can't stop adoring about!",
      "content": "This is honestly one of the best anime shows that has 2 great openings, 2 great season's and includes the best voice actors (I watched both sub and dub versions).For those who never heard of this show before or is a fan of the superpower genre, get watching this like truly.........It's freaking epic man!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "username": "spookybuk",
      "userUrl": "https://www.imdb.com/user/ur16562189",
      "reviewLink": "https://www.imdb.com/review/rw3815590",
      "warningSpoilers": false,
      "date": "26 September 2017",
      "rate": "10",
      "helpful": "79 out of 82 found this helpful.",
      "title": "Master storytelling",
      "content": "I had no expectations towards this series and I was so glad to be surprised. The story is amazing. Very funny and interesting. Best master ever. I really like One Punch Man, but I'll have to agree that this is better. After seeing Mob Psycho, it's very clear the author was taking this one to heart and One Punch Man was just something to have fun with. This is serious writing, even if the show is kind silly. I hope he can keep both series going. This one is a treat to people who like well crafted stories."
    },
    {
      "username": "bbidyut_s",
      "userUrl": "https://www.imdb.com/user/ur67598910",
      "reviewLink": "https://www.imdb.com/review/rw3813652",
      "warningSpoilers": false,
      "date": "24 September 2017",
      "rate": "10",
      "helpful": "49 out of 49 found this helpful.",
      "title": "One is a legend and so are his works...",
      "content": "i loved it so so so so very much... it deserves a perfect 10, no some mere 8.0... well, when i saw this anime, i thought it was older than ONE PUNCH MAN based on the animations but after a few i got to know that it was the vice versa actually... i hope a season 2 comes up soon... the characters were all awesome... the lead Shigeo Kageyama was marvellous, and so were his master and Dimple... its one of a kindgive it a try, everyone, YOU WILL NOT REGRET IT..."
    },
    {
      "username": "puneetsharma9",
      "userUrl": "https://www.imdb.com/user/ur55322044",
      "reviewLink": "https://www.imdb.com/review/rw4672204",
      "warningSpoilers": false,
      "date": "18 February 2019",
      "rate": "10",
      "helpful": "28 out of 32 found this helpful.",
      "title": "The first series is fun and second series is perfectly sweet",
      "content": "First season is fine and interesting you like it. As it overpower hero like Sitama but with different nature and can solve anything easily.But The second season is incredible if anyone give this show less then 10/10 then it is crime. Every episode * sweet lesson of life and actual development of character i.e. MOB. He turning more mature day by day and most of lesson give you tear of joy."
    },
    {
      "username": "sakram",
      "userUrl": "https://www.imdb.com/user/ur52753736",
      "reviewLink": "https://www.imdb.com/review/rw3516585",
      "warningSpoilers": false,
      "date": "30 July 2016",
      "rate": "10",
      "helpful": "59 out of 76 found this helpful.",
      "title": "Another masterpiece by One, and the style of animating makes it even better!",
      "content": "This is, without exaggerating, the best summer anime for this year, maybe the best anime for the year... the plot is epic, credits to ONE, regardless to the well-known series of One Punch Man which also scored a high rating too...The style of animation, that looks kinda \"Weak\", is not. The studio included a very high rate of FPS which makes the animation smooth, and the drawing style itself fits the story and the characters better ! Just imagine if it were detailedly drawn like One Punch Man, it wouldn't have that charm...Long story short, all hail Mob Psycho !"
    },
    {
      "username": "Protogeist",
      "userUrl": "https://www.imdb.com/user/ur75650931",
      "reviewLink": "https://www.imdb.com/review/rw4716171",
      "warningSpoilers": true,
      "date": "11 March 2019",
      "rate": "9",
      "helpful": "10 out of 10 found this helpful.",
      "title": "The importance of self-improvement",
      "content": "Mob Psycho 100 has a very large fanbase and is widely loved throughout the anime community. That means that you are kind of required to like the show. Of course, people will respect your opinion, but some will not. So when I first watched this show, it felt like I was forcing myself to enjoy the show. But deep inside, I knew that I wasn't enjoying it as much as I thought. And I don't know why. I hadn't done that before, so it was very confusing. But that was it. I said that I loved watching the show when I really wasn't.So, then we go forward 6 months, and it is the day before school starts after Christmas break. My mind didn't get over that I could accidentally wake up late, and that it would ruin the whole year. So I really wanted to go to sleep. And eventually, it happened. But then I woke up again. I saw that there wasn't any sunlight coming through the curtain, but that is common for Sweden in January, so I just thought it was 6 am or something. But I looked at the clock, and it was 2 am. I immediately panicked and didn't know what to do. Should I go to sleep, where there's a possibility that I wake up late? Or should I stay up and hope that I don't fall asleep. And eventually, I decided to stay up. I know it was stupid, but I couldnät risk waking up late. So I had to watch something to keep me awake. I knew I couldn't watch youtube all night, cause I knew I would run out of videos eventually. Then I got an idea. Since Mob Psycho 100 was getting another season, and I hadn't watched the first episode yet, I decided that I could rewatch the first season. And it was a really good experience. It is one of the first shows in a long time that I could watch 10 episodes of in a row. And that's where I noticed more of the themes in the show. Always striving for self-improvement. And that's something that was really interesting about the show. Cause in many shounen shows, the main character is born with powers, and that's how they save the world. They might change throughout the show, but they rarely try to become better people. And that's where Shigeo from Mob Psycho differs. Cause rather than using his powers to become popular, he tries to become something more. Cause inside, he feels that if his powers weren't there, then he wouldn't be anything. So that's kind of what the show is about IMO. How Shigeo tries to not use his powers and to become a better person. And that's what makes his character so powerful. That's what makes him unique.But there was also another aspect that was handled as well. But I would recommend watching the show before reading this part.At the beginning of the show, we are introduced to Reigen. He is a con-artist, and at first, we believe that he manipulates mob and uses his powers for money. Even though he gives Shigeo a wage, it is very small. He tricks him into believing that he also has powers. That \"I have different power, so you can't sense it\", or that \"I can't sense the ghost cause it's too small\". But as the series goes, Reigen is probably the best person on the show. He is the one that tells Shigeo to not use his powers on other people. Or that it's okay to run away if you're scared. And it is at the very end that we see how important Shigeo and Reigens relationship is. How Reigen made Shigeo think that he had powers so that he could relate to someone. So that he could talk to someone, without feeling weird And that's the best thing about Mob Psycho 100. How human the characters feel, even though the show doesn't look like it would give you that Solid 9/10"
    },
    {
      "username": "invisibleunicornninja",
      "userUrl": "https://www.imdb.com/user/ur85371862",
      "reviewLink": "https://www.imdb.com/review/rw4341222",
      "warningSpoilers": false,
      "date": "16 September 2018",
      "rate": "10",
      "helpful": "16 out of 19 found this helpful.",
      "title": "Fantastic",
      "content": "This is a hilarious anime that really leans into what it means to be animated. The movements and action scenes are well-chorographed and expressive. The characters are interesting, and there isn't a single element that falls flat on its face (I mean Mob does that a few times but still). Anything I could say about this show is would just be repetitive praise. I would highly recommend watching this one."
    },
    {
      "username": "AdityaDev007",
      "userUrl": "https://www.imdb.com/user/ur103998856",
      "reviewLink": "https://www.imdb.com/review/rw6422356",
      "warningSpoilers": false,
      "date": "30 December 2020",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "A Modern Shonen for Modern Teenagers",
      "content": "The story is focused on this philosophy that \"You are Not Special\" so you are the one 'who can be what you want to be' it shows us how the people shouldn't have hate for anyone and emotionswhich we lacks the most in modern culture. The Story is about Shigeo Kageyama a boy who has fond of god gifted psychic powers in a world where many people like him use their people in abstract ways, some uses it for good cause, some for self pleasure and getting while some uses it for bad intentions. It may sound to you like a common shonen but the journey of the character in the story with its friend is more beautifully executed than my words in review. There are many topics in the show shown like, Greed, Envy, loneliness, love, friendship, brotherhood etc on different characters ideologies. The Opening music of both seasons is seriously one of the best in anime history and ending music is ok. Its a must watch for shounen anime fans,Action sequences are one of the best executed in anime history will give you goosebumps the quality animations is done by one of the god tier animation studio:Bones"
    },
    {
      "username": "loganholley",
      "userUrl": "https://www.imdb.com/user/ur64778509",
      "reviewLink": "https://www.imdb.com/review/rw4719838",
      "warningSpoilers": false,
      "date": "13 March 2019",
      "rate": "8",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Perspective from a non-anime fan",
      "content": "Before diverging into my opinions, I must make note of something here: I am not big into anime. I love Ghibli (I mean, who doesn't?), liked Your Name quite a bit, and had one hell of a time watching through the first season of One Punch Man, but those barely scratch of the surface of what I hear my peers talking about on a day-to-day basis. My issues with Mob Psycho may be tied to the fact there's a cultural difference between how stories are told in Japan as opposed to the West, although (have thoroughly enjoyed more than a couple of foreign films from Japan) I believe it's more or less something tied to Anime, in general. I dunno, correct me if I'm wrong or something, I tend to be wrong a lot.***Mob Psycho 100 hinges on being hilarious, bat**** insane, brilliant, and confusing all at the same time. It's more of a slow burn than you'd expect, but once it gets moving, it REALLY gets moving. The animation is pitch perfect, with every frame feeling detailed and unique. The main characters are excellently developed, with some side characters being pretty good, too. All in all, it's a fun show. The first season might be a bit more coherent in a few areas, but the second season is chock full of shocking, surprising, memorable, and pulse-pounding moments.Now here's where I get into my issues with the show. My first issue relates more to the second season than the first, but it does rear its head throughout. The presentation in Mob Psycho, while certainly original and used for some gut-busting moments, can be really confusing at times. The amount of times I've needed to ask the people around me what piece of vital information I missed pales in comparison to any of the non-sensical things David Lycnh has put out. This is the least of my problems with the show. There are also: side characters that are really easy to forget about and characters that just kind of exist. My biggest issue with this show relates to a major plot point that the later episodes of both seasons focus on. The second season handles it with grace and I don't really have an issue with it. The first season, though? Ugh, it still irks me to this day. I'm not going to directly reveal what happens here for the sake of your convience, but what happens is given very little build up and just sort of ends anti-climatically. It tells you very little about the characters, doesn't really go anywhere, and just seems to exist.Regardless, I'd highly recommend Mob Psycho 100. It's a fun, albeit flawed, time from my perspective, but my friends who are way more into Anime than I am say it's better than I think it is."
    },
    {
      "username": "sweetsoumyanetra",
      "userUrl": "https://www.imdb.com/user/ur60574587",
      "reviewLink": "https://www.imdb.com/review/rw4295050",
      "warningSpoilers": false,
      "date": "20 August 2018",
      "rate": "10",
      "helpful": "27 out of 27 found this helpful.",
      "title": "You don't wanna miss this",
      "content": "Get ready to be inspired, mesmerised and thoroughly entertained by the most visually and musically satisfying show that's not only gonna tickle your funny bone but make you fall in love with the extraordinarily ordinary leading character Mob, who is relatable on so many levels. If you're looking to laugh your ass off and not be able to take your eyes off of the screen and be unable to switch off an infectious intro and outro from playing in your head, this show is for YOU."
    },
    {
      "username": "ericwaldau-94911",
      "userUrl": "https://www.imdb.com/user/ur77487370",
      "reviewLink": "https://www.imdb.com/review/rw5264843",
      "warningSpoilers": false,
      "date": "18 November 2019",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "a new classic",
      "content": "A new modern anime classic.. i had a hard time finding an anime i liked after i started off the genre by watching death note, then FMA Brotherhood. yes i set the bar high. until i saw Mob Psycho 100. its got action , comedy and definitely keeps you interested. superb storytelling and comedic value is on point never cheesy like other anime. DONT watch the live-action netflix adaptation though. Also, if you like MP100 i high'y recommend one punch man and jojo's bizarre adventure."
    },
    {
      "username": "miguelweidlich",
      "userUrl": "https://www.imdb.com/user/ur68288339",
      "reviewLink": "https://www.imdb.com/review/rw4495681",
      "warningSpoilers": false,
      "date": "5 December 2018",
      "rate": "10",
      "helpful": "30 out of 35 found this helpful.",
      "title": "The greatest anime since Fullmetal Alchemist",
      "content": "One is one of the best writers of our time! He gave us not one, but two action packed and hilarious comedies with a lot of heart and emotion. But between this and OPM, I would definitely prefer this! A great history with some of the best characters the anime industry has to offer (Specially Shigero Kageyama or Mob) and all packed into a anime with THE BEST 2D ANIMATION OF ALL TIME (And that includes movies like The Lion King and Prince of Egypt) and a great soundtrack and we have a anime giant! A must watch if you like action and/or comedic shows!"
    },
    {
      "username": "tikkitoby",
      "userUrl": "https://www.imdb.com/user/ur88414273",
      "reviewLink": "https://www.imdb.com/review/rw4170698",
      "warningSpoilers": false,
      "date": "19 May 2018",
      "rate": "10",
      "helpful": "58 out of 60 found this helpful.",
      "title": "My favorite Anime!",
      "content": "It's a shame that this show was overshadowed by Yuri On Ice back in 2016 when it came out, because this show is fantastic! The animation is creative and good quality, the soundtrack is one of my favorites out of any media, the characters are well developed, the pacing is good, and it's a relatable story line without just being about a crush in high school. ONE's stories are always told well in a creative way, and his trademark overpowered characters are handled really well. Mob Psycho also presents a good message that a lot of anime with OP characters tend to mess up; that your powers/skills don't make you any better than anyone else. Mob at a young age is told that psychic powers are the same as having any other talent or skill, like being good at math or sports. This is refreshing as a lot of main characters are constantly being told that they're special in some way, good or bad, because of their powers. Another refreshing part of the story is that kids actually ask adults for help, and the adults help them. It may sound stupid, but think of how many shows have a plot line where the adults: A. don't understand, B. aren't told anything, or C. refuse to help for no reason. Probably a lot, right? Mob Psycho has actual RESPONSIBLE adults in it. Revolutionary. These are just a few of the nice changes from the norm to come out of Mob Psycho 100, but there are plenty more and I'd highly suggest watching it!"
    },
    {
      "username": "mommeluv",
      "userUrl": "https://www.imdb.com/user/ur77295828",
      "reviewLink": "https://www.imdb.com/review/rw3731270",
      "warningSpoilers": false,
      "date": "15 June 2017",
      "rate": "10",
      "helpful": "20 out of 20 found this helpful.",
      "title": "2016's Best",
      "content": "ONE does it again with another brilliant action show, bringing humor and heart along for the ride. The messages are positive, and there are some great role models here too! As for gore, it isn't as severe as OPM, a previous creation by ONE. No sexual content, the slightest thing that comes close is a ghost haunting someone because they keep going to, lets say R RATED websites. Language is fair. SUGGESTED MPAA RATING: Rated PG-13 for Paranormal action, violence, and language"
    },
    {
      "username": "todd-28443",
      "userUrl": "https://www.imdb.com/user/ur70794451",
      "reviewLink": "https://www.imdb.com/review/rw3607683",
      "warningSpoilers": false,
      "date": "27 December 2016",
      "rate": "10",
      "helpful": "58 out of 63 found this helpful.",
      "title": "Best anime of 2016",
      "content": "I've never felt the need to write a review before. However, I was shocked at how low this series has been ranked. As someone who loved One Punch Man and feels it deserves its high ranking, let me tell you that Mob Psycho 100 is a superior anime.I can sum up why Mob Psycho 100 is better in one phrase; it's more relatable. Mob is a socially awkward kid with no talents, popularity, or interesting qualities other than his immense psychic powers. In order to have a fulfilling life, he has to force himself down the hard road to becoming a better person. All the while meeting people who have let power turn themselves into empty husks.The animation while not as highly detailed as One Punch Man, was incredibly creative and expressive, spanning a half a dozen different mediums. There were no dull boring still scenes in this anime."
    },
    {
      "username": "bmayank-98491",
      "userUrl": "https://www.imdb.com/user/ur105856169",
      "reviewLink": "https://www.imdb.com/review/rw7763039",
      "warningSpoilers": false,
      "date": "16 January 2022",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Good show !!",
      "content": "Similar to one punch man but it has its own energy..you never get bored watching this anime... love this series.A must watch. Reigen is awesome character and Mob is just so innocent. Best duo."
    },
    {
      "username": "armed_army",
      "userUrl": "https://www.imdb.com/user/ur96852807",
      "reviewLink": "https://www.imdb.com/review/rw4534306",
      "warningSpoilers": false,
      "date": "25 December 2018",
      "rate": "10",
      "helpful": "19 out of 19 found this helpful.",
      "title": "Criminally underrated",
      "content": "I started this anime going in completely blind after getting my dose of OPM - after watching the first few minutes of the first episode, I was hooked. The use of different mediums of animation techniques both in traditional cell animation and WC distortion blew me away as an animator myself. Recommended this series to my brother whom doesn't resonate with anime as much as myself and he absolutely loved it too!The slapstick humour can be a bit obnoxious at times but I see it as part of PM100s charm.. the animation fits it perfectly and it just makes it stand out from every other AAA anime out right now. My new favourite thing. ONE/BONE Studios is proving to be an outstanding competitor(s) in the anime \"game of thrones\"."
    },
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw8289116",
      "warningSpoilers": false,
      "date": "30 June 2022",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Another entertaining series from the creator of One Punch Man",
      "content": "A fun action-anime series, with lots of bizarre humor.Like One Punch Man, it has plenty of impressive fighting scenes, and despite its fast pacing, it never feels rushed.The characters are likeable and fun, and the animation is quite well done, with plenty of stylish sequences.Definately one of the best series of its kind, and I personally think it gets progressively better as the story advances."
    },
    {
      "username": "Movi3DO",
      "userUrl": "https://www.imdb.com/user/ur130195767",
      "reviewLink": "https://www.imdb.com/review/rw7109500",
      "warningSpoilers": false,
      "date": "10 July 2021",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Season 1 only for now.",
      "content": "One Punch Man but with hair?The story of Kageyama Shigeo, a shy and socially awkward middle schooler who possessed incredible psychic power.While watching this show, I can't help but see the striking similarity to One Punch Man. The look of the main characters with their immense and unexplainable amount of power were basically the same. However, I believed Mob Psycho uses this premise in a considerably more personal and clever way than One Punch Man. While One Punch Man exists mostly for great action, Mob Psycho used the power to illustrate the emotions of a kid who was going through the coming-of-age stage in his life.The emotions stored as a way of charging up Mob's power, although done many times before in other shows or movies, still was unique and clever. As he became more conflicted, I felt like something was building up within me too. If you tried to hold everything in for too long, eventually you will release and snap.The animation was also another unique part. At first, I thought the characters looked annoying and weird, but I believed there's a reason for this, which connects with the theme of the show. The animation for the fight scenes, although not as clean and awesome as One Punch Man, was still beautifully thrilling and satisfying to watch. This also helps intensifying Mob whenever he got fully charged up. He looked so menacing and dangerous, which I loved a lot.The show was hilarious. Many moments made me just laugh out loud. The character Reigen was so funny, even though he was a bit annoying couple of times.The overall theme of the show was about figuring out who you are and what you are defined as. Different characters in the show went through identity crises where they tried to be like others while ignoring what made themselves special. However, the show added another layer about being delusional about one's ability and what to use one's ability for. These themes worked incredibly well with the unique premise of the show, which made it personal for many characters, especially Mob, and I became intrigued in these characters' journeys.Overall, it was both satisfying through great display of superpowers and personal through clever usage of premise and theme. One of the best anime that I have watched. 10/10."
    },
    {
      "username": "ACollegeStudent",
      "userUrl": "https://www.imdb.com/user/ur118665987",
      "reviewLink": "https://www.imdb.com/review/rw6946046",
      "warningSpoilers": true,
      "date": "20 May 2021",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Simple Story Simple Themes about Coming of Age",
      "content": "Rating: 8.0Favorite Episode: Even Then ~Continue Forward~Great, it knows what it wants to be and excels at it. Simple story simple themes with animation that was visual eye candy. I didn't like the comedy because it held the show back from carrying more weight, and I didn't like the genericism with the final villain in season 2 and its themes around the power of friendship. Though the final arc of season 3 had some contrivances like Dimple resurrecting, Reigen somehow being able to withstand ???% mob with no powers, etc. It was thematically consistent and closed everyone's character arcs well. Overall it's a solid show with flaws."
    },
    {
      "username": "Mateo-EGC",
      "userUrl": "https://www.imdb.com/user/ur147942948",
      "reviewLink": "https://www.imdb.com/review/rw8346070",
      "warningSpoilers": false,
      "date": "18 July 2022",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "The power of empathy",
      "content": "It is an anime filled with a lot of action and a lot of comedy, as well as conveying a lot of good messages through Mob and his friends.I liked season 1 and 2 very much. Its animation is incredible, it has very good battles with a great direction, accompanied by very good soundtracks.It has characters that I liked a lot, like Reigen; for being a great guy and making me laugh, and Mob; a character with a lot of empathy and whose greatest power is the dialogue.I would have liked to see the seriousness and chaos caused by a catastrophe. But in itself, the anime is just too cool."
    },
    {
      "username": "quentinwharton-70401",
      "userUrl": "https://www.imdb.com/user/ur111317199",
      "reviewLink": "https://www.imdb.com/review/rw5344575",
      "warningSpoilers": false,
      "date": "22 December 2019",
      "rate": "8",
      "helpful": "7 out of 8 found this helpful.",
      "title": "When Animation Reaches 100%",
      "content": "(Rating as an anime) Mob Psycho 100 is a phenomenon, engineered by a culmination of many talented people to be the most visually stunning experience that it could be. It is impossible to truly praise Mob Psycho without mentioning the animation, as it is one of the key reasons that the show is so great. Every action scene is gorgeous, with every vibrantly colored flash of light complimenting each fluid movement, this show goes all out. Not only does this show have amazing visual effects and excellent fighting choreography, but it also has some of the most expressive characters I've ever seen. Facial expressions are actually expressive rather than stagnant and lifeless. The show also introduces a lot of unique visual gags that actually made me laugh quite a few times. There's a lot more to be said about the animation, but there's also much to say about the writing. Mob Psycho 100 is a charming coming of age story about a boy with psychic powers learning to grow as a person, so that one day he will no longer need to rely on his psychic abilities. Mob is not physically strong, smart, popular, or attractive. He's socially awkward, and he wants nothing more than to be noticed by his peers. Despite all of his shortcomings, he never uses his psychic powers to attract attention to himself, in order to prove to himself that he is worth more than the powers that were handed to him. All of the conflicts in this show center around Mob's emotions. It's extremely charming and it leads to a lot of powerful moments that are genuinely moving. The show also has a pretty good sense of humor, with clever jokes placed throughout the show that have gotten a lot of genuine laughs from me. It's obvious that a lot of passion was put into Mob Psycho 100, and I'm rating it an 8/10."
    },
    {
      "username": "benplays-79777",
      "userUrl": "https://www.imdb.com/user/ur112643610",
      "reviewLink": "https://www.imdb.com/review/rw7373925",
      "warningSpoilers": false,
      "date": "23 September 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "ONE> OF THE BEST ANIMES I HAVE EVER SEEN .",
      "content": "Im sitting here trying to gather words to type about this masterpiece of an anime. I have that feeling of wow this is over and now everything feels weird, and not even Attack on Titan did that to me. Probably because im hard struck that the manga is over at 16 volumes so hopefully they make a season 3, because there are still things that need to be covered....(beginning fight scene?) The animation is.... The absolute best i have ever seen . The character development is top tier, If any characters die i would like actually grieve like i did about deaths in AoT or Death Note, where i felt like i had lost a family member. Defiantly Top 3 favorite anime."
    },
    {
      "username": "dimitridematosviana",
      "userUrl": "https://www.imdb.com/user/ur130395174",
      "reviewLink": "https://www.imdb.com/review/rw8749551",
      "warningSpoilers": false,
      "date": "22 December 2022",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "one of the few animes that manage to portray adolescence well",
      "content": "When talking about adolescence in anime, it's always something forced, girls bullying you with their big breasts (however, a girl who bullies you is in love with you), even with things. American But with mob it's different, here we see an introverted young man, who doesn't know how to get along with other people, however, he has paranormal powers, but he doesn't like them, mob just wants to live a normal life.And he goes through a lot of stuff and stuff, that if you have more than 12 years, you know (except if you have 50 years old, and pass your entire adolescense in vietnam war)This anime has an incredible balance of comedy (it made me laugh, I admit) and action (fights with incredible animation made by studio bones, the same studio behind Fullmetal Alchemist Brotherhood, another anime that I love) Just watch, that's it.Oh, and while I'm writing this review, the last episode of the third season and the anime has just been released (the second best episode)"
    }
  ],
  "errorMessage": ""
}