{
  "imDbId": "tt5897304",
  "title": "Mob Psycho 100",
  "fullTitle": "Mob Psycho 100 (TV Series 2016–2022)",
  "type": "TVSeries",
  "year": "2016",
  "language": "en",
  "titleInLanguage": "Mob Psycho 100",
  "url": "https://en.wikipedia.org/wiki/Mob_Psycho_100",
  "plotShort": {
    "plainText": "Mob Psycho 100 (Japanese: モブサイコ100, Hepburn: Mobu Saiko Hyaku) is a Japanese web manga series written and illustrated by One. It was serialized on Shogakukan's Ura Sunday website from April 2012 to December 2017. It has been also available online on Shogakukan's mobile app MangaONE since December 2014. Shogakukan compiled its chapters in 16 tankōbon volumes. The story follows Shigeo Kageyama, nicknamed Mob, a boy who has strong psychic powers, and his struggles to find the simple happiness he is looking for.\r\nAn anime television series adaptation was produced by Bones. The first season aired between July and September 2016, followed by a second season from January to April 2019, and a third and final season from October to December 2022. A live-action series adaptation aired from January to April 2018. A spin-off manga series, titled Reigen, was serialized in Shogakukan MangaONE app in 2018. In North America, Dark Horse Comics licensed the manga for English publication in 2018. Meanwhile, Crunchyroll licensed the anime series for streaming, with an English dub produced by Bang Zoom! Entertainment in December 2016, and broadcast on Adult Swim's Toonami block in October 2018.\r\nBy December 2022, the manga had over 2.8 million copies in circulation. In 2017, Mob Psycho 100 won the 62nd Shogakukan Manga Award in the shōnen category. The anime adaptation has been considered one of the best anime series of the 2010s.",
    "html": "<p>Mob Psycho 100 (Japanese: モブサイコ100, Hepburn: Mobu Saiko Hyaku) is a Japanese web manga series written and illustrated by One. It was serialized on Shogakukan's Ura Sunday website from April 2012 to December 2017. It has been also available online on Shogakukan's mobile app MangaONE since December 2014. Shogakukan compiled its chapters in 16 tankōbon volumes. The story follows Shigeo Kageyama, nicknamed Mob, a boy who has strong psychic powers, and his struggles to find the simple happiness he is looking for.</p><p>An anime television series adaptation was produced by Bones. The first season aired between July and September 2016, followed by a second season from January to April 2019, and a third and final season from October to December 2022. A live-action series adaptation aired from January to April 2018. A spin-off manga series, titled Reigen, was serialized in Shogakukan MangaONE app in 2018. In North America, Dark Horse Comics licensed the manga for English publication in 2018. Meanwhile, Crunchyroll licensed the anime series for streaming, with an English dub produced by Bang Zoom! Entertainment in December 2016, and broadcast on Adult Swim's Toonami block in October 2018.</p><p>By December 2022, the manga had over 2.8 million copies in circulation. In 2017, Mob Psycho 100 won the 62nd Shogakukan Manga Award in the shōnen category. The anime adaptation has been considered one of the best anime series of the 2010s.</p>"
  },
  "plotFull": {
    "plainText": "Mob Psycho 100 (Japanese: モブサイコ100, Hepburn: Mobu Saiko Hyaku) is a Japanese web manga series written and illustrated by One. It was serialized on Shogakukan's Ura Sunday website from April 2012 to December 2017. It has been also available online on Shogakukan's mobile app MangaONE since December 2014. Shogakukan compiled its chapters in 16 tankōbon volumes. The story follows Shigeo Kageyama, nicknamed Mob, a boy who has strong psychic powers, and his struggles to find the simple happiness he is looking for.\r\nAn anime television series adaptation was produced by Bones. The first season aired between July and September 2016, followed by a second season from January to April 2019, and a third and final season from October to December 2022. A live-action series adaptation aired from January to April 2018. A spin-off manga series, titled Reigen, was serialized in Shogakukan MangaONE app in 2018. In North America, Dark Horse Comics licensed the manga for English publication in 2018. Meanwhile, Crunchyroll licensed the anime series for streaming, with an English dub produced by Bang Zoom! Entertainment in December 2016, and broadcast on Adult Swim's Toonami block in October 2018.\r\nBy December 2022, the manga had over 2.8 million copies in circulation. In 2017, Mob Psycho 100 won the 62nd Shogakukan Manga Award in the shōnen category. The anime adaptation has been considered one of the best anime series of the 2010s.\r\nPlot\r\nShigeo Kageyama is an average middle school-aged boy, nicknamed Mob. Although he looks like an inconspicuous person, he is in fact a powerful esper with immense psychic power. To keep from losing control of this power, he constantly lives a life under an emotional shackle. In order to help learn how to control his abilities, Mob works as an assistant to con-man Arataka Reigen, a self-proclaimed spirit medium. Mob wants to live a normal life just like those around him, but a barrage of trouble keeps coming after him. With his suppressed emotions growing inside Mob little by little, his power threatens to break through its limits as he eventually encounters other espers like the Claws.\r\nMedia\r\nWebcomic and publications\r\nWritten and illustrated by One, Mob Psycho 100 began in Shogakukan's Ura Sunday webcomic magazine on April 18, 2012. It has been also available on Shogakukan's mobile app MangaONE since December 2014. The series finished on December 22, 2017. Shogakukan collected its chapters in 16 tankōbon volumes, released from November 16, 2012, to July 19, 2018.\r\nDark Horse Comics announced on April 23, 2018, that they have licensed the series for English serialization in North America, with the first volume which was released on October 24, 2018.\r\nA spin-off manga series titled Reigen was serialized online in Ura Sunday website and in the MangaONE mobile app starting on March 19, 2018. Shogakukan released a compiled volume on February 19, 2019. In March 2020, Dark Horse Comics announced the acquisition of the manga for English-language release. The volume was published on December 2, 2020.\r\nVolume list\r\nAnime\r\nOn December 2, 2015, Ura Sunday announced that Mob Psycho 100 would be adapted into an anime television series. The anime adaptation was produced by Bones and directed by Yuzuru Tachikawa. Hiroshi Seko wrote the scripts, Yoshimichi Kameda designed the characters, and Kenji Kawai composed the music. The series aired between July 12, 2016, and September 27, 2016, on Tokyo MX, later airing on ytv, BS Fuji and TV Asahi Channel 1. The opening theme song, \"99\", is performed by Mob Choir while the ending theme song, titled \"Refrain Boy\" (リフレインボーイ, Rifurein Bōi), is performed by All Off.\r\nMob Psycho 100 was simulcast on Crunchyroll, while Funimation broadcast the show's simuldub. The English dub was produced by Bang Zoom! Entertainment. The series was simulcast on Animax in Southeast Asia. The Bang Zoom!-produced dub has been released on Blu-ray + DVD Combo Pack with a limited edition on December 5, 2017, and the first season was broadcast on Adult Swim's Toonami programming block beginning on October 27, 2018. According to Jason DeMarco, Adult Swim executive producer, legal issues arose with the licensing of the second season at the time, as the Japanese version was licensed by Crunchyroll, and the English version was licensed by Funimation, and it prevented the second season from the airing on the block. At the time of the legal incident, both companies were not owned by a single conglomerate company. The third season would also not air on the block, mainly due in part to Crunchyroll's \"unwillingness\" to work with Adult Swim on syndication deals for most of their licensed catalog. The series was also streamed on HBO Max in the United States until August 3, 2022. Madman Entertainment imported Funimation's release in Australia and New Zealand, and Manga Entertainment distributed the series in the United Kingdom and Ireland.\r\nFollowing a screening of three Bones films, attendees reported that Bones teased that progress was being made on a further Mob Psycho 100 anime project. In October 2017, an event anime titled Mob Psycho 100 Reigen ~The Miraculous Unknown Psychic~ (モブサイコ100 REIGEN ～知られざる奇跡の霊能力者～, Mob Psycho 100 Reigen ~Shirarezaru Kiseki Reinōryokusha~) was revealed. It is a 60-minute compilation of the anime series and features new scenes focused on Arataka Reigen. The event anime was screened twice at the Maihama Amphitheater in Chiba on March 18, 2018, and was later released on home video. At the end of the event, a second season of the anime series was announced, with the staff and voice cast returning to reprise their roles. Mob Psycho 100 II aired from January 7 to April 1, 2019, with the series being simulcast on Crunchyroll. On April 18, 2019, Funimation and Crunchyroll confirmed that season two would simuldub on April 25. The opening theme for the second season is \"99.9\" by Mob Choir feat. sajou no hana. Four ending themes performed by sajou no hana; \"Gray\" (グレイ, Gurei), \"Memosepia\" (メモセピア), \"Mabuta no Ura\" (目蓋の裏, lit. \"Under the Eyelids\") and \"Ikiru Hitobito\" (いきるひとびと, lit. \"Living People\"), were used for the second season.\r\nFollowing the conclusion of the second season, another OVA was announced, with Yuzuru Tachikawa reprising his role as director. The OVA, titled Mob Psycho 100: The Spirits and Such Consultation Office's First Company Outing ~A Healing Trip that Warms the Heart~ (モブサイコ100 第一回霊とか相談所慰安旅行~ココロ満たす癒やしの旅, Mob Psycho 100 Dai Ikkai Rei to ka Sōdansho Ianryokō ~Kokoro Mitasu Iyashi no Tabi~) was released on September 25, 2019. The second OVA episode premiered worldwide at Crunchyroll Expo 2019 on September 1, 2019. Simulcast streaming of the OVA episode on Crunchyroll began worldwide (except Asia) on September 25, 2019.\r\nOn October 19, 2021, it was announced that a third season was in production. Takahiro Hasui directed the season, with Yuzuru Tachikawa serving as chief director. The main cast and staff reprised their roles. Mob Psycho 100 III aired from October 6 to December 22, 2022. The opening theme is \"1\", and the ending theme is \"Cobalt\", both performed by Mob Choir.\r\nThe third season's simuldub was slated to be produced by Crunchyroll rather than Bang Zoom! with some roles recast, due to the choice to move dub production to in-person recording sessions at their Dallas based studio, rather than remote recordings, after largely relying on the latter at the start of the COVID-19 pandemic. Among the planned recastings was the voice of Mob, Kyle McCarley, who stated that he would likely not be reprising the role as Crunchyroll had refused to negotiate a potential union contract for future anime dubbing productions with McCarley's union SAG-AFTRA. McCarley had offered to work non-union on season 3 under the condition that Crunchyroll discuss with SAG-AFTRA, but as this did not proceed, McCarley will likely not return. This news prompted much criticism of Crunchyroll on social media.\r\nDrama\r\nA 12-episode Japanese television drama was broadcast on TV Tokyo's MokuDora 25 timeslot from January 18 to April 5, 2018.\r\nOther media\r\nA fanbook was published on November 17, 2022. It includes detailed information about the series, its characters, story and setting. It also features illustrations by various manga artists, including Hiromu Arakawa, Kotoyama, Takako Shimura, Nagano, Ryōji Minagawa and Itaru Bonnoki.\r\nReception\r\nManga\r\nMob Psycho 100 won the 62nd Shogakukan Manga Award in the shōnen category in 2017. By July 2016, Mob Psycho 100 had over 1.2 million copies in circulation. The comic book writers of San Diego Comic-Con listed it as one of the \"Most Wanted Manga\" from 2016. By December 2022, the manga had over 2.8 million copies in circulation.\r\nCritical reception\r\nIan Wolf from Anime UK News praised the first two volumes of the series, giving them 8 out of 10, and stated \"One’s art is notable for a few reasons. The art is designed to be humorous rather than stylish. Part of the comedy value in One’s work is the rough styling that adds to the scenarios he creates. In this second volume of Mob Psycho 100, it is the action which is the main focus. There is some comedy thrown into the mix as well, but mainly this time it is about the battle between the two psychics and their different philosophies. It is also interesting to witness this fight because it is one in which one of the participants is trying their hardest not to fight, while the other is giving it all they’ve got. Having said this, there is still some comedy added to the heat of the battle, the main highlight being when Teru tries to use knives to beat Mob, but Mob deflects one of the knives away, accidentally cutting off a massive chunk of Teru’s hair. It is at times like this where One’s art style can sometimes fall down. His rough artwork does lead neatly to the chaotic scenes he is trying to depict at the height of the fight but when it comes to the more dramatic moments, the rough style lacks pathos. Here, the anime has the edge when it depicts the fight because other elements such as the music or the use of colour can add to the tension\".\r\nAnime\r\nIn the 1st Crunchyroll Anime Awards, the first season of the anime series received two awards: Best Action and Best Fight Scene (Shigeo vs. Koyama). It was also nominated in six other categories, including \"Anime of the Year\". At the 4th Crunchyroll Anime Awards in 2020, the second season of the anime also won two awards: Best Animation and Best Opening Sequence for \"99.9\" by Mob Choir feat. Sajou no Hana. It was also nominated in five other categories, including \"Anime of the Year\". Mob Psycho 100 was one of the Jury Recommended Works in the Animation Division at the 20th Japan Media Arts Festival in 2017. In November 2019, Polygon named Mob Psycho 100 as one of the best anime of the 2010s, and Crunchyroll listed it in their \"Top 25 best anime of the 2010s\". IGN also listed Mob Psycho 100 among the best anime series of the 2010s.\r\nIn September 2020, the series went viral after American businessman Eric Trump, son of then-President Donald Trump, published a tweet connecting the series to allegations of censorship by Google, due to Google Search results for \"mob\" showing Mob's face rather than a group of people.\r\nCritical reception\r\nAnime News Network listed the first season of Mob Psycho 100 among the best anime series of 2016. Nick Creamer praised the series' visual style, character story and its concepts of heroism and society also presented in ONE's other work One-Punch Man. Lauren Orsini commended the coming-of-age story of Mob and praised the series' animation and music. James Beckett of Anime News Network gave the second season an A+, and describes the series as \"I don't know how else to put it: Mob Psycho 100 II is about as close to perfect a season of television as I can imagine. I am willing to bet that the series will go down as one of the best seasons of anime ever produced, and you owe it to yourself to experience it first-hand. A modern masterpiece of animation that needs to be seen to be believed\".",
    "html": "<p>Mob Psycho 100 (Japanese: モブサイコ100, Hepburn: Mobu Saiko Hyaku) is a Japanese web manga series written and illustrated by One. It was serialized on Shogakukan's Ura Sunday website from April 2012 to December 2017. It has been also available online on Shogakukan's mobile app MangaONE since December 2014. Shogakukan compiled its chapters in 16 tankōbon volumes. The story follows Shigeo Kageyama, nicknamed Mob, a boy who has strong psychic powers, and his struggles to find the simple happiness he is looking for.</p><p>An anime television series adaptation was produced by Bones. The first season aired between July and September 2016, followed by a second season from January to April 2019, and a third and final season from October to December 2022. A live-action series adaptation aired from January to April 2018. A spin-off manga series, titled Reigen, was serialized in Shogakukan MangaONE app in 2018. In North America, Dark Horse Comics licensed the manga for English publication in 2018. Meanwhile, Crunchyroll licensed the anime series for streaming, with an English dub produced by Bang Zoom! Entertainment in December 2016, and broadcast on Adult Swim's Toonami block in October 2018.</p><p>By December 2022, the manga had over 2.8 million copies in circulation. In 2017, Mob Psycho 100 won the 62nd Shogakukan Manga Award in the shōnen category. The anime adaptation has been considered one of the best anime series of the 2010s.</p><br/><h3>Plot</h3><p>Shigeo Kageyama is an average middle school-aged boy, nicknamed Mob. Although he looks like an inconspicuous person, he is in fact a powerful esper with immense psychic power. To keep from losing control of this power, he constantly lives a life under an emotional shackle. In order to help learn how to control his abilities, Mob works as an assistant to con-man Arataka Reigen, a self-proclaimed spirit medium. Mob wants to live a normal life just like those around him, but a barrage of trouble keeps coming after him. With his suppressed emotions growing inside Mob little by little, his power threatens to break through its limits as he eventually encounters other espers like the Claws.</p><br/><h3>Media</h3><h4>Webcomic and publications</h4><p>Written and illustrated by One, Mob Psycho 100 began in Shogakukan's Ura Sunday webcomic magazine on April 18, 2012. It has been also available on Shogakukan's mobile app MangaONE since December 2014. The series finished on December 22, 2017. Shogakukan collected its chapters in 16 tankōbon volumes, released from November 16, 2012, to July 19, 2018.</p><p>Dark Horse Comics announced on April 23, 2018, that they have licensed the series for English serialization in North America, with the first volume which was released on October 24, 2018.</p><p>A spin-off manga series titled Reigen was serialized online in Ura Sunday website and in the MangaONE mobile app starting on March 19, 2018. Shogakukan released a compiled volume on February 19, 2019. In March 2020, Dark Horse Comics announced the acquisition of the manga for English-language release. The volume was published on December 2, 2020.</p><h4>Volume list</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"border-bottom: 3px solid #FF5F5F\"><th width=\"4%\"><abbr title=\"Number\">No.</abbr></th><th width=\"24%\">Original release date</th><th width=\"24%\">Original ISBN</th><th width=\"24%\">English release date</th><th width=\"24%\">English ISBN</th></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol1\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">1</th><td> November 16, 2012</td><td><style data-mw-deduplicate=\"TemplateStyles:r1133582631\">.mw-parser-output cite.citation{font-style:inherit;word-wrap:break-word}.mw-parser-output .citation q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output .citation:target{background-color:rgba(0,127,255,0.133)}.mw-parser-output .id-lock-free a,.mw-parser-output .citation .cs1-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/6/65/Lock-green.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-limited a,.mw-parser-output .id-lock-registration a,.mw-parser-output .citation .cs1-lock-limited a,.mw-parser-output .citation .cs1-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/d/d6/Lock-gray-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-subscription a,.mw-parser-output .citation .cs1-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/a/aa/Lock-red-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/4/4c/Wikisource-logo.svg\")right 0.1em center/12px no-repeat}.mw-parser-output .cs1-code{color:inherit;background:inherit;border:none;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;color:#d33}.mw-parser-output .cs1-visible-error{color:#d33}.mw-parser-output .cs1-maint{display:none;color:#3a3;margin-left:0.3em}.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right{padding-right:0.2em}.mw-parser-output .citation .mw-selflink{font-weight:inherit}</style><span>978-4-09-124102-3</span></td><td>October 24, 2018</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50670-987-1</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol2\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">2</th><td> February 18, 2013</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-124252-5</span></td><td>March 20, 2019</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50670-988-8</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol3\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">3</th><td> June 18, 2013</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-124338-6</span></td><td>July 31, 2019</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50670-989-5</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol4\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">4</th><td> July 18, 2013</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-124397-3</span></td><td>March 18, 2020</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50671-369-4</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol5\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">5</th><td> December 18, 2013</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-124543-4</span></td><td>June 24, 2020</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50671-370-0</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol6\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">6</th><td> May 16, 2014</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-124682-0</span></td><td>October 14, 2020</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50671-371-7</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol7\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">7</th><td> July 18, 2014</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-125129-9</span></td><td>October 27, 2021</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50672-759-2</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol8\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">8</th><td> October 17, 2014</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-125476-4</span></td><td>May 4, 2022</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50672-760-8</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol9\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">9</th><td> February 12, 2015</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-125748-2</span></td><td>August 17, 2022</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50672-761-5</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol10\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">10</th><td> August 4, 2015</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-126328-5</span></td><td>February 8, 2023</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50673-072-1</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol11\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">11</th><td> December 4, 2015</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-126676-7</span></td><td>May 3, 2023</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50673-073-8</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol12\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">12</th><td> June 17, 2016</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-127310-9</span></td><td>September 6, 2023</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50673-074-5</span></td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol13\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">13</th><td> August 19, 2016</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-127373-4</span></td><td>—</td><td>—</td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol14\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">14</th><td> April 19, 2017</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-127592-9</span></td><td>—</td><td>—</td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol15\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">15</th><td> October 19, 2017</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-127819-7</span></td><td>—</td><td>—</td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol16\" style=\"text-align: center; font-weight: normal; background-color: transparent;\">16</th><td> July 19, 2018</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-128460-0</span></td><td>—</td><td>—</td></tr><tr style=\"text-align: center;\"><th scope=\"row\" id=\"vol''Reigen''\" style=\"text-align: center; font-weight: normal; background-color: transparent;\"><i>Reigen</i></th><td> February 19, 2019</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-4-09-128460-0</span></td><td>December 2, 2020</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-50672-072-2</span></td></tr></tbody></table><h4>Anime</h4><p>On December 2, 2015, Ura Sunday announced that Mob Psycho 100 would be adapted into an anime television series. The anime adaptation was produced by Bones and directed by Yuzuru Tachikawa. Hiroshi Seko wrote the scripts, Yoshimichi Kameda designed the characters, and Kenji Kawai composed the music. The series aired between July 12, 2016, and September 27, 2016, on Tokyo MX, later airing on ytv, BS Fuji and TV Asahi Channel 1. The opening theme song, \"99\", is performed by Mob Choir while the ending theme song, titled \"Refrain Boy\" (リフレインボーイ, Rifurein Bōi), is performed by All Off.</p><p>Mob Psycho 100 was simulcast on Crunchyroll, while Funimation broadcast the show's simuldub. The English dub was produced by Bang Zoom! Entertainment. The series was simulcast on Animax in Southeast Asia. The Bang Zoom!-produced dub has been released on Blu-ray + DVD Combo Pack with a limited edition on December 5, 2017, and the first season was broadcast on Adult Swim's Toonami programming block beginning on October 27, 2018. According to Jason DeMarco, Adult Swim executive producer, legal issues arose with the licensing of the second season at the time, as the Japanese version was licensed by Crunchyroll, and the English version was licensed by Funimation, and it prevented the second season from the airing on the block. At the time of the legal incident, both companies were not owned by a single conglomerate company. The third season would also not air on the block, mainly due in part to Crunchyroll's \"unwillingness\" to work with Adult Swim on syndication deals for most of their licensed catalog. The series was also streamed on HBO Max in the United States until August 3, 2022. Madman Entertainment imported Funimation's release in Australia and New Zealand, and Manga Entertainment distributed the series in the United Kingdom and Ireland.</p><p>Following a screening of three Bones films, attendees reported that Bones teased that progress was being made on a further Mob Psycho 100 anime project. In October 2017, an event anime titled Mob Psycho 100 Reigen ~The Miraculous Unknown Psychic~ (モブサイコ100 REIGEN ～知られざる奇跡の霊能力者～, Mob Psycho 100 Reigen ~Shirarezaru Kiseki Reinōryokusha~) was revealed. It is a 60-minute compilation of the anime series and features new scenes focused on Arataka Reigen. The event anime was screened twice at the Maihama Amphitheater in Chiba on March 18, 2018, and was later released on home video. At the end of the event, a second season of the anime series was announced, with the staff and voice cast returning to reprise their roles. Mob Psycho 100 II aired from January 7 to April 1, 2019, with the series being simulcast on Crunchyroll. On April 18, 2019, Funimation and Crunchyroll confirmed that season two would simuldub on April 25. The opening theme for the second season is \"99.9\" by Mob Choir feat. sajou no hana. Four ending themes performed by sajou no hana; \"Gray\" (グレイ, Gurei), \"Memosepia\" (メモセピア), \"Mabuta no Ura\" (目蓋の裏, lit. \"Under the Eyelids\") and \"Ikiru Hitobito\" (いきるひとびと, lit. \"Living People\"), were used for the second season.</p><p>Following the conclusion of the second season, another OVA was announced, with Yuzuru Tachikawa reprising his role as director. The OVA, titled Mob Psycho 100: The Spirits and Such Consultation Office's First Company Outing ~A Healing Trip that Warms the Heart~ (モブサイコ100 第一回霊とか相談所慰安旅行~ココロ満たす癒やしの旅, Mob Psycho 100 Dai Ikkai Rei to ka Sōdansho Ianryokō ~Kokoro Mitasu Iyashi no Tabi~) was released on September 25, 2019. The second OVA episode premiered worldwide at Crunchyroll Expo 2019 on September 1, 2019. Simulcast streaming of the OVA episode on Crunchyroll began worldwide (except Asia) on September 25, 2019.</p><p>On October 19, 2021, it was announced that a third season was in production. Takahiro Hasui directed the season, with Yuzuru Tachikawa serving as chief director. The main cast and staff reprised their roles. Mob Psycho 100 III aired from October 6 to December 22, 2022. The opening theme is \"1\", and the ending theme is \"Cobalt\", both performed by Mob Choir.</p><p>The third season's simuldub was slated to be produced by Crunchyroll rather than Bang Zoom! with some roles recast, due to the choice to move dub production to in-person recording sessions at their Dallas based studio, rather than remote recordings, after largely relying on the latter at the start of the COVID-19 pandemic. Among the planned recastings was the voice of Mob, Kyle McCarley, who stated that he would likely not be reprising the role as Crunchyroll had refused to negotiate a potential union contract for future anime dubbing productions with McCarley's union SAG-AFTRA. McCarley had offered to work non-union on season 3 under the condition that Crunchyroll discuss with SAG-AFTRA, but as this did not proceed, McCarley will likely not return. This news prompted much criticism of Crunchyroll on social media.</p><h4>Drama</h4><p>A 12-episode Japanese television drama was broadcast on TV Tokyo's MokuDora 25 timeslot from January 18 to April 5, 2018.</p><h4>Other media</h4><p>A fanbook was published on November 17, 2022. It includes detailed information about the series, its characters, story and setting. It also features illustrations by various manga artists, including Hiromu Arakawa, Kotoyama, Takako Shimura, Nagano, Ryōji Minagawa and Itaru Bonnoki.</p><br/><h3>Reception</h3><h4>Manga</h4><p>Mob Psycho 100 won the 62nd Shogakukan Manga Award in the shōnen category in 2017. By July 2016, Mob Psycho 100 had over 1.2 million copies in circulation. The comic book writers of San Diego Comic-Con listed it as one of the \"Most Wanted Manga\" from 2016. By December 2022, the manga had over 2.8 million copies in circulation.</p><h4>Critical reception</h4><p>Ian Wolf from Anime UK News praised the first two volumes of the series, giving them 8 out of 10, and stated \"One’s art is notable for a few reasons. The art is designed to be humorous rather than stylish. Part of the comedy value in One’s work is the rough styling that adds to the scenarios he creates. In this second volume of Mob Psycho 100, it is the action which is the main focus. There is some comedy thrown into the mix as well, but mainly this time it is about the battle between the two psychics and their different philosophies. It is also interesting to witness this fight because it is one in which one of the participants is trying their hardest not to fight, while the other is giving it all they’ve got. Having said this, there is still some comedy added to the heat of the battle, the main highlight being when Teru tries to use knives to beat Mob, but Mob deflects one of the knives away, accidentally cutting off a massive chunk of Teru’s hair. It is at times like this where One’s art style can sometimes fall down. His rough artwork does lead neatly to the chaotic scenes he is trying to depict at the height of the fight but when it comes to the more dramatic moments, the rough style lacks pathos. Here, the anime has the edge when it depicts the fight because other elements such as the music or the use of colour can add to the tension\".</p><h4>Anime</h4><p>In the 1st Crunchyroll Anime Awards, the first season of the anime series received two awards: Best Action and Best Fight Scene (Shigeo vs. Koyama). It was also nominated in six other categories, including \"Anime of the Year\". At the 4th Crunchyroll Anime Awards in 2020, the second season of the anime also won two awards: Best Animation and Best Opening Sequence for \"99.9\" by Mob Choir feat. Sajou no Hana. It was also nominated in five other categories, including \"Anime of the Year\". Mob Psycho 100 was one of the Jury Recommended Works in the Animation Division at the 20th Japan Media Arts Festival in 2017. In November 2019, Polygon named Mob Psycho 100 as one of the best anime of the 2010s, and Crunchyroll listed it in their \"Top 25 best anime of the 2010s\". IGN also listed Mob Psycho 100 among the best anime series of the 2010s.</p><p>In September 2020, the series went viral after American businessman Eric Trump, son of then-President Donald Trump, published a tweet connecting the series to allegations of censorship by Google, due to Google Search results for \"mob\" showing Mob's face rather than a group of people.</p><h4>Critical reception</h4><p>Anime News Network listed the first season of Mob Psycho 100 among the best anime series of 2016. Nick Creamer praised the series' visual style, character story and its concepts of heroism and society also presented in ONE's other work One-Punch Man. Lauren Orsini commended the coming-of-age story of Mob and praised the series' animation and music. James Beckett of Anime News Network gave the second season an A+, and describes the series as \"I don't know how else to put it: Mob Psycho 100 II is about as close to perfect a season of television as I can imagine. I am willing to bet that the series will go down as one of the best seasons of anime ever produced, and you owe it to yourself to experience it first-hand. A modern masterpiece of animation that needs to be seen to be believed\".</p><br/>"
  },
  "errorMessage": ""
}