{
  "imDbId": "tt5290382",
  "title": "Mindhunter",
  "fullTitle": "Mindhunter (TV Series 2017–2019)",
  "type": "TVSeries",
  "year": "2017",
  "items": [
    {
      "username": "koofasa",
      "userUrl": "https://www.imdb.com/user/ur6927864",
      "reviewLink": "https://www.imdb.com/review/rw7130296",
      "warningSpoilers": false,
      "date": "16 July 2021",
      "rate": "10",
      "helpful": "171 out of 174 found this helpful.",
      "title": "So disappointed there will be no season 3",
      "content": "Today's choices for decent dramatic programming is very spotty so when I saw that Mindhunter was canceled I couldn't be more disappointed. This was an excellent show about the start of the FBI's profiling program. It was well made and acted and now it's gone. The first two season were great though so it is definitely worth watching. There were no story lines that required a third season to wrap up so you won't feel cheated when you realize season two is the end. This show was about the criminals and how they were profiled rather than the FBI agents who did the profiling. It is still a 10 star show even without a third season."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw5949367",
      "warningSpoilers": false,
      "date": "28 July 2020",
      "rate": "9",
      "helpful": "117 out of 120 found this helpful.",
      "title": "Great!",
      "content": "Mindhunter is one of the better shows I've seen in some time! I've read some people think it gets slow at times but that's only because they're building the story and characters but it absolutely pays off. This series is so well done, from the acting to the directing to the writing to the etc, etc! Everything about this show is great!"
    },
    {
      "username": "jack_o_hasanov_imdb",
      "userUrl": "https://www.imdb.com/user/ur55640799",
      "reviewLink": "https://www.imdb.com/review/rw7211898",
      "warningSpoilers": false,
      "date": "9 August 2021",
      "rate": "9",
      "helpful": "163 out of 172 found this helpful.",
      "title": "It was one of the best series I've ever watched.",
      "content": "It was one of the best series I've ever watched.Why didn't they continue?"
    },
    {
      "username": "tkdlifemagazine",
      "userUrl": "https://www.imdb.com/user/ur88886235",
      "reviewLink": "https://www.imdb.com/review/rw8541496",
      "warningSpoilers": false,
      "date": "13 September 2022",
      "rate": "9",
      "helpful": "33 out of 33 found this helpful.",
      "title": "Brilliant Television",
      "content": "This fictionalized show about the development of 1970's police forensic psychology and profiling is brilliant. It takes a premise, which could have been a documentary, and develops it around fictional and real characters. The scripts and storyline is brilliant. The acting by the main characters, especially the two leads, is fantastic. The Direction by David FIncher and others is movie quality. The 1970's attention to detail is just stunning. The interweaving of the brilliant role outs of real serial killers is just amazing to watch. The people and the scripts surrounding Manson, the Co-ed Killer, BTK, the Son of Sam and more are just fascinating. The is a thoughtfully constructed show and one of Netflix's finest additions. I wish I had watched it sooner."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw4040527",
      "warningSpoilers": false,
      "date": "22 January 2018",
      "rate": "8",
      "helpful": "548 out of 592 found this helpful.",
      "title": "Fascinating, Suspenseful Drama Exploring The Origins Of Criminal Psychology And Profiling",
      "content": "For those of you who came here looking for something like 'Se7en', because you thought, well, it's from David Fincher and it's about serial killers, I have bad news: this is not that kind of show. But if you came here looking for something more like 'Zodiac', because you thought, well, it's Fincher producing a show about people investigating serial killers, you might indeed find something you like. And if you appreciate long-form storytelling focusing more on human drama than on action scenes, AND you're a bit of a science nerd on top of that (and by that I'm also implying you don't mind watching a show where people are talking most of the time), then, my friend, you are in for a treat.The reason I absolutely love 'Mindhunter' is this: I'm the kind of person who always wants to know why we know what we know. Because we DIDN'T always know. Somebody had to make a start; someone had to make that first step, that first discovery and draw that first conclusion. Somebody had to be curious, probably persistent, maybe even daring in their quest for knowledge. The history of science is littered with warriors, some of whom we now celebrate and hold in high esteem - but we have a tendency to forget that many scientists also were tragic figures who had to fight against restrictions imposed by society and risked paying a high price - professionally and personally - for their fight against ignorance. And it's those aspects of science that I find so fascinating, and it's precisely those aspects that 'Mindhunter' is interested in; not the \"showy\", glamorous stuff, but the meticulous groundwork and the personal human drama inherent in the quest for knowledge. And if you, like me, have a morbid curiosity for all the darker aspects of human nature, it surely doesn't hurt that the particular branch of science whose origins this show explores is that of criminal psychology: the science which tries to understand how the minds of criminals work and what causes them to commit their crimes.As you might have guessed, 'Mindhunter' isn't concerned with shoplifters or what goes on inside the head of someone who commits insurance fraud, but rather with criminals whose behavior is a tad more serious (like, you know, murderers who have a penchant for engaging in sexual activities with their victims' severed heads - stuff like that). And it isn't a documentary either; although the characters are based on real people and the show offers a realistic portrayal of serial killers, this is a dramatized account of events made for our entertainment. And entertaining it is, and on a high artistic level at that: the performances are fantastic; cinematography, editing and direction bear the clear trademark of the master filmmaker who produced and partly directed this (though it must be said that while Fincher appears to be the creative leader, the project was brought to him by one Charlize Theron who owns the rights to the book upon which the show is based and also serves as a producer, and the excellent teleplay was predominantly written by Jennifer Haley and the show's credited creator Joe Penhall).To sum it all up: 'Mindhunter' is a show that takes full advantage of its format; this is long form storytelling as it was meant to be, and while it probably doesn't work for people with short attention spans, the patient viewer is rewarded with a fascinating, richly layered and suspenseful drama exploring the origins of criminal psychology and criminal profiling. Excellent stuff: 8 stars out of 10.Favorite TV-Shows reviewed: imdb.com/list/ls075552387/Favorite films: IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/"
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8676148",
      "warningSpoilers": false,
      "date": "15 November 2022",
      "rate": "10",
      "helpful": "27 out of 27 found this helpful.",
      "title": "Extremely good, but was sadly canceled.",
      "content": "\"Mindhunter\" is probably one of the best series I've ever seen.I find people's psyches extremely interesting anyway, which is why this series felt like it was made for me.To see how serial killers are questioned here to really define their kind for the first time is just pure excitement.The serial killers' costumes are also spot on.Even in the 2nd season, which unfortunately turns out to be rather poor in most cases, there is not a hint of a reduction in quality to be seen here, but the series even steps up a notch.I find the decision to cancel the series just cheeky without giving us a satisfying ending.I understand the hiring was financial, but I would definitely rather see another season of Mindhunter than the 100th Netflix miniseries with the same boring plot."
    },
    {
      "username": "markkbranson",
      "userUrl": "https://www.imdb.com/user/ur76675770",
      "reviewLink": "https://www.imdb.com/review/rw5075328",
      "warningSpoilers": true,
      "date": "22 August 2019",
      "rate": "9",
      "helpful": "286 out of 303 found this helpful.",
      "title": "Come On Netflix: We Need Season Three of \"Mindhunter\"",
      "content": "I've watched both seasons, the last one in three days. With the teaser(S) at the end of Season Two, there has to be a third season. Why? Well, I will explain:First, this series is solid because of the acting across the board. I hadn't noticed in season one, but two of my favorites from the \"Fringe\" series are here: Anna Torv and Michael Cerveris. The others, particularly Groff (Holden Ford) and McCallany (Tench) are great as the FBI agents who founded the unit.Second, the writing is wonderful. I particularly enjoyed the interview with Charles Manson, as well as the other \"serial\" killers. The writing staff is superb in the way they have taken characters from our collective consciences and given then a character we begin the understand.Third, there are too many shoes left to drop: What is going to happen with Wendy (Torv)? What is Tench going to do about his son? What is Ford going to do? And what about this one guy with a mask we have seen throughout this season??I could go on and on, but Netflix has an obligation to us to bring some sense of closure to this series and it can't be left hanging like this. Come on Netflix; announce the third season coming in 2020!"
    },
    {
      "username": "lakings97",
      "userUrl": "https://www.imdb.com/user/ur9679268",
      "reviewLink": "https://www.imdb.com/review/rw8810453",
      "warningSpoilers": false,
      "date": "19 January 2023",
      "rate": "9",
      "helpful": "21 out of 21 found this helpful.",
      "title": "Different view of Serial Killers",
      "content": "Mindhunter is a Netflix series based on true events of the FBI agents who are tasked to solve open cases of serial killers. The two fictional characters Ford and Fench are played by Jonathan Groff and Holt McCallney they started a whole new division within the FBI during the 1970's to study why serial killers acted the way they did. They interviewed killers Kemper, Manson and others to get an insight scoop on what drives them to kill. Their stories truly made the series come to the forefront of the show. Cameron Britton was nominated and won awards for his role as Kemper. Anna Torv joined the cast at first as a professor of criminal sociology and later hired as a consultant to the FBI agents. The first two seasons were created and produced by David Fincher, Charlize Theron coproduced the series. Great series, great cast, strong script, with great cinematography. Definitely add this series to your list, hope to see additional seasons sooner than later."
    },
    {
      "username": "Trilby16",
      "userUrl": "https://www.imdb.com/user/ur7786424",
      "reviewLink": "https://www.imdb.com/review/rw8487482",
      "warningSpoilers": true,
      "date": "25 August 2022",
      "rate": "9",
      "helpful": "35 out of 35 found this helpful.",
      "title": "Only a 9 because they left us hanging.",
      "content": "I object! Throughout the two seasons, there are snippets of a guy wearing a girdle and a mask doing creepy things with a doorknob-- WHAT IS HIS DEAL??? Why does the show not follow through on this? I'm very upset about it. Season 3, guys! And Tench's wife and creepy adopted son-- GONE? Not even a note? There's another season 3. What the hell."
    },
    {
      "username": "HafizhMaulana21",
      "userUrl": "https://www.imdb.com/user/ur158897541",
      "reviewLink": "https://www.imdb.com/review/rw8790040",
      "warningSpoilers": false,
      "date": "9 January 2023",
      "rate": "8",
      "helpful": "20 out of 20 found this helpful.",
      "title": "A series similar to a crime documentary",
      "content": "Based on a true story, in the late 1970s two FBI agents were assigned to conduct interviews of serial killers.Season 1: The Mindhunter series is an interesting criminal drama series. The story is strong and dense in explaining the twists and turns of conducting their interview activities. In this first season, it tries to give a story that lacks a dramatic impression by having scenes that are so story-dense and suggestive of the story to the point. Conflict is built on a slow and detailed pace. Each episode is able to provide an interesting explanation of their interview. Each episode also features several different murderers. However, this series is indeed quite slow in building the story. This first season has 10 episodes that are considered long. A little bored and sleepy when not so interested in the series. This first season does build a story and characters full of dialogue. Sometimes there is a dialogue that is quite heavy given the presence of psychological terms in it. Not much action is shown in the series. The series became a serious and heavy spectacle."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8575531",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "9",
      "helpful": "43 out of 46 found this helpful.",
      "title": "Brilliant!!",
      "content": "Mindhunter is such a great show. Just read through the reviews to see what most people think about it. This is not your average cop show. It follows FBI agents Holden Ford (Jonathan Groff) and Bill Tech (Holt McCallany) as they attempt to understand and catch serial killers by studying their minds and psyches. This is the start of modern day serial killer profiling. It really digs in to why these monsters do the terrible things they do. I've read some people think it gets slow at times but that's only because they're building the story and characters but it absolutely pays off. Everything about this show is award worthy...the acting, writing, directing, cinematography, production, etc, etc.! One of its creators is David Fincher (Seven, Zodiac, Gone Girl, The Social Network, etc). It has the same feel of a lot of his work so if you're a fan of his then you'll be a fan of this show."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw4449051",
      "warningSpoilers": false,
      "date": "10 November 2018",
      "rate": "9",
      "helpful": "34 out of 37 found this helpful.",
      "title": "Brilliant",
      "content": "(Updated after Season 2).1979. Agent Holden Ford is attached to the FBI's Behavioural Sciences Unit, headed by veteran agent Bill Tench. A new type of killer is emerging, one that kills regularly and without apparent motive. Due to the lack of motive, it is difficult to profile and apprehend the perpetrator in a murder investigation. In order to reduce this knowledge deficit, Tench and Ford set out to question incarcerated 'sequence killers' and build up a database of their backgrounds, behaviours, drivers and motives in order to make apprehending such criminals easier in future.Brilliant drama series, largely based on a true story, with the names of the main characters changed. (Interesting fact: the true-life character Holden Ford is based on, John Douglas, was the inspiration for the character of Jack Crawford in the Hannibal books and movies.).Well-told, showing how behavioural science evolved as a means of identifying and apprehending serial killers. Quite fascinating, especially when you consider that as recently as 1979 nothing was really known about serial killers' motives or profiles. In 1979, the expression 'serial killer' wasn't even a term! (Bill Tench's real-life character coined it).The individual cases are quite riveting, and show the new method of profiling in action. Also shows that, like with any new, revolutionary idea, hitting upon the idea is only half the battle - convincing others, especially those you rely on to follow through on your work - in this case prosecutors, superiors, other law enforcement officers - is the other half.Good character depth. Each of the main characters is clearly drawn and brings their personality, issues and hang-ups to the job.On that note, the only negative aspect initially is the character of Holden Ford. I often found him irritating - cold, over-thinking, nerdy and paranoid. The episode involving the teacher was the low point of the series and a great example of the downside of Ford's personality. Maybe that's the point - what makes him brilliant also makes him a dingbat.Season 2 isn't quite as interesting as Season 1. While S1 showed them interviewing convicted serial killers, evolving their theories and processes and building their processes, S2 largely deals with one particular case. While it is reasonably interesting, and does show some of their newly-developed techniques in action, it largely involves old-fashioned police grunt work, so is nothing new and is even dull at times. I kept feeling like the story was going in circles without developing. That's how police investigations are, I suppose, so is quite realistic. Just not that exciting.Season 1: 9/10. Season 2: 8/10."
    },
    {
      "username": "pkhall1",
      "userUrl": "https://www.imdb.com/user/ur5210164",
      "reviewLink": "https://www.imdb.com/review/rw8512629",
      "warningSpoilers": false,
      "date": "4 September 2022",
      "rate": "10",
      "helpful": "49 out of 50 found this helpful.",
      "title": "Please David Fincher read this:",
      "content": "Mr. Fincher, Mindhunter is the greatest show ever created on TV. Please make another season. I know you're busy making a wonderful movies etc. But this show is just exceptional. Other than Breaking Bad and Better Call Saul, I can't remember a TV series that has been so perfectly done as this. Your direction and the cast is so enjoyable. I have seen the series now seasons 1 and 2 three times and it just keeps getting better with each viewing. Hope you can find it within yourself to keep this going for many years coming. Every single actor that has played a notorious killer has been transformed into that person by your incredible make up team it is as if we are truly watching these people give their testimonies. It is very creepy that it is so believable, but that is just simply your incredible vision and direction. I think you probably the best modern day Director. Thank you so much again and praying for future episodes."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw5094099",
      "warningSpoilers": false,
      "date": "1 September 2019",
      "rate": "10",
      "helpful": "41 out of 46 found this helpful.",
      "title": "Flawless investigation Netflix series",
      "content": "I'm beyond fascinated by the study of the criminals as weird as they may sound so this hit the spot to me kinda like a delicious meal! The other thing is David Fincher the director of the pilot is one of my all time favorite humans/famous beings! Mindhunter has a wonderful tranquil ambient soundtrack throughout and immersive acting. It'll creep you out, intrigue you, and even make you wanna sympathize with many of the characters.Also I'm rewatching for the second time, I originally saw when back in its prime and loving every bit again, I'm sure season 2 is just as good; I'll watch that soon. They're needs to be a lot more adult crime shows rated TV-MA, it's a million times better than most! Highly recommend to anyone that doesn't mind learning about monsters that did sinister crimes!"
    },
    {
      "username": "boatsfra",
      "userUrl": "https://www.imdb.com/user/ur18364527",
      "reviewLink": "https://www.imdb.com/review/rw3864774",
      "warningSpoilers": false,
      "date": "22 November 2017",
      "rate": "10",
      "helpful": "168 out of 189 found this helpful.",
      "title": "Can't Watch Just One Episode",
      "content": "Mindhunter is a 10 episode series on N'flix that hits a home run with me. First of all, David Fincher can do no wrong in my eyes, blending trance-like music with scenes that are unforgettable. He does this a few times and my goodness he's the master at it. Every scene, every line...well-constructed and nothing wasted.Mindhunter gets into your head very quickly and not only for the content, but for the era it is held in. If you weren't born in the 70's, that's OK because the producers here have done a masterful job in recreating America in that decade. I honestly don't know how they did it scene after scene. Mindhunter is a series where each character leaves an indelible mark on your psyche. The content is deep and makes you wonder. Don't forget to hug mom. I give it a 10 on the \"bingeable\" meter."
    },
    {
      "username": "andrewroy-04316",
      "userUrl": "https://www.imdb.com/user/ur71021213",
      "reviewLink": "https://www.imdb.com/review/rw5829717",
      "warningSpoilers": true,
      "date": "16 June 2020",
      "rate": "9",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Mindhunter picks up speed each episode until it's irresistible by the meat of season 2",
      "content": "The first four episodes or so are pretty slow and unremarkable, but if you stay with it, it rewards you handsomely. Even the slow start isn't bad or boring, it's just fine, solid psychological TV building up its characters (certainly less extreme in being frustrating and boring in its early build than Mr Robot was for me). Later into season 1 and particularly getting into season 2, the cases are deeper and character interactions are beautifully layered. I absolutely love Holden and Bill's characters, and both actors are exceptional. The show is about understanding violent criminal psychology at its core, but what made season 2 so wonderful was the way many other themes were seamlessly woven into the plot. It's all directly based on true events, so all the themes are practical. We get character relationship drama with Bill and Wendy having things going on, and we see the practical challenges of their work as bureaucracy, politics, race, and the legal system get in the way. The season 2 ending was absolutely perfect, as we see a resolution to the case but also see how unsatisfying and inconclusive it really was - can't we expect more out of those serving justice? Seeing the things that weigh heavy on each of the three characters, even after their supposed success, was the perfect bittersweet touch (Holden unsatisfied about the case, Wendy throwing the magazine out, and Bill finding that Nancy had left). I desperately hope more Mindhunter is made soon, because it is truly fantastic. Mindhunter has far and away the best editing of any show I've seen, and fantastic writing and cinematography to go with it. No plot thread is thrown out there and not returned to, and everything serves a precise purpose thematically. The visual intricacies of the show are a joy to watch. It's more of a thoughtful, thematically real-world relevant show than a procedural, but it's all the more unique for it. Highly recommended, Mindhunter is impeccably well made."
    },
    {
      "username": "andrewrye-06535",
      "userUrl": "https://www.imdb.com/user/ur80507339",
      "reviewLink": "https://www.imdb.com/review/rw3831826",
      "warningSpoilers": false,
      "date": "14 October 2017",
      "rate": "9",
      "helpful": "155 out of 184 found this helpful.",
      "title": "Not your typical Hollywood rubbish....",
      "content": "I read the book by John Douglas (who consults to the show) some years ago...twice. Every now and then I get a memory or part of the book come back to me. This is very close to how I'd imagine the book made into a series - not a movie would look. For those that want a nicely tied up story each episode or answers for everything, you won't find it here. The description is only partially right, this is about the development of the unit within the FBI that would eventually concentrate on serial killers and develop profiles for the offenders. For them to do this they had to interview thousands of serial murderers and find out how they clicked, their drivers and motivations. This was new ground with untested theories and often against the FBI's own protocol. So, mistakes were made, lines were over stepped and they didn't always get it right. The two main characters play their parts well, I thought. Often bumbling about, arguing and unsure of what they are doing. I notice some reviewers mistake this for wooden acting and aren't able to like the characters, yet in my mind it works well. You have to remember this is set in the early 70s, so even the title 'serial killer' wasn't coined yet. Instead they called it 'sequence killer'. They were up against old thinking where even the mention of colloquial or slang terms for penis etc. were frowned on by the FBI. It is unfortunate that some of the reviewers have treated this like a typical Hollywood cop or CSI show. Everything has to be laid out for them and they want some clever theorising and a nice tidy ending. Where as the story is in the journey, not the result. Hang in for the long haul, it's well worth it.The only unfortunate piece for me is the lead's name 'Holden Ford'. If you are an Australian or NZer you will understand. Makes me cringe every time his name is said in full. Anna Torv makes a welcome member of the cast and gives it a nice air of sophistication. It's a solid 9 for me."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw6363766",
      "warningSpoilers": false,
      "date": "13 December 2020",
      "rate": "8",
      "helpful": "21 out of 23 found this helpful.",
      "title": "Fincher TV",
      "content": "Holden Ford is a FBI hostage negotiator and then a teacher at Quantico. The straight-laced Holden meets grad student Debbie Mitford at a bar and they begin a relationship. He becomes interested in a new psychological take on the new brand of crimes. He joins veteran agent Bill Tench in the newly formed Behavioral Science Unit. They go interviewing the deadliest killers in the penal system. Psychology professor Wendy Carr becomes interested in their research and eventually joins the group.I don't know how involved was David Fincher. This show definitely has the feel of his work and that's a big positive. These are interesting characters and it has great detailed visual. It's one of the better crime drama even in today's crowded space. Sadly, it only lasted two season as Fincher got busy with other projects. I guess he was very involved if it couldn't go on without him."
    },
    {
      "username": "robfollower",
      "userUrl": "https://www.imdb.com/user/ur78277499",
      "reviewLink": "https://www.imdb.com/review/rw4744950",
      "warningSpoilers": false,
      "date": "26 March 2019",
      "rate": "8",
      "helpful": "21 out of 23 found this helpful.",
      "title": "Mindhunter distinguishes itself in a crowded genre with ambitiously cinematic visuals and a meticulous attention to character development",
      "content": "Mindhunter\" tells the semi-fictionalised story of how two FBI agents, curious about the motivations and psychology behind serial killers, begin to interview them. Their initial success leads to the establishment of the behavioural crimes division. Despite some successes applying what they learn to active cases, their controversial techniques begin to attract the attention of both the press and internal affairs.It should first be said that \"Mindhunter\" is not a police procedural show, they don't catch a new killer every week based on the insights of their interviewees, though they do, across the course of the show, learn how to deploy their techniques to help bring some murderers to justice. It's a slow moving adult drama about the effects that success, distance and exposure to the worst mankind has to offer can have on people and their relationships.Mindhunter distinguishes itself in a crowded genre with ambitiously cinematic visuals and a meticulous attention to character development"
    },
    {
      "username": "baunacholi-86159",
      "userUrl": "https://www.imdb.com/user/ur107340115",
      "reviewLink": "https://www.imdb.com/review/rw5180009",
      "warningSpoilers": false,
      "date": "11 October 2019",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "A perfect 10",
      "content": "Once in a while really AMAZING series appear on tv. Mindhunter is one of them. Every aspect of the show is a perfect 10 - the ultimate essence of noir crime. Intelligent, dark, disturbing. Why this show has not won every award possible is beyond me. The cast is top notch. Esp. Anna Torv's performance is outstanding. Cameron Britton who portrays Ed Kemper let u easily forget that it's a show. It feels so real, so raw. There are some more interviews with other suspects/killers, all let u peak into an abyss as cruel and dark as it can be. A twisted mind. If u are up for something truly unique and innovative in the usually rather stereotype crime bla, mindhunter is your antidote."
    },
    {
      "username": "manTOman",
      "userUrl": "https://www.imdb.com/user/ur7282630",
      "reviewLink": "https://www.imdb.com/review/rw8372713",
      "warningSpoilers": false,
      "date": "26 July 2022",
      "rate": "10",
      "helpful": "21 out of 21 found this helpful.",
      "title": "Bring back this masterpiece",
      "content": "Dont cancel this one cause man this is by far best criminal series for ages. This so well act and script is brilliant. No forced melodrama for long time American crime series is coming close to be as good as Brits are doing."
    },
    {
      "username": "snowyprecipice",
      "userUrl": "https://www.imdb.com/user/ur47991635",
      "reviewLink": "https://www.imdb.com/review/rw3831175",
      "warningSpoilers": true,
      "date": "14 October 2017",
      "rate": "9",
      "helpful": "198 out of 237 found this helpful.",
      "title": "It's a good watch",
      "content": "I hate it when people give reviews or ratings after half-assed watching just 2 or 3 episodes. Yes, Mindhunter is a slow burner and yes, it's not fast-paced or exciting. If you want that, go somewhere else. Mindhunter is a 'thinking piece' of work where you have to watch and see where it goes while having your mind whirring and contemplating the difficult questions the show poses. Why are serial killers so fascinating to us? The Ed Kemper in the show was just riveting, as were the other serial killers they interviewed. The main characters pose interesting questions and are complex individuals, and towards the end of the series this poses conflict. Also, who is that random dude they keep showing at the start of some episodes? I have a feeling it's a serial killer they will face off with in the second season or something.10/10 would recommend to anyone who likes more subtle shows, and likes having their minds peeled apart."
    },
    {
      "username": "ymousnona123",
      "userUrl": "https://www.imdb.com/user/ur32098779",
      "reviewLink": "https://www.imdb.com/review/rw8663911",
      "warningSpoilers": false,
      "date": "9 November 2022",
      "rate": "10",
      "helpful": "25 out of 26 found this helpful.",
      "title": "We need season 3!",
      "content": "Please bring it back! I absolutely love this series. It is so well executed. The acting, the tension, attention to details, colour scheme, cinematography, music score, I could go on and on. I first watched it when it came out, and I have rewatched it a few times.It's a slow burn, and it works well. I really appreciate how carefully they chose the actors who play the serial killers. They really embodied the mannerisms of those monsters. Then we see the main characters grappling with their own demons and curiosity, and trying to make sense of it all.I understand that it always comes down to money, but I am a little disappointed that this show was abandoned at such a pivotal point. I want to see how it ends! This is as close to British procedurals as we've gotten, and I am craving for more."
    },
    {
      "username": "anniec62",
      "userUrl": "https://www.imdb.com/user/ur81312376",
      "reviewLink": "https://www.imdb.com/review/rw3830823",
      "warningSpoilers": false,
      "date": "13 October 2017",
      "rate": "8",
      "helpful": "188 out of 219 found this helpful.",
      "title": "How can we get ahead of crazy if we don't know how crazy thinks?",
      "content": "I'm spoiled for good quality TV shows that are intriguing and make me think while entertaining along the way. So many shows I watch the first episode and can't even get through it because its so predictable or cookie cutter. I'm excited I've found a new one to enjoy. And even though it is set in the 70s, its very relevant for today. Crazy takes on many forms. Back then it was \"sequence killers\" prior to term \"serial killer\" being used. Today its crazy mass shooters. I love Ford's desire to learn. I've watched 2 episodes and looking forward to the rest. And BTW the soundtrack is amazing!"
    },
    {
      "username": "Vinicius8",
      "userUrl": "https://www.imdb.com/user/ur66359155",
      "reviewLink": "https://www.imdb.com/review/rw3830617",
      "warningSpoilers": false,
      "date": "13 October 2017",
      "rate": "9",
      "helpful": "353 out of 412 found this helpful.",
      "title": "Enter the psychopath's mind",
      "content": "Two episodes in and I'm already hooked. Technically speaking, this series is very good (it's directed by David Fincher, of course it's good) and it stays true (so far) to the real-life crimes it was based on. I can't say the same for the characters, and how close they are to the people who really did this work, but considering their names are different and the book they adapted wasn't some sort of biography, most of their personal (love) lives must be fictitious or at least overtly dramatized.You see, this series here isn't some kind of good cop, bad cop chase villains and shoot and explode a lot of stuff and at the end of the day (or episode) they go back to their wives and sleep like babies. No. There are way too many series like that, so search elsewhere if that's what you want, because you won't find that here.Mindhunter is slow. Very slow. At first it might look like an simple thriller but actually it tells the story of two FBI agents in their pursuit to, as very precisely said by Holt McCallany's character, \"understand how crazy thinks\". But that doesn't come easily. Crazy is crazy. You gotta be crazy to understand crazy. But that doesn't stop naïve Holden Ford from interviewing the most despicable real-life psychopaths alive in America in the late 70's to develop the ideas that will become the tenets of the criminal profiling system.As I said before, Mindhunter is directed by David Fincher, and as expected from his work, it's impeccable, both pacing and cinematography are top-notch. At the end of the episode you will be like \"wait, that's it?\" as the credits roll and the song keeps playing like the story is still going on. And somehow you are watching the next episode.Writing and dialogue are great too. All very natural and haunting. Damn psychos could very much be the real ones. And that gets me to the acting, from what I've seen there's enough to say it's fantastic. The characters are brought to life by the actors. Also, the chemistry between characters Holden Ford and Bill Tench is incredibly real and sometimes, even through the bleakness of their work's nature, hilarious.To finish off, I'll just say the biggest review cliché: Mindhunter is not for everyone. I know you know everyone says it, but it's truer in this case. If my review and the trailer got your attention, you gotta watch it. If it didn't, you'll probably hate Mindhunter. That's how it goes."
    }
  ],
  "errorMessage": ""
}