{
  "imDbId": "tt4158110",
  "title": "Mr. Robot",
  "fullTitle": "Mr. Robot (TV Series 2015–2019)",
  "type": "TVSeries",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "Mr. Robot",
  "url": "https://en.wikipedia.org/wiki/Mr._Robot",
  "plotShort": {
    "plainText": "Mr. Robot is an American drama thriller television series created by Sam Esmail for USA Network. It stars Rami Malek as Elliot Alderson, a cybersecurity engineer and hacker with social anxiety disorder, clinical depression and dissociative identity disorder. Elliot is recruited by an insurrectionary anarchist known as \"Mr. Robot\", played by Christian Slater, to join a group of hacktivists called \"fsociety\". The group aims to destroy all debt records by encrypting the financial data of E Corp, the largest conglomerate in the world.\r\nThe pilot premiered via online and video on demand services on May 27, 2015. In addition to Malek and Slater, the series stars an ensemble cast featuring Carly Chaikin, Portia Doubleday, Martin Wallström, Michael Cristofer, Stephanie Corneliussen, Grace Gummer, BD Wong, Bobby Cannavale, Ashlie Atkinson, and Elliot Villar. The first season debuted on USA Network on June 24, 2015, while the second season premiered on July 13, 2016, and the third season premiered on October 11, 2017. The fourth and final season premiered on October 6, 2019, and concluded on December 22, 2019.\r\nMr. Robot received critical acclaim, particularly for the performances of Malek and Slater, its story and visual presentation, and Mac Quayle's musical score. Esmail has received praise for his direction of the series, having directed three episodes in the first season before serving as the sole director for the remainder of the show. The show received numerous accolades, including two Golden Globe Awards, three Primetime Emmy Awards, and a Peabody Award.",
    "html": "<p>Mr. Robot is an American drama thriller television series created by Sam Esmail for USA Network. It stars Rami Malek as Elliot Alderson, a cybersecurity engineer and hacker with social anxiety disorder, clinical depression and dissociative identity disorder. Elliot is recruited by an insurrectionary anarchist known as \"Mr. Robot\", played by Christian Slater, to join a group of hacktivists called \"fsociety\". The group aims to destroy all debt records by encrypting the financial data of E Corp, the largest conglomerate in the world.</p><p>The pilot premiered via online and video on demand services on May 27, 2015. In addition to Malek and Slater, the series stars an ensemble cast featuring Carly Chaikin, Portia Doubleday, Martin Wallström, Michael Cristofer, Stephanie Corneliussen, Grace Gummer, BD Wong, Bobby Cannavale, Ashlie Atkinson, and Elliot Villar. The first season debuted on USA Network on June 24, 2015, while the second season premiered on July 13, 2016, and the third season premiered on October 11, 2017. The fourth and final season premiered on October 6, 2019, and concluded on December 22, 2019.</p><p>Mr. Robot received critical acclaim, particularly for the performances of Malek and Slater, its story and visual presentation, and Mac Quayle's musical score. Esmail has received praise for his direction of the series, having directed three episodes in the first season before serving as the sole director for the remainder of the show. The show received numerous accolades, including two Golden Globe Awards, three Primetime Emmy Awards, and a Peabody Award.</p>"
  },
  "plotFull": {
    "plainText": "Mr. Robot is an American drama thriller television series created by Sam Esmail for USA Network. It stars Rami Malek as Elliot Alderson, a cybersecurity engineer and hacker with social anxiety disorder, clinical depression and dissociative identity disorder. Elliot is recruited by an insurrectionary anarchist known as \"Mr. Robot\", played by Christian Slater, to join a group of hacktivists called \"fsociety\". The group aims to destroy all debt records by encrypting the financial data of E Corp, the largest conglomerate in the world.\r\nThe pilot premiered via online and video on demand services on May 27, 2015. In addition to Malek and Slater, the series stars an ensemble cast featuring Carly Chaikin, Portia Doubleday, Martin Wallström, Michael Cristofer, Stephanie Corneliussen, Grace Gummer, BD Wong, Bobby Cannavale, Ashlie Atkinson, and Elliot Villar. The first season debuted on USA Network on June 24, 2015, while the second season premiered on July 13, 2016, and the third season premiered on October 11, 2017. The fourth and final season premiered on October 6, 2019, and concluded on December 22, 2019.\r\nMr. Robot received critical acclaim, particularly for the performances of Malek and Slater, its story and visual presentation, and Mac Quayle's musical score. Esmail has received praise for his direction of the series, having directed three episodes in the first season before serving as the sole director for the remainder of the show. The show received numerous accolades, including two Golden Globe Awards, three Primetime Emmy Awards, and a Peabody Award.\r\nPremise\r\nThe series follows Elliot Alderson, a young man living in New York City, who works at the cybersecurity company Allsafe as a cybersecurity engineer. Constantly struggling with social anxiety, dissociative identity disorder, clinical depression and drug abuse, Elliot's thought process seems heavily influenced by paranoia and delusion. He connects to people by hacking them, which often leads him to act as a cyber-vigilante. He is recruited by a mysterious insurrectionary anarchist known as Mr. Robot and joins his team of hacktivists known as fsociety. One of their missions is to cancel all consumer debt by encrypting all the data of one of the largest corporations in the world, E Corp (which Elliot perceives as Evil Corp), which also happens to be Allsafe's biggest client.\r\nCast and characters\r\nMain\r\nRami Malek as Elliot Alderson, a senior cybersecurity engineer at Allsafe Cybersecurity and a vigilante hacker. He has dissociative identity disorder and deals with other mental illnesses such as clinical depression and severe anxiety, which are partly responsible for his antisocial behavior and drug use. Elliot's hacker nickname is \"Sam Sepiol\" or \"samsep10l\". Elliot is portrayed as a child by Aidan Liebman (seasons 1–2), Alex Bento (season 3), and Evan Whitten (season 4).\r\nCarly Chaikin as Darlene Alderson, Elliot's younger sister, a malware coder and one of the fsociety hackers\r\nPortia Doubleday as Angela Moss, Elliot's childhood friend and a fellow employee at Allsafe, later PR Manager for E Corp. Mabel Tyler portrays a young Angela.\r\nMartin Wallström as Tyrell Wellick, originally the ambitious Senior Vice President of Technology at E Corp and later part of fsociety\r\nChristian Slater as Mr. Robot, an insurrectionary anarchist who recruits Elliot into an underground hacker group called fsociety and Edward Alderson, Elliot's father\r\nMichael Cristofer as Phillip Price, the CEO of E Corp (seasons 2–4; recurring season 1)\r\nStephanie Corneliussen as Joanna Wellick, Tyrell's wife (seasons 2–3; recurring season 1).\r\nGrace Gummer as Dominique \"Dom\" DiPierro, an FBI field agent investigating the E Corp hack (seasons 2–4)\r\nBD Wong as Whiterose, a trans woman, cyber-terrorist and head of the Dark Army. Whiterose also operates as Zhi Zhang, China's Minister of State Security (seasons 3–4; recurring seasons 1–2). A younger Whiterose was portrayed by Ross Kurt Le (season 4).\r\nBobby Cannavale as Irving, a used car salesman who is a Dark Army fixer (season 3; guest season 4).\r\nElliot Villar as Fernando Vera, Shayla's drug supplier and Elliot's only supply of suboxone who has a unique dangerous philosophy and is obsessed with Shayla and later Elliot (season 4; recurring season 1; guest season 3)\r\nAshlie Atkinson as Janice, a chatty taxidermist and Dark Army fixer with a peculiar sense of humor (season 4).\r\nRecurring\r\nGloria Reuben as Krista Gordon, Elliot's psychiatrist\r\nMichel Gill as Gideon Goddard, CEO of Allsafe Security (seasons 1–2; guest season 3).\r\nBen Rappaport as Ollie Parker, Angela's boyfriend and an employee at Allsafe (season 1; guest seasons 2, 4).\r\nAaron Takahashi as Lloyd Chong , Elliot's coworker at Allsafe (season 1; guest seasons 2, 4)\r\nFrankie Shaw as Shayla Nico, Elliot's drug dealer and girlfriend (season 1)\r\nRon Cephas Jones as Leslie Romero, a member of fsociety (season 1; guest season 2).\r\nSunita Mani as Shama \"Trenton\" Biswas, a member of fsociety (seasons 1–3).\r\nAzhar Khan as Sunil \"Mobley\" Markesh, a member of fsociety and Bank of E employee (seasons 1–3).\r\nBruce Altman as Terry Colby, the former CTO of E Corp who is framed by fsociety for a hack attack (season 1; guest seasons 2–3)\r\nArmand Schultz as Lenny Shannon, Krista's ex-lover and one of Elliot's early hacking targets (season 1; guest seasons 2–3)\r\nMichael Drayer as Francis \"Cisco\" Shaw, Darlene's ex-boyfriend who was the U.S. liaison to the Chinese hacker group Dark Army (seasons 1–2; guest season 3).\r\nBrian Stokes Mitchell as Scott Knowles, the CTO of E Corp following Colby's arrest (seasons 1–2)\r\nJeremy Holm as Donald \"Mr. Sutherland\" Hoffman, a fixer under Tyrell and Joanna Wellick (seasons 1–2; guest season 3).\r\nSakina Jaffrey as Antara Nayar, Angela's lawyer (seasons 1–2; guest season 3).\r\nDon Sparks as Donald Moss, Angela's adopted father (season 1; guest season 2).\r\nMichele Hicks as Sharon Knowles, Scott's wife (season 1; guest season 2).\r\nVaishnavi Sharma as Magda Alderson, Elliot's abusive mother (seasons 1–2, 4)\r\nRick Gonzalez as Isaac Vera, Fernando Vera's brother (season 1).\r\nNadia Gan as Elizabeth, Tyrell's assistant (season 1; guest season 4).\r\nStephen Lin as Hamburger Man, Elliot's contact with the Dark Army (season 3; guest seasons 1–2, 4)\r\nJoey Badass as Leon, a new close friend of Elliot and an inmate obsessed with sitcoms, as well as an agent for the Dark Army responsible for Elliot's safety (seasons 2–4)\r\nBernadette Quigley as a chaplain who hosts a prayer group attended by Elliot (season 2)\r\nSandrine Holt as Susan Jacobs, an E Corp General Counsel known as Madame Executioner (season 2)\r\nAnthony Jennings as Vincent, an fsociety member given orders by Darlene (season 2).\r\nErik Jensen as Frank Cody, a conspiracy theorist and talk show host (seasons 2–3).\r\nChris Conroy as Derek, Joanna's secret lover who works as a bartender and a DJ (season 2; guest season 3).\r\nCraig Robinson as Ray Heyworth, a prison warden who secretly runs a Tor routed website involving human trafficking, drugs and weapons (season 2).\r\nMichael Maize as \"Lone Star\" Lockwood, a Texas native and an off-balanced prison guard and associate of Ray (season 2).\r\nOmar Metwally as Ernesto Santiago, Dom's superior at the FBI who also works for the Dark Army to protect Tyrell Wellick (seasons 2–3).\r\nGrant Chang as Grant, Whiterose's assistant and lover (seasons 2–3).\r\nLuke Robertson as RT, Ray's former system admin (season 2).\r\nRizwan Manji as Norm Gill, Dom's new partner working with her to investigate the 5/9 hack (season 3).\r\nRamy Youssef as Samar Swailem, Elliot's coworker at E Corp (season 3)\r\nChristine M. Campbell as Janet Robinson, a high-level manager at E Corp (season 3)\r\nKathryn Danielle as Bobbi, the HR manager at E Corp (season 3)\r\nJosh Mostel as Bo, Elliot's landlord (season 3)\r\nJing Xu as Wang Shu, Whiterose's assistant (season 4).\r\nDominik García as Olivia Cortez, employee for Cyprus National Bank (season 4).\r\nYoung M.A as Peanuts, Vera's loyal henchman (season 4).\r\nProduction\r\nConception and development\r\nSam Esmail, the show's creator and showrunner, is the credited writer on the vast majority of the episodes. In an interview, Sam Esmail shared that he is fascinated by hacker culture and wanted to make a film about it for around 15 years. In the production, Esmail consulted experts to give a realistic picture of hacking activities. Another inspiration for Esmail, who is of Egyptian descent, was the 2011 Arab Spring, mainly the Egyptian Revolution, where young people who were angry at society used social media to bring about a change. He has said that Elliot is a \"thinly-veiled version\" of himself.\r\nEsmail had originally intended Mr. Robot to be a feature film, with the end of the first act being someone finding out that he had a mental disorder while enacting a greater scheme. However, midway through writing the first act, he found that the script had expanded considerably, and that it had become better-suited for a television show. He removed 20 of around 89 pages of the script then written, and used it as the pilot for the series, and what was to have been the end of the first act became the finale of the first season. Esmail took the script to film and television production company Anonymous Content to see if it could be developed into a television series, which was then picked up by USA Network. USA gave a pilot order to Mr. Robot in July 2014. After an exhaustive search to cast the lead role, it was announced in September 2014 that Rami Malek had been cast as Elliot; the remainder of the roles in the pilot were cast later in September and October.\r\nUSA picked it up to series with a 10-episode order in December 2014. Production began in New York on April 13, 2015. The pilot premiered on multiple online and video on demand services on May 27, 2015, and the series was renewed for a second season before the first season premiered on USA on June 24, 2015. In December 2015, it was announced that Esmail would direct all episodes in the second season. In June 2016, it was announced that the second season's episode order was increased from 10 to 12 episodes. The 12-episode second season premiered on July 13, 2016. On August 16, 2016, USA renewed Mr. Robot for a third season to air in 2017. The third season debuted in October 2017 and consisted of 10 episodes. All episodes were directed by Esmail, just as in the second season. On December 13, 2017, USA renewed Mr. Robot for a fourth season. In August 2018, it was confirmed that the fourth season would be the final season.\r\nOriginally, the show planned to dress Elliot in a worn sweatshirt and colorful backpack; however, Malek suggested a black backpack and wore his own B:Scott black hoodie to set. The outfit became the signature look for the character, and the costume designer ordered 20 more of them, despite the item having been discontinued years earlier. To portray the unusual, often confused worldview of lead character Elliot Alderson, Franklin Peterson, who edited three Mr. Robot episodes in the first season and six in the second season, used creative editing styles that included jump cuts, varied lengths of takes and shuffling scenes around within an episode and sometimes even between episodes. Esmail encouraged the experimentation as Peterson and his team explored the personality of each character in the editing suite, finding creative ways to tell their stories and maintain their humanity.\r\nVisual effects\r\nFuseFX was hired to provide the visual effects for episode \"eps3.4_runtime-error.r00\" of season 3, in which they took 40 shots and stitched them together to appear as one seamless shot for the entire episode.\r\nTechnical accuracy\r\nMr. Robot has been widely praised for its technical accuracy by numerous cybersecurity firms and services such as Avast, Panda Security, Avira, Kaspersky, Proton Mail, and bloggers who analyzed and dissected the technical aspects of the show after episodes containing hacking scenes. Aside from the pilot episode, Esmail hired Kor Adana (former network security analyst and forensics manager for Toyota Motor Sales), Michael Bazzell (security consultant and former FBI Cyber Crimes Task Force agent and investigator) and James Plouffe (lead solutions architect at MobileIron) as his advisors to oversee the technical accuracy of the show. By the second season, Adana assembled a team of hackers and cybersecurity experts including Jeff Moss (founder and director of Black Hat and DEF CON computer security conferences), Marc Rogers (principal security researcher for Cloudflare and head of security for DEF CON), Ryan Kazanciyan (chief security architect for Tanium) and Andre McGregor (director of security for Tanium and former FBI Cyber Special agent) to assist him with the authenticity of the hacks and the technology being used. Hacking scenes were performed by members of the technical team in real life, recorded and rebuilt using Flash animation. Animation process is carried out by animator Adam Brustein under the direct supervision of Adana himself. Kali Linux and its tools were used in multiple episodes.\r\nThe show has also attempted to accurately represent Elliot's mental health issues. In an interview with Terry Gross for the radio show Fresh Air, Malek recounted contacting a psychologist to learn about schizophrenia, dissociative identity disorder, and social anxiety. When in meetings with Esmail, Malek's knowledge on the topics led Esmail to bring the psychologist on as a consultant for the show. Subsequently, the show has been widely praised by critics, viewers and psychiatrists as being one of the most accurate representations of mental health issues ever portrayed on TV or film, especially for its depictions of dissociative identity disorder, social anxiety, panic disorders and chronic depression. Malek and Chaikin's performances have been further singled out for their \"raw and authentic depictions of mental illness makes it more relatable to those who haven't experienced it firsthand\" while also representing a \"kindred spirit\" to viewers who do have mental health issues. Inverse described Mr. Robot as \"setting a new standard for depictions of mental illness ... without ending up exploitative.\"\r\nInfluences\r\nSam Esmail has acknowledged several major influences on the show, such as American Psycho, Taxi Driver, A Clockwork Orange, and The Matrix. In particular, Esmail credited Fight Club as the inspiration for a main character who has dissociative identity disorder creating a new manifestation of his deceased father in the form of a hacker, as well as for the anti-consumerist, anti-establishment, and anti-capitalist spirit of its characters. Commentators have also noted the parallel in its plot on the erasing of consumer debt records to the film. Even so, Lauren Lawson for GQ remarked, \"Mr. Robot elevates the Fight Club formula: the show's mindfuckery lubes us up to think about society (Elliot's and ours) in a discerning way, but it's not the main event. You can see Fight Club once and pretty much get the picture, but it will take years of scholarly binge-watching to answer the questions Mr. Robot raises.\" In an interview, Esmail explains how playing the song that David Fincher used to underscore the climax of Fight Club (\"Where Is My Mind?\") when Elliot initiates the hack in episode nine is intended as a message to the audience that he is aware of the inspiration they took from the film. The narration by the protagonist was influenced by Taxi Driver, and other influences mentioned included Risky Business for its music score, Blade Runner for the character development, and the television series Breaking Bad for the story arc.\r\nFilming locations\r\nThe series was filmed in New York. Filming locations include Silvercup Studios and Coney Island, which serves as the exterior of the base of operations for the hacking group fsociety. As the production crew was unable to shut down Times Square for filming, the scenes at Times Square in the first-season finale were shot late at night just before July 4 holiday weekend to catch the area at its emptiest while other shots were done on sets. Production on the second season began on March 7, 2016, resuming filming in New York City.\r\nAftershows\r\nIn June 2016, USA Network announced Hacking Robot, a live aftershow hosted by Andy Greenwald to air during the second season. Hacking Robot debuted after the second-season premiere and aired again following the tenth episode. In addition, a weekly web-only aftershow titled Mr. Robot Digital After Show premiered on The Verge and USA Network's websites after the third episode, and continued through the third season.\r\nReception\r\nCritical response\r\nSeason 1\r\nThe first season of Mr. Robot received critical acclaim. On Rotten Tomatoes, it has a rating of 98%, based on 146 reviews, with an average rating of 8.35/10. The site's consensus reads, \"Mr. Robot is a suspenseful cyber-thriller with timely stories and an intriguing, provocative premise.\" It set a record on Rotten Tomatoes as the only show to earn perfect episode scores for an entire season since the site began tracking television episodes. On Metacritic, the first season scored 79 out of 100, based on 24 critics, indicating \"generally favorable reviews\".\r\nMerrill Barr of Forbes gave it a very positive review, writing, \"Mr. Robot has one of the best kick-offs to any series in a while\" and that it \"could be the series that finally, after years of ignorance, puts a deserving network among the likes of HBO, AMC and FX in terms of acclaim.\"\r\nIn The New York Times, Alessandra Stanley noted that \"Occupy Wall Street, the protest movement that erupted in 2011, didn't do much to curb the financial industry. It didn't die out, though. It went Hollywood\", before finding Mr. Robot to be, \"an intriguing new series ... a cyber-age thriller infused with a dark, almost nihilistic pessimism about the Internet, capitalism and income inequality. And that makes it kind of fun\". The UK The Daily Telegraph reviewer Michael Hogan gave the show five stars, finding it to be \"The Matrix meets Fight Club meets Robin Hood\", noting that, \"bafflingly, it took months for a UK broadcaster to snap up the rights\". Although Hogan found too much attention was devoted to Elliot's social anxiety, he eventually decided that \"this alienated anti-hero was a brilliant, boldly complex character.\" Overall, Hogan concluded that the show deserved to find an audience in the UK.\r\nMr. Robot made several critics' list for the best TV shows of 2015. Three critics, Jeff Jensen of Entertainment Weekly, Rob Sheffield of Rolling Stone, and the staff of TV Guide, named it the best show of the year. The series was also placed second on the list from three other critics, and was named among the best of the year from four other critics.\r\nSeason 2\r\nThe second season also received critical acclaim. On Rotten Tomatoes, it has a score of 89%, based on 262 reviews, with an average rating of 7.8/10. The site's consensus reads: \"Unique storytelling, a darker tone, and challenging opportunities for its tight cast push Mr. Robot even further into uncharted television territory.\" On Metacritic, it has a score of 81 out of 100, based on 28 critics, indicating \"universal acclaim\".\r\nSonia Saraiya of Variety praised Rami Malek's performance and wrote, \"It's Malek's soulful eyes and silent pathos that give Mr. Robot its unexpected warmth, as the viewer is lured into Elliot's chaos and confusion.\" Tim Goodman of The Hollywood Reporter lauded Sam Esmail's direction, writing \"Esmail's camerawork—characters tucked into corners of the frame, among other nontraditional compositions—continues to give the sense of disorientation and never feels tired\" and \"there are some flourishes in the first two hours that are brilliantly conceived and contribute to what is one of the most visually remarkable hours on television.\"\r\nSeason 3\r\nThe third season also received critical acclaim. On Rotten Tomatoes, it has a score of 92%, based on 143 reviews, with an average rating of 8.25/10. The site's critical consensus reads, \"Mr. Robot's striking visuals and bold narrative fuel its seductive blend of reality and fantasy.\" On Metacritic, it has a score of 82 out of 100, based on 9 critics, indicating \"universal acclaim\".\r\nBased on six episodes for review, Darren Franich of Entertainment Weekly gave it an \"A\" grade, calling it a \"noir masterpiece\", and overall, wrote that \"Season 3 of Mr. Robot is a masterpiece, ballasting the global ambitions of season 2 while sharpening back to the meticulous build of season 1.\"\r\nSeason 4\r\nAs with previous seasons, the fourth and final season has been met with acclaim. On Rotten Tomatoes, it has a score of 97% with an average rating of 8.95/10, based on 121 reviews. The site's critical consensus reads, \"Mr. Robot returns with a thrilling final season that is sure to surprise and satisfy its audience.\" On Metacritic, it has a score of 81 out of 100, based on 5 critics, indicating \"universal acclaim\".\r\nThe episode \"407 Proxy Authentication Required\" specifically gained exceptional acclaim by Decider, who called it \"among the best individual TV episodes of 2019, and possibly one of the best of all time.\" Variety listed it as the 22nd best show of the 2010s, and Emily St. James of Vox named it among \"shows that help explain the decade\". Emma Garland of Vice described the show as defining the 2010s and post-Occupy world as one of vast inequality: \"Even if you don't buy into its earnestness, you can't argue with its bittersweet irony.\"\r\nRatings\r\nAwards and nominations\r\nCritics' top ten lists\r\nIn other media\r\nMr. Robot has spawned a variety of video games. Its mobile game, titled: Mr. Robot:1.51exfiltrati0n.apk (for Android) and Mr. Robot:1.51exfiltrati0n.ipa (for iOS) are set during the first season of the series and was published by Telltale Games. Users play as a fictional character who has stumbled upon the phone of an important member of fsociety and takes it upon themselves to assist them in bringing down E Corp. The Mr. Robot Virtual Reality Experience, written and directed by Sam Esmail, is a 13-minute video viewable using virtual reality headsets that explores Elliot's past. Mr. Robot also features several Easter eggs, including websites related to the show or IP addresses used within the series that redirect to real websites.\r\nA book tie-in, Mr. Robot: Red Wheelbarrow (eps1.91_redwheelbarr0w.txt) written by Esmail and Courtney Looney, was released on November 1, 2016.\r\nRelease\r\nBroadcast\r\nMr. Robot premiered in the United States on USA Network on June 24, 2015, and in Canada on Showcase on September 4, 2015. Amazon.com secured international broadcasting rights in the United Kingdom, with the first season added on Amazon Prime on October 16, 2015, and second-season episodes to be released immediately after initial broadcast in the United States. In Australia, the series premiered on Presto on August 14, 2015. After Presto shut down, the series moved to Fox Showcase for its third season and to Foxtel On Demand for the fourth season. The show aired in the Republic of Ireland on TG4.\r\nHome media\r\nUniversal Pictures Home Entertainment released all four seasons on DVD and Blu-ray. The first season was released on January 12, 2016. It contains all 10 episodes, plus deleted scenes, gag reel, making-of featurette, and UltraViolet digital copies of the episodes. The second season was released on January 10, 2017. The third season was released on March 27, 2018 in the United States. The fourth season as well as a complete series collection was released on March 31, 2020.\r\nIn September 2015, Amazon.com acquired exclusive streaming VOD rights to Mr. Robot in several countries. The first season became available to stream in June 2016 for U.S. Amazon Prime subscribers.",
    "html": "<p>Mr. Robot is an American drama thriller television series created by Sam Esmail for USA Network. It stars Rami Malek as Elliot Alderson, a cybersecurity engineer and hacker with social anxiety disorder, clinical depression and dissociative identity disorder. Elliot is recruited by an insurrectionary anarchist known as \"Mr. Robot\", played by Christian Slater, to join a group of hacktivists called \"fsociety\". The group aims to destroy all debt records by encrypting the financial data of E Corp, the largest conglomerate in the world.</p><p>The pilot premiered via online and video on demand services on May 27, 2015. In addition to Malek and Slater, the series stars an ensemble cast featuring Carly Chaikin, Portia Doubleday, Martin Wallström, Michael Cristofer, Stephanie Corneliussen, Grace Gummer, BD Wong, Bobby Cannavale, Ashlie Atkinson, and Elliot Villar. The first season debuted on USA Network on June 24, 2015, while the second season premiered on July 13, 2016, and the third season premiered on October 11, 2017. The fourth and final season premiered on October 6, 2019, and concluded on December 22, 2019.</p><p>Mr. Robot received critical acclaim, particularly for the performances of Malek and Slater, its story and visual presentation, and Mac Quayle's musical score. Esmail has received praise for his direction of the series, having directed three episodes in the first season before serving as the sole director for the remainder of the show. The show received numerous accolades, including two Golden Globe Awards, three Primetime Emmy Awards, and a Peabody Award.</p><br/><h3>Premise</h3><p>The series follows Elliot Alderson, a young man living in New York City, who works at the cybersecurity company Allsafe as a cybersecurity engineer. Constantly struggling with social anxiety, dissociative identity disorder, clinical depression and drug abuse, Elliot's thought process seems heavily influenced by paranoia and delusion. He connects to people by hacking them, which often leads him to act as a cyber-vigilante. He is recruited by a mysterious insurrectionary anarchist known as Mr. Robot and joins his team of hacktivists known as fsociety. One of their missions is to cancel all consumer debt by encrypting all the data of one of the largest corporations in the world, E Corp (which Elliot perceives as Evil Corp), which also happens to be Allsafe's biggest client.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 24, 2015</td><td style=\"padding:0 8px\">September 2, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 13, 2016</td><td style=\"padding:0 8px\">September 21, 2016</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 11, 2017</td><td style=\"padding:0 8px\">December 13, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 6, 2019</td><td style=\"padding:0 8px\">December 22, 2019</td></tr></tbody></table><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Rami Malek as Elliot Alderson, a senior cybersecurity engineer at Allsafe Cybersecurity and a vigilante hacker. He has dissociative identity disorder and deals with other mental illnesses such as clinical depression and severe anxiety, which are partly responsible for his antisocial behavior and drug use. Elliot's hacker nickname is \"Sam Sepiol\" or \"samsep10l\". Elliot is portrayed as a child by Aidan Liebman (seasons 1–2), Alex Bento (season 3), and Evan Whitten (season 4).</li><li>Carly Chaikin as Darlene Alderson, Elliot's younger sister, a malware coder and one of the fsociety hackers</li><li>Portia Doubleday as Angela Moss, Elliot's childhood friend and a fellow employee at Allsafe, later PR Manager for E Corp. Mabel Tyler portrays a young Angela.</li><li>Martin Wallström as Tyrell Wellick, originally the ambitious Senior Vice President of Technology at E Corp and later part of fsociety</li><li>Christian Slater as Mr. Robot, an insurrectionary anarchist who recruits Elliot into an underground hacker group called fsociety and Edward Alderson, Elliot's father</li><li>Michael Cristofer as Phillip Price, the CEO of E Corp (seasons 2–4; recurring season 1)</li><li>Stephanie Corneliussen as Joanna Wellick, Tyrell's wife (seasons 2–3; recurring season 1).</li><li>Grace Gummer as Dominique \"Dom\" DiPierro, an FBI field agent investigating the E Corp hack (seasons 2–4)</li><li>BD Wong as Whiterose, a trans woman, cyber-terrorist and head of the Dark Army. Whiterose also operates as Zhi Zhang, China's Minister of State Security (seasons 3–4; recurring seasons 1–2). A younger Whiterose was portrayed by Ross Kurt Le (season 4).</li><li>Bobby Cannavale as Irving, a used car salesman who is a Dark Army fixer (season 3; guest season 4).</li><li>Elliot Villar as Fernando Vera, Shayla's drug supplier and Elliot's only supply of suboxone who has a unique dangerous philosophy and is obsessed with Shayla and later Elliot (season 4; recurring season 1; guest season 3)</li><li>Ashlie Atkinson as Janice, a chatty taxidermist and Dark Army fixer with a peculiar sense of humor (season 4).</li></ul><h4>Recurring</h4><ul><li>Gloria Reuben as Krista Gordon, Elliot's psychiatrist</li><li>Michel Gill as Gideon Goddard, CEO of Allsafe Security (seasons 1–2; guest season 3).</li><li>Ben Rappaport as Ollie Parker, Angela's boyfriend and an employee at Allsafe (season 1; guest seasons 2, 4).</li><li>Aaron Takahashi as Lloyd Chong , Elliot's coworker at Allsafe (season 1; guest seasons 2, 4)</li><li>Frankie Shaw as Shayla Nico, Elliot's drug dealer and girlfriend (season 1)</li><li>Ron Cephas Jones as Leslie Romero, a member of fsociety (season 1; guest season 2).</li><li>Sunita Mani as Shama \"Trenton\" Biswas, a member of fsociety (seasons 1–3).</li><li>Azhar Khan as Sunil \"Mobley\" Markesh, a member of fsociety and Bank of E employee (seasons 1–3).</li><li>Bruce Altman as Terry Colby, the former CTO of E Corp who is framed by fsociety for a hack attack (season 1; guest seasons 2–3)</li><li>Armand Schultz as Lenny Shannon, Krista's ex-lover and one of Elliot's early hacking targets (season 1; guest seasons 2–3)</li><li>Michael Drayer as Francis \"Cisco\" Shaw, Darlene's ex-boyfriend who was the U.S. liaison to the Chinese hacker group Dark Army (seasons 1–2; guest season 3).</li><li>Brian Stokes Mitchell as Scott Knowles, the CTO of E Corp following Colby's arrest (seasons 1–2)</li><li>Jeremy Holm as Donald \"Mr. Sutherland\" Hoffman, a fixer under Tyrell and Joanna Wellick (seasons 1–2; guest season 3).</li><li>Sakina Jaffrey as Antara Nayar, Angela's lawyer (seasons 1–2; guest season 3).</li><li>Don Sparks as Donald Moss, Angela's adopted father (season 1; guest season 2).</li><li>Michele Hicks as Sharon Knowles, Scott's wife (season 1; guest season 2).</li><li>Vaishnavi Sharma as Magda Alderson, Elliot's abusive mother (seasons 1–2, 4)</li><li>Rick Gonzalez as Isaac Vera, Fernando Vera's brother (season 1).</li><li>Nadia Gan as Elizabeth, Tyrell's assistant (season 1; guest season 4).</li><li>Stephen Lin as Hamburger Man, Elliot's contact with the Dark Army (season 3; guest seasons 1–2, 4)</li><li>Joey Badass as Leon, a new close friend of Elliot and an inmate obsessed with sitcoms, as well as an agent for the Dark Army responsible for Elliot's safety (seasons 2–4)</li><li>Bernadette Quigley as a chaplain who hosts a prayer group attended by Elliot (season 2)</li><li>Sandrine Holt as Susan Jacobs, an E Corp General Counsel known as Madame Executioner (season 2)</li><li>Anthony Jennings as Vincent, an fsociety member given orders by Darlene (season 2).</li><li>Erik Jensen as Frank Cody, a conspiracy theorist and talk show host (seasons 2–3).</li><li>Chris Conroy as Derek, Joanna's secret lover who works as a bartender and a DJ (season 2; guest season 3).</li><li>Craig Robinson as Ray Heyworth, a prison warden who secretly runs a Tor routed website involving human trafficking, drugs and weapons (season 2).</li><li>Michael Maize as \"Lone Star\" Lockwood, a Texas native and an off-balanced prison guard and associate of Ray (season 2).</li><li>Omar Metwally as Ernesto Santiago, Dom's superior at the FBI who also works for the Dark Army to protect Tyrell Wellick (seasons 2–3).</li><li>Grant Chang as Grant, Whiterose's assistant and lover (seasons 2–3).</li><li>Luke Robertson as RT, Ray's former system admin (season 2).</li><li>Rizwan Manji as Norm Gill, Dom's new partner working with her to investigate the 5/9 hack (season 3).</li><li>Ramy Youssef as Samar Swailem, Elliot's coworker at E Corp (season 3)</li><li>Christine M. Campbell as Janet Robinson, a high-level manager at E Corp (season 3)</li><li>Kathryn Danielle as Bobbi, the HR manager at E Corp (season 3)</li><li>Josh Mostel as Bo, Elliot's landlord (season 3)</li><li>Jing Xu as Wang Shu, Whiterose's assistant (season 4).</li><li>Dominik García as Olivia Cortez, employee for Cyprus National Bank (season 4).</li><li>Young M.A as Peanuts, Vera's loyal henchman (season 4).</li></ul><br/><h3>Production</h3><h4>Conception and development</h4><p>Sam Esmail, the show's creator and showrunner, is the credited writer on the vast majority of the episodes. In an interview, Sam Esmail shared that he is fascinated by hacker culture and wanted to make a film about it for around 15 years. In the production, Esmail consulted experts to give a realistic picture of hacking activities. Another inspiration for Esmail, who is of Egyptian descent, was the 2011 Arab Spring, mainly the Egyptian Revolution, where young people who were angry at society used social media to bring about a change. He has said that Elliot is a \"thinly-veiled version\" of himself.</p><p>Esmail had originally intended Mr. Robot to be a feature film, with the end of the first act being someone finding out that he had a mental disorder while enacting a greater scheme. However, midway through writing the first act, he found that the script had expanded considerably, and that it had become better-suited for a television show. He removed 20 of around 89 pages of the script then written, and used it as the pilot for the series, and what was to have been the end of the first act became the finale of the first season. Esmail took the script to film and television production company Anonymous Content to see if it could be developed into a television series, which was then picked up by USA Network. USA gave a pilot order to Mr. Robot in July 2014. After an exhaustive search to cast the lead role, it was announced in September 2014 that Rami Malek had been cast as Elliot; the remainder of the roles in the pilot were cast later in September and October.</p><p>USA picked it up to series with a 10-episode order in December 2014. Production began in New York on April 13, 2015. The pilot premiered on multiple online and video on demand services on May 27, 2015, and the series was renewed for a second season before the first season premiered on USA on June 24, 2015. In December 2015, it was announced that Esmail would direct all episodes in the second season. In June 2016, it was announced that the second season's episode order was increased from 10 to 12 episodes. The 12-episode second season premiered on July 13, 2016. On August 16, 2016, USA renewed Mr. Robot for a third season to air in 2017. The third season debuted in October 2017 and consisted of 10 episodes. All episodes were directed by Esmail, just as in the second season. On December 13, 2017, USA renewed Mr. Robot for a fourth season. In August 2018, it was confirmed that the fourth season would be the final season.</p><p>Originally, the show planned to dress Elliot in a worn sweatshirt and colorful backpack; however, Malek suggested a black backpack and wore his own B:Scott black hoodie to set. The outfit became the signature look for the character, and the costume designer ordered 20 more of them, despite the item having been discontinued years earlier. To portray the unusual, often confused worldview of lead character Elliot Alderson, Franklin Peterson, who edited three Mr. Robot episodes in the first season and six in the second season, used creative editing styles that included jump cuts, varied lengths of takes and shuffling scenes around within an episode and sometimes even between episodes. Esmail encouraged the experimentation as Peterson and his team explored the personality of each character in the editing suite, finding creative ways to tell their stories and maintain their humanity.</p><h4>Visual effects</h4><p>FuseFX was hired to provide the visual effects for episode \"eps3.4_runtime-error.r00\" of season 3, in which they took 40 shots and stitched them together to appear as one seamless shot for the entire episode.</p><h4>Technical accuracy</h4><p>Mr. Robot has been widely praised for its technical accuracy by numerous cybersecurity firms and services such as Avast, Panda Security, Avira, Kaspersky, Proton Mail, and bloggers who analyzed and dissected the technical aspects of the show after episodes containing hacking scenes. Aside from the pilot episode, Esmail hired Kor Adana (former network security analyst and forensics manager for Toyota Motor Sales), Michael Bazzell (security consultant and former FBI Cyber Crimes Task Force agent and investigator) and James Plouffe (lead solutions architect at MobileIron) as his advisors to oversee the technical accuracy of the show. By the second season, Adana assembled a team of hackers and cybersecurity experts including Jeff Moss (founder and director of Black Hat and DEF CON computer security conferences), Marc Rogers (principal security researcher for Cloudflare and head of security for DEF CON), Ryan Kazanciyan (chief security architect for Tanium) and Andre McGregor (director of security for Tanium and former FBI Cyber Special agent) to assist him with the authenticity of the hacks and the technology being used. Hacking scenes were performed by members of the technical team in real life, recorded and rebuilt using Flash animation. Animation process is carried out by animator Adam Brustein under the direct supervision of Adana himself. Kali Linux and its tools were used in multiple episodes.</p><p>The show has also attempted to accurately represent Elliot's mental health issues. In an interview with Terry Gross for the radio show Fresh Air, Malek recounted contacting a psychologist to learn about schizophrenia, dissociative identity disorder, and social anxiety. When in meetings with Esmail, Malek's knowledge on the topics led Esmail to bring the psychologist on as a consultant for the show. Subsequently, the show has been widely praised by critics, viewers and psychiatrists as being one of the most accurate representations of mental health issues ever portrayed on TV or film, especially for its depictions of dissociative identity disorder, social anxiety, panic disorders and chronic depression. Malek and Chaikin's performances have been further singled out for their \"raw and authentic depictions of mental illness makes it more relatable to those who haven't experienced it firsthand\" while also representing a \"kindred spirit\" to viewers who do have mental health issues. Inverse described Mr. Robot as \"setting a new standard for depictions of mental illness ... without ending up exploitative.\"</p><h4>Influences</h4><p>Sam Esmail has acknowledged several major influences on the show, such as American Psycho, Taxi Driver, A Clockwork Orange, and The Matrix. In particular, Esmail credited Fight Club as the inspiration for a main character who has dissociative identity disorder creating a new manifestation of his deceased father in the form of a hacker, as well as for the anti-consumerist, anti-establishment, and anti-capitalist spirit of its characters. Commentators have also noted the parallel in its plot on the erasing of consumer debt records to the film. Even so, Lauren Lawson for GQ remarked, \"Mr. Robot elevates the Fight Club formula: the show's mindfuckery lubes us up to think about society (Elliot's and ours) in a discerning way, but it's not the main event. You can see Fight Club once and pretty much get the picture, but it will take years of scholarly binge-watching to answer the questions Mr. Robot raises.\" In an interview, Esmail explains how playing the song that David Fincher used to underscore the climax of Fight Club (\"Where Is My Mind?\") when Elliot initiates the hack in episode nine is intended as a message to the audience that he is aware of the inspiration they took from the film. The narration by the protagonist was influenced by Taxi Driver, and other influences mentioned included Risky Business for its music score, Blade Runner for the character development, and the television series Breaking Bad for the story arc.</p><h4>Filming locations</h4><p>The series was filmed in New York. Filming locations include Silvercup Studios and Coney Island, which serves as the exterior of the base of operations for the hacking group fsociety. As the production crew was unable to shut down Times Square for filming, the scenes at Times Square in the first-season finale were shot late at night just before July 4 holiday weekend to catch the area at its emptiest while other shots were done on sets. Production on the second season began on March 7, 2016, resuming filming in New York City.</p><h4>Aftershows</h4><p>In June 2016, USA Network announced Hacking Robot, a live aftershow hosted by Andy Greenwald to air during the second season. Hacking Robot debuted after the second-season premiere and aired again following the tenth episode. In addition, a weekly web-only aftershow titled Mr. Robot Digital After Show premiered on The Verge and USA Network's websites after the third episode, and continued through the third season.</p><br/><h3>Reception</h3><h4>Critical response</h4><h4>Season 1</h4><p>The first season of Mr. Robot received critical acclaim. On Rotten Tomatoes, it has a rating of 98%, based on 146 reviews, with an average rating of 8.35/10. The site's consensus reads, \"Mr. Robot is a suspenseful cyber-thriller with timely stories and an intriguing, provocative premise.\" It set a record on Rotten Tomatoes as the only show to earn perfect episode scores for an entire season since the site began tracking television episodes. On Metacritic, the first season scored 79 out of 100, based on 24 critics, indicating \"generally favorable reviews\".</p><p>Merrill Barr of Forbes gave it a very positive review, writing, \"Mr. Robot has one of the best kick-offs to any series in a while\" and that it \"could be the series that finally, after years of ignorance, puts a deserving network among the likes of HBO, AMC and FX in terms of acclaim.\"</p><p>In The New York Times, Alessandra Stanley noted that \"Occupy Wall Street, the protest movement that erupted in 2011, didn't do much to curb the financial industry. It didn't die out, though. It went Hollywood\", before finding Mr. Robot to be, \"an intriguing new series ... a cyber-age thriller infused with a dark, almost nihilistic pessimism about the Internet, capitalism and income inequality. And that makes it kind of fun\". The UK The Daily Telegraph reviewer Michael Hogan gave the show five stars, finding it to be \"The Matrix meets Fight Club meets Robin Hood\", noting that, \"bafflingly, it took months for a UK broadcaster to snap up the rights\". Although Hogan found too much attention was devoted to Elliot's social anxiety, he eventually decided that \"this alienated anti-hero was a brilliant, boldly complex character.\" Overall, Hogan concluded that the show deserved to find an audience in the UK.</p><p>Mr. Robot made several critics' list for the best TV shows of 2015. Three critics, Jeff Jensen of Entertainment Weekly, Rob Sheffield of Rolling Stone, and the staff of TV Guide, named it the best show of the year. The series was also placed second on the list from three other critics, and was named among the best of the year from four other critics.</p><h4>Season 2</h4><p>The second season also received critical acclaim. On Rotten Tomatoes, it has a score of 89%, based on 262 reviews, with an average rating of 7.8/10. The site's consensus reads: \"Unique storytelling, a darker tone, and challenging opportunities for its tight cast push Mr. Robot even further into uncharted television territory.\" On Metacritic, it has a score of 81 out of 100, based on 28 critics, indicating \"universal acclaim\".</p><p>Sonia Saraiya of Variety praised Rami Malek's performance and wrote, \"It's Malek's soulful eyes and silent pathos that give Mr. Robot its unexpected warmth, as the viewer is lured into Elliot's chaos and confusion.\" Tim Goodman of The Hollywood Reporter lauded Sam Esmail's direction, writing \"Esmail's camerawork—characters tucked into corners of the frame, among other nontraditional compositions—continues to give the sense of disorientation and never feels tired\" and \"there are some flourishes in the first two hours that are brilliantly conceived and contribute to what is one of the most visually remarkable hours on television.\"</p><h4>Season 3</h4><p>The third season also received critical acclaim. On Rotten Tomatoes, it has a score of 92%, based on 143 reviews, with an average rating of 8.25/10. The site's critical consensus reads, \"Mr. Robot's striking visuals and bold narrative fuel its seductive blend of reality and fantasy.\" On Metacritic, it has a score of 82 out of 100, based on 9 critics, indicating \"universal acclaim\".</p><p>Based on six episodes for review, Darren Franich of Entertainment Weekly gave it an \"A\" grade, calling it a \"noir masterpiece\", and overall, wrote that \"Season 3 of Mr. Robot is a masterpiece, ballasting the global ambitions of season 2 while sharpening back to the meticulous build of season 1.\"</p><h4>Season 4</h4><p>As with previous seasons, the fourth and final season has been met with acclaim. On Rotten Tomatoes, it has a score of 97% with an average rating of 8.95/10, based on 121 reviews. The site's critical consensus reads, \"Mr. Robot returns with a thrilling final season that is sure to surprise and satisfy its audience.\" On Metacritic, it has a score of 81 out of 100, based on 5 critics, indicating \"universal acclaim\".</p><p>The episode \"407 Proxy Authentication Required\" specifically gained exceptional acclaim by Decider, who called it \"among the best individual TV episodes of 2019, and possibly one of the best of all time.\" Variety listed it as the 22nd best show of the 2010s, and Emily St. James of Vox named it among \"shows that help explain the decade\". Emma Garland of Vice described the show as defining the 2010s and post-Occupy world as one of vast inequality: \"Even if you don't buy into its earnestness, you can't argue with its bittersweet irony.\"</p><h4>Ratings</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per season of <i>Mr. Robot</i></span></caption><tbody><tr><th scope=\"col\" rowspan=\"2\">Season</th><th scope=\"col\" rowspan=\"2\">Timeslot (<span>ET</span>)</th><th scope=\"col\" rowspan=\"2\">Episodes</th><th scope=\"col\" colspan=\"2\">First aired</th><th scope=\"col\" colspan=\"2\">Last aired</th><th scope=\"col\" rowspan=\"2\"><abbr title=\"Average\">Avg.</abbr> viewers<br>(millions)</th><th scope=\"col\" rowspan=\"2\"><abbr title=\"Average\">Avg.</abbr> 18–49<br>rating</th></tr><tr><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(millions)</th><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>1</span></th><td rowspan=\"3\">Wednesday 10:00 pm</td><td>10</td><td>June 24, 2015</td><td>1.75</td><td>September 2, 2015</td><td>1.21</td><td rowspan=\"1\">1.39</td><td rowspan=\"1\">0.48</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>2</span></th><td>12</td><td>July 13, 2016</td><td>1.04</td><td>September 21, 2016</td><td>0.85</td><td rowspan=\"1\">0.74</td><td rowspan=\"1\">0.30</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>3</span></th><td>10</td><td>October 11, 2017</td><td>0.68</td><td>December 13, 2017</td><td>0.45</td><td rowspan=\"1\">0.53</td><td rowspan=\"1\">0.22</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>4</span></th><td rowspan=\"1\">Sunday 10:00 pm</td><td>13</td><td>October 6, 2019</td><td>0.44</td><td>December 22, 2019</td><td>0.32</td><td rowspan=\"1\">0.38</td><td rowspan=\"1\">0.12</td></tr></tbody></table><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" style=\"width:3%;\">Year</th><th scope=\"col\" style=\"width:22%;\">Award</th><th scope=\"col\" style=\"width:33%;\">Category</th><th>Nominee(s)</th><th scope=\"col\" style=\"width:6%;\">Result</th><th scope=\"col\" class=\"unsortable\" style=\"width:1%;\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><td rowspan=\"3\" style=\"text-align:center;\">2015</td><td><span>2015 SXSW Film Audience Award</span></td><td>Audience Award for Best Episodic</td><td rowspan=\"3\"><i>Mr. Robot</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>25th Gotham Independent Film Awards</span></td><td><span>Breakthrough Series – Long Form</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span class=\"mw-redirect\">2015 American Film Institute Awards</span></td><td>Television Programs of the Year</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"31\" style=\"text-align:center;\">2016</td><td><span>42nd People's Choice Awards</span></td><td>Favorite Cable TV Actor</td><td><span>Christian Slater</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"3\"><span>20th Satellite Awards</span></td><td><span>Best Drama Series</span></td><td><i>Mr. Robot</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td><span>Best Actor in a Drama Series</span></td><td><span>Rami Malek</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor in a Series, Miniseries or TV Film</span></td><td>Christian Slater</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">68th Writers Guild of America Awards</span></td><td><span>Best Drama Series</span></td><td rowspan=\"2\"><span>Kyle Bradstreet</span>, Kate Erickson, <span>Sam Esmail</span>, <span>David Iserson</span>, Randolph Leon, Adam Penn, <span>Matt Pyken</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Best New Series</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>22nd Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by a Male Actor in a Drama Series</span></td><td>Rami Malek</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"3\"><span>73rd Golden Globe Awards</span></td><td><span>Best Television Series – Drama</span></td><td><i>Mr. Robot</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\"></td></tr><tr><td><span>Best Actor – Television Series Drama</span></td><td>Rami Malek</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor – Series, Miniseries or Television Film</span></td><td>Christian Slater</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span class=\"mw-redirect\">6th Critics' Choice Television Awards</span></td><td><span>Best Drama Series</span></td><td><i>Mr. Robot</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"4\"></td></tr><tr><td><span>Best Actor in a Drama Series</span></td><td>Rami Malek</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor in a Drama Series</span></td><td>Christian Slater</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Guest Performer in a Drama Series</span></td><td><span>BD Wong</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Dorian Awards</span></td><td>TV Drama of the Year</td><td><i>Mr. Robot</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>TV Performance of the Year – Actor</td><td>Rami Malek</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>42nd Saturn Awards</span></td><td><span>Best Action-Thriller Television Series</span></td><td rowspan=\"5\"><i>Mr. Robot</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span class=\"mw-redirect\">75th Peabody Awards</span></td><td>Peabody Award</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"4\"><span>32nd TCA Awards</span></td><td><span>Program of the Year</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\"></td></tr><tr><td><span>Outstanding Achievement in Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding New Program</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Individual Achievement in Drama</span></td><td>Rami Malek</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"6\"><span>68th Primetime Emmy Awards</span></td><td><span>Outstanding Drama Series</span></td><td><i>Mr. Robot</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"6\"></td></tr><tr><td><span>Outstanding Lead Actor in a Drama Series</span></td><td>Rami Malek in \"<span>eps1.0 hellofriend.mov</span>\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Writing for a Drama Series</span></td><td>Sam Esmail for \"<span>eps1.0 hellofriend.mov</span>\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Music Composition for a Series</span></td><td><span>Mac Quayle</span> for \"<span>eps1.0 hellofriend.mov</span>\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Casting for a Drama Series</span></td><td>Susie Farris, Beth Bowling, Kim Miscia</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Sound Mixing for a Comedy or Drama Series (One-Hour)</span></td><td>John W. Cook II, Bill Freesh, Timothia Sellers, <span>Andrew Morgado</span> for \"<span class=\"mw-redirect\">eps1.5_br4ve-trave1er.asf</span>\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span class=\"mw-redirect\">7th Critics' Choice Television Awards</span></td><td><span>Best Drama Series</span></td><td><i>Mr. Robot</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td><span>Best Actor in a Drama Series</span></td><td>Rami Malek</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor in a Drama Series</span></td><td>Christian Slater</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"14\" style=\"text-align:center;\">2017</td><td rowspan=\"2\"><span>74th Golden Globe Awards</span></td><td><span>Best Actor – Television Series Drama</span></td><td>Rami Malek</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Best Supporting Actor – Series, Miniseries or Television Film</span></td><td>Christian Slater</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>23rd Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by a Male Actor in a Drama Series</span></td><td>Rami Malek</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>53rd Cinema Audio Society Awards</span></td><td>Outstanding Achievement in Sound Mixing for Television Series – One Hour</td><td>William Sarokin, John W. Cook II, Bill Freesh, Beaux Nyguard and Mike Marino for \"eps2.8_h1dden-pr0cess.axx\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>67th ACE Eddie Awards</span></td><td>Best Edited One Hour Series for Commercial Television</td><td>Philip Harrison for \"eps2.4m4ster-s1ave.aes\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"2\"><span>21st Satellite Awards</span></td><td><span>Best Drama Series</span></td><td><i>Mr. Robot</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"><br></td></tr><tr><td><span>Best Actor in a Drama Series</span></td><td>Rami Malek</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Society of Camera Operators</span> Awards</td><td>Camera Operator of the Year – Television</td><td>Aaron Medick</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>43rd Saturn Awards</span></td><td>Best Action/Thriller Television Series</td><td><i>Mr. Robot</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>2017 MTV Movie &amp; TV Awards</span></td><td>Best Fight Against the System</td><td><i>Mr. Robot</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"4\"><span>69th Primetime Emmy Awards</span></td><td><span>Outstanding Guest Actor in a Drama Series</span></td><td>BD Wong</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\"></td></tr><tr><td><span class=\"mw-redirect\">Outstanding Cinematography for a Single-Camera Series (One Hour)</span></td><td>Tod Campbell for \"eps2.0_unm4sk-pt1.tc\"/\"eps2.0_unm4sk-pt2.tc\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Original Creative Achievement in Interactive Media within a Scripted Program</span></td><td><i>The Mr. Robot Virtual Reality Experience</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Sound Mixing for a Comedy or Drama Series (One Hour)</span></td><td>John W. Cook II, Bill Freesh, William Sarokin, Paul Drenning for \"eps2.8_h1dden-pr0cess.axx\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"6\" style=\"text-align:center;\">2018</td><td><span>75th Golden Globe Awards</span></td><td><span>Best Supporting Actor – Series, Miniseries or Television Film</span></td><td>Christian Slater</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span class=\"mw-redirect\">8th Critics' Choice Television Awards</span></td><td><span>Best Supporting Actor in a Drama Series</span></td><td>Bobby Cannavale</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>16th Visual Effects Society Awards</span></td><td>Outstanding Supporting Visual Effects in a Photoreal Episode</td><td>Ariel Altman, Lauren Montuori, John Miller, Luciano DiGeronimo for \"<span>eps3.4 runtime-error.r00</span>\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"3\"><span>70th Primetime Emmy Awards</span></td><td><span>Original Creative Achievement in Interactive Media within a Scripted Program</span></td><td><i>Mr. Robot: Ecoin</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td><span>Outstanding Sound Mixing for a Comedy or Drama Series (One Hour)</span></td><td>John W. Cook II, Bill Freesh, Joe White, Paul Drenning for \"<span>eps3.4 runtime-error.r00</span>\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Special Visual Effects in a Supporting Role</span></td><td>Ariel Altman, Lauren Montuori, Joe Gunn, John Miller, Brian Kubovcik, Luciano DiGeronimo, Lindsay Seguin, Greg Anderson, John-Michael Buban for \"<span>eps3.4 runtime-error.r00</span>\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\" style=\"text-align:center;\">2020</td><td><span>77th Golden Globe Awards</span></td><td><span>Best Actor – Television Series Drama</span></td><td>Rami Malek</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>70th ACE Eddie Awards</span></td><td><span>Best Edited Drama Series for Commercial Television</span></td><td>Rosanne Tan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"1\"><span class=\"mw-redirect\">72nd Writers Guild of America Awards</span></td><td><span>Best Episodic Drama</span></td><td rowspan=\"1\">Sam Esmail for \"<span>407 Proxy Authentication Required</span>\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"1\"></td></tr><tr><td rowspan=\"1\"><span>72nd Primetime Emmy Awards</span></td><td rowspan=\"1\"><span>Outstanding Interactive Extension of a Linear Program</span></td><td rowspan=\"1\"><i>Season_4.0 ARG</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\"></td></tr><tr><td rowspan=\"1\" style=\"text-align:center;\">2021</td><td rowspan=\"1\"><span>71st ACE Eddie Awards</span></td><td rowspan=\"1\">Best Edited One Hour Series for Commercial Television</td><td rowspan=\"1\">Rosanne Tan for \"<span>405 Method Not Allowed</span>\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"1\"></td></tr></tbody></table><h4>Critics' top ten lists</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th style=\"width:14em; background:#C4C3D0; text-align:left\">2015</th></tr><tr><td colspan=\"2\"><ul><li>No. 1 <i><span>Entertainment Weekly</span></i></li><li>No. 1 <i><span class=\"mw-redirect\">Complex</span></i></li><li>No. 1 <i><span>Rolling Stone</span></i></li><li>No. 1 <i>TV Fanatic</i></li><li>No. 1 <i><span>TV Guide</span></i></li><li>No. 1 <i><span>NPR</span></i></li><li>No. 2 <i><span>IGN</span></i></li><li>No. 2 <i><span class=\"mw-redirect\">TV Insider</span></i></li><li>No. 5 <i><span>Time</span></i></li><li>No. 5 <i><span>TV.com</span></i></li><li>No. 6 <i><span>Business Insider</span></i></li><li>No. 6 <i><span>The Hollywood Reporter</span></i></li><li>No. 6 <i><span>New York Post</span></i></li><li>No. 7 <i><span>Adweek</span></i></li><li>No. 7 <i><span>Uproxx</span></i></li><li>No. 8 <i><span>TheWrap</span></i></li><li>No. 10 <i><span>USA Today</span></i></li><li> — <i><span class=\"mw-redirect\">The Atlantic</span></i></li><li> — <i><span>Associated Press</span></i></li><li> — <i><span>Maxim</span></i></li><li> — <i><span>Variety</span></i></li><li> — <i><span>Vanity Fair</span></i></li><li> — <i><span>Vogue</span></i></li><li> — <i><span>Wired</span></i></li></ul></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th style=\"width:14em; background:#C4C3D0; text-align:left\">2016</th></tr><tr><td colspan=\"2\"><ul><li>No. 3 <i>Hidden Remote</i></li><li>No. 5 <i><span class=\"mw-redirect\">Complex</span></i></li><li>No. 6 <i><span>Tulsa World</span></i></li><li>No. 10 <i><span>IndieWire</span></i></li><li> — <i><span>Newsweek</span></i></li></ul></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th style=\"width:14em; background:#C4C3D0; text-align:left\">2017</th></tr><tr><td colspan=\"2\"><ul><li>No. 3 <i><span class=\"mw-redirect\">Complex</span></i></li><li>No. 10 <i><span>Entertainment Weekly</span></i></li><li>No. 10 <i>PopCulture.com</i></li><li> — <i><span>Vox</span></i></li></ul></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th style=\"width:14em; background:#C4C3D0; text-align:left\">2019</th></tr><tr><td colspan=\"2\"><ul><li>No. 3 <i><span class=\"mw-redirect\">Complex</span></i></li><li>No. 6 <i><span>Gothamist</span></i></li><li>No. 7 <i><span>The New York Times</span></i></li><li>No. 9 <i><span>Vox</span></i></li><li>No. 10 <i><span>Little White Lies</span></i></li><li> — <i><span>The A.V. Club</span></i></li></ul></td></tr></tbody></table><br/><h3>In other media</h3><p>Mr. Robot has spawned a variety of video games. Its mobile game, titled: Mr. Robot:1.51exfiltrati0n.apk (for Android) and Mr. Robot:1.51exfiltrati0n.ipa (for iOS) are set during the first season of the series and was published by Telltale Games. Users play as a fictional character who has stumbled upon the phone of an important member of fsociety and takes it upon themselves to assist them in bringing down E Corp. The Mr. Robot Virtual Reality Experience, written and directed by Sam Esmail, is a 13-minute video viewable using virtual reality headsets that explores Elliot's past. Mr. Robot also features several Easter eggs, including websites related to the show or IP addresses used within the series that redirect to real websites.</p><p>A book tie-in, Mr. Robot: Red Wheelbarrow (eps1.91_redwheelbarr0w.txt) written by Esmail and Courtney Looney, was released on November 1, 2016.</p><br/><h3>Release</h3><h4>Broadcast</h4><p>Mr. Robot premiered in the United States on USA Network on June 24, 2015, and in Canada on Showcase on September 4, 2015. Amazon.com secured international broadcasting rights in the United Kingdom, with the first season added on Amazon Prime on October 16, 2015, and second-season episodes to be released immediately after initial broadcast in the United States. In Australia, the series premiered on Presto on August 14, 2015. After Presto shut down, the series moved to Fox Showcase for its third season and to Foxtel On Demand for the fourth season. The show aired in the Republic of Ireland on TG4.</p><h4>Home media</h4><p>Universal Pictures Home Entertainment released all four seasons on DVD and Blu-ray. The first season was released on January 12, 2016. It contains all 10 episodes, plus deleted scenes, gag reel, making-of featurette, and UltraViolet digital copies of the episodes. The second season was released on January 10, 2017. The third season was released on March 27, 2018 in the United States. The fourth season as well as a complete series collection was released on March 31, 2020.</p><p>In September 2015, Amazon.com acquired exclusive streaming VOD rights to Mr. Robot in several countries. The first season became available to stream in June 2016 for U.S. Amazon Prime subscribers.</p><br/>"
  },
  "errorMessage": ""
}