{
  "imDbId": "tt4834232",
  "title": "Critical Role",
  "fullTitle": "Critical Role (TV Series 2015– )",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "dmnqwk",
      "userUrl": "https://www.imdb.com/user/ur5703201",
      "reviewLink": "https://www.imdb.com/review/rw3337841",
      "warningSpoilers": false,
      "date": "18 October 2015",
      "rate": "8",
      "helpful": "32 out of 40 found this helpful.",
      "title": "An excellent display of storytelling.",
      "content": "Critical Role is an excellent display of just how much fun you can have playing the classic 'pen and paper' game of Dungeons and Dragons. Bringing the old radio plays from the 20s into a modern day setting (the internet) these highly talented voice actors all inject fun, enthusiasm and entertainment into their characters.Matthew Mercer (Halo 4, Diablo 3) takes on the role of the Game Master, the person responsible for maintaining the story, who guides the players through their journey in a world of his creation. Every shopkeeper, tavern owner and wandering monster is brought to life by his quirky and intelligent style.On occasion the story can wane due to the size of the party and due to the budgets available to web shows the sound quality will sometimes go awry I was unable to rate it as a 10, but the quality of voice acting involved will rival any movie, TV show or video game. If you love playing the game itself or want to pick up some helpful tips this show is not something you can afford to miss."
    },
    {
      "username": "casey-468-959961",
      "userUrl": "https://www.imdb.com/user/ur36181430",
      "reviewLink": "https://www.imdb.com/review/rw3290162",
      "warningSpoilers": false,
      "date": "24 July 2015",
      "rate": "10",
      "helpful": "83 out of 93 found this helpful.",
      "title": "The most epic show of epicness to ever exist!",
      "content": "9 voice actors get together and play Dungeons and Dragons, live, for our entertainment. The voice acting experience of everyone involved is outstanding and they have played these character for the better part of 2 years and so they are truly emotional when one of their party is on the brink of death; REAL TEARS PEOPLE! If you're a fan of fantasy and great story telling, if you were ever embarrassed by your basement hobby, if you wanted to learn about table top role playing, but, didn't know where to go, I highly recommend Geek & Sundry's Critical Role. I laugh, I cry, I RAGE! But, mostly, I love, love, love Critical Role. By far the most genuine and entertaining show out there at the moment.#Critter4Life10/10 all the feels."
    },
    {
      "username": "nmcgehee-788-723657",
      "userUrl": "https://www.imdb.com/user/ur46532358",
      "reviewLink": "https://www.imdb.com/review/rw3733581",
      "warningSpoilers": false,
      "date": "18 June 2017",
      "rate": "10",
      "helpful": "27 out of 31 found this helpful.",
      "title": "Better than most television",
      "content": "This show is a joy to watch. All of the actors truly care about their characters and the narrative. The unscripted, improvised actions of the players adds to the unpredictable and engaging story that Matt Mercer sets up.Watching Critical Role will enrich your life."
    },
    {
      "username": "philliphopp",
      "userUrl": "https://www.imdb.com/user/ur67283086",
      "reviewLink": "https://www.imdb.com/review/rw3472348",
      "warningSpoilers": false,
      "date": "18 May 2016",
      "rate": "10",
      "helpful": "33 out of 39 found this helpful.",
      "title": "The most seamless blend between comedy, action, and drama I've ever seen.",
      "content": "I stumbled upon this web series quite early in its airing. It mainly caught my interest because of the cast. Nine voice actors in total, some of which you never knew you knew, make up this extremely well rounded and semi-professional improvisational group of adventurers. Developing a human being is no easy feat, and to make each and every character as unique as they are, it's astounding. With the cherry on top that is their years of experience in voice acting, it is a joy to listen to them all whenever they speak. Now what got me to stay was the absurdly well spun story, custom built by the dungeon master. The writing of this loose script is pulled off amazingly, and the only thing that would make it better is to have an actual cast behind the creator to voice each character. Don't get me wrong, he does do a fantastic job with each one, breathing life into every being in his world. From the characters born from both the players and the DM, comes the gut busting, tear jerking, most jaw dropping story that I have ever had the pleasure to witness unfold before me. As of writing this review today on the Thursday of May 19, 2016, I await the impending exhilaration of watching the newest episode, number 54. To all of those reading this, I have one question for you. Is it Thursday yet?"
    },
    {
      "username": "jessi-dawn0513",
      "userUrl": "https://www.imdb.com/user/ur29781634",
      "reviewLink": "https://www.imdb.com/review/rw3459662",
      "warningSpoilers": false,
      "date": "21 April 2016",
      "rate": "10",
      "helpful": "28 out of 35 found this helpful.",
      "title": "Fantastically amazingly awesomely perfect",
      "content": "This is easily the best visual experience of my life. The connection the community feels to each other, to the people in the show, and to the game itself is incredible and I've been hooked -- nearly obsessed -- since the first half hour I saw. The experience is one that will resonate with you throughout your life and I sincerely hope this group continues in one form or another for decades to come.This is the first and only time I've been tempted to send something to the actors, and even with only a fan letter I am waiting on pins and needles to know if they even got the letter.Less than three you guys!P.S. Includes more than a bit of swearing, some inappropriate humor and lots and lots of nerdiness."
    },
    {
      "username": "LayllasLocker",
      "userUrl": "https://www.imdb.com/user/ur27302507",
      "reviewLink": "https://www.imdb.com/review/rw4642245",
      "warningSpoilers": false,
      "date": "12 February 2019",
      "rate": "10",
      "helpful": "10 out of 15 found this helpful.",
      "title": "Long road ahead and I LOVE IT",
      "content": "I just started with Season 1 - ep 1! These ppl are magical! ♥ Finally found perfect background while sculpting."
    },
    {
      "username": "toothy-tottan",
      "userUrl": "https://www.imdb.com/user/ur48547409",
      "reviewLink": "https://www.imdb.com/review/rw3325215",
      "warningSpoilers": false,
      "date": "23 September 2015",
      "rate": "10",
      "helpful": "33 out of 42 found this helpful.",
      "title": "Is it Thursday yet?",
      "content": "One of the many things you must see before you die. Preferably Live. Do you like D&D look no further. In the vision of Matthew Mercer we follow our heroes in the quest of entertaining us. The gang of Vox Machina: The accountant Vex cries when the gang spend to much money. Her twin brother Vax is the sneaky backstabbing kind. Grog is the fierce Goliath with an heart of gold. Pike is the true-believer of the gang and she is also paladin with a strong healing touch. Percy is the tinker of the gang creating deadly things of use. Scanlan is the gigolo and bard and the gangs jester. Keyleth the Elven Druid of many shapes and she got a wonderful laugh. Tiberius the Sorcerer he is from Draconia.Critter and Vox Machina Fan for life.The toothy swede."
    },
    {
      "username": "andrea-552",
      "userUrl": "https://www.imdb.com/user/ur16825505",
      "reviewLink": "https://www.imdb.com/review/rw3733230",
      "warningSpoilers": false,
      "date": "18 June 2017",
      "rate": "10",
      "helpful": "21 out of 27 found this helpful.",
      "title": "Engaging character-driven show of truly epic proportions",
      "content": "Critical Role is a surprisingly engaging show, told through constant improvisation performed by some of the hardest hitters in the Voice Acting business, through the game \"Dungeons and Dragons\" lead by Matthew Mercer. Critical Role takes place in the high fantasy world of Exandria, and centers around the group of adventurers called Vox Machina. Vox Machina consists of Goliath barbarian Grog (Travis Willingham), human gunslinger Percival (Taliesin Jaffe), Dragonborn Sorcerer Tiberius (Orion Acaba), half-elf druid Keyleth (Marisha Ray), gnome cleric Pike (Ashley Johnson), gnome bard Scanlan (Sam Riegel) and the half-elven twins, the ranger Vex'ahlia (Laura Bailey) and her brother, the rogue Vax'ildan (Liam O'Brien). The story starts in-medias-res as the group are entering the dwarven city of Kraghammer. They don't manage to be there long before they start attracting attention and trouble. What makes the show isn't the story itself, which might surprise most who try to watch the show. It's the characters, their inter- personal relationships, struggles, and the impact they have on the world around them that makes the show what it is. Despite having no visuals at all, this show is intensely visual, through the amazingly graphic storytelling of Matthew Mercer. If you possess even a smidgen of ability to imagine, Matthew Mercer handles the rest. He'll paint castles in your mind, after which the remaining cast will fill the castle with life, laughter, and tears of both joy and sorrow. Being that the show is running on 300+ hours, and isn't done yet, with the average episode being 3 hours, I wouldn't recommend it to anyone with a short attention span. But if that isn't an issue, I'd recommend it to anyone who enjoys stories about people. Even if you don't like fantasy, you'll quite quickly discover that the fantasy is just the setting of the story, but that the backbone of Critical Role is the characters. I've seen 300 hours of this show, and I'd happily watch 300 more."
    },
    {
      "username": "danny-93040",
      "userUrl": "https://www.imdb.com/user/ur66312696",
      "reviewLink": "https://www.imdb.com/review/rw3454476",
      "warningSpoilers": false,
      "date": "9 April 2016",
      "rate": "10",
      "helpful": "23 out of 29 found this helpful.",
      "title": "The best and most immersive representation of tabletop gameplay",
      "content": "This is the best televised dungeon and dragons(homebrew/tweaked) series i have ever seen. Rarely ever do i like the position of spectator when people are playing games. But for 48 episodes i've been eagerly longing for the next. The dungeon master Matthew Mercer is a storyteller extraordinaire. All the other characters are of equal importance to the story Matthew develops. Each and every one of the actors adding a unique touch and feel to the campaigns. From serious to in for a good laugh you will be engulfed in an array of creative problem solving. Immersive roleplay and an excellent distribution of heroic moments between characters where all actors respect their assisting role at the right time allowing for each character to shine.Thank you so much critical role crew for giving me such a lovely experience on a weekly basis. P.s. Please air the rebroadcast on a Sunday! It's too hard for this European to wait until Monday to see the episodes and impossible to break my day rhythm to see it at midnight."
    },
    {
      "username": "jamie_brandon",
      "userUrl": "https://www.imdb.com/user/ur77504150",
      "reviewLink": "https://www.imdb.com/review/rw3733932",
      "warningSpoilers": false,
      "date": "19 June 2017",
      "rate": "10",
      "helpful": "27 out of 33 found this helpful.",
      "title": "Greatest internet show of all time",
      "content": "This show is epic, the story telling is top notch. And the real emotions of these voice actors as they are truly connected to their characters is unbelievable! Matthew Mercer is a world creating genius and just waiting for Thursday proper to roll around so that I can watch is almost torture. This is by far my favorite streaming show of all time."
    },
    {
      "username": "chessworth",
      "userUrl": "https://www.imdb.com/user/ur113113689",
      "reviewLink": "https://www.imdb.com/review/rw7120846",
      "warningSpoilers": false,
      "date": "14 July 2021",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "One of the best storytelling shows",
      "content": "Amazing show, where a bunch of amazing voice actors and great people get together to play dungeons and dragons with the spirit of storytelling."
    },
    {
      "username": "will_lambert",
      "userUrl": "https://www.imdb.com/user/ur61131412",
      "reviewLink": "https://www.imdb.com/review/rw6731958",
      "warningSpoilers": false,
      "date": "22 March 2021",
      "rate": "9",
      "helpful": "3 out of 4 found this helpful.",
      "title": "Great D&D played on your TV",
      "content": "So great to finally see a D&D show. I'm a little late to the Critical Role party and didn't expect to be entertained has much as this show does. I was always an old school 'Theatre of the mind' roleplayer, and the show doesn't disappoint, with brilliant characterisation from the players and DM"
    },
    {
      "username": "Jaredcollins2",
      "userUrl": "https://www.imdb.com/user/ur26288805",
      "reviewLink": "https://www.imdb.com/review/rw4248225",
      "warningSpoilers": false,
      "date": "22 July 2018",
      "rate": "10",
      "helpful": "4 out of 7 found this helpful.",
      "title": "I love this show.",
      "content": "An immersive, hilarious, exciting, fun, must-watch show. I'll admit, it's not going to be for everyone. But, those that don't like it, might not have a pulse!"
    },
    {
      "username": "carlinhosmarcelo",
      "userUrl": "https://www.imdb.com/user/ur77512215",
      "reviewLink": "https://www.imdb.com/review/rw3734176",
      "warningSpoilers": false,
      "date": "19 June 2017",
      "rate": "10",
      "helpful": "14 out of 18 found this helpful.",
      "title": "it, is. awesome.",
      "content": "Honestly, I never thought I would like this show. As a D&D player (and DM) myself, I've always thought that watching someone play without playing yourself to be extremely boring. 54 episodes later, I have to say: that was not the case with Critical Role.How can watching 8 people talk and roll dice make you laugh or cry?I've found that listening to Matt's descriptions would paint a picture before my eyes. It was just like watching a movie, only way better. Because fails are awesome too here. Characters are not always ready or prepared, they sometimes don't really know what to say. And that makes them more real. Through the players' voices, I can hear their characters. I've come to the point where i really believe that Ashley and Sam are gnomes, and Travis is a Goliath.This show made me want to be a better DM, and a better player. Matthew, I one day will be as prepared as you are! I know the chances of the cast ever reading this, but if any of you ever do, thank you for letting me watch and have fun with you."
    },
    {
      "username": "redtailfoxx",
      "userUrl": "https://www.imdb.com/user/ur103015848",
      "reviewLink": "https://www.imdb.com/review/rw4856176",
      "warningSpoilers": false,
      "date": "15 May 2019",
      "rate": "10",
      "helpful": "5 out of 8 found this helpful.",
      "title": "Wonderful and engaging program",
      "content": "I don't always get to watch it live, but I always watch it. The whole cast is a delight to watch. Matt Mercer is a great storyteller & hardly ever stumbles on his path, even when the rest of the cast derails entire plotlines. If you love a good story, that you've never heard before, watch Critical Role."
    },
    {
      "username": "abele-emily",
      "userUrl": "https://www.imdb.com/user/ur25918595",
      "reviewLink": "https://www.imdb.com/review/rw4857324",
      "warningSpoilers": false,
      "date": "16 May 2019",
      "rate": "10",
      "helpful": "4 out of 8 found this helpful.",
      "title": "This is the greatest show of all time.",
      "content": "Critical Role has gotten me through some tough times; when I worked overnights or 100 hour weeks, I had a journey to follow and something to keep me going. These nerdy-ass voice actors having fun, being friends, and living a story made me feel less alone, like I could make it if I just kept listening because there was another episode waiting for me. I worked my way through the entire back catalogue all the way until the start of campaign 2.Now I get to eagerly await each new episode and experience a whole new adventure."
    },
    {
      "username": "graberr",
      "userUrl": "https://www.imdb.com/user/ur40180934",
      "reviewLink": "https://www.imdb.com/review/rw5743815",
      "warningSpoilers": false,
      "date": "16 May 2020",
      "rate": "10",
      "helpful": "3 out of 6 found this helpful.",
      "title": "No Screen or special effects needed for an amazing story",
      "content": "Matthew Mercer is the most imaginative and immersive story teller I've ever seen it blows me away that he creates and brings to life so many characters and an entire world with his incredible voices and tone. He inspired me to play DnD. Laura, Travis, Talesin, Sam, Liam, Ashley, and Marisha are amazing and immersive voice actors that really adopt their character as their own, sinking real emotions into it all. It's all real on the spot acting and it comes to life so well when you really sit down and watch them. I highly recommend it for anyone that likes the fantasy genre, tons of absolutely amazing content"
    },
    {
      "username": "catarina159",
      "userUrl": "https://www.imdb.com/user/ur58008094",
      "reviewLink": "https://www.imdb.com/review/rw4858103",
      "warningSpoilers": false,
      "date": "16 May 2019",
      "rate": "10",
      "helpful": "4 out of 8 found this helpful.",
      "title": "bless",
      "content": "This show made me gay 10/10 would watch again im reviewing this becase i love it a bunch"
    },
    {
      "username": "silentpoet-90647",
      "userUrl": "https://www.imdb.com/user/ur70073060",
      "reviewLink": "https://www.imdb.com/review/rw4854185",
      "warningSpoilers": false,
      "date": "15 May 2019",
      "rate": "10",
      "helpful": "4 out of 8 found this helpful.",
      "title": "Everything and more",
      "content": "This show has brought my imagination alive in ways no other show has. It's provided me with a community previously unknown. These actors are the best around, bringing to life characters with only descriptions and their voices. 10/10"
    },
    {
      "username": "Chrisiant",
      "userUrl": "https://www.imdb.com/user/ur14936551",
      "reviewLink": "https://www.imdb.com/review/rw4773821",
      "warningSpoilers": false,
      "date": "11 April 2019",
      "rate": "10",
      "helpful": "5 out of 8 found this helpful.",
      "title": "Storytelling Goals",
      "content": "This show is what storytelling should be. Each of them has made me laugh and cry. Matt Mercer's skill and meticulous care makes his world immersive and beautiful and genuine."
    },
    {
      "username": "gazzalodi",
      "userUrl": "https://www.imdb.com/user/ur17641996",
      "reviewLink": "https://www.imdb.com/review/rw7197075",
      "warningSpoilers": false,
      "date": "5 August 2021",
      "rate": "6",
      "helpful": "13 out of 58 found this helpful.",
      "title": "Entertaining for what it is. A great ad for D&D.",
      "content": "Six stars isn't a bad review, it's actually a raving positive review because most D&D streams are 2 star at the best.Yes Matt Mercer is an awesome DM, though egregiously gentle. Six plus years of this show and 0 tpks and only one DM PC kill? Not realistic.Yes it sucks that most new DMs now try to be Matt Mercer clones not realizing this guy has decades of practice. But hey, there are NEW DMs now because of him. So good on him for that.The show is very entertaining. The most watchable D&D show being streamed. Is it 'scripted'? Yes, mostly. The outcomes are predetermined (they have let that slip numerous times). They have to be given the guests who show up and how many things end on point to make the next plot narrative thread work. But that's okay because if you watch the online play streams, not scripting the narrative arc can really bog down a stream as a DM tries to cover for the fact that he wasn't expecting the party to go all murder hobo and set themselves up as feudal lords of the gnomish fishing village they were only supposed to spend a day in. Fun for players, but boring to watch. That said I do think the moment by moment interactions are improvised.Yes, some of the players are long winded emo edgelords. If you don't like those scenes skip the 20 minute angst-fests and fast forward back to the narrative, you aren't missing anything. If you like emo edgelord roleplay, then enjoy.Yes there is a ton of virtue signaling (but seriously, not as much at the game producer, WotC, does) and yes one of the characters spews their RL political views through their character enough to catch a lot of nerdrage. So what? In the six years of the show that character's annoyingly uneducated (they obviously don't realize one of the parent companies they shill for got busted using slave labor in China) political rants make up about ten minutes.Yes the shows fans are legendarily thin skinned and have toxic reactions to any criticism of the show or characters. Look at all the downvotes for anything that isn't a 10 star review here. But unless you leave a comment that isn't absolutely glowing in a forum/youtube comments section about the show you can easily avoid the \"leave Britney alone\" types that make up a majority of the show's fan base.Final conclusion. Worth watching if you are curious about D&D or want to a D&D fix between your own sessions, just avoid interacting with their fans. Not worth watching if you are wanting to know the hard mechanics of how a D&D session actually work or want instruction on being a DM. Matt Mercer and other, even better, DMs have a bunch of separate series of DM'ing tips on Youtube for that."
    },
    {
      "username": "culegurrl",
      "userUrl": "https://www.imdb.com/user/ur102984579",
      "reviewLink": "https://www.imdb.com/review/rw4854388",
      "warningSpoilers": false,
      "date": "15 May 2019",
      "rate": "10",
      "helpful": "3 out of 6 found this helpful.",
      "title": "Wonderful show with wonderful people",
      "content": "Critical Role features wonderful characters, storylines, and the cast are amazing people whom we do not deserve. Upon getting sucked into this extensive show, you will find yourself crying and laughing uncontrollably along with the crew. Though the show is imaginary, the connections forged and created feel real thanks to the extremely talented acting cast. You'll find yourself waiting eagerly for Thursday around 7pm Pacific Time. The four hour long episodes seem daunting at first, but once the ball begins rolling you'll be begging for more. These people are so positive and the community is welcoming and the most friendly of fandoms I've had experience with. Anybody with a love of this show will be right at home with us."
    },
    {
      "username": "ansemsdaughter",
      "userUrl": "https://www.imdb.com/user/ur103061686",
      "reviewLink": "https://www.imdb.com/review/rw4859305",
      "warningSpoilers": false,
      "date": "17 May 2019",
      "rate": "10",
      "helpful": "4 out of 7 found this helpful.",
      "title": "Wonderful show!",
      "content": "Creative, funny, heartwarming, and heartbreaking! This show has it all! Matt is an amazing DM and the rest of the cast are absolutely brilliant!"
    },
    {
      "username": "bu_mac",
      "userUrl": "https://www.imdb.com/user/ur77470569",
      "reviewLink": "https://www.imdb.com/review/rw5349032",
      "warningSpoilers": false,
      "date": "24 December 2019",
      "rate": "10",
      "helpful": "2 out of 5 found this helpful.",
      "title": "They're the gold standard for a reason.",
      "content": "When you have a group mostly comprised of professional actors (and friends) who sit down to tell a communal story it's either going to go down in flames, or soar.Critical Role soars.The storylines are generally compelling, the actors/players create interesting characters (even the ones that are irritating). The gameplay is generally a second seat to story so it's rarely a slog (combat being the one time it gets bogged down). Broadly speaking the acting is great (some guests...not so much) and they stick to their characters for the most part. I have tried to watch other RPG based shows and for me (a personal taste thing) I just cant stand the ones where people make the same tired jokes because someone's name sounds like a body part over and over...I don't want to watch other people play DnD. I want to watch other people craft a story, and this is what Critical Role excels at.I understand that there are certain cast members who rub folks the wrong way, and in fairness I get rubbed the wrong way by some cast members at times too, but I also get what they're doing... from a marketing perspective you have to look at your audience and see who is watching you...with a cast of 7 + guests theres a very wide range of personality types to pick from and represent...and they do that pretty well. The issue that arises is that there's also a range of talent on the cast so it is more obvious when someone who would be great at a normal table is trying to keep up with more talented peers...this creates a jarring effect of breaking immersion when its Character A and Character B talking then PLAYER C trying to join the scene. Pair that with some occasional timing issues (they're actors...they seem to like the spotlight and aren't always good at letting a scene sit when they see .moment to get attention) and it becomes a recipe for \"so and so sucks!\" They don't. There are just a number of factors involved...including picking character traits that are generally irritating in real life, acting skill compared to scene mates, timing, improv abilities etc which makes it seem like a given person in a given scene sucks.That was a long way of saying: Even the stuff I don't like about it is either done well or I get it from a marketing and a human standpoint and can overlook the few irritating elements as the whole of the show is great entertainment.I will say that I find the second campaign a little less compelling than the first. I'm not quite sure why this is other than I don't think I like the characters as a whole as much as I did in the first campaign. At the time of this writing I feel enough time has passed for the players to have folded into the characters so it might just be that they don't resonate with me as much as the first season's characters did. The world is still interesting, the NPCs are great etc...not totally sure what it is.I did notice that I find the cast themselves to be a little overly woke and hyper \"humble\" for my tastes, it comes across (to me) as disingenuous on both fronts. Like they're playing to expectations rather than letting just being the decent human beings that they are speak for their beliefs. It seems like they feel the need to go over the top with it to make sure people know their stance...or maybe it's that they don't see enough of it and are trying to make up for everyone else? Not really sure. Also, you're successful as hell, just own it at this point...the false modesty (or apparent false modesty) is off putting. Both elements are only mildly irritating though I admit I have to take a break from the show every time they cower away from negative commentary (after the whole Wendy's fiasco I stopped watching for a month because I lost a ton of respect for the whole team when they bowed to the people whining about it...to be honest, I almost stopped watching entirely, I came back because I got annoyed at myself for almost letting keyboard \"warriors\" allow me to give up something I enjoyed). No one will be happy with you 100% of the time and naysayers are always the loudest...that doesn't mean that they are right.Anyhow. I was apparently more irritated by some of those minor elements than I thought. I enjoy the show, I think it's worth 10 stars even with my minor gripes (as I say, you can't make everyone happy all of the time) and I'm glad to see nerd culture making it's way into the mainstream and I feel that Critical Role is leading the charge for table top gaming...and for that I am thankful.If you're considering getting into the show I'd start with the current campaign in spite of my earlier statements. There's something like 400 hours of campaign 1 to get through...you'll never catch up :)"
    },
    {
      "username": "Tessa_cowan",
      "userUrl": "https://www.imdb.com/user/ur18819388",
      "reviewLink": "https://www.imdb.com/review/rw4855552",
      "warningSpoilers": false,
      "date": "15 May 2019",
      "rate": "10",
      "helpful": "2 out of 5 found this helpful.",
      "title": "Best show ever",
      "content": "Amazing actors, quick witted improvisation and DND. Best combination."
    }
  ],
  "errorMessage": ""
}