{
  "imDbId": "tt4834232",
  "title": "Critical Role",
  "fullTitle": "Critical Role (TV Series 2015– )",
  "type": "TVSeries",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "Critical Role",
  "url": "https://en.wikipedia.org/wiki/Critical_Role",
  "plotShort": {
    "plainText": "Critical Role is an American web series in which a group of professional voice actors plays Dungeons & Dragons. The show started streaming partway through the cast's first campaign in March 2015. Campaign one ended in October 2017 after 115 episodes, and campaign two started in January 2018 and ended in June 2021 after 141 episodes. A number of one-shots were aired in the hiatus between the two campaigns. After campaign two was completed, the spin-off limited series Exandria Unlimited aired from June 2021 to August 2021. The third campaign premiered on October 21, 2021.\r\nThe series is broadcast on Thursdays at 19:00 PT on the Critical Role Twitch and YouTube channels, with the video on demand (VOD) becoming available to Twitch subscribers immediately after the broadcast. The VODs are made available for the public on Critical Role's website and uploaded to their YouTube channel on the Monday after the live stream. Prior to the COVID-19 pandemic, the show had broadcast live, but has been pre-recorded since its return for episode 100 of Campaign Two.\r\nThe cast own the intellectual property from the show, and the show also lends its name to the studio owned by the cast—Critical Role Productions. The studio has produced Critical Role since 2018. A number of licensed works based on the show have been released, such as several comic books and two official campaign setting guides. The Legend of Vox Machina, the animated series based on the first campaign of Critical Role, premiered on January 28, 2022. Mighty Nein, an upcoming animated series based on the second campaign, was announced in January 2023.",
    "html": "<p>Critical Role is an American web series in which a group of professional voice actors plays Dungeons & Dragons. The show started streaming partway through the cast's first campaign in March 2015. Campaign one ended in October 2017 after 115 episodes, and campaign two started in January 2018 and ended in June 2021 after 141 episodes. A number of one-shots were aired in the hiatus between the two campaigns. After campaign two was completed, the spin-off limited series Exandria Unlimited aired from June 2021 to August 2021. The third campaign premiered on October 21, 2021.</p><p>The series is broadcast on Thursdays at 19:00 PT on the Critical Role Twitch and YouTube channels, with the video on demand (VOD) becoming available to Twitch subscribers immediately after the broadcast. The VODs are made available for the public on Critical Role's website and uploaded to their YouTube channel on the Monday after the live stream. Prior to the COVID-19 pandemic, the show had broadcast live, but has been pre-recorded since its return for episode 100 of Campaign Two.</p><p>The cast own the intellectual property from the show, and the show also lends its name to the studio owned by the cast—Critical Role Productions. The studio has produced Critical Role since 2018. A number of licensed works based on the show have been released, such as several comic books and two official campaign setting guides. The Legend of Vox Machina, the animated series based on the first campaign of Critical Role, premiered on January 28, 2022. Mighty Nein, an upcoming animated series based on the second campaign, was announced in January 2023.</p>"
  },
  "plotFull": {
    "plainText": "Critical Role is an American web series in which a group of professional voice actors plays Dungeons & Dragons. The show started streaming partway through the cast's first campaign in March 2015. Campaign one ended in October 2017 after 115 episodes, and campaign two started in January 2018 and ended in June 2021 after 141 episodes. A number of one-shots were aired in the hiatus between the two campaigns. After campaign two was completed, the spin-off limited series Exandria Unlimited aired from June 2021 to August 2021. The third campaign premiered on October 21, 2021.\r\nThe series is broadcast on Thursdays at 19:00 PT on the Critical Role Twitch and YouTube channels, with the video on demand (VOD) becoming available to Twitch subscribers immediately after the broadcast. The VODs are made available for the public on Critical Role's website and uploaded to their YouTube channel on the Monday after the live stream. Prior to the COVID-19 pandemic, the show had broadcast live, but has been pre-recorded since its return for episode 100 of Campaign Two.\r\nThe cast own the intellectual property from the show, and the show also lends its name to the studio owned by the cast—Critical Role Productions. The studio has produced Critical Role since 2018. A number of licensed works based on the show have been released, such as several comic books and two official campaign setting guides. The Legend of Vox Machina, the animated series based on the first campaign of Critical Role, premiered on January 28, 2022. Mighty Nein, an upcoming animated series based on the second campaign, was announced in January 2023.\r\nBackground\r\nCritical Role is a creator-owned streaming show where the cast play an ongoing Dungeons & Dragons campaign, with Matthew Mercer serving as the show's Dungeon Master for the seven other cast members.\r\nThe group's first campaign began two years prior to the start of the series as a one-off, simplified Dungeons & Dragons 4th edition game for Liam O'Brien's birthday. The players enjoyed the game so much that they continued to play it while switching to the Pathfinder ruleset. After Felicia Day heard about the private home game from Ashley Johnson, she approached the group about playing it in a live-streamed format for Geek & Sundry, which hosted the show until February 2019. In order to streamline gameplay for the show, the game's characters were converted from Pathfinder to Dungeons & Dragons 5th edition before the web series began airing on March 12, 2015. There were initially eight cast member players; Orion Acaba left the show after episode 27 of campaign one. His character, Tiberius, appeared in the first seven issues of the prequel comic series Critical Role: Vox Machina Origins.\r\nFans of the show officially dubbed themselves \"Critters\" in 2015 after Liam O'Brien suggested it and the chatbox ran with it.\r\nCritical Role company and studio\r\nThe Critical Role company, Critical Role Productions LLC, was incorporated in 2015. As of 2019, Travis Willingham serves as chief executive officer, Matthew Mercer as chief creative officer, Marisha Ray as creative director, Ed Lopez as chief operating officer, Rachel Romero as senior vice president of marketing, and Ben Van Der Fluit as vice president of business development.\r\nIn June 2018, Critical Role Productions launched its own Twitch and YouTube channels, with cast member Marisha Ray announced as the creative director of the franchise. The company also moved to their own studio space in 2018 and started putting out new shows on their Twitch and YouTube channels. The sets for Critical Role and Talks Machina moved from Legendary Digital Network's studios to Critical Role's own studios in July 2018. In February 2019, Critical Role finalized its split from Geek & Sundry and Legendary Digital Networks, with live broadcasts of the company's shows and VODs airing exclusively on Critical Role's channels. Critical Role also took over production responsibility for Critical Role and Talks Machina after splitting from Legendary Digital Networks. Some \"legacy episodes\" (currently the entirety of Campaign 1, the first 19 episodes of Campaign 2, as well as the corresponding episodes of official discussion show Talks Machina) remain available in Geek & Sundry's archives on YouTube and Twitch, though some older episodes of Critical Role and Talks Machina are being deleted from the Geek and Sundry channels and re-uploaded to the official Critical Role channels since 2019 as part of an ongoing migration of older content to the creator-owned channels.: 0:45\r\nOn March 4, 2019, Critical Role launched a Kickstarter campaign to raise funds for a 22-minute animation called Critical Role: The Legend of Vox Machina Animated Special. The final total raised by the Kickstarter when it closed on April 19, 2019, was $11.3M turning the intended animated special into a ten-episode animated series. When the campaign closed, it was one of the most quickly funded in Kickstarter history, and was the most funded Kickstarter for TV and film projects. In November 2019, Amazon Prime Video announced that they had acquired the streaming rights to The Legend of Vox Machina, and had commissioned 14 additional episodes (two additional episodes for season 1 and a second season of 12 episodes). The project was originally slated for release in late 2020, however in June 2020, it was announced that the debut would be missed due to the COVID-19 pandemic. The Legend of Vox Machina premiered on January 28, 2022.\r\nA leak of Twitch data in October 2021 revealed that Critical Role is among the highest earners on Twitch; the company received a total direct payout of $9,626,712 between September 2019 and September 2021 from Twitch in gross income for subscriptions and ad revenue. BBC News commented that this list of payments is unlikely to \"account for tax paid on income\" and that \"many, if not all, of these top streamers are effectively large-scale media operations, with their own employees and business expenses – so the numbers do not represent 'take-home pay' for those listed\". Business Insider highlighted that \"Critical Role has grown into a full-fledged media company. Its LinkedIn page lists employees in roles including marketing, business development, photography, editing, and even one person responsible for keeping track of the lore, or details in its fantasy world\".\r\nFormat\r\nCritical Role is a mixture of a weekly show and a modern gaming Twitch stream. Each episode usually runs for three to five (in some cases six) hours and is streamed live on Critical Role's Twitch and YouTube channels on almost every Thursday, with possible breaks from the show being announced at least one week prior to the broadcast. The VOD is made available for subscribers of Critical Role's Twitch channel immediately after airing and before being uploaded to Critical Role's YouTube channel the following Monday, where it can be watched for free. Prior to the COVID-19 pandemic, the show had broadcast live, but has been pre-recorded since its return for episode 100 of Campaign Two and will continue to be pre-recorded for Campaign Three. Starting with the third campaign, the main campaign of Critical Role will not air new episodes on the last Thursday of every month; instead, other content by the studio will air in its time slot.\r\nCritical Role has played with a live theater audience nine times. The third campaign's premiere was simulcast live in Cinemark Theatres along with the regular Twitch and YouTube livestream. Similarly, the 17th episode of the third campaign was simulcast in Cinemark Theatres, Landmark Theatres, and Cinépolis alongside the regular livestream as part of their 7th anniversary celebration.\r\nA number of Critical Role's streams have also served as a donation drive to support nonprofit organizations such as St Jude, 826LA, Extra Life, and Doctors Without Borders.\r\nPodcasts\r\nOn the 100th episode of Critical Role, the launch of the Critical Role podcast was announced: an audio version of the game sessions. It is available on iTunes, Spotify, Google Play Music, and at the Geek & Sundry website. The first campaign's podcast episodes were released in batches of 10–15, between June 8, 2017, and January 8, 2018. \"Listened to at 1.5X speed, total listening time of the first campaign would be reduced to a little over 298 hours – at 2X speed, under 224 hours\".: 197 Since the start of the second campaign, the podcast episodes have been released on the following Thursday.\r\nCampaign structure\r\nThe Critical Role storyline occurs in campaigns that consist of a series of story arcs, which are usually played over multiple episodes. Between—or sometimes within—the major story arcs, the characters rest, resupply, or go on side quests. In addition, every player character has a backstory, an unfinished part of their personal history that can be relevant to the campaign from time to time. Sometimes, major story arcs are intrinsically tied to a character's backstory. While each campaign centers on a different party of adventurers, the campaigns are all set on the various continents of Exandria, a world of Mercer's creation. In June 2021, the cast of Critical Role finished their second campaign. Their third campaign premiered on October 21, 2021.\r\nCampaign one\r\nCampaign one takes place primarily in Tal'Dorei, a continent of Exandria. It follows the exploits of an adventuring party known as Vox Machina, previously known as the Super High-Intensity Team (or S.H.I.T.s), a rag-tag group of mercenaries originally formed in the swamp town of Stilben.\r\nPre-series history\r\nThe Vox Machina campaign originated as the home game of the cast, which was played at home from 2012 to 2015. In their adventures prior to the start of the series, the group saved the family of Sovereign Uriel Tal'Dorei III, ruler of Tal'Dorei and its capital city of Emon. In appreciation, Uriel gave the group seats on the city council, and provided them with a residence called Greyskull Keep, which is located just outside the city.\r\nWhile the early adventures were not formally recorded, some shorter recordings have been released by the cast. This includes audio from the first session of the campaign, which was released as a segment in the third episode of the podcast All Work No Play. Additionally, O'Brien released a recording of the magic carpet being discovered by the party. Episode 36, titled Winter's Crest in Whitestone, features a summary of the pre-series history, with artwork created by Wendy Sullivan Green and voice-overs provided by the cast. The comic book, Critical Role: Vox Machina Origins, is an adaptation of the group's game before the show. The animated series adaptation, The Legend of Vox Machina, also adapts a canonic story that takes place within the pre-stream time frame.\r\nOn-stream campaign\r\nThe show begins in medias res with the characters regrouping in the city of Emon after approximately six months apart and the streamed campaign picks up where the cast's original home game left off. The first episode of the show aired on March 12, 2015, and the campaign concluded with its final episode on October 12, 2017. Campaign one was broadcast live on the Geek & Sundry Twitch and YouTube channels between March 12, 2015, and October 12, 2017, for a total of 115 episodes and six story arcs. Starting in November 2016, it was also broadcast live on the Alpha streaming service from Legendary Digital Networks. The show on Alpha had a unique overlay that included \"real-time character sheets, damage and heal animations, and visualizations\".\r\nPost-campaign\r\nIn 2019, over a year after the first campaign ended, Critical Role produced three canonical one-shot games that feature Vox Machina in the time frame after Vecna's banishment. The first one-shot, Vox Machina: The Search for Grog, was played at a live show in Los Angeles on January 19, 2019, then broadcast on Twitch on February 22, 2019, before being released via YouTube and Twitch VOD on February 23, 2019. It explored an event that took place in the final episode of campaign one, but was not played out in detail because it would have disrupted the ongoing epilogue. More Vox Machina one-shots were unlocked as rewards and stretch goals during the Kickstarter campaign for the Critical Role animated series. The first of these was Vox Machina: The Search for Bob, a continuation of the events of The Search for Grog. It aired on the Critical Role Twitch channel on June 21, 2019, with the YouTube VOD being made available on June 23, 2019. Another Kickstarter reward was Vox Machina's Summer Reunion at Dalen's Closet, which aired on Twitch on August 29, 2019, with the YouTube VOD becoming available for the public on September 2, 2019. This one-shot takes place a year after the events of The Search for Grog/Bob, as Percy and Vex renew their wedding vows on a beach in Marquet, with all of their friends and family present—as well as a few uninvited \"guests\".\r\nCritical Role also played another canonical and Vox Machina-related one-shot at a live show in 2019: The Adventures of the Darrington Brigade, which was played at the Bass Concert Hall in Austin, Texas, on November 23, 2019. It stars Sam Riegel as Taryon Darrington, honorary member of Vox Machina, who leads a group of new characters into their own adventures. The story is set roughly a decade after campaign one and a decade before campaign two. It aired on the Critical Role Twitch channel on November 29, 2019, with the YouTube VOD being made available on December 1, 2019.\r\nAfter the animated series, The Legend of Vox Machina, was picked up by Amazon and, according to Variety, \"Prime Video ordered an additional 14 episodes, for a total of 24 episodes across two seasons\". Critical Role announced that the animated show would adapt the full Briarwood arc along with other storylines from campaign one.\r\nCampaign two\r\nThe second campaign began on January 11, 2018, and follows the adventuring party known as The Mighty Nein. The story is set on the continent of Wildemount, which was briefly visited during the Vox Machina campaign. The Mighty Nein campaign is set about 20 years after Vox Machina's final battle against Vecna and takes place in a time where tensions between two of Wildemount's mightiest nations are very high. A hiatus due to concerns around the COVID-19 pandemic was in effect from March to July 2020, after which the show returned in a non-live format adjusted for social distancing. In May 2021, the cast announced that campaign two would end shortly; however, \"the Mighty Nein's story wasn't finished\". The finale aired on June 3, 2021; it was the longest episode at just over seven hours.\r\nPost-campaign\r\nIn October 2022, Critical Role announced an upcoming two-part special titled The Mighty Nein Reunited. The canonical story picks up several months after the conclusion of the second campaign with the cast reprising their roles. Part 1 aired on November 17, 2022 with Part 2 airing on December 1, 2022. In addition to being streamed on Twitch and YouTube, The Mighty Nein Reunited was simulcast in Cinemark Theatres in both the United States and South America.\r\nIn January 2023, it was announced that the campaign will receive an animated television adaptation titled Mighty Nein. The series will be executive produced by Tasha Huo, Sam Riegel, Travis Willingham, Chris Prynoski, Shannon Prynoski, Antonio Canobbio and Ben Kalina; Metapigeon, Amazon Studios, and Titmouse will also executive produce.\r\nCampaign three\r\nThe third campaign premiered on October 21, 2021. The story takes place after the events of the second campaign and Exandria Unlimited; it is set on the continent of Marquet, which was briefly visited during the Vox Machina campaign. Multiple characters in this campaign are returning characters. Dorian, Orym, and Fearne premiered in Exandria Unlimited while Bertrand premiered in the one-shot \"Search For Grog\".\r\nAnthology and limited series\r\nExandria Unlimited\r\nExandria Unlimited (ExU) is an anthology series which premiered on June 24, 2021, and is a spin-off of the main Critical Role series. IGN reported, in June 2021, that \"Exandria Unlimited will be considered canon within the wider Critical Role story, and 'will affect future environments and timelines across the overall lore of Critical Role.' So as fans await what may come from Campaign 3 of the core CR cast, Unlimited looks to offer a new vantage point into the world of Exandria\".\r\nThe first season is set in the city of Emon on the continent of Tal'Dorei 30 years after Campaign One and 10 years after Campaign Two. It features Aabria Iyengar (known for other streaming shows such as Happy Jacks RPG, Dimension 20, and Saving Throw) as the game master and stars Aimee Carrero, Robbie Daymond, Johnson, O'Brien, and Mercer as players. Daymond, Mercer, Carrero, and Iyengar reprised their roles for Exandria Unlimited: Kymal, a two-part adventure continuation of the first season which premiered in March 2022. Anjali Bhimani, reprising her previous ExU guest star, and Erica Lindbeck also joined the cast.\r\nThe second season, titled Exandria Unlimited: Calamity, is set in the Age of Arcanum – almost 1,000 years before the Critical Role series. It was broadcast from May 26 to June 16, 2022. It features Brennan Lee Mulligan as the Dungeon Master and stars Iyengar, Ray, Riegel, Willingham as players along with newcomers Lou Wilson and Luis Carazo.\r\nOne-shots\r\nInstead of an episode in the main storyline, the series occasionally features a one-shot game—a self-contained story that can be told within the time constraints of one episode (or three to four hours of gameplay). A one-shot could be described as the RPG equivalent to a short story. Some of the Critical Role one-shots are canonical parts of the storylines that play out in one of the campaigns, covering events that occur outside the time frame of the respective campaign, but still feature some of the campaign's main characters. Other one-shots only have a tangential relationship to the campaigns, as they are set in the world of Exandria, but feature a different cast of characters, often in smaller scale adventures that may or may not be canon. There are also one-shots that have no connection with the campaigns or the world of Exandria at all.\r\nNot all Critical Role one-shots use the Dungeons & Dragons game system, as some are based on other RPG systems. In many one-shots, other cast members take over the role of Dungeon Master or game master (GM) from Mercer. The show aired several one-shots in the hiatus between campaign one and campaign two.\r\nSome of Critical Role's one shots have been sponsored. One-shot sponsors have included Warner Bros. Interactive Entertainment, Blizzard Entertainment, and Chaosium for running one-shots themed around Middle-earth: Shadow of War, Hearthstone, and Call of Cthulhu respectively.\r\nCast and characters\r\nSince October 2015, Critical Role has consisted of eight main cast members, all of whom are the original cast. The show had a cast of nine for the first 27 episodes. A number of guest players have also appeared on the show over the years.\r\nMain\r\nThe cast and their characters' names, races, and classes for the three campaigns are listed below. For multiclassed characters, the classes are listed in chronological order.\r\nMatthew MercerDungeon Master (Campaigns 1, 2, 3)\r\nDungeon Master (Campaigns 1, 2, 3)\r\nAshley JohnsonPike Trickfoot (gnome cleric) (Campaign 1) Yasha Nydoorin (aasimar barbarian) (Campaign 2) Fearne Calloway (faun druid/rogue) (Campaign 3)\r\nPike Trickfoot (gnome cleric) (Campaign 1)\r\nYasha Nydoorin (aasimar barbarian) (Campaign 2)\r\nFearne Calloway (faun druid/rogue) (Campaign 3)\r\nTravis WillinghamGrog Strongjaw (goliath barbarian/fighter) (Campaign 1) Sir Bertrand Bell (human fighter) (\"The Search for Grog\", Campaign 3, 1-3) Fjord Stone (half-orc warlock/paladin) (Campaign 2) Chetney Pock O'Pea (gnome blood hunter/rogue) (Campaign 3, 7-on)\r\nGrog Strongjaw (goliath barbarian/fighter) (Campaign 1)\r\nSir Bertrand Bell (human fighter) (\"The Search for Grog\", Campaign 3, 1-3)\r\nFjord Stone (half-orc warlock/paladin) (Campaign 2)\r\nChetney Pock O'Pea (gnome blood hunter/rogue) (Campaign 3, 7-on)\r\nLaura BaileyVex'ahlia \"Vex\" de Rolo (née Vessar) (half-elf ranger/rogue) (Campaign 1) Jester Lavorre (tiefling cleric) (Campaign 2) Imogen Temult (human sorcerer) (Campaign 3)\r\nVex'ahlia \"Vex\" de Rolo (née Vessar) (half-elf ranger/rogue) (Campaign 1)\r\nJester Lavorre (tiefling cleric) (Campaign 2)\r\nImogen Temult (human sorcerer) (Campaign 3)\r\nLiam O'BrienVax'ildan \"Vax\" Vessar (half-elf rogue/paladin/druid) (Campaign 1) Lieve'tel Toluse (elf cleric) (\"The Search for Grog\") Derrig (half-elf fighter) (\"Dalen's Closet\") Caleb Widogast/Bren Aldric Ermendrud (human wizard) (Campaign 2) Orym of the Air Ashari (halfling fighter) (Campaign 3)\r\nVax'ildan \"Vax\" Vessar (half-elf rogue/paladin/druid) (Campaign 1)\r\nLieve'tel Toluse (elf cleric) (\"The Search for Grog\")\r\nDerrig (half-elf fighter) (\"Dalen's Closet\")\r\nCaleb Widogast/Bren Aldric Ermendrud (human wizard) (Campaign 2)\r\nOrym of the Air Ashari (halfling fighter) (Campaign 3)\r\nTaliesin JaffePercival \"Percy\" Fredrickstein Von Musel Klossowski de Rolo III (human gunslinger) (Campaign 1) Mollymauk \"Molly\" Tealeaf/Kingsley Tealeaf (tiefling blood hunter) (Campaign 2, 1–26 and 140–141, The Mighty Nein Reunited Parts 1 and 2) Caduceus Clay (firbolg cleric) (Campaign 2, 28–on) Ashton Greymoore (earth genasi barbarian) (Campaign 3)\r\nPercival \"Percy\" Fredrickstein Von Musel Klossowski de Rolo III (human gunslinger) (Campaign 1)\r\nMollymauk \"Molly\" Tealeaf/Kingsley Tealeaf (tiefling blood hunter) (Campaign 2, 1–26 and 140–141, The Mighty Nein Reunited Parts 1 and 2)\r\nCaduceus Clay (firbolg cleric) (Campaign 2, 28–on)\r\nAshton Greymoore (earth genasi barbarian) (Campaign 3)\r\nMarisha RayKeyleth of the Air Ashari (half-elf druid) (Campaign 1) Beauregard \"Beau\" Lionett (human monk) (Campaign 2) Laudna (human (Hollow One) sorcerer/warlock) (Campaign 3)\r\nKeyleth of the Air Ashari (half-elf druid) (Campaign 1)\r\nBeauregard \"Beau\" Lionett (human monk) (Campaign 2)\r\nLaudna (human (Hollow One) sorcerer/warlock) (Campaign 3)\r\nOrion Acaba: 195 Tiberius Stormwind (dragonborn sorcerer) (Campaign 1, 1–27)\r\nTiberius Stormwind (dragonborn sorcerer) (Campaign 1, 1–27)\r\nSam Riegel Scanlan Shorthalt (gnome bard) (Campaign 1, absent 86–98) Taryon \"Tary\" Gary Darrington (human artificer) (Campaign 1, 85–102 and \"Dalen's Closet\") Nott the Brave/Veth Brenatto (goblin/halfling rogue/wizard) (Campaign 2) Fresh Cut Grass (aeormaton cleric) (Campaign 3)\r\nScanlan Shorthalt (gnome bard) (Campaign 1, absent 86–98)\r\nTaryon \"Tary\" Gary Darrington (human artificer) (Campaign 1, 85–102 and \"Dalen's Closet\")\r\nNott the Brave/Veth Brenatto (goblin/halfling rogue/wizard) (Campaign 2)\r\nFresh Cut Grass (aeormaton cleric) (Campaign 3)\r\nGuests\r\nGuests are an irregular occurrence on Critical Role and, in most cases, only stay on the show for a one-off appearance or a few consecutive episodes. Only a few guests (Mary Elizabeth McGlynn, Will Friedle and Patrick Rothfuss in campaign one, as well as Khary Payton in campaign two) have appeared in non-consecutive episodes, with their respective characters playing an active role in different parts of the overall storyline. Chris Perkins is the only guest to appear in multiple campaigns. He has a guest role in both of the first two campaigns, playing a different character in each.\r\nFelicia Day as Lyra (human wizard)\r\nMary Elizabeth McGlynn as Zahra Hydris (tiefling warlock)\r\nWil Wheaton as Thorbir Falbek (dwarf fighter)\r\nWill Friedle as Kashaw Vesh (human cleric)\r\nKit Buss as Lillith Anioska Daturai (tiefling wizard)\r\nJason C. Miller as Garthok (half-orc rogue)\r\nChris Hardwick as Gern Blanston (dragonborn wizard)\r\nChris Perkins as Shale (goliath fighter)\r\nPatrick Rothfuss as Kerrek (human paladin)\r\nND Stevenson as Tova (dwarf/werebear blood hunter)\r\nJon Heder as Lionel \"Chod\" Gayheart (half-orc bard/barbarian)\r\nDarin De Paul as Ethrid \"Sprigg\" Brokenbranch (gnome rogue)\r\nJoe Manganiello as Arkhan the Cruel (red dragonborn paladin/barbarian)\r\nKhary Payton as Shakäste (human cleric)\r\nMark Hulmes as Calianna (half-elf sorcerer, 1/10 black dragon)\r\nAshly Burch as Keg (dwarven fighter)\r\nSumalee Montano as Nila (firbolg druid)\r\nChris Perkins as Spurt (kobold inventor)\r\nDeborah Ann Woll as Twiggy (forest gnome rogue)\r\nMica Burton as Reani (aasimar druid)\r\nRobbie Daymond as Dorian Storm (air genasi bard)\r\nErika Ishii as Dusk (changeling warlock/paladin)\r\nAabria Iyengar as Deanna Leimert (gnome cleric)\r\nChristian Navarro as F.R.I.D.A. (aeormaton rogue/fighter/cleric)\r\nAimee Carrero as Deni$e (barbarian/rogue)\r\nUtkarsh Ambudkar as Bor'Dor Dog'Son (half-elf sorcerer)\r\nEmily Axford as Prism (shadar-kai wizard)\r\nReception\r\nViewership\r\nViewer responses to the show have been overwhelmingly positive, with many fans, nicknamed \"Critters\", creating content such as fanart, fan fiction, character-inspired music, and fan-created merchandise for the show. Fans also send in many gifts for the cast and crew, resulting in occasional \"Critmas\" episodes during which the gifts are opened and distributed.\r\nAs of January 2016, each episode of the show has been watched for more than a million minutes on Twitch, totaling over 37 million minutes watched for the whole series. Additionally, the Critical Role YouTube channel, which was only started in 2018, has over 500 million views as of September 2022. By the time the 100th episode was launched, the channel had amassed over 68 million views overall, reaching over 224 million views as of December 2020. As of January 2021, the first episode of campaign one has been watched 15 million times on YouTube. In October 2021, Business Insider reported that the official Twitch channel had 828,000 followers and 13,530 active subscribers while the official YouTube channel had 1.4 million subscribers; the Twitch channel has over 1 million followers as of September 2022. Variety reported \"historically, C.R.'s Twitch channel has attracted 60,000–75,000 live viewers for each episode. Factoring in on-demand plays on Twitch and YouTube, the total per-episode audience has ranged from 1.2 million to 1.5 million, according to Willingham.\" The Critical Role audience has grown significantly on Twitch and YouTube year over year. With 1.1 million followers on Twitch, Critical Role is one of many successful enterprises; Twitch's 50 most popular streamers have 4 million followers or more.\r\nCritical response\r\nIn a January 2016 article, Polygon described Critical Role as a \"thoroughly modern\" show with a business model that is still developing. In September 2016, Russ Burlingame of Comicbook.com highlighted that the show has a \"stellar cast\" with good \"chemistry\". Burlingame commented that it has also \"evolved from a pretty simple and low-fi operation in the early days to something much more elaborate and with better production values as time goes on\". Early on the show caught the attention of the publishers of Dungeons & Dragons, Wizards of the Coast, who discussed it at length on two occasions on their official D&D podcast in 2015 and 2016, along with cast members Matthew Mercer, Marisha Ray, Liam O'Brien, Laura Bailey and former member Orion Acaba.\r\nAndy Wilson, for Bleeding Cool, highlighted Critical Role as \"the best show watched all year\" in 2020. He wrote, \"I've said repeatedly that Critical Role is the future of television, and specifically praising their response to COVID that continued their show in a safe way where no one has gotten sick. Let me pause there for a moment: no one has gotten sick. They have been smart and responsible and safe. ... But even more important is what they did this year. They are, weekly, one of the most-watched streams on Twitch. ... They gave fans something to look forward to every week– an incredible feat given the endless monotony and despair of socially distant quarantine life.\"\r\nChris King, in his review of Exandria Unlimited for Polygon, commented that \"despite Critical Role's commercial success, criticisms of the show have been mounting over the years—first, that the cast wasn't diverse enough and, second, that there was really no easy way in to understanding this world without starting all the way back at the beginning\". King felt the show didn't succeed as an entry for new fans (between the show's hook and the length of each episode), however, \"Exandria Unlimited is still a big step in the right direction. ... Some fans of the series have become wedded to the idea that Mercer's way is the only way to play, but Iyengar's work here goes a long way toward proving that Critical Role doesn't always need Mercer at the head of the table to succeed.\" King wrote, \"Exandria Unlimited has been able to retain what makes Critical Role so beloved by so many fans, while bringing new voices to the table. ... It's not an adventure for the uninitiated, but instead an interstitial adventure filled with pre-existing lore and in-jokes to old campaigns, and no clear starting point for new fans to connect with. But it's still a lot of fun\".\r\nDungeons & Dragons resurgence\r\nin 2020, Sarah Whitten of CNBC stated that the resurgence of Dungeons & Dragons began with the release of the new 5th Edition in 2014 which intersected with the \"Let's Play\" genre of online videos – Critical Role introduced \"a whole new audience to\" Dungeons & Dragons and helped \"bolster the renaissance of the 46-year-old role-playing game\". Whitten wrote, \"Critical Role isn't just a source of entertainment, it's teaching people how to play Dungeons & Dragons in the same way someone might watch a baseball or football game to gain a basic understanding of the rules and then start playing\". In a 2015 interview with Polygon, lead D&D designer Mike Mearls commented about the show: \"It was really cool, as a guy who works on Dungeons & Dragons, to open up my Twitch app on my iPad and see Dungeons & Dragons in the first row.\" Critical Role has been credited by VentureBeat as responsible for making actual play shows \"their own genre of entertainment\", and has since become one of the most prominent actual play series.\r\nA 2020 qualitative study examining the modern resurgence of Dungeons & Dragons stated that participant responses highlighted Critical Role's \"high quality production value and noteworthy depiction of social fun and fantasy tropes\" which \"cultivated a burgeoning interest in D&D play that they believed contributed to the game's resurgence\". The authors commented that \"the criticality of Critical Role was repeatedly mentioned by participants and reveals successful convergence culture in action and the impact this has had on drawing more interest and players towards D&D. The progression of Critical Role from a home tabletop game, to live broadcast, to mass-media partnered animated series, to in-canon campaign guide, exemplifies the prolific impact that convergence culture has had on D&D's modern resurgence and popularity\".\r\nHowever, critics have also highlighted the impact of the \"Matt Mercer Effect\" on Dungeons & Dragons. Named for Critical Role's Dungeon Master, Matthew Mercer, the \"mercer-effect\" is the belief that all TTRPG/DnD players expect an experience with the same narrative, immersive, and gameplay qualities as Critical Role. Mercer has responded numerous times to people asking how to \"beat\" this effect and critics who cite Critical Role for creating unattainable standards in the hobby. In a message to the community, he writes, \"Every table is different, and should be! If they just want to 'copy' what we do, that's not very creative nor what makes the game magic at the table.\"\r\nOrion Acaba's departure\r\nOrion Acaba left Critical Role in 2015. Emily Duncan of Tor.com stated that the \"popular consensus\" is to start Critical Role's first campaign at episode 24 after Acaba's departure as \"everyone at the table is more comfortable and the energy of the group is more vibrant after the removal of a player who caused some tension within the first two arcs\". Emily Friedman, in the book Roleplaying Games in the Digital Age: Essays on Transmedia Storytelling, Tabletop RPGs and Fandom (2021), highlighted that \"while the public statements by all were civil and warm, fan speculation was so rampant that the Critical Role Reddit page ... has an entire FAQ section on what can and cannot be discussed in relation to Acaba and his character Tiberius Stormwind. Acaba attempted to run an independent spinoff series focused on the character's home country of Draconia, but the show only saw a handful of episodes before it ended. Acaba courted fan appeals to bring back his character (and thus himself), none successful. As of this writing, almost all episodes of the spinoff have been purged from YouTube ... The show's audience base expanded significantly in the months after Acaba's departure. As a result, different viewers have a different experience of 'how long' Tiberius was a part of Critical Role\".: 195\r\nShelly Jones, in an essay in the book Watch Us Roll (2021), also highlighted the fan response (including the Reddit FAQ) to Acaba's departure and the cast's \"external strife associated\" with his departure (such as \"disgruntled and deleted Tweets\" and an \"uncomfortable AskMeAnything on Reddit\").: 139 Jones also commented that Critical Role's fandom has learned a \"behavior of erasure in the guise of maintaining a positive attitude\" from the show itself. The FAQ of The Legend of Vox Machina Kickstarter states that Tiberius would not appear in the show; Jones wrote, \"while there are many possible reasons for this exclusion, the result is the same: the ultimate distortion of the narrative of Critical Role\". Cori McCreery, for WWAC, highlighted Tiberius' exit in the second volume of the prequel comic. She wrote, \"Part of the beauty of adaptations is that you can change things that no longer fit the story you want to tell. The Critical Role team had a falling out with the actor who played Tiberius, and the character wound up leaving the game pretty early on into the stream, and leaving a bit of a conundrum for adaptations like this and the upcoming cartoon. So while I don't know if they're writing the character out in the comics earlier than he left the game, I do know that they do not plan to use him in the animated series, despite his being present for some of the adventures there. I'd be perfectly fine if this adaptation took a page from the medium it's part of and provides everyone with a retcon of the group's past\".\r\nFeast of Legends / Wendy's\r\nIn 2019, a Critical Role one-shot was sponsored by Wendy's to promote the Feast of Legends RPG system developed by the company. However, following a strong negative fan response to the sponsor, the Critical Role team chose to take down the VOD, and announced via Twitter that they had donated their sponsorship profits from the one-shot to the Farm Worker Justice organization. In 2021, the book The Routledge Handbook of Remix Studies and Digital Humanities highlighted the Feast of Legends one-shot. It states, \"neither the game itself nor quality of the Critical Role performance was really at issue ... Accepting financial support from Wendy's was read among some fans as a tacit acceptance of political positions held by Wendy's. ... To bring Critical Role into contact with Wendy's was not just bringing professional voice actors into Freshtovia; a whole array of political issues were brought into the mix at the same time. The Critical Role staff scrubbed nearly all evidence of the video from their official feeds and records. The community was significantly jarred by the mashup, not of D&D and fast food, but escapism and politics\". Jones commented that decision to remove the Feast of Legends episode was \"presumably\" made by the show's \"development team for purposes of branding and controlling the criticism circulating about the failed experiment\".: 149 Jones also highlighted that the fan-created wiki followed the show's example and that by scrubbing the episode from their wiki, these fans \"are erasing any evidence of negativity in an effort to protect their fan object\".: 149\r\nAccolades\r\nLicensed works and related products\r\nCritical Role's commercial success has led to many other related products, including a prequel comic series, art books, a novel, two campaign setting books (Critical Role: Tal'Dorei Campaign Setting and Explorer's Guide to Wildemount), and an animated series. Hobby and toy stores sell miniatures and other collectibles related to Critical Role.\r\nCharity involvement\r\nOn October 16, 2015, the Extra Life fundraiser episode raised over $20,000 for the Children's Miracle Network during the broadcast. This charity episode included a reappearance of the Critical Rejects, as well as three members of the Critical Role cast: Liam O'Brien, Marisha Ray, and Orion Acaba.\r\nDuring the show, viewers are invited to donate money to 826LA, which is later provided in a lump sum to the charity. Donation amounts and messages appear live on the stream, and on earlier episodes, a list of donors was read at the end of each session. During Geek & Sundry's 2015 Extra Life fundraiser, a special interactive episode was broadcast. This episode alone brought in over $20,000 for the Children's Miracle Network, and the event as a whole raised over $76,000. In late November 2015, Geek & Sundry's Twitch channel held a special Doctors Without Borders fundraiser, with nearly half of the $10,000 goal being raised during the four-hour Critical Role broadcast. In December 2015, the cast released an article on Geek & Sundry, \"Critter's Guide to Critmas\", in response to the flood of gifts they were receiving from fans, asking them to instead donate to a variety of charities, with a different cast member sponsoring each charity.\r\nIn Spring 2018, the show held a charity drive for 826LA which resulted in community members donating over $50,000, with a matching amount given by one generous community member. The drive resulted in some prizes being unlocked for the community, such as discount codes for D&D Beyond and Wyrmwood Gaming, a second \"Fireside Chat\" with Mercer, and a second Honey Heist run by Ray.\r\nCritical Role Foundation\r\nCritical Role Productions launched a new 501(c)(3) nonprofit organization, Critical Role Foundation, in September 2020 with the mission statement: \"To leave the world better than we found it.\" Comic Book Resources reported that \"Critical Role Foundation will partner with other organizations in the nonprofit sector that share the same values as Critical Role and its community, in addition to raising emergency relief funds to be put toward immediate humanitarian aid as needed. Its inaugural partnership will be with First Nations Development Institute, which seeks to strengthen Native American economies and communities. CRF aims to raise $50,000 for First Nations, which will fund the Native Youth & Culture Fund for two initiatives over the course of one year.\"",
    "html": "<p>Critical Role is an American web series in which a group of professional voice actors plays Dungeons & Dragons. The show started streaming partway through the cast's first campaign in March 2015. Campaign one ended in October 2017 after 115 episodes, and campaign two started in January 2018 and ended in June 2021 after 141 episodes. A number of one-shots were aired in the hiatus between the two campaigns. After campaign two was completed, the spin-off limited series Exandria Unlimited aired from June 2021 to August 2021. The third campaign premiered on October 21, 2021.</p><p>The series is broadcast on Thursdays at 19:00 PT on the Critical Role Twitch and YouTube channels, with the video on demand (VOD) becoming available to Twitch subscribers immediately after the broadcast. The VODs are made available for the public on Critical Role's website and uploaded to their YouTube channel on the Monday after the live stream. Prior to the COVID-19 pandemic, the show had broadcast live, but has been pre-recorded since its return for episode 100 of Campaign Two.</p><p>The cast own the intellectual property from the show, and the show also lends its name to the studio owned by the cast—Critical Role Productions. The studio has produced Critical Role since 2018. A number of licensed works based on the show have been released, such as several comic books and two official campaign setting guides. The Legend of Vox Machina, the animated series based on the first campaign of Critical Role, premiered on January 28, 2022. Mighty Nein, an upcoming animated series based on the second campaign, was announced in January 2023.</p><br/><h3>Background</h3><p>Critical Role is a creator-owned streaming show where the cast play an ongoing Dungeons & Dragons campaign, with Matthew Mercer serving as the show's Dungeon Master for the seven other cast members.</p><p>The group's first campaign began two years prior to the start of the series as a one-off, simplified Dungeons & Dragons 4th edition game for Liam O'Brien's birthday. The players enjoyed the game so much that they continued to play it while switching to the Pathfinder ruleset. After Felicia Day heard about the private home game from Ashley Johnson, she approached the group about playing it in a live-streamed format for Geek & Sundry, which hosted the show until February 2019. In order to streamline gameplay for the show, the game's characters were converted from Pathfinder to Dungeons & Dragons 5th edition before the web series began airing on March 12, 2015. There were initially eight cast member players; Orion Acaba left the show after episode 27 of campaign one. His character, Tiberius, appeared in the first seven issues of the prequel comic series Critical Role: Vox Machina Origins.</p><p>Fans of the show officially dubbed themselves \"Critters\" in 2015 after Liam O'Brien suggested it and the chatbox ran with it.</p><br/><h3>Critical Role company and studio</h3><p>The Critical Role company, Critical Role Productions LLC, was incorporated in 2015. As of 2019, Travis Willingham serves as chief executive officer, Matthew Mercer as chief creative officer, Marisha Ray as creative director, Ed Lopez as chief operating officer, Rachel Romero as senior vice president of marketing, and Ben Van Der Fluit as vice president of business development.</p><p>In June 2018, Critical Role Productions launched its own Twitch and YouTube channels, with cast member Marisha Ray announced as the creative director of the franchise. The company also moved to their own studio space in 2018 and started putting out new shows on their Twitch and YouTube channels. The sets for Critical Role and Talks Machina moved from Legendary Digital Network's studios to Critical Role's own studios in July 2018. In February 2019, Critical Role finalized its split from Geek & Sundry and Legendary Digital Networks, with live broadcasts of the company's shows and VODs airing exclusively on Critical Role's channels. Critical Role also took over production responsibility for Critical Role and Talks Machina after splitting from Legendary Digital Networks. Some \"legacy episodes\" (currently the entirety of Campaign 1, the first 19 episodes of Campaign 2, as well as the corresponding episodes of official discussion show Talks Machina) remain available in Geek & Sundry's archives on YouTube and Twitch, though some older episodes of Critical Role and Talks Machina are being deleted from the Geek and Sundry channels and re-uploaded to the official Critical Role channels since 2019 as part of an ongoing migration of older content to the creator-owned channels.: 0:45</p><p>On March 4, 2019, Critical Role launched a Kickstarter campaign to raise funds for a 22-minute animation called Critical Role: The Legend of Vox Machina Animated Special. The final total raised by the Kickstarter when it closed on April 19, 2019, was $11.3M turning the intended animated special into a ten-episode animated series. When the campaign closed, it was one of the most quickly funded in Kickstarter history, and was the most funded Kickstarter for TV and film projects. In November 2019, Amazon Prime Video announced that they had acquired the streaming rights to The Legend of Vox Machina, and had commissioned 14 additional episodes (two additional episodes for season 1 and a second season of 12 episodes). The project was originally slated for release in late 2020, however in June 2020, it was announced that the debut would be missed due to the COVID-19 pandemic. The Legend of Vox Machina premiered on January 28, 2022.</p><p>A leak of Twitch data in October 2021 revealed that Critical Role is among the highest earners on Twitch; the company received a total direct payout of $9,626,712 between September 2019 and September 2021 from Twitch in gross income for subscriptions and ad revenue. BBC News commented that this list of payments is unlikely to \"account for tax paid on income\" and that \"many, if not all, of these top streamers are effectively large-scale media operations, with their own employees and business expenses – so the numbers do not represent 'take-home pay' for those listed\". Business Insider highlighted that \"Critical Role has grown into a full-fledged media company. Its LinkedIn page lists employees in roles including marketing, business development, photography, editing, and even one person responsible for keeping track of the lore, or details in its fantasy world\".</p><br/><h3>Format</h3><p>Critical Role is a mixture of a weekly show and a modern gaming Twitch stream. Each episode usually runs for three to five (in some cases six) hours and is streamed live on Critical Role's Twitch and YouTube channels on almost every Thursday, with possible breaks from the show being announced at least one week prior to the broadcast. The VOD is made available for subscribers of Critical Role's Twitch channel immediately after airing and before being uploaded to Critical Role's YouTube channel the following Monday, where it can be watched for free. Prior to the COVID-19 pandemic, the show had broadcast live, but has been pre-recorded since its return for episode 100 of Campaign Two and will continue to be pre-recorded for Campaign Three. Starting with the third campaign, the main campaign of Critical Role will not air new episodes on the last Thursday of every month; instead, other content by the studio will air in its time slot.</p><p>Critical Role has played with a live theater audience nine times. The third campaign's premiere was simulcast live in Cinemark Theatres along with the regular Twitch and YouTube livestream. Similarly, the 17th episode of the third campaign was simulcast in Cinemark Theatres, Landmark Theatres, and Cinépolis alongside the regular livestream as part of their 7th anniversary celebration.</p><p>A number of Critical Role's streams have also served as a donation drive to support nonprofit organizations such as St Jude, 826LA, Extra Life, and Doctors Without Borders.</p><h4>Podcasts</h4><p>On the 100th episode of Critical Role, the launch of the Critical Role podcast was announced: an audio version of the game sessions. It is available on iTunes, Spotify, Google Play Music, and at the Geek & Sundry website. The first campaign's podcast episodes were released in batches of 10–15, between June 8, 2017, and January 8, 2018. \"Listened to at 1.5X speed, total listening time of the first campaign would be reduced to a little over 298 hours – at 2X speed, under 224 hours\".: 197 Since the start of the second campaign, the podcast episodes have been released on the following Thursday.</p><br/><h3>Campaign structure</h3><p>The Critical Role storyline occurs in campaigns that consist of a series of story arcs, which are usually played over multiple episodes. Between—or sometimes within—the major story arcs, the characters rest, resupply, or go on side quests. In addition, every player character has a backstory, an unfinished part of their personal history that can be relevant to the campaign from time to time. Sometimes, major story arcs are intrinsically tied to a character's backstory. While each campaign centers on a different party of adventurers, the campaigns are all set on the various continents of Exandria, a world of Mercer's creation. In June 2021, the cast of Critical Role finished their second campaign. Their third campaign premiered on October 21, 2021.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Campaign</th><th scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\">Party</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr><td colspan=\"13\" id=\"Main_series\" style=\"text-align:center;background-color:#ccf;color:black\"><b>Main series</b></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td scope=\"col\" rowspan=\"1\" style=\"padding:0 8px\">Vox Machina</td><td colspan=\"2\">115</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 12, 2015</td><td style=\"padding:0 8px\">October 12, 2017</td><td rowspan=\"2\"><span>Twitch</span>, <span>YouTube</span>, Alpha (2016–2019)</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td scope=\"col\" rowspan=\"1\" style=\"padding:0 8px\">The Mighty Nein</td><td colspan=\"2\">141</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 11, 2018</td><td style=\"padding:0 8px\">June 3, 2021</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td scope=\"col\" rowspan=\"1\" style=\"padding:0 8px\">Bell's Hells</td><td colspan=\"2\"><span><span>60</span></span></td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 21, 2021</td><td data-sort-value=\"\" class=\"table-na\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center; ;padding:0 8px\">TBA</td><td rowspan=\"1\">Twitch, YouTube</td></tr><tr><td colspan=\"13\" id=\"Anthology_series\" style=\"text-align:center;background-color:#ccf;color:black\"><b>Anthology series</b></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span><i>Exandria Unlimited</i></span></span></span></span></th><td scope=\"col\" rowspan=\"1\" style=\"padding:0 8px\">The Crown Keepers</td><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 24, 2021</td><td style=\"padding:0 8px\">April 1, 2022</td><td rowspan=\"1\">Twitch, YouTube</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><i>Exandria Unlimited: Calamity</i></span></span></span></th><td scope=\"col\" rowspan=\"1\" style=\"padding:0 8px\">The Ring of Brass</td><td colspan=\"2\">4</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">May 26, 2022</td><td style=\"padding:0 8px\">June 16, 2022</td><td rowspan=\"1\">Twitch, YouTube</td></tr><tr><td colspan=\"13\" id=\"Limited_series\" style=\"text-align:center;background-color:#ccf;color:black\"><b>Limited series</b></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>One-shots</span></span></span></span></th><td scope=\"col\" rowspan=\"1\" style=\"padding:0 8px\">Various</td><td colspan=\"2\">49</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 25, 2016</td><td data-sort-value=\"\" class=\"table-na\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center; ;padding:0 8px\">TBA</td><td rowspan=\"1\">Twitch, YouTube, Alpha (2016–2019)</td></tr></tbody></table><h4>Campaign one</h4><p>Campaign one takes place primarily in Tal'Dorei, a continent of Exandria. It follows the exploits of an adventuring party known as Vox Machina, previously known as the Super High-Intensity Team (or S.H.I.T.s), a rag-tag group of mercenaries originally formed in the swamp town of Stilben.</p><h4>Pre-series history</h4><p>The Vox Machina campaign originated as the home game of the cast, which was played at home from 2012 to 2015. In their adventures prior to the start of the series, the group saved the family of Sovereign Uriel Tal'Dorei III, ruler of Tal'Dorei and its capital city of Emon. In appreciation, Uriel gave the group seats on the city council, and provided them with a residence called Greyskull Keep, which is located just outside the city.</p><p>While the early adventures were not formally recorded, some shorter recordings have been released by the cast. This includes audio from the first session of the campaign, which was released as a segment in the third episode of the podcast All Work No Play. Additionally, O'Brien released a recording of the magic carpet being discovered by the party. Episode 36, titled Winter's Crest in Whitestone, features a summary of the pre-series history, with artwork created by Wendy Sullivan Green and voice-overs provided by the cast. The comic book, Critical Role: Vox Machina Origins, is an adaptation of the group's game before the show. The animated series adaptation, The Legend of Vox Machina, also adapts a canonic story that takes place within the pre-stream time frame.</p><h4>On-stream campaign</h4><p>The show begins in medias res with the characters regrouping in the city of Emon after approximately six months apart and the streamed campaign picks up where the cast's original home game left off. The first episode of the show aired on March 12, 2015, and the campaign concluded with its final episode on October 12, 2017. Campaign one was broadcast live on the Geek & Sundry Twitch and YouTube channels between March 12, 2015, and October 12, 2017, for a total of 115 episodes and six story arcs. Starting in November 2016, it was also broadcast live on the Alpha streaming service from Legendary Digital Networks. The show on Alpha had a unique overlay that included \"real-time character sheets, damage and heal animations, and visualizations\".</p><h4>Post-campaign</h4><p>In 2019, over a year after the first campaign ended, Critical Role produced three canonical one-shot games that feature Vox Machina in the time frame after Vecna's banishment. The first one-shot, Vox Machina: The Search for Grog, was played at a live show in Los Angeles on January 19, 2019, then broadcast on Twitch on February 22, 2019, before being released via YouTube and Twitch VOD on February 23, 2019. It explored an event that took place in the final episode of campaign one, but was not played out in detail because it would have disrupted the ongoing epilogue. More Vox Machina one-shots were unlocked as rewards and stretch goals during the Kickstarter campaign for the Critical Role animated series. The first of these was Vox Machina: The Search for Bob, a continuation of the events of The Search for Grog. It aired on the Critical Role Twitch channel on June 21, 2019, with the YouTube VOD being made available on June 23, 2019. Another Kickstarter reward was Vox Machina's Summer Reunion at Dalen's Closet, which aired on Twitch on August 29, 2019, with the YouTube VOD becoming available for the public on September 2, 2019. This one-shot takes place a year after the events of The Search for Grog/Bob, as Percy and Vex renew their wedding vows on a beach in Marquet, with all of their friends and family present—as well as a few uninvited \"guests\".</p><p>Critical Role also played another canonical and Vox Machina-related one-shot at a live show in 2019: The Adventures of the Darrington Brigade, which was played at the Bass Concert Hall in Austin, Texas, on November 23, 2019. It stars Sam Riegel as Taryon Darrington, honorary member of Vox Machina, who leads a group of new characters into their own adventures. The story is set roughly a decade after campaign one and a decade before campaign two. It aired on the Critical Role Twitch channel on November 29, 2019, with the YouTube VOD being made available on December 1, 2019.</p><p>After the animated series, The Legend of Vox Machina, was picked up by Amazon and, according to Variety, \"Prime Video ordered an additional 14 episodes, for a total of 24 episodes across two seasons\". Critical Role announced that the animated show would adapt the full Briarwood arc along with other storylines from campaign one.</p><h4>Campaign two</h4><p>The second campaign began on January 11, 2018, and follows the adventuring party known as The Mighty Nein. The story is set on the continent of Wildemount, which was briefly visited during the Vox Machina campaign. The Mighty Nein campaign is set about 20 years after Vox Machina's final battle against Vecna and takes place in a time where tensions between two of Wildemount's mightiest nations are very high. A hiatus due to concerns around the COVID-19 pandemic was in effect from March to July 2020, after which the show returned in a non-live format adjusted for social distancing. In May 2021, the cast announced that campaign two would end shortly; however, \"the Mighty Nein's story wasn't finished\". The finale aired on June 3, 2021; it was the longest episode at just over seven hours.</p><h4>Post-campaign</h4><p>In October 2022, Critical Role announced an upcoming two-part special titled The Mighty Nein Reunited. The canonical story picks up several months after the conclusion of the second campaign with the cast reprising their roles. Part 1 aired on November 17, 2022 with Part 2 airing on December 1, 2022. In addition to being streamed on Twitch and YouTube, The Mighty Nein Reunited was simulcast in Cinemark Theatres in both the United States and South America.</p><p>In January 2023, it was announced that the campaign will receive an animated television adaptation titled Mighty Nein. The series will be executive produced by Tasha Huo, Sam Riegel, Travis Willingham, Chris Prynoski, Shannon Prynoski, Antonio Canobbio and Ben Kalina; Metapigeon, Amazon Studios, and Titmouse will also executive produce.</p><h4>Campaign three</h4><p>The third campaign premiered on October 21, 2021. The story takes place after the events of the second campaign and Exandria Unlimited; it is set on the continent of Marquet, which was briefly visited during the Vox Machina campaign. Multiple characters in this campaign are returning characters. Dorian, Orym, and Fearne premiered in Exandria Unlimited while Bertrand premiered in the one-shot \"Search For Grog\".</p><h4>Anthology and limited series</h4><h4>Exandria Unlimited</h4><p>Exandria Unlimited (ExU) is an anthology series which premiered on June 24, 2021, and is a spin-off of the main Critical Role series. IGN reported, in June 2021, that \"Exandria Unlimited will be considered canon within the wider Critical Role story, and 'will affect future environments and timelines across the overall lore of Critical Role.' So as fans await what may come from Campaign 3 of the core CR cast, Unlimited looks to offer a new vantage point into the world of Exandria\".</p><p>The first season is set in the city of Emon on the continent of Tal'Dorei 30 years after Campaign One and 10 years after Campaign Two. It features Aabria Iyengar (known for other streaming shows such as Happy Jacks RPG, Dimension 20, and Saving Throw) as the game master and stars Aimee Carrero, Robbie Daymond, Johnson, O'Brien, and Mercer as players. Daymond, Mercer, Carrero, and Iyengar reprised their roles for Exandria Unlimited: Kymal, a two-part adventure continuation of the first season which premiered in March 2022. Anjali Bhimani, reprising her previous ExU guest star, and Erica Lindbeck also joined the cast.</p><p>The second season, titled Exandria Unlimited: Calamity, is set in the Age of Arcanum – almost 1,000 years before the Critical Role series. It was broadcast from May 26 to June 16, 2022. It features Brennan Lee Mulligan as the Dungeon Master and stars Iyengar, Ray, Riegel, Willingham as players along with newcomers Lou Wilson and Luis Carazo.</p><h4>One-shots</h4><p>Instead of an episode in the main storyline, the series occasionally features a one-shot game—a self-contained story that can be told within the time constraints of one episode (or three to four hours of gameplay). A one-shot could be described as the RPG equivalent to a short story. Some of the Critical Role one-shots are canonical parts of the storylines that play out in one of the campaigns, covering events that occur outside the time frame of the respective campaign, but still feature some of the campaign's main characters. Other one-shots only have a tangential relationship to the campaigns, as they are set in the world of Exandria, but feature a different cast of characters, often in smaller scale adventures that may or may not be canon. There are also one-shots that have no connection with the campaigns or the world of Exandria at all.</p><p>Not all Critical Role one-shots use the Dungeons & Dragons game system, as some are based on other RPG systems. In many one-shots, other cast members take over the role of Dungeon Master or game master (GM) from Mercer. The show aired several one-shots in the hiatus between campaign one and campaign two.</p><p>Some of Critical Role's one shots have been sponsored. One-shot sponsors have included Warner Bros. Interactive Entertainment, Blizzard Entertainment, and Chaosium for running one-shots themed around Middle-earth: Shadow of War, Hearthstone, and Call of Cthulhu respectively.</p><br/><h3>Cast and characters</h3><p>Since October 2015, Critical Role has consisted of eight main cast members, all of whom are the original cast. The show had a cast of nine for the first 27 episodes. A number of guest players have also appeared on the show over the years.</p><h4>Main</h4><p>The cast and their characters' names, races, and classes for the three campaigns are listed below. For multiclassed characters, the classes are listed in chronological order.</p><ul><li>Matthew MercerDungeon Master (Campaigns 1, 2, 3)</li><li>Dungeon Master (Campaigns 1, 2, 3)</li><li>Ashley JohnsonPike Trickfoot (gnome cleric) (Campaign 1) Yasha Nydoorin (aasimar barbarian) (Campaign 2) Fearne Calloway (faun druid/rogue) (Campaign 3)</li><li>Pike Trickfoot (gnome cleric) (Campaign 1)</li><li>Yasha Nydoorin (aasimar barbarian) (Campaign 2)</li><li>Fearne Calloway (faun druid/rogue) (Campaign 3)</li><li>Travis WillinghamGrog Strongjaw (goliath barbarian/fighter) (Campaign 1) Sir Bertrand Bell (human fighter) (\"The Search for Grog\", Campaign 3, 1-3) Fjord Stone (half-orc warlock/paladin) (Campaign 2) Chetney Pock O'Pea (gnome blood hunter/rogue) (Campaign 3, 7-on)</li><li>Grog Strongjaw (goliath barbarian/fighter) (Campaign 1)</li><li>Sir Bertrand Bell (human fighter) (\"The Search for Grog\", Campaign 3, 1-3)</li><li>Fjord Stone (half-orc warlock/paladin) (Campaign 2)</li><li>Chetney Pock O'Pea (gnome blood hunter/rogue) (Campaign 3, 7-on)</li><li>Laura BaileyVex'ahlia \"Vex\" de Rolo (née Vessar) (half-elf ranger/rogue) (Campaign 1) Jester Lavorre (tiefling cleric) (Campaign 2) Imogen Temult (human sorcerer) (Campaign 3)</li><li>Vex'ahlia \"Vex\" de Rolo (née Vessar) (half-elf ranger/rogue) (Campaign 1)</li><li>Jester Lavorre (tiefling cleric) (Campaign 2)</li><li>Imogen Temult (human sorcerer) (Campaign 3)</li><li>Liam O'BrienVax'ildan \"Vax\" Vessar (half-elf rogue/paladin/druid) (Campaign 1) Lieve'tel Toluse (elf cleric) (\"The Search for Grog\") Derrig (half-elf fighter) (\"Dalen's Closet\") Caleb Widogast/Bren Aldric Ermendrud (human wizard) (Campaign 2) Orym of the Air Ashari (halfling fighter) (Campaign 3)</li><li>Vax'ildan \"Vax\" Vessar (half-elf rogue/paladin/druid) (Campaign 1)</li><li>Lieve'tel Toluse (elf cleric) (\"The Search for Grog\")</li><li>Derrig (half-elf fighter) (\"Dalen's Closet\")</li><li>Caleb Widogast/Bren Aldric Ermendrud (human wizard) (Campaign 2)</li><li>Orym of the Air Ashari (halfling fighter) (Campaign 3)</li><li>Taliesin JaffePercival \"Percy\" Fredrickstein Von Musel Klossowski de Rolo III (human gunslinger) (Campaign 1) Mollymauk \"Molly\" Tealeaf/Kingsley Tealeaf (tiefling blood hunter) (Campaign 2, 1–26 and 140–141, The Mighty Nein Reunited Parts 1 and 2) Caduceus Clay (firbolg cleric) (Campaign 2, 28–on) Ashton Greymoore (earth genasi barbarian) (Campaign 3)</li><li>Percival \"Percy\" Fredrickstein Von Musel Klossowski de Rolo III (human gunslinger) (Campaign 1)</li><li>Mollymauk \"Molly\" Tealeaf/Kingsley Tealeaf (tiefling blood hunter) (Campaign 2, 1–26 and 140–141, The Mighty Nein Reunited Parts 1 and 2)</li><li>Caduceus Clay (firbolg cleric) (Campaign 2, 28–on)</li><li>Ashton Greymoore (earth genasi barbarian) (Campaign 3)</li><li>Marisha RayKeyleth of the Air Ashari (half-elf druid) (Campaign 1) Beauregard \"Beau\" Lionett (human monk) (Campaign 2) Laudna (human (Hollow One) sorcerer/warlock) (Campaign 3)</li><li>Keyleth of the Air Ashari (half-elf druid) (Campaign 1)</li><li>Beauregard \"Beau\" Lionett (human monk) (Campaign 2)</li><li>Laudna (human (Hollow One) sorcerer/warlock) (Campaign 3)</li><li>Orion Acaba: 195 Tiberius Stormwind (dragonborn sorcerer) (Campaign 1, 1–27)</li><li>Tiberius Stormwind (dragonborn sorcerer) (Campaign 1, 1–27)</li><li>Sam Riegel Scanlan Shorthalt (gnome bard) (Campaign 1, absent 86–98) Taryon \"Tary\" Gary Darrington (human artificer) (Campaign 1, 85–102 and \"Dalen's Closet\") Nott the Brave/Veth Brenatto (goblin/halfling rogue/wizard) (Campaign 2) Fresh Cut Grass (aeormaton cleric) (Campaign 3)</li><li>Scanlan Shorthalt (gnome bard) (Campaign 1, absent 86–98)</li><li>Taryon \"Tary\" Gary Darrington (human artificer) (Campaign 1, 85–102 and \"Dalen's Closet\")</li><li>Nott the Brave/Veth Brenatto (goblin/halfling rogue/wizard) (Campaign 2)</li><li>Fresh Cut Grass (aeormaton cleric) (Campaign 3)</li></ul><h4>Guests</h4><p>Guests are an irregular occurrence on Critical Role and, in most cases, only stay on the show for a one-off appearance or a few consecutive episodes. Only a few guests (Mary Elizabeth McGlynn, Will Friedle and Patrick Rothfuss in campaign one, as well as Khary Payton in campaign two) have appeared in non-consecutive episodes, with their respective characters playing an active role in different parts of the overall storyline. Chris Perkins is the only guest to appear in multiple campaigns. He has a guest role in both of the first two campaigns, playing a different character in each.</p><ul><li>Felicia Day as Lyra (human wizard)</li><li>Mary Elizabeth McGlynn as Zahra Hydris (tiefling warlock)</li><li>Wil Wheaton as Thorbir Falbek (dwarf fighter)</li><li>Will Friedle as Kashaw Vesh (human cleric)</li><li>Kit Buss as Lillith Anioska Daturai (tiefling wizard)</li><li>Jason C. Miller as Garthok (half-orc rogue)</li><li>Chris Hardwick as Gern Blanston (dragonborn wizard)</li><li>Chris Perkins as Shale (goliath fighter)</li><li>Patrick Rothfuss as Kerrek (human paladin)</li><li>ND Stevenson as Tova (dwarf/werebear blood hunter)</li><li>Jon Heder as Lionel \"Chod\" Gayheart (half-orc bard/barbarian)</li><li>Darin De Paul as Ethrid \"Sprigg\" Brokenbranch (gnome rogue)</li><li>Joe Manganiello as Arkhan the Cruel (red dragonborn paladin/barbarian)</li></ul><ul><li>Khary Payton as Shakäste (human cleric)</li><li>Mark Hulmes as Calianna (half-elf sorcerer, 1/10 black dragon)</li><li>Ashly Burch as Keg (dwarven fighter)</li><li>Sumalee Montano as Nila (firbolg druid)</li><li>Chris Perkins as Spurt (kobold inventor)</li><li>Deborah Ann Woll as Twiggy (forest gnome rogue)</li><li>Mica Burton as Reani (aasimar druid)</li></ul><ul><li>Robbie Daymond as Dorian Storm (air genasi bard)</li><li>Erika Ishii as Dusk (changeling warlock/paladin)</li><li>Aabria Iyengar as Deanna Leimert (gnome cleric)</li><li>Christian Navarro as F.R.I.D.A. (aeormaton rogue/fighter/cleric)</li><li>Aimee Carrero as Deni$e (barbarian/rogue)</li><li>Utkarsh Ambudkar as Bor'Dor Dog'Son (half-elf sorcerer)</li><li>Emily Axford as Prism (shadar-kai wizard)</li></ul><br/><h3>Reception</h3><h4>Viewership</h4><p>Viewer responses to the show have been overwhelmingly positive, with many fans, nicknamed \"Critters\", creating content such as fanart, fan fiction, character-inspired music, and fan-created merchandise for the show. Fans also send in many gifts for the cast and crew, resulting in occasional \"Critmas\" episodes during which the gifts are opened and distributed.</p><p>As of January 2016, each episode of the show has been watched for more than a million minutes on Twitch, totaling over 37 million minutes watched for the whole series. Additionally, the Critical Role YouTube channel, which was only started in 2018, has over 500 million views as of September 2022. By the time the 100th episode was launched, the channel had amassed over 68 million views overall, reaching over 224 million views as of December 2020. As of January 2021, the first episode of campaign one has been watched 15 million times on YouTube. In October 2021, Business Insider reported that the official Twitch channel had 828,000 followers and 13,530 active subscribers while the official YouTube channel had 1.4 million subscribers; the Twitch channel has over 1 million followers as of September 2022. Variety reported \"historically, C.R.'s Twitch channel has attracted 60,000–75,000 live viewers for each episode. Factoring in on-demand plays on Twitch and YouTube, the total per-episode audience has ranged from 1.2 million to 1.5 million, according to Willingham.\" The Critical Role audience has grown significantly on Twitch and YouTube year over year. With 1.1 million followers on Twitch, Critical Role is one of many successful enterprises; Twitch's 50 most popular streamers have 4 million followers or more.</p><h4>Critical response</h4><p>In a January 2016 article, Polygon described Critical Role as a \"thoroughly modern\" show with a business model that is still developing. In September 2016, Russ Burlingame of Comicbook.com highlighted that the show has a \"stellar cast\" with good \"chemistry\". Burlingame commented that it has also \"evolved from a pretty simple and low-fi operation in the early days to something much more elaborate and with better production values as time goes on\". Early on the show caught the attention of the publishers of Dungeons & Dragons, Wizards of the Coast, who discussed it at length on two occasions on their official D&D podcast in 2015 and 2016, along with cast members Matthew Mercer, Marisha Ray, Liam O'Brien, Laura Bailey and former member Orion Acaba.</p><p>Andy Wilson, for Bleeding Cool, highlighted Critical Role as \"the best show watched all year\" in 2020. He wrote, \"I've said repeatedly that Critical Role is the future of television, and specifically praising their response to COVID that continued their show in a safe way where no one has gotten sick. Let me pause there for a moment: no one has gotten sick. They have been smart and responsible and safe. ... But even more important is what they did this year. They are, weekly, one of the most-watched streams on Twitch. ... They gave fans something to look forward to every week– an incredible feat given the endless monotony and despair of socially distant quarantine life.\"</p><p>Chris King, in his review of Exandria Unlimited for Polygon, commented that \"despite Critical Role's commercial success, criticisms of the show have been mounting over the years—first, that the cast wasn't diverse enough and, second, that there was really no easy way in to understanding this world without starting all the way back at the beginning\". King felt the show didn't succeed as an entry for new fans (between the show's hook and the length of each episode), however, \"Exandria Unlimited is still a big step in the right direction. ... Some fans of the series have become wedded to the idea that Mercer's way is the only way to play, but Iyengar's work here goes a long way toward proving that Critical Role doesn't always need Mercer at the head of the table to succeed.\" King wrote, \"Exandria Unlimited has been able to retain what makes Critical Role so beloved by so many fans, while bringing new voices to the table. ... It's not an adventure for the uninitiated, but instead an interstitial adventure filled with pre-existing lore and in-jokes to old campaigns, and no clear starting point for new fans to connect with. But it's still a lot of fun\".</p><h4>Dungeons & Dragons resurgence</h4><p>in 2020, Sarah Whitten of CNBC stated that the resurgence of Dungeons & Dragons began with the release of the new 5th Edition in 2014 which intersected with the \"Let's Play\" genre of online videos – Critical Role introduced \"a whole new audience to\" Dungeons & Dragons and helped \"bolster the renaissance of the 46-year-old role-playing game\". Whitten wrote, \"Critical Role isn't just a source of entertainment, it's teaching people how to play Dungeons & Dragons in the same way someone might watch a baseball or football game to gain a basic understanding of the rules and then start playing\". In a 2015 interview with Polygon, lead D&D designer Mike Mearls commented about the show: \"It was really cool, as a guy who works on Dungeons & Dragons, to open up my Twitch app on my iPad and see Dungeons & Dragons in the first row.\" Critical Role has been credited by VentureBeat as responsible for making actual play shows \"their own genre of entertainment\", and has since become one of the most prominent actual play series.</p><p>A 2020 qualitative study examining the modern resurgence of Dungeons & Dragons stated that participant responses highlighted Critical Role's \"high quality production value and noteworthy depiction of social fun and fantasy tropes\" which \"cultivated a burgeoning interest in D&D play that they believed contributed to the game's resurgence\". The authors commented that \"the criticality of Critical Role was repeatedly mentioned by participants and reveals successful convergence culture in action and the impact this has had on drawing more interest and players towards D&D. The progression of Critical Role from a home tabletop game, to live broadcast, to mass-media partnered animated series, to in-canon campaign guide, exemplifies the prolific impact that convergence culture has had on D&D's modern resurgence and popularity\".</p><p>However, critics have also highlighted the impact of the \"Matt Mercer Effect\" on Dungeons & Dragons. Named for Critical Role's Dungeon Master, Matthew Mercer, the \"mercer-effect\" is the belief that all TTRPG/DnD players expect an experience with the same narrative, immersive, and gameplay qualities as Critical Role. Mercer has responded numerous times to people asking how to \"beat\" this effect and critics who cite Critical Role for creating unattainable standards in the hobby. In a message to the community, he writes, \"Every table is different, and should be! If they just want to 'copy' what we do, that's not very creative nor what makes the game magic at the table.\"</p><h4>Orion Acaba's departure</h4><p>Orion Acaba left Critical Role in 2015. Emily Duncan of Tor.com stated that the \"popular consensus\" is to start Critical Role's first campaign at episode 24 after Acaba's departure as \"everyone at the table is more comfortable and the energy of the group is more vibrant after the removal of a player who caused some tension within the first two arcs\". Emily Friedman, in the book Roleplaying Games in the Digital Age: Essays on Transmedia Storytelling, Tabletop RPGs and Fandom (2021), highlighted that \"while the public statements by all were civil and warm, fan speculation was so rampant that the Critical Role Reddit page ... has an entire FAQ section on what can and cannot be discussed in relation to Acaba and his character Tiberius Stormwind. Acaba attempted to run an independent spinoff series focused on the character's home country of Draconia, but the show only saw a handful of episodes before it ended. Acaba courted fan appeals to bring back his character (and thus himself), none successful. As of this writing, almost all episodes of the spinoff have been purged from YouTube ... The show's audience base expanded significantly in the months after Acaba's departure. As a result, different viewers have a different experience of 'how long' Tiberius was a part of Critical Role\".: 195</p><p>Shelly Jones, in an essay in the book Watch Us Roll (2021), also highlighted the fan response (including the Reddit FAQ) to Acaba's departure and the cast's \"external strife associated\" with his departure (such as \"disgruntled and deleted Tweets\" and an \"uncomfortable AskMeAnything on Reddit\").: 139 Jones also commented that Critical Role's fandom has learned a \"behavior of erasure in the guise of maintaining a positive attitude\" from the show itself. The FAQ of The Legend of Vox Machina Kickstarter states that Tiberius would not appear in the show; Jones wrote, \"while there are many possible reasons for this exclusion, the result is the same: the ultimate distortion of the narrative of Critical Role\". Cori McCreery, for WWAC, highlighted Tiberius' exit in the second volume of the prequel comic. She wrote, \"Part of the beauty of adaptations is that you can change things that no longer fit the story you want to tell. The Critical Role team had a falling out with the actor who played Tiberius, and the character wound up leaving the game pretty early on into the stream, and leaving a bit of a conundrum for adaptations like this and the upcoming cartoon. So while I don't know if they're writing the character out in the comics earlier than he left the game, I do know that they do not plan to use him in the animated series, despite his being present for some of the adventures there. I'd be perfectly fine if this adaptation took a page from the medium it's part of and provides everyone with a retcon of the group's past\".</p><h4>Feast of Legends / Wendy's</h4><p>In 2019, a Critical Role one-shot was sponsored by Wendy's to promote the Feast of Legends RPG system developed by the company. However, following a strong negative fan response to the sponsor, the Critical Role team chose to take down the VOD, and announced via Twitter that they had donated their sponsorship profits from the one-shot to the Farm Worker Justice organization. In 2021, the book The Routledge Handbook of Remix Studies and Digital Humanities highlighted the Feast of Legends one-shot. It states, \"neither the game itself nor quality of the Critical Role performance was really at issue ... Accepting financial support from Wendy's was read among some fans as a tacit acceptance of political positions held by Wendy's. ... To bring Critical Role into contact with Wendy's was not just bringing professional voice actors into Freshtovia; a whole array of political issues were brought into the mix at the same time. The Critical Role staff scrubbed nearly all evidence of the video from their official feeds and records. The community was significantly jarred by the mashup, not of D&D and fast food, but escapism and politics\". Jones commented that decision to remove the Feast of Legends episode was \"presumably\" made by the show's \"development team for purposes of branding and controlling the criticism circulating about the failed experiment\".: 149 Jones also highlighted that the fan-created wiki followed the show's example and that by scrubbing the episode from their wiki, these fans \"are erasing any evidence of negativity in an effort to protect their fan object\".: 149</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Year</th><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient(s)</th><th scope=\"col\">Result</th><th scope=\"col\"><abbr title=\"Reference(s)\">Ref.</abbr></th></tr><tr><td>2016</td><td><span>Streamy Awards</span></td><td>Gaming</td><td>Critical Role</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td>2018</td><td>Streamy Awards</td><td>Live Streamer</td><td>Critical Role</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"4\">2019</td><td rowspan=\"2\"><span class=\"mw-redirect\">Webby Awards</span></td><td rowspan=\"2\">Video Series &amp; Channels – Games</td><td rowspan=\"2\">Critical Role</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won (Webby Award)</td><td></td></tr><tr><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won (People's Voice)</td><td></td></tr><tr><td rowspan=\"2\"><span>Shorty Awards</span></td><td rowspan=\"2\">Games</td><td rowspan=\"2\">Critical Role</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Finalist</td><td></td></tr><tr><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won (Audience Honor)</td><td></td></tr><tr><td rowspan=\"3\">2022</td><td><span>The Streamer Awards</span></td><td>Best Role-Play Streamer</td><td>Critical Role</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"1\"></td></tr><tr><td rowspan=\"2\">Shorty Impact Awards</td><td>Best Influencer &amp; Celebrity Partnership</td><td rowspan=\"2\">Critical Role Foundation</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Pending</td><td></td></tr><tr><td>Best Fundraising Campaign</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Pending</td><td></td></tr></tbody></table><br/><h3>Licensed works and related products</h3><p>Critical Role's commercial success has led to many other related products, including a prequel comic series, art books, a novel, two campaign setting books (Critical Role: Tal'Dorei Campaign Setting and Explorer's Guide to Wildemount), and an animated series. Hobby and toy stores sell miniatures and other collectibles related to Critical Role.</p><br/><h3>Charity involvement</h3><p>On October 16, 2015, the Extra Life fundraiser episode raised over $20,000 for the Children's Miracle Network during the broadcast. This charity episode included a reappearance of the Critical Rejects, as well as three members of the Critical Role cast: Liam O'Brien, Marisha Ray, and Orion Acaba.</p><p>During the show, viewers are invited to donate money to 826LA, which is later provided in a lump sum to the charity. Donation amounts and messages appear live on the stream, and on earlier episodes, a list of donors was read at the end of each session. During Geek & Sundry's 2015 Extra Life fundraiser, a special interactive episode was broadcast. This episode alone brought in over $20,000 for the Children's Miracle Network, and the event as a whole raised over $76,000. In late November 2015, Geek & Sundry's Twitch channel held a special Doctors Without Borders fundraiser, with nearly half of the $10,000 goal being raised during the four-hour Critical Role broadcast. In December 2015, the cast released an article on Geek & Sundry, \"Critter's Guide to Critmas\", in response to the flood of gifts they were receiving from fans, asking them to instead donate to a variety of charities, with a different cast member sponsoring each charity.</p><p>In Spring 2018, the show held a charity drive for 826LA which resulted in community members donating over $50,000, with a matching amount given by one generous community member. The drive resulted in some prizes being unlocked for the community, such as discount codes for D&D Beyond and Wyrmwood Gaming, a second \"Fireside Chat\" with Mercer, and a second Honey Heist run by Ray.</p><h4>Critical Role Foundation</h4><p>Critical Role Productions launched a new 501(c)(3) nonprofit organization, Critical Role Foundation, in September 2020 with the mission statement: \"To leave the world better than we found it.\" Comic Book Resources reported that \"Critical Role Foundation will partner with other organizations in the nonprofit sector that share the same values as Critical Role and its community, in addition to raising emergency relief funds to be put toward immediate humanitarian aid as needed. Its inaugural partnership will be with First Nations Development Institute, which seeks to strengthen Native American economies and communities. CRF aims to raise $50,000 for First Nations, which will fund the Native Youth & Culture Fund for two initiatives over the course of one year.\"</p><br/>"
  },
  "errorMessage": ""
}