{
  "imDbId": "tt3671754",
  "title": "Kardes Payi",
  "fullTitle": "Kardes Payi (TV Series 2014–2015)",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "sardarandimeh",
      "userUrl": "https://www.imdb.com/user/ur60590142",
      "reviewLink": "https://www.imdb.com/review/rw4456715",
      "warningSpoilers": false,
      "date": "13 November 2018",
      "rate": "10",
      "helpful": "25 out of 28 found this helpful.",
      "title": "WTF !! Phenomenal - 10/10",
      "content": "Let me start by saying that i've watched each episode at least 5 times, there is an uncatchable tempo, non-stop jokes and outstanding performances from actors, the jokes are referred to both pop culture and intellectual subjects, it's partly absurd partly black comedy, and of course there is a story. i've never enjoyed any serie as much as this one, highly recommended"
    },
    {
      "username": "skyway3131",
      "userUrl": "https://www.imdb.com/user/ur29254639",
      "reviewLink": "https://www.imdb.com/review/rw3055376",
      "warningSpoilers": true,
      "date": "23 July 2014",
      "rate": "8",
      "helpful": "29 out of 46 found this helpful.",
      "title": "Meeting is over",
      "content": "We met Selcuk Aydemir with Calgi Cengi and Isler Gucler.They were great works.Selcuk Aydemir's works have a quality who you can't see very often.Because of that we all buried some bad thoughts about works.Before i criticize 2 things i want to write Kardes Payi is best show in Turkish televisions right now.1-Aydemir must give up glorifying violence almost every episode. There's no episode you ran a dialog like this: -oh how they beat me good i'm like reborn......2-Main characters problem M.Cemcir and A.Kural came to us as a inventor brothers.They got ideas like no physic professor can find.In the series we have no idea how this two guys could be scientists\\inventors.We didn't see them watching a documentary,we didn't see them reading a book or quoting from some science men in a conversation.Nothing!!They are typical unemployed neighborhood boys have suddenly an invention about ending oil problem on the earth plus save the environment.Probably they saw problem about that and after 10 episodes we learned they are not inventors they're just two guys who tries to improve they're father's invention by the way we learned after 10 episodes they're father was a retired physic professor.So I want to ask then why first 10 episodes they act like they've got an invention? plus even they're not inventors they must know great physics for improving invention. Finally i want to congrats Sinasi Yurtsever,Ali Ihsan Varol(one of my favorite guys),Berfu Ongoren,Ipek Yaylacioglu and Korhan Erduran from cast.If show still best in the Turkish TV.All crew must be thankful those 5 actors\\actresses."
    },
    {
      "username": "jack_o_hasanov_imdb",
      "userUrl": "https://www.imdb.com/user/ur55640799",
      "reviewLink": "https://www.imdb.com/review/rw7211593",
      "warningSpoilers": false,
      "date": "9 August 2021",
      "rate": "8",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Cool",
      "content": "It was a good series, I didn't like the last episodes very much, but after the \"Isler Gucler\" series, I was curious and watched it. I forgot, but a few of my friends still tell me the lines in the series."
    },
    {
      "username": "hakanakgog",
      "userUrl": "https://www.imdb.com/user/ur130200423",
      "reviewLink": "https://www.imdb.com/review/rw7932620",
      "warningSpoilers": false,
      "date": "9 March 2022",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Very goood",
      "content": "It was very good, I wish I could lose my memory and watch it again with Hilmi and Turgut Usta and Sezai comedy. Is there any downside? There was no season 1. Season 2 is a bit."
    },
    {
      "username": "CaliforniaRoll",
      "userUrl": "https://www.imdb.com/user/ur135932189",
      "reviewLink": "https://www.imdb.com/review/rw8162094",
      "warningSpoilers": false,
      "date": "21 May 2022",
      "rate": "5",
      "helpful": "0 out of 2 found this helpful.",
      "title": "As far as I remember",
      "content": "If you have time, you can watch. I remember it being a funny series that could be considered entertaining. It was funny when I watched it before I reached maturity, but I didn't need to watch it again to interpret it. I wish the parts played by Seda Minister had been kept shorter. I guess it's because I couldn't bear to watch \"Isler Gucler\" for more than 20 minutes."
    },
    {
      "username": "kaya_fatih1978",
      "userUrl": "https://www.imdb.com/user/ur43588446",
      "reviewLink": "https://www.imdb.com/review/rw8226727",
      "warningSpoilers": false,
      "date": "11 June 2022",
      "rate": "9",
      "helpful": "1 out of 2 found this helpful.",
      "title": "Happy for the watch series.",
      "content": "It's one of my rare favorite Turkish TV series. This may be one of the turning points in the history of Turkish TV series. The shooting quality of the series, the scenes, the effects were great. Thank you very much to everyone who contributed to the production. If you agree with my comment, you can like it."
    }
  ],
  "errorMessage": ""
}