{
  "imDbId": "tt4742876",
  "title": "TVF Pitchers",
  "fullTitle": "TVF Pitchers (TV Series 2015–2022)",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "ajit2106",
      "userUrl": "https://www.imdb.com/user/ur23650639",
      "reviewLink": "https://www.imdb.com/review/rw3308049",
      "warningSpoilers": false,
      "date": "30 August 2015",
      "rate": "9",
      "helpful": "49 out of 61 found this helpful.",
      "title": "\"Entrepreneurs\"- \"Indian men at Work\"-Kudos People. Tour-de- force",
      "content": "\"Pitchers\"- An inventive script, impeccable screenplay, true-to-life characters, splendid acting and humor at its best.Arnuabh Kumar started \"The Viral Fever\" on YouTube when he got rejected from MTV because their show was too intellectual. Now here he is, with \"Pitchers\", which is intellectual.Some IIT guys with a penchant for filmmaking started making small videos, and now they have reached a level where we can proudly say that they are encouraging everyone. Their satires on the social issues, politics, and everything bad in our country is commendable.\"Pitchers\" have taken the creativity to a whole new level, lovable characters and immaculate writing are the souls of it.Gives the feel of \"Entourage\".Kudos people, Keep it up."
    },
    {
      "username": "pal-gandharv",
      "userUrl": "https://www.imdb.com/user/ur52410950",
      "reviewLink": "https://www.imdb.com/review/rw8757992",
      "warningSpoilers": false,
      "date": "26 December 2022",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Pioneer of webseries culture in India, set a great example",
      "content": "Believe me, they started from where they left off in season 1. Probably the pioneer of webseries this has been but believe me that the team behind Pitchers has done a lot of homework to cover all the intricacies of startups. From beer to whiskey now, from the idea of a startup to running that startup now, these guys seem to reach a next level. Missing Jeetu for obvious reasons as he brings the desi pana of coders which I personally co-relate to. Baap of all Indian webseries. Claiming it confidently. With more than 7 or 8 years gap, they came with a nuclear bomb that isnt just gonna shake the new India but revolutionize the webseries department once again. All minds of TVF have come to one place and that is, Pitchers. A must must watch. 9.5/10. I can proudly say that this Indian silicon valley is way better than America's. And they have done it without Jeetu. Woh aayega to bhuchaal aa jayega kasam se. Wont give spoilers."
    },
    {
      "username": "dhruvchandra",
      "userUrl": "https://www.imdb.com/user/ur61064887",
      "reviewLink": "https://www.imdb.com/review/rw3271244",
      "warningSpoilers": false,
      "date": "20 June 2015",
      "rate": "10",
      "helpful": "104 out of 121 found this helpful.",
      "title": "Something refreshing..",
      "content": "Its one of the coolest TV series ever produced. Just love watching it. Keep it up guys..!! Its something i look forward to watch after my tiring day. It provides you with great fun and entertainment along with a crisp of events. A must watch for today's tech generation. It looks to be promising with excellent performances by its actors Very good directing skills to make it look authenticating and compare with day to day life. Naveen, Jitu, Yogi and Mandal ensure they don't make it look an over the top series. Hats off to TVF for coming up with such an interesting topic and projecting this concept as many people, especially Indian individual , are opting for this future and making it big. Well Done..Keep it up.."
    },
    {
      "username": "shashankapr",
      "userUrl": "https://www.imdb.com/user/ur57667904",
      "reviewLink": "https://www.imdb.com/review/rw3303548",
      "warningSpoilers": false,
      "date": "24 August 2015",
      "rate": "10",
      "helpful": "59 out of 68 found this helpful.",
      "title": "Inspiring and entertaining at the same time!",
      "content": "This is one of those rare things which relaxes a part of you by its entertainment (rather sensible, no nonsense entertainment) and awakens one part of you to think about what you are actually doing with your own life. Its funny, its serious, its inspiring, its REAL, its a 100 more things I can't describe. Personally, what I like most is the respect with which TVF Pitchers treats its audience. When I watch this series I feel good when they present such intelligent comedy and so REAL story line. Thank you TVF for NOT insulting your audience like Mainstream serials in India do and for NOT treating them as idiots who can not understand anything as Mainstream movies in India do. Keep it Up!!! And yes, please bring the finale episode soon man!:)"
    },
    {
      "username": "akshaydba",
      "userUrl": "https://www.imdb.com/user/ur61452793",
      "reviewLink": "https://www.imdb.com/review/rw3275364",
      "warningSpoilers": false,
      "date": "12 July 2015",
      "rate": "10",
      "helpful": "46 out of 53 found this helpful.",
      "title": "Must watch for everybody",
      "content": "Excellent attempt by TVF to capture the real life of IT professionals in India who are aspiring for startups. Direction is awesome and performances by all the actors do not make it boring experience.Frustration of IT employee is captured well and TVF team has made considerable efforts in making this a very authentic experience. Its treat for eyes and ears.I would love to watch this series and I am eagerly waiting for next episode. I would love to have such new plots coming even on television in India on youth channels like Bindaas or MTV etc.Thank you TVF for wonderful experience."
    },
    {
      "username": "namanbanaudha",
      "userUrl": "https://www.imdb.com/user/ur61600566",
      "reviewLink": "https://www.imdb.com/review/rw3290087",
      "warningSpoilers": false,
      "date": "3 August 2015",
      "rate": "10",
      "helpful": "69 out of 83 found this helpful.",
      "title": "Absolute Magic",
      "content": "I think to cut a long story short, India has the capability of making this kind of Serial, Fantastic Story line, Naveen Bansal Speech in 4th episode truly breath taking, Jitu and his dad add spark and at the same time that how much a child still cares of his father, yogi brilliant Comic timing!! A Must watch for all professionals.And not to forget the IIM guy Mandal, who looks so innocent and at the same time acting a backbone of for the whole team. One things that this serial has set apart that it has covered every genre that IT professional goes through from his college days to Career, they give themselves motivation to strive for the . Hats off to the Screenplay, each character has been portrait to absolute certainty. Way to go TVF, you guys are doing a magnificent job :)"
    },
    {
      "username": "apoorvaankur",
      "userUrl": "https://www.imdb.com/user/ur61879727",
      "reviewLink": "https://www.imdb.com/review/rw3290113",
      "warningSpoilers": false,
      "date": "3 August 2015",
      "rate": "10",
      "helpful": "73 out of 88 found this helpful.",
      "title": "Brilliant show, excellent performances",
      "content": "I will try to keep it short:1. Excellent dialogues- Well written and dialogues that are relevant to the audience go a long way in making this an excellent show. 2. Acting- Everyone excels in their roles. TVF has come a long way and this is a sleek product with top-notch performance (hat tip to Jeetu for his scenes with his father). 3. TVF- The hype surrounding TVF and their TV shows (a highly recommended \"Permanent Roommates\" included) is completely justified. Just like the character \"Naveen Bansal\" says about being fearless as a kid, TVF is just that even now and we as audiences benefit from that. 4. Entertainment- It is very easy to get preachy while dealing with subjects such as entrepreneurship (and end up being documentary like in tone) but TVF is true to its promise of delivering quality entertainment that is laced with acidic yet witty commentary about the malaise and issues surrounding entrepreneurship. 5. Production Value- The show looks very polished and the hard work TVF has put into making the show look absolutely realistic shows."
    },
    {
      "username": "bisalsinghnayal",
      "userUrl": "https://www.imdb.com/user/ur61940707",
      "reviewLink": "https://www.imdb.com/review/rw3292368",
      "warningSpoilers": false,
      "date": "6 August 2015",
      "rate": "10",
      "helpful": "49 out of 58 found this helpful.",
      "title": "Inspiring and Real...!!!",
      "content": "I have been a follower of TVF since their \"Permanent roommates\" series. You guys are nailing it down one by one...!!!. The best thing, majority of the Indian population is able to relate themselves to your series :). Many guys do wanna take the leap of faith with startups but they are afraid. Hope your series inspires us so that this fear of failure can be crushed.Acting: 10/10 Casting: 10/10 Editing: 10/10 Background score: 10/10 Dialogues: 7/10 (You could have kept it little less abusive :(, I wanted to show this series to older generations in my family who still think jobs in MNC and govt. jobs is what the Indian dream is. They are still not aware of the startup culture)Do share the background music/songs please. Please keep this series alive for a long time like the 2-3 seasons."
    },
    {
      "username": "lokesh_mogra",
      "userUrl": "https://www.imdb.com/user/ur62038507",
      "reviewLink": "https://www.imdb.com/review/rw3300113",
      "warningSpoilers": false,
      "date": "12 August 2015",
      "rate": "10",
      "helpful": "47 out of 59 found this helpful.",
      "title": "I am not sure if calling it amazing will be sufficient",
      "content": "Comic, Its so casual and real. Brilliant actors. The entire is so very Inspiring. I must have watched it what some 25 times each episode. Brilliant Job TVF, \"Yogi\" u are a comic master man, hast off. Naveens jury room explanation and the speech, was awesome. But the thing that makes me love it are the detailing. like brining the real startup founders to act in it, the bechdel test. The Box8 thing, u know when i opened Box8 site for curosity it was crawling for 5 minutes. Gary in his short stint was brilliant too. Mandal and Jitu are also amazing. And cherry on the cap was the entry of Biswapati Sarkar. I am a die hard fan of his comic timing, i love the chai-sutta cronicles. Waiting for the next episodes to come."
    },
    {
      "username": "aditya-kaul-ak",
      "userUrl": "https://www.imdb.com/user/ur35162898",
      "reviewLink": "https://www.imdb.com/review/rw3276878",
      "warningSpoilers": false,
      "date": "9 July 2015",
      "rate": "10",
      "helpful": "33 out of 43 found this helpful.",
      "title": "Refreshing series",
      "content": "i've been following TVF since quite long...they have always managed to come up with unique concepts and sketches, unlike qtiyapa, tech convo wid dad, permanent roommates, this is more intense and quite evolving one...each character is so well developed that it has that 'factor' that makes u think about the possibilities and again make u, as a viewer, relate with one's life...I wish u guys all the very best n yes, to the '#qutiyaguy...aka arunabh...i too wish to see this series on par or better than entourage...kudos guys!!!...n bisso..aka...biswapati sarkar...some one will definitely mention u as his/her inspiration for their start up!!! :)"
    },
    {
      "username": "devdenim",
      "userUrl": "https://www.imdb.com/user/ur131693893",
      "reviewLink": "https://www.imdb.com/review/rw6842614",
      "warningSpoilers": false,
      "date": "23 April 2021",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Watched after 6 years of release.. I wonder why..Awesome",
      "content": "Do yourself a favour .. watch this and appreciate true \"Content\". Then watch Kota Factory. Then wonder why you were not aware of TVF's free web series on YouTube. Then you will remember that you were off loaded with garbage from KJo Salman and entire Bollywood. Their marketing was so strong that these small timers tvf were lost somewhere.. even with 80 lakhs subscribers till date.Watch it."
    },
    {
      "username": "sudeep_ks",
      "userUrl": "https://www.imdb.com/user/ur18165561",
      "reviewLink": "https://www.imdb.com/review/rw8755421",
      "warningSpoilers": false,
      "date": "25 December 2022",
      "rate": "5",
      "helpful": "18 out of 27 found this helpful.",
      "title": "Season 2 feels like forced",
      "content": "In Season 2 this feels like the founder is just talking in air and giving quotes... absolutely no idea about the tech stack and Not sure what is his contribution...He just wants to make it big.. He is whiskey and he gets breaks... this is so not right at so many levels...The basic thing wrong about this is the audience has absolutely no idea * what is the product what they are pivoting * who is this prachi lady and how did she \"become the founder's friend\" *An entrepreneurs journey without knowing tech and just talking dialogues * With Lucky breaks and Angels in the investing world All this is so forced and looks like a forced merger of Silicon valley and Indian drama."
    },
    {
      "username": "sjcrap",
      "userUrl": "https://www.imdb.com/user/ur61293795",
      "reviewLink": "https://www.imdb.com/review/rw3271652",
      "warningSpoilers": false,
      "date": "3 July 2015",
      "rate": "9",
      "helpful": "50 out of 67 found this helpful.",
      "title": "Refreshing new show!",
      "content": "TVF Pitchers is an audacious attempt by TVF to make a sensible TV show in India. The theme of the story is one which majority of the IT and young people will relate to. The main difference about this show is its improved direction, better storyline, original music(No constant irritating background music) and decent dialogs. Also the actors fit the role and their acting is satisfactory. The storyline is interesting, comical and also realistic which is a rare find in the Indian television industry. The show however sometimes losses its focus and tries to overdo a little. Despite its little imperfections the series has begun well and is something I would definitely continue watching. Kudos to the makers for a daring attempt."
    },
    {
      "username": "Perspicuity1",
      "userUrl": "https://www.imdb.com/user/ur40349414",
      "reviewLink": "https://www.imdb.com/review/rw8822589",
      "warningSpoilers": false,
      "date": "24 January 2023",
      "rate": "9",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Season 2 - Strong comeback but not talking about the product was a bummer.",
      "content": "Seven years after it's first season came out, I didn't really know what to expect from the second season of Pitchers. The excitement generated by the first season had faded a long time back, a new creative team was handling this season and on top of everything, Jitendra Kumar was not going to be a part of the new season; as a consequence of all these reasons, I was more worried than happy for the return of Pitchers, but after having watched the new season, all my fears have been put to rest as the writers and directors have done a truly commendable job of taking forward the story. Of course there are some shortcomings, but the positives outweigh the negatives.If this season had disappointed us, then writers Prashant Kumar, Shubham Sharma and Talha Siddiqui would have been the fall guys, so keeping that in mind, all three of them deserve our appreciation because they managed to come up with five strong episodes. The writers have managed to expand the storyline in the most organic way possible and have crafted a screenplay that comes across as much more organized, realistic and polished. The writers have sprinkled a few nostalgic moments randomly to keep the essence of the previous season alive, but I am really glad that some extremely stupid and over the top scenes were avoided in this season, for example, Jitendra Kumar's scenes with his father were a bit difficult to believe in the first season; why would a married man sleep with his father and also get scared of moving out of the house without permission? The writers may not have talked about the kind of work 'Pragati. AI' does but have added a good dose of comedy and emotions in the screenplay, which is paced very well and remains engaging throughout the season.Abhay Mahajan and Arunabh Kumar were the heroes of this season, not only as actors but also as characters. In the first season, Abhay Mahajan's role was restricted to providing comic relief in every episode, but in this season the actor inside him flourishes beautifully. Abhay's nuanced portrayal of Saurabh Mandal gives a hint of the kind of brilliance this actor possesses. The return of Pitchers also marks the return of Arunabh Kumar into the field of acting and it was wonderful to see him play Yogi once again. This time Yogi was much more restrained and understated compared to last time but was fascinating to watch nevertheless. Even though Arunabh pretty much plays himself in this show, it's always amazing to see him deliver his dialogues, because he does it in a very effortless and natural way. Naveen Kasturia as Naveen Bansal was once again extremely believable, although I did not like his character that much. This team is the creation of Naveen but somehow he himself doesn't come across as a team player. By keeping things to himself, taking key decisions on his own, ignoring the co-founders of his company and pointing fingers at everyone when things go wrong, he has turned himself into pretty much the villain of this show and it does seem like things are only going to get worse in the next season. Sometimes I wonder what exactly Naveen's role in this company is; Yogi comes across as a much better motivator, Jitendra Maheshwari was the technical head and Saurabh Mandal works tirelessly as a manager and always comes across as the most sensible person in the room, but what does Naveen do ? What doesn't help matters is that we don't know what exactly their company does. It would really help if we knew what Naveen's vision is.The supporting actors and actresses have done a praiseworthy job as well in this season. Shreya Singh was extremely warm and endearing as Hina Rizwan; Abhishek Banerjee thankfully had more than two lines to deliver this season and was fantastic as Bhati. Sikander Kher had a small role but he made his presence felt; it's amazing to see the transformation he has had in the last few years because as far as I remember he was never considered a good actor. The presence of Gopal Dutt put a smile on my face, what an amazingly talented actor he is; it's always a joy to watch him on screen. Ronjini Chakraborty had very few scenes as Aprajita but she made them count, especially the one where she had an argument with Dungeon Master. Saad Bilgrami is an extremely gifted actor and I am glad he got the opportunity to act in this series; the length of his role as Pawan Putra may not have been much but one did get a glimpse of the talent that he has. Ashish Vidyarthi is a legend in the field of acting and it's beyond me to judge his performance; TVF should consider themselves fortunate that he agreed to be a part of their project. Riddhi Dogra was pretty good as Prachi Meena, a role clearly inspired from Monica in Silicon Valley (2014).Talking about the shortcomings of this season, the most critical one continues to be the lack of information about what exactly do our heroes do. What is their million dollar idea? What are they working on? What is the product that they have created? What kind of service do they plan to provide? What does their mobile application do? The first season worked fine because the focus was on the creators and their journey, but they shouldn't have repeated that in the second season as well. You won't get any kind of funding by saying that your team is capable of solving problems very well; that was a bit too much of generalization. Distraction and misdirection won't help them in hiding the elephant in the room. TVF is not making it easy for itself by delaying the product reveal so much; all they have to do is come up with a simple idea and then develop it further; they don't have to come up with a world changing idea, no one expects them to do so. There was a time when the idea of Pitchers was rejected by a television producer because he found it to be too intelligent for the viewers, and now Arunabh Kumar is making the same mistake of underestimating the intelligence level of the audience.The second major problem with this season was of course the absence of Jitendra Kumar. It's difficult to digest, that after all these years TVF decided to make the second season of Pitchers but could not manage to bring Jitendra Kumar on board. TVF knows what he brings to a show; it's just impossible for any other actor or character to step into his shoes. Throughout the season, they kept teasing that Jeetu might make an appearance at some point, but unfortunately it never happened. I just hope that Jitendra Kumar was busy filming the next season of Kota Factory or some other show, and he did not purposefully opt out of the show because he had lost interest, because that would be quite sad. Jitendra Kumar's absence was very much felt in this season and I really hope they bring him back in the next season.Why were the showrunners trying to link Kota Factory with Pitchers? They were hinting that Jitendra Kumar left the start-up and became a teacher in Kota, and Prachi Meena is the sister of Balmukund Meena, who happens to be the favourite student of Jitendra; but problem is that things don't add-up. In Kota Factory, Jitendra Kumar has been teaching for at least two years because that's how long he has been teaching Meena, but in Pitchers we were told that it's been 6 months since Jitendra left, and in those six months he met Meena, who used his application and is now apparently dead. Also, in Kota Factory Jitendra is named as Jitendra Kumar, while in Pitchers he is known as Jitendra Maheshwari. So quite clearly the showrunners haven't thought it through. I just hope they are not serious about this and this was just their way of giving the audience a hint that Jitendra Kumar could not be a part of Pitchers because he was busy filming the new season of Kota Factory.The music of this season is outstanding to say the least. It's beyond my understanding as to why Vaibhav Bundhoo hasn't made it big in the Indian Film Industry. Hindi Music Industry is running low on talent and yet a musician like Vaibhav, who composes one amazing song after another, hasn't been discovered by any producer! Music is a category in which TVF never goes wrong, and that streak continues with the new season of Pitchers. The background score and songs never feel out of place and beautifully enhance the emotions attached to the scene.I went into this season with no expectations but thoroughly enjoyed watching it. I really hope that the showrunners reveal everything about the product in the next season because they are really testing our patience now. Talking about other startups and throwing in inspirational quotes won't help them in hiding the elephant in the room, they will have to address this issue now."
    },
    {
      "username": "rahulwadhwani-52617",
      "userUrl": "https://www.imdb.com/user/ur74642884",
      "reviewLink": "https://www.imdb.com/review/rw6526178",
      "warningSpoilers": false,
      "date": "25 January 2021",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Inspiring, Motivational & Entertaining on the same time.",
      "content": "Wow! Just Outstanding concept! The way director present all the IT jobbers it was so exceptional. It was so entertaining. The dialogues are so reliable. Screenplay is so fantastic. All the actors specially lead 4 actors done their best. Definitely it will teach you the lesson of life. There are few dialogues which are the all time best one of this like jab Graduates apni 9 to 5 job se bore hote hai wo 3 hi chiz ki taraf jate hai. MBA, IAS ya Start up. The final Presentation scene was the highlight point of this series. A Must watch for every entrepreneur or normal person!"
    },
    {
      "username": "sunilcool-13293",
      "userUrl": "https://www.imdb.com/user/ur151681166",
      "reviewLink": "https://www.imdb.com/review/rw8751402",
      "warningSpoilers": false,
      "date": "23 December 2022",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Fantastic show by tvf team",
      "content": "Just finished watching season 2. And I must say the show had roller coaster of emotions which a founder go through during his struggle days. The chemistry between all the characters is still intact like seasons 1. Missed seeing jeetu in season 2. Great work from the creators. Thanks for making season 2. Naveen, mandal and Yogi rocked life before in the show. Lot of entrepreneurial lessons in same show. How much sacrifices and cost it needs to build owns dream. Everyone in the show deserves a great thanks who acted, supported and directed. Hope to see more seasons coming in future. It would recommend this show to everyone."
    },
    {
      "username": "swagato-61151",
      "userUrl": "https://www.imdb.com/user/ur106071196",
      "reviewLink": "https://www.imdb.com/review/rw8763380",
      "warningSpoilers": false,
      "date": "28 December 2022",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Interesting and Splendid one",
      "content": "This is my second series I am watching of TVF. 'Pitchers'. Will always remember and loved the dialogue, \"We are not Entrepreneurs, We are Pitchers\"... Must say, TVF have always kept their productions on a different level than other programs. Thanks to my friend for suggesting me to watch this lovely series. Season 3 must be released.I recommend everyone to watch 'Pitchers'. Seriously it will take you to whole new paradigm of fraternity and emotion. Loved such True-to-life characters and each and everyone have out-performed themselves. The series will show what a perfect team-work is. Tons of Love and Thanks to 'The Viral Fever' team for making such a splendid series."
    },
    {
      "username": "partholas",
      "userUrl": "https://www.imdb.com/user/ur26919814",
      "reviewLink": "https://www.imdb.com/review/rw3348760",
      "warningSpoilers": false,
      "date": "4 November 2015",
      "rate": "",
      "helpful": "5 out of 7 found this helpful.",
      "title": "Expected pure gold, came out with a diamond",
      "content": "Everyone told me to watch this series. Being a 17 year old boy in a world of innovations and start ups, for a few weeks, this was the talk of the town. This is the first time i watched an Indian TV series, and it is brilliant. The dialogues and jokes are simply perfect. Naveen and his friends represent the entire youth of India and we can connect to them perfectly. The storyline and jokes seemed to get better and better as the series progressed. Rocksolid critics might point out mistakes in the directing and acting, but the jovial mood created by the actors just steals the show. It's not only amusing, but also very inspiring. What is entrepreneurship? This question is answered in a very different way through this show.Keep it up!Can't wait for season 2 to come out"
    },
    {
      "username": "KrazzyDJ",
      "userUrl": "https://www.imdb.com/user/ur22268559",
      "reviewLink": "https://www.imdb.com/review/rw3311084",
      "warningSpoilers": false,
      "date": "5 September 2015",
      "rate": "9",
      "helpful": "4 out of 6 found this helpful.",
      "title": "Pitcher Perfect !!!",
      "content": "I had only just heard of TVF. I knew they were into making spoof videos. I wasn't aware of what Pitchers is. Or the fact that there was a Permanent Roommates before it.And then, one morning, I woke up to a post on Facebook. I do not remember whether it was a news article or a post share. All I remember is the content: TVF Pitchers had secured a spot on IMDb's Top 250 TV Shows.At first I was surprised. When did IMDb start a Top 250 for TV Shows. Even more surprising was the thought that if Pitchers had a place here, then it wasn't a spoof video. It was much more. What was it ? I searched, read and quickly realized what it was; a dream of millions of youngsters waiting to be realized that had come into fruition. And suddenly I saw the possibilities; no longer would we have to wait eagerly for the next season of The Big Bang Theory to begin or no longer would we have to wait for Season 3 of Silicon Valley to start. We could have our own. Indian shows, at par with their American counterparts, using Indian history, culture, memes, jokes and situations Indians could identify with.I set myself up to watch this. But then I thought, following chronology would be better. And so I started, not with Pitchers but with Permanent Roommates. Saw all 5 episodes and quickly realized, yes, the doors have opened. Of course, the Indian version of 24 had proved it. But this solidified it. The possibilities were now endless.Then I started watching Pitchers. I started with the first episode. In the first 10 minutes ending with the show's opening (the gang of four walking into a bar), it was already a winner. The production values, cinematography, the catchy opening intro, writing, the analogy with beer (brilliant piece of writing), flawlessly smooth editing, it was all there. Right there. And all in the first 10 minutes.I thought maybe it'll lose its first episode charm. I was wrong. With each passing episode came sequences and situations that were not only believable and highly identifiable but situations that you actually felt with, connected with and reacted with. From Naveen's speech, to the frustrated software engineer Jeetu's outburst, you not only feel every moment but feel like applauding and clapping with them.There will be a Permanent Roommates Season 2. There will be a Pitchers, Season 2. There will be more shows. But there can be much more. There can be short films. There can be full fledged 2 hour internet movies (at Hollywood Standards so that we can bid Bollywood goodbye). There can even be a TVF's dedicated channel (if the government allows it that is).But most importantly, this is the beer for all content that will follow. This is it; this is the spark we all needed to realize that yes, its possible. We don't need TV channels, huge production budgets, lots and lots of crew members to make it happen. We need dedication. And with Pitchers, we've seen that dedication. We've seen that quality. More inspiring than its story-line of four friends creating is a startup, is the fact that TVF created Pitchers.Hopefully, Pitchers inspires people to create. If not a startup, then perhaps several shows that will take Indian entertainment several steps forward. Of course we have Permanent Roommates. And we have Office Office. And the Indian version of 24 (if at all there are more seasons). And we will always have several other shows. But then, maybe in the distant future, Pitchers will be remembered as the show that started it all. Or the one that changed it all for India.And this, I feel, is why Pitchers deserves a watch. At least once !!!"
    },
    {
      "username": "himamlai",
      "userUrl": "https://www.imdb.com/user/ur131352982",
      "reviewLink": "https://www.imdb.com/review/rw8757377",
      "warningSpoilers": false,
      "date": "26 December 2022",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Season 2 of TVF Pitchers is awesome series.",
      "content": "Arunabh kumar is a genius. The real world of start-up has been shown in a crystal clear way. I had tears in my eyes while seeing these episodes. I also loved the role of Mandal. He is definitely one of the most important pillar of team Pragati. Naveen has also justified his role in a very realistic way. Special kudos to Bhati Saab, Is there any role which you cannot play? He did a fantastic job. All the TVF team is doing a great job in OTT industry. I wish you good luck. Keep up the good work, I will keep watching all of your shows for sure. You guys are the future of Indian cinema. Congratulations!"
    },
    {
      "username": "bhatt-parantap",
      "userUrl": "https://www.imdb.com/user/ur54042325",
      "reviewLink": "https://www.imdb.com/review/rw3356342",
      "warningSpoilers": false,
      "date": "16 November 2015",
      "rate": "8",
      "helpful": "7 out of 12 found this helpful.",
      "title": "Simply put- e^x (Exponential Rise) but slightly overrated",
      "content": "The exponential rise of the online content in India owes it to TVF in delivering impeccable quality in material, production value and performance. Complimenting the rise of The Viral Fever Media Labs, TVF Pitchers starts with a good note and ends on a summit. Personally, I felt the pilot fair enough, not exceptional, to represent the changing dimensions of content coming from frustrated(at the banality that is passed off as prime time entertainment) intelligentsia, but as the series unfolded they rose above my expectations and delivered a spectacle of pristine content backed by wonderful performances. There are a few technical jargon that the rising crop of Engineers can relate to, clearly depicting a huge chunk of the TVF fan-base. The series portrays the dilemma of an IT professional trying to build a company in an atmosphere of adversities, unlike Silicon Valley(both the show and the region), in a place where stability is valued higher than taking a risk. Humor is ingrained in the plot and situation, extremely well written, which portrays a paradigm shift in the thinking of modern professionals still preserving the values of their homeland that is dear to them. The paradox of a cosmopolitan yet traditional values trying to amalgamate is portrayed brilliantly. Performances are honest and natural which seem effortless in execution, a remarkable feat.As one can see its entire viewership comes from the people hailing from the Indian subcontinent, who shared similar cultural understanding. I'm not sure about the international community that is unaware of the colloquial slang would find the same punch in the series as Indians do, moreover, the cultural differences and restraints in Indian middle class are different than the first world, but they sure can appreciate a good content when they see one.I agree on the point that since it is the best that came out of this subcontinent doesn't mean it's not overrated by enthusiastic fans(including myself) and the sheer population of Indian users on IMDb. I admire the series, as I was able to relate to it and found it worthy. Objectively, I'd say there is more to be expected of Arunabh and in time, I'm sure TVF will deliver content that will be on par with HBO, hopefully better, as TVF wishes, but for now, the Top 250 rank is overrated. My dilemma is, I liked it very much but am I being objective in negating the series or is it that the general notion of average grade content from India makes people feel that Pitchers can't be \"that\" good."
    },
    {
      "username": "Puroo",
      "userUrl": "https://www.imdb.com/user/ur120321993",
      "reviewLink": "https://www.imdb.com/review/rw7301813",
      "warningSpoilers": false,
      "date": "3 September 2021",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "The first thing that comes to my mind when I think of TVF",
      "content": "Back when this web series came everyone in my school and coaching centre were going crazy. Me being me, was only interested in studies plus I had a feature phone so I didn't watch it back then. Plus its name didn't appeal me either (pitcher, seriously? What's this show about, pottery?). So finally when I got a phone and I didn't have money to get an actual streaming service, I decided to download TVF Play and watch this over there. And I do have to admit, this is the best web series on the entire platform. In fact it's the first thing I think of when someone says TVF.Pitchers is a show about a couple of friends doing a start-up. It's just like how all of us think about doing one with our friends, except these ones actually did it. From what I perceive from the beginning of the first episode, we really feel terrible when we see someone else being successful in something we wanted to be successful. And the way the man gave the example of beer and the protagonist changed it to coffee while completely ruining it was very funny and relatable. Even I end up speaking things I expect people will react strongly to but see no one cares.The acting, story, music, everything about it is pretty solid. Even though I don't remember the names of all the characters, I do remember what each person was like. The whole idea of tossing a coin and deciding what we want was actually pretty good. Arunabh Kumar's character (I don't remember his name) was actually pretty annoying when he started scolding the Champu guy. I was actually feeling very bad for him, even though he was the one who ruined everything. Gopal Das also taught us the right way of giving someone an invitation card, something I will always remember.Normally I use web series to talk about TVF quality shows which don't have any lighting, rendering, good cinematography, or that feel of watching something expensive; and I use TV show to talk about those serials which do. Basically web series is what I call those which feel like a YouTube video. It does not mean it's a bad thing, considering they gave us this for free, unlike most other streaming services which keep it paid. Also since this is the first of its kind and existed even before the Indian OTT shows came up, so there was no way they could have thought about this.TVF Pitchers is the foundation of all the web series that other TVF Originals have been following. Judging by this one can easily understand how much cultural impact this web series had. It is the reason why so many people got attracted to a new hobby and shall continue to get on in the future."
    },
    {
      "username": "faisalfaves",
      "userUrl": "https://www.imdb.com/user/ur48691639",
      "reviewLink": "https://www.imdb.com/review/rw4235974",
      "warningSpoilers": false,
      "date": "12 July 2018",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Low Budget but Best Series.",
      "content": "I loved it, believe now India is coming forward. Recently another show came \"Sacred Games\" Amazing. Just Watch this and that too."
    },
    {
      "username": "Quirk47",
      "userUrl": "https://www.imdb.com/user/ur108585036",
      "reviewLink": "https://www.imdb.com/review/rw5851225",
      "warningSpoilers": false,
      "date": "24 June 2020",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Success",
      "content": "To achieve succes one should do hardwork. Face the challenges. Don't give up. Pitchers is not about Achivement. Its about friendship ,love ,Family , growth.Some scenes are just excellent ..how do they get idea like this A departmental store scene b/w Naveen and his lover. Jeethu's wife explanation to her father in law about startup. Saurabh's presentation and following scenes with him There r many like this ..if u watch u can get more. Watch it if u r Comprising in life. Atleast u will get a satisfied"
    },
    {
      "username": "omnipresent-42657",
      "userUrl": "https://www.imdb.com/user/ur62404007",
      "reviewLink": "https://www.imdb.com/review/rw3308572",
      "warningSpoilers": true,
      "date": "31 August 2015",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "very refreshing",
      "content": "we love anything from TVF. we have been following from the very beginning . The actors ,the reality connection to every youth in India. The IT life, frustrated young generation to find their passion but yet connected to the roots of Indian cutler the father son relation, arranged marriage working out are shown well. The general Indian men thinking of wife not getting the job my husband has been showing the TVF videos to all the guest. Even friends as if we are the brand ambassador's of the show. good direction. good story and characterization. The final episode was too good. The college students acting was little unnatural though."
    }
  ],
  "errorMessage": ""
}