{
  "imDbId": "tt3526078",
  "title": "Schitt's Creek",
  "fullTitle": "Schitt's Creek (TV Series 2015–2020)",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "misscharlietaylor",
      "userUrl": "https://www.imdb.com/user/ur54953233",
      "reviewLink": "https://www.imdb.com/review/rw6300852",
      "warningSpoilers": false,
      "date": "22 November 2020",
      "rate": "10",
      "helpful": "208 out of 218 found this helpful.",
      "title": "Stick with it, and you fall in love with the characters",
      "content": "I must admit to really struggling to get into this show in the beginning. After Season 1, I couldn't work out why the reviews were so good, I just wasn't finding it that funny, and wasn't keen on the characters, but I knew I had to keep watching. I think the mistake I made was expecting it to be as laugh out loud as something like Modern Family for example. With Catherine O'Hara and Eugene Levy who have made me laugh so much with things like Best In Show and a Mighty Wind I was expecting the same thing. But then it just clicked, subtle jokes, characters that become more and more lovable each episode, and really touching moments which have made me shed a tear on more than one occasion. By season five I was feeling sad that there was only going to be one more season after this. This is so well written, and the first time I've seen Dan Levy in anything, and he is just brilliant. If you're thinking of switching off, don't, keep going!"
    },
    {
      "username": "backofthevan",
      "userUrl": "https://www.imdb.com/user/ur4947500",
      "reviewLink": "https://www.imdb.com/review/rw5092578",
      "warningSpoilers": false,
      "date": "1 September 2019",
      "rate": "10",
      "helpful": "187 out of 213 found this helpful.",
      "title": "A granny crushing on David Rose! :)",
      "content": "I'm one of the many who, I admit, expected absolutely nothing from a show called Schitt's Creek, so never bothered to even have a look in. Well, I'm here to say I have never been more wrong about a television program!Absolutely love this, and I feel sorry for those who don't get the abundant clever-but-subtle humour that has obviously gone straight over their heads and caused them to leave bitter, whining, negative reviews. Too bad for them, but it's their loss.Schitt's Creek grew on me episode by episode, so much so that I binge-watched the first 4 seasons on Netflix over a weekend! Once in, I couldn't leave! It just gets better and better and I didn't want it to end. I am now watching series 5 and will be awaiting the sadly final series come January 2020 (I hope).I read too many negative reviews from people whining about CBC nepotism and the fact that Dan Levy got a job on this show through his father, so please take note: Dan Levy is the creator of Schitt's Creek, so it could be said he gave his father this job. Together they put this show together, and by bothering to read the credits it's clear that Dan wrote and directed (I think) many of the episodes.On top of that, he plays David brilliantly! His sweetness, fashion obsession, insecurity, need for approval and wit are so cleverly played. People complaining about Dan Levy and his facial expressions: Hello! Those are part of his brilliant performance as David. All the characters express so much with just a glance, an eyebrow twitch or the sardonic curl of a lip -- words aren't even necessary with actors this accomplished! Daniel Levy: you have brought joy to my heart with your writing and portrayal of David Rose!Alexis Rose is annoying, dreadfully so at first. But she learns, she evolves, she grows as time passes. As does David. They are very believable as brother and sister, even sometimes displaying similar mannerisms and expressions. Such clever writing, acting and directing.I have laughed out loud watching Schitt's Creek. I have felt delighted, annoyed, surprised, cringey, charmed and deeply touched. Season 4 episodes Open Mic and The Olive Branch brought tears to my eyes. \"That\" scene in Olive Branch I have rewatched about a dozen times and will watch again and again. (Avoiding spoilers here so not saying more than that.)David Rose. I just want to put my arms around him, give him a big hug, tell him he's beautiful and good and right and that everything will be okay.Love, love, love Schitt's Creek. Love the humour, the satire, the subtle jokes and the big, fat broad ones, and most of all I love the love. It's a beauty!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8576178",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "8",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Pretty Funny!",
      "content": "I've heard nothing but great things about Schitt's Creek for years but I still put off watching it for some reason. After reading the great reviews and ratings I finally gave in and watched it and so glad that I did because I absolutely loved it. It's just a flat out funny show, nothing really more to say than that. While it's not one of my favorite sitcoms ever it's still really funny and definitely worth watching. It's about a family the had more money than they knew what to do with but then lost it all over night. The only thing they retained was a small hillbilly town and they had to move there and the difference between their previous world and the world they live in now is what makes this so funny. There's a reason this show won so many awards and that's because it's freaking hilarious! Give it a chance and I promise you'll like it, it just might take a few episodes."
    },
    {
      "username": "vivlet",
      "userUrl": "https://www.imdb.com/user/ur15101096",
      "reviewLink": "https://www.imdb.com/review/rw4888476",
      "warningSpoilers": false,
      "date": "26 May 2019",
      "rate": "10",
      "helpful": "94 out of 110 found this helpful.",
      "title": "I grew to love every single character",
      "content": "With a title like \"Schitt's Creek\" you'd think that this show would be full of nothing but crass jokes. That couldn't be further from the truth. It's full of heart, and somehow this snobby, annoying rich family grows on you more and more with each episode. By the end of Season 4 I had tears dripping down my face because of how these characters have found love through immense personal growth. My favs are David and Moira, but even though I found Alexis mostly annoying, I grew to love even her in the end.I'm so glad I had this recommended to me by friends who insisted I watch it, because I never watch these types of sitcoms otherwise.Thank you Dan Levy for coming up with this concept! I listened to him talk about the development of this show through a podcast and I have to say, I hope he writes more shows in the future."
    },
    {
      "username": "lizs1289",
      "userUrl": "https://www.imdb.com/user/ur58600739",
      "reviewLink": "https://www.imdb.com/review/rw4704056",
      "warningSpoilers": false,
      "date": "7 March 2019",
      "rate": "10",
      "helpful": "91 out of 112 found this helpful.",
      "title": "Brilliant!",
      "content": "I love this show. I was given the heads up by the UK tv/radio listings magazine Radio Times, of all things. Fortunately, Netflix was gifted to us and we thought we'd give it a try. Well, once my other half and I started watching, we couldn't stop. We've watched 4 seasons in about 3 weeks or so. This should give some idea of how good this show is. The draw was the wonderful Eugene Levy but the other cast members are absolutely perfect, especially Dan Levy and his fabulous character David. I just love the way some of the cast appear to be desperate to giggle at some points, indicating to me they are having a ball. Great writing and performances. Must also mention Catherine O'Hara and the clothes and wigs! I hope Netflix show season 5 soon. Withdrawal symptoms have set in already! ,"
    },
    {
      "username": "stormslinger",
      "userUrl": "https://www.imdb.com/user/ur94811060",
      "reviewLink": "https://www.imdb.com/review/rw6444337",
      "warningSpoilers": false,
      "date": "4 January 2021",
      "rate": "10",
      "helpful": "68 out of 76 found this helpful.",
      "title": "One of the most SUPRISING shows ever!",
      "content": "I had skipped over this show several times and have heard people raving about this show. My wife and I started watching this over the New Years weekend and have to say....WOW. This show is amazing! The writing is absolutely brilliant, the casting is perfect and I haven't found an episode yet (halfway through season 4) that I haven't laughed in. The old Riches to Rags storyline works brilliantly because at first, the Rose's are disgusted by everything. Throughout the show, they discover new selves after opening up to the town, it's people and the support of the community only seen in small town life. They all grow from their experiences on the show and they become such a lovable family.The humor in this show is sublime. It is well-timed, sarcastic, dark and hysterical. David Rose (dan Levy) is the character that steals the show for me. His facial expressions, retorts and self awareness makes for an absolute riot of a time!Listen to the reviews on this show and give it a chance...It definitely will not leave you \"Up Schitt's Creek\"!!"
    },
    {
      "username": "jlieske-85601",
      "userUrl": "https://www.imdb.com/user/ur98841389",
      "reviewLink": "https://www.imdb.com/review/rw4720495",
      "warningSpoilers": true,
      "date": "13 March 2019",
      "rate": "10",
      "helpful": "82 out of 99 found this helpful.",
      "title": "Love this show so much",
      "content": "This show is so enjoyable to watch. The acting is something else and really gives the show some spunk. All the characters in the town are so weird and unique in their own way. It is amazing seeing a wealthy family blend with the people of Schitt's Creek. The facial expressions and voices of the entire rose family makes me laugh every time. I also absolutely love the sarcasm from Stevie, as she continues to encourage the stuck up attitude of the entire Rose family. Very good show for laughing and casual viewing!"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7676515",
      "warningSpoilers": false,
      "date": "24 December 2021",
      "rate": "8",
      "helpful": "20 out of 24 found this helpful.",
      "title": "Won so many awards for a reason!",
      "content": "I've heard nothing but great things about Schitt's Creek for years but still put off watching it for some reason. I finally gave in and watched it and absolutely loved it. It's just such a flat out funny show, nothing really more to say than that. There's a reason this show won so many awards and that's because it's freaking hilarious! Give it a chance and I promise you'll like it, it just might take a few episodes!"
    },
    {
      "username": "CubsandCulture",
      "userUrl": "https://www.imdb.com/user/ur83822756",
      "reviewLink": "https://www.imdb.com/review/rw7640975",
      "warningSpoilers": true,
      "date": "13 December 2021",
      "rate": "10",
      "helpful": "16 out of 19 found this helpful.",
      "title": "David and Patrick are a couple for the ages-they are the crown jewel of this great show",
      "content": "There is a lot to love about this show but to me it is an all time great show because of the love story between men that is the emotional core of the back half of the series. Dan Levy-as actor, writer, director-really manages to tell a lovely, funny love story between men without any drama about societal homophobia. Even the coming out episode is devoid of the common dealing with homophobia tropes that crop up in mainstream LGBT content. It is such a refreshing creative decision to ground such a love story in a world better than our own. Schitt's Creek is a grounded fantasia on this point. The writing of Patrick, David is very authentic while not getting dark; there's not even a hint of tragedy. The relationship plays like a bunch of other sit com couples over the years. Their foibles are human foibles, not gay men's foibles. (For the most part, there's just enough specific dynamics between men to be authentic) And Noah Reid is the perfect performer to play off of Dan Levy.As I said the series has a lot of other virtues. The Alexis-Ted storyline is both very funny and ends up in a different-but proper-place than you would have expected. There is a poignancy to bittersweet love story that doesn't work out but in such a way both characters end up in better places. Alexis' character growth is as well realized as David's and the conclusion of both their stories complement each other very well.Indeed, I could go through every character and storyline; the show on the whole is exceptionally well considered. It may have a fish-out-of-water set-up of any number of other sit coms but it ends up being a compelling story of a family finding their best selves. It's also a celebration of small town life-something we need more of. In a lot of ways the show's heart is quintessentially Canadian. (The show could have taken place in the States and only a few passing references to curling and form of gov't set it in Canada)And of course Eugene Levy and Catherine O'Hara are their delightful selves. I maintain that Mitch & Mickey in A Mighty Wind (2003) are their best performances but the Roses are extremely close second. There is a reason why these two keep working together. It is wonderful to see two of their characters go through so much.Technically the show is surprisingly polished for its budget. It's amazing how much wardrobe mileage they got for Moriah not to mention Alexis and David. (Hell Moriah's wigs alone!) There show manages to keep the visuals fresh. There is a classical assured visual construction throughout the series.This is everything a sit-com should be. It is laugh out loud funny with most of the humor being deeply rooted in characterization. It shows a world like own but far better. It has dramatically compelling storylines that don't sacrifice laughs for believability and vice versa. And above all a cast and a set of characters that are impossible to not love."
    },
    {
      "username": "Caribtony",
      "userUrl": "https://www.imdb.com/user/ur42049044",
      "reviewLink": "https://www.imdb.com/review/rw8421279",
      "warningSpoilers": false,
      "date": "10 August 2022",
      "rate": "10",
      "helpful": "13 out of 14 found this helpful.",
      "title": "Even better watching the second time around!",
      "content": "Like some, the name seemed to \"punny' (as Ted would say) to be good. The first two seasons more or less introduces characters of the show and we are taught and learn their idiocincracies. The plot lines are funny, and we get into the twists and turns of the setting and characters. By season 3 we are ready for story arcs and boy do they deliver! I've watched this series more than once, yet still the last two episodes leaves me an emotional wreck - bawling my eyes out and laughing at the same time! It's no surprise that the last season won so many Emmys and other awards. Highly recommend! Word of warning: you will get addicted to David and Alexis's twitches and gestures....."
    },
    {
      "username": "haoweenie",
      "userUrl": "https://www.imdb.com/user/ur23107104",
      "reviewLink": "https://www.imdb.com/review/rw4745259",
      "warningSpoilers": false,
      "date": "26 March 2019",
      "rate": "9",
      "helpful": "188 out of 217 found this helpful.",
      "title": "It grows on you!",
      "content": "I had a hard time getting into it with the first couple episodes, but after learning about the characters it really gets good. I really enjoy it a lot. It's just a fun show to binge!! And Dan Levy (David)makes the show!!!"
    },
    {
      "username": "samanthapalmese",
      "userUrl": "https://www.imdb.com/user/ur126681687",
      "reviewLink": "https://www.imdb.com/review/rw6334474",
      "warningSpoilers": false,
      "date": "4 December 2020",
      "rate": "9",
      "helpful": "29 out of 34 found this helpful.",
      "title": "I love this show!!!",
      "content": "The first season or two I didn't like this show that much. I thought nothing happened in the plot and it wasn't that funny. Season 3 and on I was obsessed with the show and I'm now rewatching. I think ANYONE could watch this show and enjoy it, just give it time. It's so funny and even better on a rewatch. The peak in my opinion is the Cabaret storyline in season five. I'm a huge theatre nerd and seeing theatre really help someone gain confidence made me soooo happy. Additionally, the character Alexis has some of the best character growth I've ever seen on tv. Everyone in the show is phenomenal and there's not an episode that I don't like. Schitts Creek is simply the best!!!"
    },
    {
      "username": "henryllama",
      "userUrl": "https://www.imdb.com/user/ur101376107",
      "reviewLink": "https://www.imdb.com/review/rw4766381",
      "warningSpoilers": false,
      "date": "7 April 2019",
      "rate": "10",
      "helpful": "81 out of 101 found this helpful.",
      "title": "almost TOO funny",
      "content": "Amazingly good series--LOVE all the actors in it!! but Eugene & Daniel Levy steal the series...with their humor & eyebrows...greatest series I've seen in a LONG while!! THE BEST SERIES ON TV!!"
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw6080583",
      "warningSpoilers": false,
      "date": "10 September 2020",
      "rate": "10",
      "helpful": "25 out of 35 found this helpful.",
      "title": "Mark my words: whenever Eugene Levy and Catherine O'Hara collaborate, you're in for something good",
      "content": "Eugene Levy and Catherine O'Hara have co-starred in a couple of Christopher Guest's mockumentaries, always doing a great job. They now get to star on a TV series. \"Schitt's Creek\" casts them as a rich couple (with Dan Levy and Annie Murphy as their children) who suddenly lose everything and have to move to a podunk town that they purchased, forcing them to learn the ways of the hoi polloi. I think that this is the first Canadian series that I've watched consistently, and I love it. You're sure to love it also. Definitely check it out."
    },
    {
      "username": "Calicodreamin",
      "userUrl": "https://www.imdb.com/user/ur29385135",
      "reviewLink": "https://www.imdb.com/review/rw5619710",
      "warningSpoilers": false,
      "date": "8 April 2020",
      "rate": "10",
      "helpful": "25 out of 36 found this helpful.",
      "title": "Absolutely amazing",
      "content": "One of the best tv shows ever made. Absolutely hilarious one minute, then delightfully heartfelt the next. When you look up character development in the dictionary it says Schitts Creek. Watching these characters over the course of six seasons was a joy. The whole cast has undeniable chemistry that carries you through the show. One of the best written series ever, the storyline flows remarkably well for a comedy. A joy that will be missed."
    },
    {
      "username": "jacob-s-hicks",
      "userUrl": "https://www.imdb.com/user/ur38064266",
      "reviewLink": "https://www.imdb.com/review/rw4414989",
      "warningSpoilers": false,
      "date": "23 October 2018",
      "rate": "10",
      "helpful": "316 out of 355 found this helpful.",
      "title": "Hated the ads, finally watched it and fell in love.",
      "content": "Apparently not for everyone, but I can not get enough of it. I HATED the ads on Netflix, HATED!, but somehow I finally got around to watching an episode....instantly my new favourite show.Cast is stellar, offbeat quirky humour is my jam. Main cast and side characters fit so well together, people you don't need a laugh track to tell you when something is funny.The shared mannerisms between the Rose family are one of my favourite things about this show, you could almost believe they grew up around each other. Consistent story line, sweet heartfelt moments, genuinely funny at times, horribly cringey at others.As someone who has never reviewed anything before, (was it hard to tell?), I felt compelled to share my love for this show."
    },
    {
      "username": "kmichaels-06205",
      "userUrl": "https://www.imdb.com/user/ur105090094",
      "reviewLink": "https://www.imdb.com/review/rw4975102",
      "warningSpoilers": false,
      "date": "3 July 2019",
      "rate": "10",
      "helpful": "172 out of 201 found this helpful.",
      "title": "Simply the best!",
      "content": "\"Schitt's Creek\" is about love and humanity, told in an absolutely hilarious way. The show gets honest laughs and the characters become like family. It is simply one of the best comedies of all time. It is certainly THE most important comedy to have prominent LGBT characters (sorry \"Will and Grace\"). A must see. Creator/star Daniel Levy is a comedic wunderkind. With the show ending with its 6th season, I can't wait to see what he does next."
    },
    {
      "username": "kirstengrimbeek",
      "userUrl": "https://www.imdb.com/user/ur78996093",
      "reviewLink": "https://www.imdb.com/review/rw6464498",
      "warningSpoilers": false,
      "date": "11 January 2021",
      "rate": "10",
      "helpful": "26 out of 33 found this helpful.",
      "title": "Schitt's Creek is exactly what the world needs right now",
      "content": "This is easily one of my favourite tv shows of all time! I've just binge-watched the entire series! It's funny, heartwarming, deep...the perfect mix of everything that is life. I just can't get enough of it! It is a story about family, love, acceptance and embracing diversity...and can I just say that David's story is one of the most profound and beautiful love stories (not saying more on that as I don't want to give anything away ;-))! Watch it...please - it's what the world needs right now!"
    },
    {
      "username": "anon9999",
      "userUrl": "https://www.imdb.com/user/ur2208435",
      "reviewLink": "https://www.imdb.com/review/rw3174778",
      "warningSpoilers": false,
      "date": "1 February 2015",
      "rate": "10",
      "helpful": "348 out of 420 found this helpful.",
      "title": "A sweet, slow buzz; I love it!",
      "content": "A killer cast mixing vets with fresh faces, Schitt's Creek is a great new cable comedy (although it airs on network TV in Canada.) The cinematography and production design remind me of Shameless; the sharp writing and unique characters remind me of Silicon Valley. The slow and steady pace reminds me of the Christopher Guest movies that O'Hara and Levy were in. It's a rich pedigree indeed. And it doesn't disappoint. I was puzzled why so many people didn't like it initially, but I think I get it: with a title like that, some people must have been expecting something juvenile, and laugh-a-minute. Schitt's Creek is much much better than that.The confidence on the part of the filmmakers is evidenced by the lack of a laugh track, and further, the musical score is used sparingly. It can be hilariously funny, but what really hooks me is that it has a heart and a sweetness that other shows might be afraid to show. There are no characters in the show that are unlikeable. It favors character development over easy laughs, and it may take a while for people to catch on to it, but to me this is a sweet slow buzz, and I am addicted.Can't wait for more."
    },
    {
      "username": "mywakinglife01",
      "userUrl": "https://www.imdb.com/user/ur19978698",
      "reviewLink": "https://www.imdb.com/review/rw4697871",
      "warningSpoilers": false,
      "date": "4 March 2019",
      "rate": "10",
      "helpful": "33 out of 47 found this helpful.",
      "title": "Absolutely wonderful show",
      "content": "I hesitated watching this show because of the dumb name but I am so glad I finally did. Such hilarious characters who seem far fetched but are very relatable. This show has so much humor and heart that one second I'm cracking up and the next I get a lump in my throat. So well written and delightful to watch. I hope it goes on for more seasons it's truly a gem."
    },
    {
      "username": "bgar-80932",
      "userUrl": "https://www.imdb.com/user/ur77092838",
      "reviewLink": "https://www.imdb.com/review/rw6697702",
      "warningSpoilers": true,
      "date": "15 March 2021",
      "rate": "8",
      "helpful": "12 out of 17 found this helpful.",
      "title": "Grows on you",
      "content": "I didn't like it at first but stuck with it because my wife wanted to. The characters really grow on you and by the end I liked all of them. Alexis was probably my favorite but I see the appeal of all the main family and some of the side characters as well. Pretty good show. It's rarely laugh out loud funny but it's always ridiculous and you'll grow to like the cast for sure."
    },
    {
      "username": "pfeiffermcrae",
      "userUrl": "https://www.imdb.com/user/ur94332737",
      "reviewLink": "https://www.imdb.com/review/rw4418929",
      "warningSpoilers": false,
      "date": "25 October 2018",
      "rate": "10",
      "helpful": "349 out of 398 found this helpful.",
      "title": "Comedic Genius",
      "content": "I have yet to make it through an episode without laughing out loud and I'm already on Season 3 after finding this show two days ago. This is one of the best shows that I have ever stumbled upon. The characters are perfectly cast and each is relatable in their own way. I cannot say enough good things about this show. Plus, Stevie and David are officially my favorite TV duo of all time.Watch this show!!"
    },
    {
      "username": "amy317317",
      "userUrl": "https://www.imdb.com/user/ur30151790",
      "reviewLink": "https://www.imdb.com/review/rw8427075",
      "warningSpoilers": false,
      "date": "11 August 2022",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "A comedy classic",
      "content": "Unique, quirky, hilarious, a true classic with INSANELY talented actors. Anyone who doesn't love this show or \"get it\" as David would say, is a stupid loser with horrible taste."
    },
    {
      "username": "sammyfinlay-47537",
      "userUrl": "https://www.imdb.com/user/ur80459607",
      "reviewLink": "https://www.imdb.com/review/rw7668770",
      "warningSpoilers": false,
      "date": "21 December 2021",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "One of my favourite shows of all time",
      "content": "Funny, interesting and heartwarming. The growth of the characters is wonderful with you investing and attaching to them more and more each season. Honestly couldn't recommend it more. Be prepared to binge once you start."
    },
    {
      "username": "pavithranrbharath",
      "userUrl": "https://www.imdb.com/user/ur61431544",
      "reviewLink": "https://www.imdb.com/review/rw4840729",
      "warningSpoilers": false,
      "date": "10 May 2019",
      "rate": "10",
      "helpful": "50 out of 64 found this helpful.",
      "title": "Supremely Funny and Suprisingly Emotional",
      "content": "I was the most sceptical person going into the show but when the season progressed the characters got a great depth despite the quirky setup. The site is suprisingly Emotional that makes the characters much more relatable considering the situation they are in."
    }
  ],
  "errorMessage": ""
}