{
  "imDbId": "tt3526078",
  "title": "Schitt's Creek",
  "fullTitle": "Schitt's Creek (TV Series 2015–2020)",
  "type": "TVSeries",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "Schitt's Creek",
  "url": "https://en.wikipedia.org/wiki/Schitt%27s_Creek",
  "plotShort": {
    "plainText": "Schitt's Creek is a Canadian television sitcom created by Dan Levy and his father, Eugene Levy, that aired on CBC Television from 2015 to 2020. It consists of 80 episodes spread over six seasons. Produced by Not a Real Company Productions and the Canadian Broadcasting Corporation, it follows the trials and tribulations of the formerly wealthy Rose family. After their business manager embezzles the family business, Rose Video, the family loses its fortune and relocates to Schitt's Creek, a small town they once purchased as a joke. Now living in a motel, Johnny (Eugene Levy) and Moira (Catherine O'Hara)—along with their adult children, David (Dan Levy) and Alexis (Annie Murphy)—must adjust to life without wealth.\r\nThe series concept came from Dan Levy who wondered how wealthy families, as frequently depicted on American reality television, would react if they lost all their money. He developed the series with his father Eugene before pitching it to several Canadian and American networks. It was first sold to CBC Television in Canada and secured final funding to start production in its sale to Pop in the United States. Although limited in popularity for its first few seasons, its regional appearances on Netflix after its third season is credited for its rise in stature (the so named \"Netflix bump\") and a dynamic social media presence.\r\nSchitt's Creek received critical acclaim and garnered a cult following, particularly for its writing, humour and acting. It has won various accolades, including two ACTRA Awards and 18 Canadian Screen Awards. It is the first Canadian comedy series to be nominated for a Critics' Choice Television Award for Best Comedy Series. It also received two Screen Actors Guild Awards, including Outstanding Performance by an Ensemble in a Comedy Series and a total of 19 Primetime Emmy Award nominations, including Outstanding Comedy Series twice. It received 15 of these nominations for its sixth and final season, setting a record for most Emmy nominations for a comedy series's final season. For its portrayal of LGBTQ+ people, it received three nominations for a GLAAD Media Award for Outstanding Comedy Series, winning twice.\r\nAt the 72nd Primetime Emmy Awards, the series' final season swept all seven major comedy awards. It was the first time a comedy or drama series received all seven awards; Dan Levy notably received Outstanding Comedy Series, Writing and Directing for a Comedy Series (sharing the last with Andrew Cividino). It set records for winning all four major acting categories (Lead Actor/Actress and Supporting Actor/Actress) for O'Hara, Murphy and both Levys—a first for a comedy or drama series; for most Emmy wins by a comedy series in a single season (beating The Marvelous Mrs. Maisel's 2018 record), and for most Emmy nominations and wins by a comedy series in its final season.",
    "html": "<p>Schitt's Creek is a Canadian television sitcom created by Dan Levy and his father, Eugene Levy, that aired on CBC Television from 2015 to 2020. It consists of 80 episodes spread over six seasons. Produced by Not a Real Company Productions and the Canadian Broadcasting Corporation, it follows the trials and tribulations of the formerly wealthy Rose family. After their business manager embezzles the family business, Rose Video, the family loses its fortune and relocates to Schitt's Creek, a small town they once purchased as a joke. Now living in a motel, Johnny (Eugene Levy) and Moira (Catherine O'Hara)—along with their adult children, David (Dan Levy) and Alexis (Annie Murphy)—must adjust to life without wealth.</p><p>The series concept came from Dan Levy who wondered how wealthy families, as frequently depicted on American reality television, would react if they lost all their money. He developed the series with his father Eugene before pitching it to several Canadian and American networks. It was first sold to CBC Television in Canada and secured final funding to start production in its sale to Pop in the United States. Although limited in popularity for its first few seasons, its regional appearances on Netflix after its third season is credited for its rise in stature (the so named \"Netflix bump\") and a dynamic social media presence.</p><p>Schitt's Creek received critical acclaim and garnered a cult following, particularly for its writing, humour and acting. It has won various accolades, including two ACTRA Awards and 18 Canadian Screen Awards. It is the first Canadian comedy series to be nominated for a Critics' Choice Television Award for Best Comedy Series. It also received two Screen Actors Guild Awards, including Outstanding Performance by an Ensemble in a Comedy Series and a total of 19 Primetime Emmy Award nominations, including Outstanding Comedy Series twice. It received 15 of these nominations for its sixth and final season, setting a record for most Emmy nominations for a comedy series's final season. For its portrayal of LGBTQ+ people, it received three nominations for a GLAAD Media Award for Outstanding Comedy Series, winning twice.</p><p>At the 72nd Primetime Emmy Awards, the series' final season swept all seven major comedy awards. It was the first time a comedy or drama series received all seven awards; Dan Levy notably received Outstanding Comedy Series, Writing and Directing for a Comedy Series (sharing the last with Andrew Cividino). It set records for winning all four major acting categories (Lead Actor/Actress and Supporting Actor/Actress) for O'Hara, Murphy and both Levys—a first for a comedy or drama series; for most Emmy wins by a comedy series in a single season (beating The Marvelous Mrs. Maisel's 2018 record), and for most Emmy nominations and wins by a comedy series in its final season.</p>"
  },
  "plotFull": {
    "plainText": "Schitt's Creek is a Canadian television sitcom created by Dan Levy and his father, Eugene Levy, that aired on CBC Television from 2015 to 2020. It consists of 80 episodes spread over six seasons. Produced by Not a Real Company Productions and the Canadian Broadcasting Corporation, it follows the trials and tribulations of the formerly wealthy Rose family. After their business manager embezzles the family business, Rose Video, the family loses its fortune and relocates to Schitt's Creek, a small town they once purchased as a joke. Now living in a motel, Johnny (Eugene Levy) and Moira (Catherine O'Hara)—along with their adult children, David (Dan Levy) and Alexis (Annie Murphy)—must adjust to life without wealth.\r\nThe series concept came from Dan Levy who wondered how wealthy families, as frequently depicted on American reality television, would react if they lost all their money. He developed the series with his father Eugene before pitching it to several Canadian and American networks. It was first sold to CBC Television in Canada and secured final funding to start production in its sale to Pop in the United States. Although limited in popularity for its first few seasons, its regional appearances on Netflix after its third season is credited for its rise in stature (the so named \"Netflix bump\") and a dynamic social media presence.\r\nSchitt's Creek received critical acclaim and garnered a cult following, particularly for its writing, humour and acting. It has won various accolades, including two ACTRA Awards and 18 Canadian Screen Awards. It is the first Canadian comedy series to be nominated for a Critics' Choice Television Award for Best Comedy Series. It also received two Screen Actors Guild Awards, including Outstanding Performance by an Ensemble in a Comedy Series and a total of 19 Primetime Emmy Award nominations, including Outstanding Comedy Series twice. It received 15 of these nominations for its sixth and final season, setting a record for most Emmy nominations for a comedy series's final season. For its portrayal of LGBTQ+ people, it received three nominations for a GLAAD Media Award for Outstanding Comedy Series, winning twice.\r\nAt the 72nd Primetime Emmy Awards, the series' final season swept all seven major comedy awards. It was the first time a comedy or drama series received all seven awards; Dan Levy notably received Outstanding Comedy Series, Writing and Directing for a Comedy Series (sharing the last with Andrew Cividino). It set records for winning all four major acting categories (Lead Actor/Actress and Supporting Actor/Actress) for O'Hara, Murphy and both Levys—a first for a comedy or drama series; for most Emmy wins by a comedy series in a single season (beating The Marvelous Mrs. Maisel's 2018 record), and for most Emmy nominations and wins by a comedy series in its final season.\r\nSynopsis\r\nThe wealthy Rose family—video store magnate Johnny (Eugene Levy), his wife and former soap opera actress Moira (Catherine O'Hara), and their pampered adult children David (Dan Levy) and Alexis (Annie Murphy)—lose their fortune after being defrauded by their business manager. They rebuild their lives with their sole remaining asset: a small, remote town named Schitt's Creek, which Johnny bought for David's birthday in 1991 as a joke.\r\nThe Roses are forced to relocate to Schitt's Creek, moving into two adjacent rooms in a run-down motel. While the family adjusts to their new lives, their well-to-do attitudes conflict with the town's more provincial residents, including mayor Roland Schitt (Chris Elliott), his wife Jocelyn (Jenn Robertson) and their son Mutt (Tim Rozon), the motel's manager Stevie Budd (Emily Hampshire), town council members Ronnie Lee (Karen Robinson) and Bob Currie (John Hemphill), veterinarian Ted Mullens (Dustin Milligan), and Jazzagal member and Café Tropical waitress Twyla Sands (Sarah Levy).\r\nCast and characters\r\nEugene Levy as Johnny Rose, a former video store chain owner, generally the most levelheaded of the Rose family\r\nCatherine O'Hara as Moira Rose, the eccentric former star of the soap opera Sunrise Bay\r\nDaniel Levy as David Rose, the pretentious son of Johnny and Moira\r\nAnnie Murphy as Alexis Rose, the flighty socialite daughter of Johnny and Moira, who gets involved in a self-imposed love triangle with Ted and Mutt\r\nJennifer Robertson as Jocelyn Schitt, the mayor's down-to-earth wife and local schoolteacher\r\nEmily Hampshire as Stevie Budd, a sardonic clerk at the motel where the Roses reside, who becomes David's best friend and brief friend-with-benefits\r\nTim Rozon as Mutt Schitt (starring seasons 1–2; guest seasons 3–4), Roland and Jocelyn's provincial son and Alexis's love interest\r\nChris Elliott as Roland Schitt, the posturing, nosy, easily offended mayor\r\nDustin Milligan as Ted Mullens, the town's veterinarian and Alexis's love interest\r\nSarah Levy as Twyla Sands, the ditzy yet troubled Café Tropical waitress and later owner\r\nJohn Hemphill as Bob Currie, proprietor of Bob's Garage and a member of the town council\r\nKaren Robinson as Veronica \"Ronnie\" Lee, a member of the town council and a leading member of the Jazzagals who frequently butts heads with Patrick\r\nRizwan Manji as Ray Butani (starring seasons 2–6; recurring season 1), the town's only real estate agent and a former town council member, who has a variety of other businesses. Despite being born and raised in Winnipeg, Ray speaks with a non-standard Canadian accent.\r\nRobin Duke as Wendy Kurtz (starring season 2; guest season 5), dress shop owner and David's former employer\r\nSteve Lund as Jake (starring season 3; guest seasons 2, 4 and 6), a furniture maker and love interest for both David and Stevie\r\nNoah Reid as Patrick Brewer (starring seasons 3–6), David's business partner and later husband\r\nEpisodes\r\nDevelopment\r\nConception\r\nDan Levy came up with the idea for the show while watching reality television. \"I had been watching some reality TV at the time and was concentrating on what would happen if one of these wealthy families would lose everything. Would the Kardashians still be the Kardashians without their money?\" He turned to his father Eugene to help develop the show, who came up with the series title. Dan decided to make the location of Schitt's Creek vague, but has said that it is in Canada.\r\nThe premise of being forced to move to a town they once bought as a joke was inspired by actress Kim Basinger's $20 million purchase of the town of Braselton, Georgia in 1989. Eugene Levy said, \"My wife had an idea for a television show about boomers not having money or moving in with their kids. Their situation was described as being up sh–'s creek. It just made us laugh. Then my son Daniel came in with an article one day about an actress, Alec Baldwin's ex-wife (Basinger), who bought a town. She was hoping that film people would come to the town to use it as a location area and she lost a lot of money. The idea of wealthy people buying a town went back to the Schitt's Creek idea.\"\r\nThe Levys initially pitched the show to several networks in Canada and the United States. Cable networks HBO and Showtime passed on the series, while a broadcast network in America and the CBC in Canada expressed interest. The show was first sold to the CBC, but the Levys decided against major U.S. broadcasters after getting nervous about their reputation for creative interference. Schitt's Creek eventually found a U.S. home on Pop TV after striking a deal with network head Brad Schwartz, who had previously hired Dan on MTV Canada.\r\nDuring the early stages of development, various networks suggested the title of the show be changed to avoid the vulgar word. The Levys resisted these suggestions and argued \"Schitt\" was a legitimate last name. To prove their point, they brought pages copied from a phone book to the CBC showing listings for individuals with the \"Schitt\" surname. The CBC agreed and allowed the Levys to keep the original title.\r\nDan Levy initially envisioned the series ending with season five, but agreed to a sixth season after receiving a two-year renewal following the show's fourth season.\r\nCasting\r\nCatherine O'Hara was the series creators' first choice for the role of eccentric family matriarch, Moira Rose. O'Hara had previously worked with Eugene Levy on SCTV and several of Christopher Guest's films. She initially turned down Levy's offer to star, citing \"laziness\" and an aversion to long-term projects. Levy reached out to another (unnamed) actress, but continued to court O'Hara for the role. O'Hara eventually agreed to participate in the presentation pilot with no obligation to continue in the role after Schitt's Creek was ordered to series. After the show was picked up by the CBC, O'Hara agreed to continue in the role.\r\nAnnie Murphy was offered the role of spoiled socialite Alexis Rose after actress Abby Elliott was unable to continue due to scheduling conflicts. Murphy was on the verge of giving up on acting since she had not worked in over two years when she got an email inviting her to audition for the role. She first auditioned in Los Angeles, where Dan Levy said she stood out due to her \"wonderfully natural likability.\" Eugene Levy was unsure of Murphy's casting because she did not possess the blonde hair he had pictured for the role of Alexis. Murphy was subsequently called back for a second audition for a different role, sarcastic motel clerk Stevie Budd. After this audition, Dan Levy convinced his father that Murphy could dye her hair blonde, and she was officially cast as Alexis Rose.\r\nEmily Hampshire was cast as the deadpan motel clerk, Stevie Budd, after auditioning for the role in Los Angeles. She originally requested to submit a taped audition on account of her nerves and recurring hive breakouts. Hampshire ultimately agreed to audition in person, but states she has no recollection of the experience. According to Daniel Levy, who was present for the process, Hampshire gave a \"great\" audition, then proceeded to lift her shirt over her head to hide and slowly rocked back and forth. Levy later told Hampshire he found her audition \"charming\", and she was offered the part of Stevie.\r\nNoah Reid was offered the role of David's business partner and love interest, Patrick Brewer, in season three. Dan Levy was socially familiar with Reid and invited him to audition on the suggestion of Stacey Farber. Reid had never watched the show before he auditioned and was unsure how long the character would be a part of the series. Dan Levy was not present during the audition process and did not \"chemistry test\" with Reid before he was cast.\r\nOther cast regulars Chris Elliott and Sarah Levy were given the roles of Roland Schitt and Twyla Sands, respectively, without auditioning. Elliott says when Eugene Levy offered him the role of the town mayor, he thought, \"Why would I say no?\" Sarah Levy, the daughter of Eugene and sister of Dan, was asked to be a part of the show before it was fully developed. She says she was glad not to be cast as Alexis, as being out of her family's orbit on the show allowed her to \"do own thing.\"\r\nProduction\r\nSchitt's Creek is produced by Not a Real Company Productions in association with CBC and Pop TV. Pop TV joined the production team in season two after the series' first season was produced solely in association with CBC. ITV Studios Global Entertainment also partnered with the CBC and Pop to distribute the show worldwide. Eugene Levy, Dan Levy, Fred Levy (Eugene's brother), Andrew Barnsley, and Ben Feigin have served as executive producers throughout the show's entirety. Other executive producers have included writers Kevin White (seasons two and three) and David West Read (seasons five and six). Eugene Levy served as showrunner alongside co-creator and son, Dan Levy, during the series' first season; Dan Levy took over as sole showrunner beginning in season two.\r\nSchitt's Creek was part of a \"new direction\" in programming taken by both CBC and Pop TV during the 2014–15 television season. Premiering alongside 12 new primetime shows on CBC, the series represented one of the network's efforts to produce more \"serialized, scripted\" content, as well as more \"cable-like\" shows. The series was also the first original, scripted program to air on Pop TV after its re-branding in January 2015. Formerly known as TV Guide Network, Pop TV was re-branded as a channel \"filled with optimism, passion, funny and excitement\".\r\nFilming style and locations\r\nSchitt's Creek was filmed using a single camera set-up with no live audience or laugh track. The interior scenes for the first two seasons were filmed at Pinewood Toronto Studios in Port Lands area of Toronto, while interior scenes for season three were shot at Dufferin Gate Studios in (Etobicoke) Toronto. Interior scenes were also filmed at Revival Studios in (Leslieville) Toronto for an unknown number of seasons. The remainder of the series is filmed on location in Goodwood, the Regional Municipality of Durham in the Greater Toronto Area, Brantford and Mono, where the motel scenes are filmed. Goodwood was one of 30 towns scouted for the fictional location of Schitt's Creek before production of the series began in 2014. The Canadian Press wrote June 27, 2019 that Goodwood had become a \"tourist hot spot\" as filming for the current season concluded.\r\nThe series was filmed in several additional locations during its run. The opening shot of the first season features Lisa Vanderpump’s former Beverly Park estate in Los Angeles as the facade of the Rose family estate. Interior shots of the Rose family estate were filmed on location in a Sistine Chapel-inspired mansion in Toronto (30 Fifeshire Road near Bayview Avenue and York Mills Road). Main Street Stouffville served as a filming location for an unspecified number of scenes (Thicketwood Veterinary Hospital) in the series' first two seasons. Applewood Farm and Winery in Stouffville was also used. Scenes involving the fictional retailer, Blouse Barn, in seasons two and three were filmed on location on Main Street Unionville in Markham. In the season four episode \"The Jazzaguy,\" scenes involving a spa retreat were filmed on location at Monte Carlo Inn in Vaughan, Ontario. Exterior filming also took place at Rattlesnake Point in Milton for season five's \"The Hike\". In season six's \"Smoke Signals\", the series shot on location at Graydon Hall Manor, a wedding venue in Toronto. The series also filmed in Bay-Adelaide Centre and Toronto-Dominion Centre for the season six episode \"The Pitch\". Additional filming for several season six episodes took place at a local motel in Brantford.\r\nThe former Hockley Motel in Mono, where the exterior shots of the Rosebud Motel were filmed, was marketed for sale by its owners in November 2020.\r\nMusic\r\nThe Schitt's Creek soundtrack is composed by Canadian film and television composer/songwriter Maribeth Solomon.\r\nThe show features several musical performances from its main and supporting characters. The majority of these performances feature the town singing group, the Jazzagals. The Jazzagals' main members are Moira Rose, Jocelyn Schitt, Twyla Sands, Ronnie Lee, and Gwen Currie. Throughout the series, they covered \"It's Raining Men\"; \"Baby, I'm Yours\"; \"Takin' It Home\"; \"Silent Night\"; and \"Islands in the Stream\".\r\nIn season one's \"Carl's Funeral\", Moira sings an unaccompanied version of \"Danny Boy\" as a distraction when Johnny's eulogy goes awry. She performs the same song a second time later in the episode.\r\nIn season two's \"The Motel Guest\", Schitt's Creek's mayor Roland Schitt stays for the night next door to the Roses and plays the song \"Don't Cry Out Loud\" sung by Melissa Manchester loud continually, annoying Johnny and Moira.\r\nIn season four's \"Asbestos Fest\", David and Moira perform a duet known as \"The Number\". This medley of holiday songs was regularly performed at the annual Rose Christmas party and included \"Oh Come, All Ye Faithful\", \"Deck the Halls\", and \"God Rest Ye Merry Gentlemen\". The song was arranged by Moira's portrayer, Catherine O’Hara.\r\nIn season four's \"Open Mic\", Patrick sings an acoustic cover of Tina Turner's \"The Best\" as a declaration of love to David. The song was arranged and performed by Patrick's portrayer, Noah Reid. After airing on Schitt's Creek, Reid's version of the song was released on Spotify and iTunes, where it reached No. 1 on the Canadian charts. All proceeds from the single were donated to the Ontario charity, LGBT Youth Line.\r\nIn season five's \"The Hospies\", Alexis auditions for a community theatre production by singing \"A Little Bit Alexis\", the theme song from her \"critically reviewed, limited reality series\" of the same name. Alexis's portrayer, Annie Murphy, who wrote and performed the song for the show, says she drew inspiration from the pop songs of Paris Hilton and Lindsay Lohan. Menno Versteeg and Nixon Boyd of the Canadian band Hollerado also helped produce the song. \"A Little Bit Alexis\" was released as a single on Spotify and iTunes, where it reached No. 28 on the Canadian charts. Partial proceeds from the single were donated to MusiCounts, a Canadian organization providing music resources to schools in need.\r\nIn season five's \"Life Is a Cabaret\", several main characters perform \"Willkommen\" from the musical Cabaret. Stevie also sings a second number, \"Maybe This Time\", as her Cabaret character, Sally Bowles, in the same episode. Both songs were performed in front of a live audience during filming.\r\nIn season six's \"Happy Ending\", the series finale, the Jazzagals sing a cappella versions of James Morrison's \"Precious Love\" and Tina Turner's \"The Best\" at David and Patrick's wedding. Noah Reid's Patrick also sings a portion of Mariah Carey's \"Always Be My Baby\" as part of his wedding vows to David in the same episode.\r\nBroadcast\r\nOriginal broadcast\r\nSchitt's Creek has been co-broadcast in Canada and the United States since 2015. It premiered on the CBC in Canada on Tuesday, January 13, 2015, at 9:00 pm/9:30 pm NT with back-to-back episodes. It made its United States debut on Pop TV on Wednesday, February 11, 2015, at 10:00 pm ET/PT. Pop moved the series to an 8:00 pm ET/PT time slot with an encore broadcast at 11:00 pm ET/PT for seasons two through four; then returned it to its original 10:00 pm ET/PT time slot for season five. The series maintained staggered premieres throughout its first five seasons, with new episodes debuting in Canada before being broadcast in the US. This changed in the final season, with new episodes broadcast simultaneously in Canada and the US. The series finale aired on April 7, 2020 at 8:00 pm ET; followed by a one-hour behind-the-scenes retrospective documentary, Best Wishes, Warmest Regards: A Schitt's Creek Farewell. In the US, the series finale was Schitt's Creek's highest-rated episode ever and was simulcast on Logo TV and Comedy Central, which had recently become sibling networks to Pop TV through the ViacomCBS merger.\r\nOther broadcasts\r\nAs of 2019, the series was also airing on 4Music in the UK; Comedy Central in India; FX Asia; and ABC Comedy in Australia. It was previously broadcast in New Zealand by TV2 and TVNZ on Demand, in Australia by ABC and its iView streaming service, and on Comedy Central in India. The five seasons appeared, though not always together, on different streaming television services worldwide. Netflix carried the first five seasons and later six for viewers in the U.S., UK, Ireland, France, Japan, Australia and South Africa. IMDb TV, a streaming service available through IMDb, and CW Seed, a streaming service for the American CW network, also carries the first five seasons for viewers in the U.S. The series first season is available from July 14, 2021, in Italy, through the streaming platform Mediaset Infinity+.\r\nIn December 2019, fans on social media accused UK television station 4Music of censoring some scenes featuring \"intimate dialogue\" and kissing between the show's LGBTQ characters. Co-creator and star, Dan Levy, also addressed the alleged censorship on social media calling it \"highly disturbing\" and \"dangerous\". 4Music responded to the allegations of censored kissing with an apology, stating that the removal of a kiss between two male characters was \"human error\" and would be restored for future broadcasts. The station did not specifically respond to the allegations of censored dialogue between LGBTQ characters.\r\nAdditional accusations of censorship were made in October 2020 when co-creator and star, Dan Levy, called out Comedy Central India for editing a same-sex kiss between two male characters in a promotional clip posted to Comedy Central India's Twitter account. Levy noted via social media that Schitt's Creek is \"a show about the power of inclusivity\" and censoring gay intimacy was a \"harmful statement against that message\".\r\nIn April 2022, Hulu acquired the U.S. streaming rights to Schitt's Creek. All six seasons of the series began streaming exclusively on the service starting on October 3.\r\nSyndication\r\nIn 2018, Debmar-Mercury, a division of Lionsgate, acquired the U.S. syndication rights to Schitt's Creek. The series is scheduled to debut in syndication with the Fox Television Stations serving as the flagship group throughout the U.S. during the fall 2020 television season. The series also began airing reruns of series on Comedy Central on October 2, 2020. In December 2021, Fox Television Stations announced an end of syndication of the show at the close of the 2021–2022 television season.\r\nReception and accolades\r\nCritical response\r\nThe first season of Schitt's Creek received mixed to positive reviews. It holds an approval rating of 68% on Rotten Tomatoes based on 26 ratings averaging 6.38/10. The website's critical consensus reads, \"The title is one of the best jokes of Schitt's Creek, but performances from Eugene Levy and Catherine O'Hara give the writing a comedic boost.\" On Metacritic, the first season has a score of 64 out of 100, based on 11 critics, indicating \"generally favorable reviews\". Vinay Menon of the Toronto Star wrote that the show \"is one of the best CBC comedies in years\". After being picked up by Pop, the Los Angeles Times described the show as \"very funny, beautifully played, sometimes touching,\" although Mike Hale of The New York Times called Schitt's Creek \"drab and underwritten\".\r\nSubsequent seasons of Schitt's Creek were more positively received, with the show growing in popularity after debuting on Netflix in January 2017. On Rotten Tomatoes, seasons 2, 4, 5 and 6 have approval ratings of 100%, with season 4's consensus reading, \"The comedic real estate value rises for Schitt's Creek in its fourth year, the series gradually maturing into appointment viewing with a big, beating heart beneath its absurdity.\" The final season's consensus reads: \"Witty, warm, and with just the right blend of wisdom and wisecracks, Schitt's Creek's final season is the perfect farewell to the Roses and the town that changed their lives.\" On Metacritic, the final season has a score of 94 out of 100, based on 4 critics, indicating \"universal acclaim\". Bridget Read of Vogue wrote that while the series \"started off with typical fish out of water scenarios,\" it has \"fully come into its own, with a whole cast of Twin Peaks-meets-Christopher-Guest-universe characters that are as equally endearing\". In New York Magazine, Maggie Fremont wrote that \"the show takes a few episodes to get into its groove, but once it does, you'll never want to leave\". The series has placed on annual best-of lists published by The A.V. Club, Esquire, Glamour, The Guardian, The New Yorker, and Variety. In 2019, the series was named \"The Best Show on TV Right Now\" by TV Guide.\r\nThe series has also been praised for its portrayal of a pansexual character, played by Dan Levy, as well as for how David's sexuality and subsequent relationship with Patrick are simply accepted by the other characters with no expressions of homophobia in the storyline.\r\nAwards and nominations\r\nIn 2015, Schitt's Creek's first season received two Directors Guild of Canada awards from three nominations. At the 2016 ceremony, season 1 received nine Canadian Screen Awards from 16 nominations. Schitt's Creek's second season received 13 nominations at the 5th Canadian Screen Awards. In 2018, the series received nominations from the US-based MTV Movie & TV Awards and the Critics' Choice Television Award. In 2019, the series was nominated for 15 Canadian Screen Awards and four Primetime Emmy Awards, winning the award for Best Performance by an Actress in a Continuing Leading Comedic Role (Catherine O'Hara) and Best Comedy Program or Series at the Canadian Screen Awards. The same year, the series won Dorian Awards for TV Comedy of the Year and Unsung TV Show of the Year from the Society of LGBTQ Entertainment Critics. In 2020, the sixth and final season was nominated for 15 Primetime Emmy Awards. This broke the record for the most Emmy nominations given to a comedy series in its final season. During the 72nd Primetime Emmy Awards, the show became the first ever comedy or drama series to sweep the four acting categories (Outstanding Lead Actor, Outstanding Lead Actress, Outstanding Supporting Actor, Outstanding Supporting Actress) and one of only four live action shows, along with All in the Family, The Golden Girls, and Will & Grace where all the principal actors have won at least one Emmy Award. In 2021, it won the Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Comedy Series.\r\nOther media\r\nHome media\r\nSchitt's Creek has been distributed on DVD in the United States via Lionsgate Home Entertainmant, and in Canada by Entertainment One. In the United Kingdom, the series was released in it entirety through ITV Studios. It has also been made available in Australia and New Zealand from Acorn DVD.\r\nPromotional\r\nDuring the show's later seasons, the main cast participated in a series of interactive fan events. A live audience promotional tour known as Schitt's Creek: Up Close & Personal featuring cast members Eugene Levy, Catherine O'Hara, Dan Levy, Annie Murphy, Emily Hampshire, and Noah Reid premiered in September 2018 in Los Angeles. The event included behind-the-scenes stories; a live question and answer session with the cast; and an audience participation trivia game. Following the initial event's success, the tour was expanded to include stops in several additional US and Canadian cities in 2019. Daniel Levy stated that the tour was meant to both promote the show and thank fans for their support.\r\nIn November and December 2019, Schitt's Creek's US broadcaster, Pop TV, staged two immersive fan events in Los Angeles and New York City. These events allowed participants to visit the titular town via a series of \"reimagined\" sets featured on the show.\r\nTo promote the series' sixth and final season in January 2020, CBC and Pop TV commissioned \"groundbreaking\" billboards featuring a same-sex kiss between the show's engaged couple, David and Patrick. Series creator Dan Levy said it felt \"irresponsible\" not to put the characters kissing on a billboard, as it isn't \"something we see every day\" and is \"banned in multiple countries.\"\r\nIn June 2020, the cast of the show was featured in the YouTube \"Dear Class of 2020\" event performing the Mariah Carey song \"Hero\", with Carey herself making a surprise appearance.\r\nToronto mayor John Tory announced that on Monday, September 21, 2020, the CN Tower would be lit up in gold to celebrate the Schitt's Creek record-breaking sweep of every top comedy award at the 72nd Primetime Emmy Awards.\r\nIn conjunction with the series finale, the one-hour documentary special Best Wishes, Warmest Regards: A Schitt's Creek Farewell was also broadcast by both CBC and Pop.\r\nPossible film\r\nFollowing the series finale, Daniel Levy was asked about the possibility of a feature film. While not committed to an idea at the time, he has expressed interest should such an idea materialize. \"To be honest, this is the best way we could have ever ended the show. If there is an idea that pops into my head, it has to be really freaking good because this is a nice way to say goodbye. Fingers crossed we get a nice idea popping into our head soon. I would love to work with these people again.\"",
    "html": "<p>Schitt's Creek is a Canadian television sitcom created by Dan Levy and his father, Eugene Levy, that aired on CBC Television from 2015 to 2020. It consists of 80 episodes spread over six seasons. Produced by Not a Real Company Productions and the Canadian Broadcasting Corporation, it follows the trials and tribulations of the formerly wealthy Rose family. After their business manager embezzles the family business, Rose Video, the family loses its fortune and relocates to Schitt's Creek, a small town they once purchased as a joke. Now living in a motel, Johnny (Eugene Levy) and Moira (Catherine O'Hara)—along with their adult children, David (Dan Levy) and Alexis (Annie Murphy)—must adjust to life without wealth.</p><p>The series concept came from Dan Levy who wondered how wealthy families, as frequently depicted on American reality television, would react if they lost all their money. He developed the series with his father Eugene before pitching it to several Canadian and American networks. It was first sold to CBC Television in Canada and secured final funding to start production in its sale to Pop in the United States. Although limited in popularity for its first few seasons, its regional appearances on Netflix after its third season is credited for its rise in stature (the so named \"Netflix bump\") and a dynamic social media presence.</p><p>Schitt's Creek received critical acclaim and garnered a cult following, particularly for its writing, humour and acting. It has won various accolades, including two ACTRA Awards and 18 Canadian Screen Awards. It is the first Canadian comedy series to be nominated for a Critics' Choice Television Award for Best Comedy Series. It also received two Screen Actors Guild Awards, including Outstanding Performance by an Ensemble in a Comedy Series and a total of 19 Primetime Emmy Award nominations, including Outstanding Comedy Series twice. It received 15 of these nominations for its sixth and final season, setting a record for most Emmy nominations for a comedy series's final season. For its portrayal of LGBTQ+ people, it received three nominations for a GLAAD Media Award for Outstanding Comedy Series, winning twice.</p><p>At the 72nd Primetime Emmy Awards, the series' final season swept all seven major comedy awards. It was the first time a comedy or drama series received all seven awards; Dan Levy notably received Outstanding Comedy Series, Writing and Directing for a Comedy Series (sharing the last with Andrew Cividino). It set records for winning all four major acting categories (Lead Actor/Actress and Supporting Actor/Actress) for O'Hara, Murphy and both Levys—a first for a comedy or drama series; for most Emmy wins by a comedy series in a single season (beating The Marvelous Mrs. Maisel's 2018 record), and for most Emmy nominations and wins by a comedy series in its final season.</p><br/><h3>Synopsis</h3><p>The wealthy Rose family—video store magnate Johnny (Eugene Levy), his wife and former soap opera actress Moira (Catherine O'Hara), and their pampered adult children David (Dan Levy) and Alexis (Annie Murphy)—lose their fortune after being defrauded by their business manager. They rebuild their lives with their sole remaining asset: a small, remote town named Schitt's Creek, which Johnny bought for David's birthday in 1991 as a joke.</p><p>The Roses are forced to relocate to Schitt's Creek, moving into two adjacent rooms in a run-down motel. While the family adjusts to their new lives, their well-to-do attitudes conflict with the town's more provincial residents, including mayor Roland Schitt (Chris Elliott), his wife Jocelyn (Jenn Robertson) and their son Mutt (Tim Rozon), the motel's manager Stevie Budd (Emily Hampshire), town council members Ronnie Lee (Karen Robinson) and Bob Currie (John Hemphill), veterinarian Ted Mullens (Dustin Milligan), and Jazzagal member and Café Tropical waitress Twyla Sands (Sarah Levy).</p><br/><h3>Cast and characters</h3><ul><li>Eugene Levy as Johnny Rose, a former video store chain owner, generally the most levelheaded of the Rose family</li><li>Catherine O'Hara as Moira Rose, the eccentric former star of the soap opera Sunrise Bay</li><li>Daniel Levy as David Rose, the pretentious son of Johnny and Moira</li><li>Annie Murphy as Alexis Rose, the flighty socialite daughter of Johnny and Moira, who gets involved in a self-imposed love triangle with Ted and Mutt</li><li>Jennifer Robertson as Jocelyn Schitt, the mayor's down-to-earth wife and local schoolteacher</li><li>Emily Hampshire as Stevie Budd, a sardonic clerk at the motel where the Roses reside, who becomes David's best friend and brief friend-with-benefits</li><li>Tim Rozon as Mutt Schitt (starring seasons 1–2; guest seasons 3–4), Roland and Jocelyn's provincial son and Alexis's love interest</li><li>Chris Elliott as Roland Schitt, the posturing, nosy, easily offended mayor</li><li>Dustin Milligan as Ted Mullens, the town's veterinarian and Alexis's love interest</li><li>Sarah Levy as Twyla Sands, the ditzy yet troubled Café Tropical waitress and later owner</li><li>John Hemphill as Bob Currie, proprietor of Bob's Garage and a member of the town council</li><li>Karen Robinson as Veronica \"Ronnie\" Lee, a member of the town council and a leading member of the Jazzagals who frequently butts heads with Patrick</li><li>Rizwan Manji as Ray Butani (starring seasons 2–6; recurring season 1), the town's only real estate agent and a former town council member, who has a variety of other businesses. Despite being born and raised in Winnipeg, Ray speaks with a non-standard Canadian accent.</li><li>Robin Duke as Wendy Kurtz (starring season 2; guest season 5), dress shop owner and David's former employer</li><li>Steve Lund as Jake (starring season 3; guest seasons 2, 4 and 6), a furniture maker and love interest for both David and Stevie</li><li>Noah Reid as Patrick Brewer (starring seasons 3–6), David's business partner and later husband</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 13, 2015</td><td style=\"padding:0 8px\">March 31, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 12, 2016</td><td style=\"padding:0 8px\">March 29, 2016</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 10, 2017</td><td style=\"padding:0 8px\">April 4, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"1\" rowspan=\"2\">13</td><td colspan=\"1\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 9, 2018</td><td style=\"padding:0 8px\">April 10, 2018</td></tr><tr style=\"height:100%\"><td colspan=\"1\">1</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">December 19, 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">14</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 8, 2019</td><td style=\"padding:0 8px\">April 9, 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">14</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 7, 2020</td><td style=\"padding:0 8px\">April 7, 2020</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Special</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">April 7, 2020</td></tr></tbody></table><br/><h3>Development</h3><h4>Conception</h4><p>Dan Levy came up with the idea for the show while watching reality television. \"I had been watching some reality TV at the time and was concentrating on what would happen if one of these wealthy families would lose everything. Would the Kardashians still be the Kardashians without their money?\" He turned to his father Eugene to help develop the show, who came up with the series title. Dan decided to make the location of Schitt's Creek vague, but has said that it is in Canada.</p><p>The premise of being forced to move to a town they once bought as a joke was inspired by actress Kim Basinger's $20 million purchase of the town of Braselton, Georgia in 1989. Eugene Levy said, \"My wife had an idea for a television show about boomers not having money or moving in with their kids. Their situation was described as being up sh–'s creek. It just made us laugh. Then my son Daniel came in with an article one day about an actress, Alec Baldwin's ex-wife (Basinger), who bought a town. She was hoping that film people would come to the town to use it as a location area and she lost a lot of money. The idea of wealthy people buying a town went back to the Schitt's Creek idea.\"</p><p>The Levys initially pitched the show to several networks in Canada and the United States. Cable networks HBO and Showtime passed on the series, while a broadcast network in America and the CBC in Canada expressed interest. The show was first sold to the CBC, but the Levys decided against major U.S. broadcasters after getting nervous about their reputation for creative interference. Schitt's Creek eventually found a U.S. home on Pop TV after striking a deal with network head Brad Schwartz, who had previously hired Dan on MTV Canada.</p><p>During the early stages of development, various networks suggested the title of the show be changed to avoid the vulgar word. The Levys resisted these suggestions and argued \"Schitt\" was a legitimate last name. To prove their point, they brought pages copied from a phone book to the CBC showing listings for individuals with the \"Schitt\" surname. The CBC agreed and allowed the Levys to keep the original title.</p><p>Dan Levy initially envisioned the series ending with season five, but agreed to a sixth season after receiving a two-year renewal following the show's fourth season.</p><h4>Casting</h4><p>Catherine O'Hara was the series creators' first choice for the role of eccentric family matriarch, Moira Rose. O'Hara had previously worked with Eugene Levy on SCTV and several of Christopher Guest's films. She initially turned down Levy's offer to star, citing \"laziness\" and an aversion to long-term projects. Levy reached out to another (unnamed) actress, but continued to court O'Hara for the role. O'Hara eventually agreed to participate in the presentation pilot with no obligation to continue in the role after Schitt's Creek was ordered to series. After the show was picked up by the CBC, O'Hara agreed to continue in the role.</p><p>Annie Murphy was offered the role of spoiled socialite Alexis Rose after actress Abby Elliott was unable to continue due to scheduling conflicts. Murphy was on the verge of giving up on acting since she had not worked in over two years when she got an email inviting her to audition for the role. She first auditioned in Los Angeles, where Dan Levy said she stood out due to her \"wonderfully natural likability.\" Eugene Levy was unsure of Murphy's casting because she did not possess the blonde hair he had pictured for the role of Alexis. Murphy was subsequently called back for a second audition for a different role, sarcastic motel clerk Stevie Budd. After this audition, Dan Levy convinced his father that Murphy could dye her hair blonde, and she was officially cast as Alexis Rose.</p><p>Emily Hampshire was cast as the deadpan motel clerk, Stevie Budd, after auditioning for the role in Los Angeles. She originally requested to submit a taped audition on account of her nerves and recurring hive breakouts. Hampshire ultimately agreed to audition in person, but states she has no recollection of the experience. According to Daniel Levy, who was present for the process, Hampshire gave a \"great\" audition, then proceeded to lift her shirt over her head to hide and slowly rocked back and forth. Levy later told Hampshire he found her audition \"charming\", and she was offered the part of Stevie.</p><p>Noah Reid was offered the role of David's business partner and love interest, Patrick Brewer, in season three. Dan Levy was socially familiar with Reid and invited him to audition on the suggestion of Stacey Farber. Reid had never watched the show before he auditioned and was unsure how long the character would be a part of the series. Dan Levy was not present during the audition process and did not \"chemistry test\" with Reid before he was cast.</p><p>Other cast regulars Chris Elliott and Sarah Levy were given the roles of Roland Schitt and Twyla Sands, respectively, without auditioning. Elliott says when Eugene Levy offered him the role of the town mayor, he thought, \"Why would I say no?\" Sarah Levy, the daughter of Eugene and sister of Dan, was asked to be a part of the show before it was fully developed. She says she was glad not to be cast as Alexis, as being out of her family's orbit on the show allowed her to \"do own thing.\"</p><h4>Production</h4><p>Schitt's Creek is produced by Not a Real Company Productions in association with CBC and Pop TV. Pop TV joined the production team in season two after the series' first season was produced solely in association with CBC. ITV Studios Global Entertainment also partnered with the CBC and Pop to distribute the show worldwide. Eugene Levy, Dan Levy, Fred Levy (Eugene's brother), Andrew Barnsley, and Ben Feigin have served as executive producers throughout the show's entirety. Other executive producers have included writers Kevin White (seasons two and three) and David West Read (seasons five and six). Eugene Levy served as showrunner alongside co-creator and son, Dan Levy, during the series' first season; Dan Levy took over as sole showrunner beginning in season two.</p><p>Schitt's Creek was part of a \"new direction\" in programming taken by both CBC and Pop TV during the 2014–15 television season. Premiering alongside 12 new primetime shows on CBC, the series represented one of the network's efforts to produce more \"serialized, scripted\" content, as well as more \"cable-like\" shows. The series was also the first original, scripted program to air on Pop TV after its re-branding in January 2015. Formerly known as TV Guide Network, Pop TV was re-branded as a channel \"filled with optimism, passion, funny and excitement\".</p><h4>Filming style and locations</h4><p>Schitt's Creek was filmed using a single camera set-up with no live audience or laugh track. The interior scenes for the first two seasons were filmed at Pinewood Toronto Studios in Port Lands area of Toronto, while interior scenes for season three were shot at Dufferin Gate Studios in (Etobicoke) Toronto. Interior scenes were also filmed at Revival Studios in (Leslieville) Toronto for an unknown number of seasons. The remainder of the series is filmed on location in Goodwood, the Regional Municipality of Durham in the Greater Toronto Area, Brantford and Mono, where the motel scenes are filmed. Goodwood was one of 30 towns scouted for the fictional location of Schitt's Creek before production of the series began in 2014. The Canadian Press wrote June 27, 2019 that Goodwood had become a \"tourist hot spot\" as filming for the current season concluded.</p><p>The series was filmed in several additional locations during its run. The opening shot of the first season features Lisa Vanderpump’s former Beverly Park estate in Los Angeles as the facade of the Rose family estate. Interior shots of the Rose family estate were filmed on location in a Sistine Chapel-inspired mansion in Toronto (30 Fifeshire Road near Bayview Avenue and York Mills Road). Main Street Stouffville served as a filming location for an unspecified number of scenes (Thicketwood Veterinary Hospital) in the series' first two seasons. Applewood Farm and Winery in Stouffville was also used. Scenes involving the fictional retailer, Blouse Barn, in seasons two and three were filmed on location on Main Street Unionville in Markham. In the season four episode \"The Jazzaguy,\" scenes involving a spa retreat were filmed on location at Monte Carlo Inn in Vaughan, Ontario. Exterior filming also took place at Rattlesnake Point in Milton for season five's \"The Hike\". In season six's \"Smoke Signals\", the series shot on location at Graydon Hall Manor, a wedding venue in Toronto. The series also filmed in Bay-Adelaide Centre and Toronto-Dominion Centre for the season six episode \"The Pitch\". Additional filming for several season six episodes took place at a local motel in Brantford.</p><p>The former Hockley Motel in Mono, where the exterior shots of the Rosebud Motel were filmed, was marketed for sale by its owners in November 2020.</p><h4>Music</h4><p>The Schitt's Creek soundtrack is composed by Canadian film and television composer/songwriter Maribeth Solomon.</p><p>The show features several musical performances from its main and supporting characters. The majority of these performances feature the town singing group, the Jazzagals. The Jazzagals' main members are Moira Rose, Jocelyn Schitt, Twyla Sands, Ronnie Lee, and Gwen Currie. Throughout the series, they covered \"It's Raining Men\"; \"Baby, I'm Yours\"; \"Takin' It Home\"; \"Silent Night\"; and \"Islands in the Stream\".</p><p>In season one's \"Carl's Funeral\", Moira sings an unaccompanied version of \"Danny Boy\" as a distraction when Johnny's eulogy goes awry. She performs the same song a second time later in the episode.</p><p>In season two's \"The Motel Guest\", Schitt's Creek's mayor Roland Schitt stays for the night next door to the Roses and plays the song \"Don't Cry Out Loud\" sung by Melissa Manchester loud continually, annoying Johnny and Moira.</p><p>In season four's \"Asbestos Fest\", David and Moira perform a duet known as \"The Number\". This medley of holiday songs was regularly performed at the annual Rose Christmas party and included \"Oh Come, All Ye Faithful\", \"Deck the Halls\", and \"God Rest Ye Merry Gentlemen\". The song was arranged by Moira's portrayer, Catherine O’Hara.</p><p>In season four's \"Open Mic\", Patrick sings an acoustic cover of Tina Turner's \"The Best\" as a declaration of love to David. The song was arranged and performed by Patrick's portrayer, Noah Reid. After airing on Schitt's Creek, Reid's version of the song was released on Spotify and iTunes, where it reached No. 1 on the Canadian charts. All proceeds from the single were donated to the Ontario charity, LGBT Youth Line.</p><p>In season five's \"The Hospies\", Alexis auditions for a community theatre production by singing \"A Little Bit Alexis\", the theme song from her \"critically reviewed, limited reality series\" of the same name. Alexis's portrayer, Annie Murphy, who wrote and performed the song for the show, says she drew inspiration from the pop songs of Paris Hilton and Lindsay Lohan. Menno Versteeg and Nixon Boyd of the Canadian band Hollerado also helped produce the song. \"A Little Bit Alexis\" was released as a single on Spotify and iTunes, where it reached No. 28 on the Canadian charts. Partial proceeds from the single were donated to MusiCounts, a Canadian organization providing music resources to schools in need.</p><p>In season five's \"Life Is a Cabaret\", several main characters perform \"Willkommen\" from the musical Cabaret. Stevie also sings a second number, \"Maybe This Time\", as her Cabaret character, Sally Bowles, in the same episode. Both songs were performed in front of a live audience during filming.</p><p>In season six's \"Happy Ending\", the series finale, the Jazzagals sing a cappella versions of James Morrison's \"Precious Love\" and Tina Turner's \"The Best\" at David and Patrick's wedding. Noah Reid's Patrick also sings a portion of Mariah Carey's \"Always Be My Baby\" as part of his wedding vows to David in the same episode.</p><br/><h3>Broadcast</h3><h4>Original broadcast</h4><p>Schitt's Creek has been co-broadcast in Canada and the United States since 2015. It premiered on the CBC in Canada on Tuesday, January 13, 2015, at 9:00 pm/9:30 pm NT with back-to-back episodes. It made its United States debut on Pop TV on Wednesday, February 11, 2015, at 10:00 pm ET/PT. Pop moved the series to an 8:00 pm ET/PT time slot with an encore broadcast at 11:00 pm ET/PT for seasons two through four; then returned it to its original 10:00 pm ET/PT time slot for season five. The series maintained staggered premieres throughout its first five seasons, with new episodes debuting in Canada before being broadcast in the US. This changed in the final season, with new episodes broadcast simultaneously in Canada and the US. The series finale aired on April 7, 2020 at 8:00 pm ET; followed by a one-hour behind-the-scenes retrospective documentary, Best Wishes, Warmest Regards: A Schitt's Creek Farewell. In the US, the series finale was Schitt's Creek's highest-rated episode ever and was simulcast on Logo TV and Comedy Central, which had recently become sibling networks to Pop TV through the ViacomCBS merger.</p><h4>Other broadcasts</h4><p>As of 2019, the series was also airing on 4Music in the UK; Comedy Central in India; FX Asia; and ABC Comedy in Australia. It was previously broadcast in New Zealand by TV2 and TVNZ on Demand, in Australia by ABC and its iView streaming service, and on Comedy Central in India. The five seasons appeared, though not always together, on different streaming television services worldwide. Netflix carried the first five seasons and later six for viewers in the U.S., UK, Ireland, France, Japan, Australia and South Africa. IMDb TV, a streaming service available through IMDb, and CW Seed, a streaming service for the American CW network, also carries the first five seasons for viewers in the U.S. The series first season is available from July 14, 2021, in Italy, through the streaming platform Mediaset Infinity+.</p><p>In December 2019, fans on social media accused UK television station 4Music of censoring some scenes featuring \"intimate dialogue\" and kissing between the show's LGBTQ characters. Co-creator and star, Dan Levy, also addressed the alleged censorship on social media calling it \"highly disturbing\" and \"dangerous\". 4Music responded to the allegations of censored kissing with an apology, stating that the removal of a kiss between two male characters was \"human error\" and would be restored for future broadcasts. The station did not specifically respond to the allegations of censored dialogue between LGBTQ characters.</p><p>Additional accusations of censorship were made in October 2020 when co-creator and star, Dan Levy, called out Comedy Central India for editing a same-sex kiss between two male characters in a promotional clip posted to Comedy Central India's Twitter account. Levy noted via social media that Schitt's Creek is \"a show about the power of inclusivity\" and censoring gay intimacy was a \"harmful statement against that message\".</p><p>In April 2022, Hulu acquired the U.S. streaming rights to Schitt's Creek. All six seasons of the series began streaming exclusively on the service starting on October 3.</p><h4>Syndication</h4><p>In 2018, Debmar-Mercury, a division of Lionsgate, acquired the U.S. syndication rights to Schitt's Creek. The series is scheduled to debut in syndication with the Fox Television Stations serving as the flagship group throughout the U.S. during the fall 2020 television season. The series also began airing reruns of series on Comedy Central on October 2, 2020. In December 2021, Fox Television Stations announced an end of syndication of the show at the close of the 2021–2022 television season.</p><br/><h3>Reception and accolades</h3><h4>Critical response</h4><p>The first season of Schitt's Creek received mixed to positive reviews. It holds an approval rating of 68% on Rotten Tomatoes based on 26 ratings averaging 6.38/10. The website's critical consensus reads, \"The title is one of the best jokes of Schitt's Creek, but performances from Eugene Levy and Catherine O'Hara give the writing a comedic boost.\" On Metacritic, the first season has a score of 64 out of 100, based on 11 critics, indicating \"generally favorable reviews\". Vinay Menon of the Toronto Star wrote that the show \"is one of the best CBC comedies in years\". After being picked up by Pop, the Los Angeles Times described the show as \"very funny, beautifully played, sometimes touching,\" although Mike Hale of The New York Times called Schitt's Creek \"drab and underwritten\".</p><p>Subsequent seasons of Schitt's Creek were more positively received, with the show growing in popularity after debuting on Netflix in January 2017. On Rotten Tomatoes, seasons 2, 4, 5 and 6 have approval ratings of 100%, with season 4's consensus reading, \"The comedic real estate value rises for Schitt's Creek in its fourth year, the series gradually maturing into appointment viewing with a big, beating heart beneath its absurdity.\" The final season's consensus reads: \"Witty, warm, and with just the right blend of wisdom and wisecracks, Schitt's Creek's final season is the perfect farewell to the Roses and the town that changed their lives.\" On Metacritic, the final season has a score of 94 out of 100, based on 4 critics, indicating \"universal acclaim\". Bridget Read of Vogue wrote that while the series \"started off with typical fish out of water scenarios,\" it has \"fully come into its own, with a whole cast of Twin Peaks-meets-Christopher-Guest-universe characters that are as equally endearing\". In New York Magazine, Maggie Fremont wrote that \"the show takes a few episodes to get into its groove, but once it does, you'll never want to leave\". The series has placed on annual best-of lists published by The A.V. Club, Esquire, Glamour, The Guardian, The New Yorker, and Variety. In 2019, the series was named \"The Best Show on TV Right Now\" by TV Guide.</p><p>The series has also been praised for its portrayal of a pansexual character, played by Dan Levy, as well as for how David's sexuality and subsequent relationship with Patrick are simply accepted by the other characters with no expressions of homophobia in the storyline.</p><h4>Awards and nominations</h4><p>In 2015, Schitt's Creek's first season received two Directors Guild of Canada awards from three nominations. At the 2016 ceremony, season 1 received nine Canadian Screen Awards from 16 nominations. Schitt's Creek's second season received 13 nominations at the 5th Canadian Screen Awards. In 2018, the series received nominations from the US-based MTV Movie & TV Awards and the Critics' Choice Television Award. In 2019, the series was nominated for 15 Canadian Screen Awards and four Primetime Emmy Awards, winning the award for Best Performance by an Actress in a Continuing Leading Comedic Role (Catherine O'Hara) and Best Comedy Program or Series at the Canadian Screen Awards. The same year, the series won Dorian Awards for TV Comedy of the Year and Unsung TV Show of the Year from the Society of LGBTQ Entertainment Critics. In 2020, the sixth and final season was nominated for 15 Primetime Emmy Awards. This broke the record for the most Emmy nominations given to a comedy series in its final season. During the 72nd Primetime Emmy Awards, the show became the first ever comedy or drama series to sweep the four acting categories (Outstanding Lead Actor, Outstanding Lead Actress, Outstanding Supporting Actor, Outstanding Supporting Actress) and one of only four live action shows, along with All in the Family, The Golden Girls, and Will & Grace where all the principal actors have won at least one Emmy Award. In 2021, it won the Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Comedy Series.</p><br/><h3>Other media</h3><h4>Home media</h4><p>Schitt's Creek has been distributed on DVD in the United States via Lionsgate Home Entertainmant, and in Canada by Entertainment One. In the United Kingdom, the series was released in it entirety through ITV Studios. It has also been made available in Australia and New Zealand from Acorn DVD.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">Season</th><th colspan=\"5\">Release date</th><th rowspan=\"2\">Ref(s)</th></tr><tr><th width=\"140\"><span>Region 1</span><br><span style=\"font-size:85%;\">(U.S.)</span></th><th width=\"115\"><span>Region 1</span><br><span style=\"font-size:85%;\">(Canada)</span></th><th width=\"115\"><span>Region 2</span><br><span style=\"font-size:85%;\">(UK)</span></th><th width=\"115\"><span>Region 4</span><br><span style=\"font-size:85%;\">(Australia)</span></th><th width=\"140\"><span>Region 4</span><br><span style=\"font-size:85%;\">(New Zealand)</span></th></tr><tr><td><b>1</b></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>August 11, 2015</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td></td></tr><tr><td><b>2</b></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>April 26, 2015</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td></td></tr><tr><td><b>1–2</b></td><td>November 1, 2016</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td></td></tr><tr><td><b>3</b></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>April 11, 2017</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td></td></tr><tr><td><b>1–3</b></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>April 5, 2017</td><td>May 24, 2017</td><td></td></tr><tr><td><b>4</b></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>February 6, 2019</td><td>March 14, 2019</td><td></td></tr><tr><td><b>5</b></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>August 7, 2019</td><td>September 13, 2019</td><td></td></tr><tr><td><b>6</b></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>June 17, 2020</td><td>June 12, 2020</td><td></td></tr><tr><td><b>1–6</b></td><td>November 10, 2020</td><td>October 6, 2020</td><td>June 29, 2020</td><td>August 26, 2020</td><td>August 27, 2020</td><td></td></tr></tbody></table><h4>Promotional</h4><p>During the show's later seasons, the main cast participated in a series of interactive fan events. A live audience promotional tour known as Schitt's Creek: Up Close & Personal featuring cast members Eugene Levy, Catherine O'Hara, Dan Levy, Annie Murphy, Emily Hampshire, and Noah Reid premiered in September 2018 in Los Angeles. The event included behind-the-scenes stories; a live question and answer session with the cast; and an audience participation trivia game. Following the initial event's success, the tour was expanded to include stops in several additional US and Canadian cities in 2019. Daniel Levy stated that the tour was meant to both promote the show and thank fans for their support.</p><p>In November and December 2019, Schitt's Creek's US broadcaster, Pop TV, staged two immersive fan events in Los Angeles and New York City. These events allowed participants to visit the titular town via a series of \"reimagined\" sets featured on the show.</p><p>To promote the series' sixth and final season in January 2020, CBC and Pop TV commissioned \"groundbreaking\" billboards featuring a same-sex kiss between the show's engaged couple, David and Patrick. Series creator Dan Levy said it felt \"irresponsible\" not to put the characters kissing on a billboard, as it isn't \"something we see every day\" and is \"banned in multiple countries.\"</p><p>In June 2020, the cast of the show was featured in the YouTube \"Dear Class of 2020\" event performing the Mariah Carey song \"Hero\", with Carey herself making a surprise appearance.</p><p>Toronto mayor John Tory announced that on Monday, September 21, 2020, the CN Tower would be lit up in gold to celebrate the Schitt's Creek record-breaking sweep of every top comedy award at the 72nd Primetime Emmy Awards.</p><p>In conjunction with the series finale, the one-hour documentary special Best Wishes, Warmest Regards: A Schitt's Creek Farewell was also broadcast by both CBC and Pop.</p><br/><h3>Possible film</h3><p>Following the series finale, Daniel Levy was asked about the possibility of a feature film. While not committed to an idea at the time, he has expressed interest should such an idea materialize. \"To be honest, this is the best way we could have ever ended the show. If there is an idea that pops into my head, it has to be really freaking good because this is a nice way to say goodbye. Fingers crossed we get a nice idea popping into our head soon. I would love to work with these people again.\"</p><br/>"
  },
  "errorMessage": ""
}