{
  "imDbId": "tt4093826",
  "title": "Twin Peaks",
  "fullTitle": "Twin Peaks (TV Series 2017–2017)",
  "type": "TVSeries",
  "year": "2017",
  "items": [
    {
      "username": "simodeev",
      "userUrl": "https://www.imdb.com/user/ur35364895",
      "reviewLink": "https://www.imdb.com/review/rw4941228",
      "warningSpoilers": false,
      "date": "17 June 2019",
      "rate": "10",
      "helpful": "272 out of 318 found this helpful.",
      "title": "10-star reviews are right, 1-star reviews are right",
      "content": "It's condescending to tell people they don't 'get it', and it's narrow-minded to claim anyone who loves it is pretentious. I adored this new Twin Peaks, and I understand why it's divisive.In his old age, an artist had a chance to throw a kitchen sink's worth of ideas on screen, under the banner of his old show, with complete creative control. Good on him I say! That creative control means many of the aspects which came from others in the original show are missing.I was compelled from start to finish. I appreciated its slow rhythms, found the pacing hypnotic. I'd understand why many fans would despise its new form. I wouldn't blame them for it.If you're after a fully-resolved, tightly-plotted, didactic storytelling, you won't get it. You'll be frustrated by scenes which suggest the story is kicking into high gear in traditional Hollywood ways, only to then be presented with a five minute shot of a man cleaning a floor.This jarring approach... loose ends, unresolved plots, ambiguity and odd pacing are understandably annoying for many. It does lack the melodrama of the earlier series, but there's still a warmth to many of the characters, you are just less guided by music and tight plotting. It's a feat to me that it is somehow utterly absurd yet simultaneously feels more grounded, but this show is not going to tell you a tight story with a guiding hand.Personally, I haven't received this feeling from any US cinema in the past few decades, and I love it. Twin Peaks The Return gave me space to let my mind wander in the same way an Apichatpong Weeresthekul film might. That's a very personal thing, for me it's not boredom, it's a space to imagine and open my mind.There's a lot of hyperbole surrounding David Lynch but his works are the summation of his very clear influences, like any other artist. You can see it all very clearly, and I happen to share many of his loves, so it's exciting for me. Here it's the usual Cocteau, Anger visuals, noir and 50s stylings, but there are clear nods to everything under the cinematic sun, from Jacques Tati to Tarantino and early silent cinema. I loved that, it feels like a celebration of cinema!The tone jumps from humour to horror in a heartbeat, each episode is jarring in barely-cohesive ways but for me, somehow it coalesced. The show feels liberated, free of expectation and cliché. It put me under a spell, certainly not because I was instructed to by critics at large but because together, all these disparate elements felt refreshing.I don't think it's a puzzle to be solved, I don't think there's a bullet-point explanation to the story sitting in a locked vault. I do believe the broad intention was to make you think, imagine and question what you're used to being fed by TV and films.Would I watch it if it weren't called Twin Peaks and weren't by David Lynch? Yes. Should it have been called Twin Peaks, and is it kicking fans in the face by doing so? Very likely. I think that's what makes it so anarchic and brilliant. I also fully understand why many wouldn't want that from Twin Peaks."
    },
    {
      "username": "recklesscow",
      "userUrl": "https://www.imdb.com/user/ur55546538",
      "reviewLink": "https://www.imdb.com/review/rw3713317",
      "warningSpoilers": true,
      "date": "22 May 2017",
      "rate": "10",
      "helpful": "425 out of 614 found this helpful.",
      "title": "Sure to repel traditional watchers and please anyone looking for something different.",
      "content": "If you don't know anything about the original 1990s predecessor, I can't imagine what you'd be doing here, so let's skip all that introduction nonsense.The new \"Twin Peaks\" is out, and you're most likely an old fan wanting to know what you're in for. Is it the same as you remember it? Yes...and no. Lynch, ever known for his weirdness, is no longer operating under the wing of ABC network interference this time around and has been given full creative control for these 18 episodes. As you can probably expect, Lynch when he isn't being reigned in is Weird with a capital \"W\", but unfortunately for those fans looking for more of the same old \"Twin Peaks\" you're used to, Lynch isn't serving up that. Oh, the main players are all back and the town still has a neat local dive with some dreamy musical acts, but this is a bigger story in terms of scope and vision.For one, the series is not confined to the town of Twin Peaks and features many characters in different locations. As for the tone, Lynch obviously saw the opportunity to go all out on his weird style with no one to reign him in, and go all out he does. This is bad news for those expecting a traditional, linear plot to unfold, but great news for those who loved the more surreal aspects of the original series.There are long, drawn out scenes of dialogue, or sometimes just actions. The pacing is often slow and deliberate. The insanity of the original series finale comes to the fore and gets served up in heavy doses. If the original managed to pull in some viewers for the murder mystery despite the quirky aspects of the series, this one disregards those fans altogether by refusing to throw them a bone. Oh, there is a story here, but it's no longer centered around a marketing campaign masquerading as a murder mystery and it isn't going to be told in clear and cut A to B fashion. You have to either be willing to follow Lynch on where he wants to take you or give up in frustration and part ways. Because in terms of differences, that seems to be the main one here: Lynch is doing this his way...and you're either with him or not. This doesn't make it easy on traditional viewers, and I fully expect them to be out once they get to the end of the premiere.Me, I am loving the fact that there is nothing else like this on TV. The same could be said of the original when it aired, and it's shocking how much changes and yet stays the same considering we're 25 more years along and it still takes David Lynch to serve up something truly unique on television. What have these other guys been doing? My boyfriend watched an episode of \"Sense8\" when I was finished watching the premiere, and the difference in what is passing as entertainment today felt like I had gone from a pristine environment with \"Twin Peaks\" to breathing in pollution. This is the perfect antidote for someone tired of having their emotions led and manipulated by TV shows that tell you exactly how to feel and think. It's not going to cater to you or babysit you like a child. If requires patience and imagination, and for those willing to stick with it, the results can be so rewarding. Think of it as a purge from all the derivative crap we watch without even realizing how banal it is. Because it takes watching this new \"Twin Peaks\" to realize just how mediocre our \"hit\" shows really are. I look forward to being cleansed once a week for the next few months."
    },
    {
      "username": "cherold",
      "userUrl": "https://www.imdb.com/user/ur0011762",
      "reviewLink": "https://www.imdb.com/review/rw3719702",
      "warningSpoilers": false,
      "date": "30 May 2017",
      "rate": "8",
      "helpful": "77 out of 122 found this helpful.",
      "title": "For those who liked the weirdest parts of Twin Peaks",
      "content": "A quarter of a century after it ended, Twin Peaks gets a season 3. That in itself is part of the weirdness of Twin Peaks; it's not a reboot, or a remake, it's just ... season 3, picking up just where season 2 left off. No one but David Lynch would do that. I suspect whether you will love or hate this series return (and people seem to do one or the other) will depend on what you liked about the original Twin Peaks. If you liked the quirky soap opera aspect of things in plot threads like the lumber mill, well, this might not be for you. If, like me, your favorite scenes were the really weird ones like the hotel scene that began episode 2 and the amazing scene of the kid and the creamed corn, and if you didn't understand while people didn't appreciate the utter brilliance of Fire Walk With Me, then you'll probably like this.The series begins with the weirdness turned up to ten and the eventfulness turned down to zero, as though Lynch is saying, yes, I made Twin Peaks, but don't forget I'm also the guy who did Inland Empire. After a while the Inland Empire aspects thankfully become fewer and there is more of the quirky humor of the original series (as in a scene with cops try to track down a key to an apartment), actual story and character, and Lynch's typical approach of painting a placid surface and then showing the rot underneath. And some of the old elements of the series, like a weirdly ageless Kimmy Robertson as Lucy and Lynch as Gordon Cole, are every bit as fun and funny as they were in the original.At times full Lynchian madness flares up, like the a-bomb test episode that thrilled some people and that annoyed others, like me. Other times, Lynch shocks everyone by actually offering detailed explanaions of some of the mysteries he has raised in the original series and Fire Walk with Me. At times Lynch seems to be saying, \"here's a sensible answer to that thing you've been wondering about for years, but before you get too happy here's another unexplained weird thing to replace that.\"I wasn't as fanatic about Twin Peaks as some people. I didn't find the pilot especially interesting until funny, eccentric Dale Cooper appeared, and without Kyle MacClachlan I probably never would have watched the second episode. I didn't fully love the series until the incredible weirdness of the second season, and that love didn't last long since the show quickly spiraled into a disastrous mess. That may be why I enjoy this third season and Fire Walk With Me; they represent David Lynch giving me the aspects of the series I love without all the boring soap stuff.Some of Twin Peaks is hugely annoying, other parts are utterly fascinating. Overall, I found it very entertaining, and if it's not everything I want (after 4 episodes I rated this 9 stars, but at season's end dropped it to 8), well, that's David Lynch.One final note. I've seen several reviews saying that the only people who like this series are \"hipsters.\" This is the silliest critique I've ever seen. I'll admit I don't know much about hipsters except they wear funny mustaches and churn their own butter, but my guess is hipsters are not all people who like to watch a revival of a series they don't remember starring a bunch of people old enough to be their parents. Just a guess. No, you silly 1-star reviewers, I'm not a hipster, and I'm not, as some have suggested, a \"paid reviewer\" (although if someone can tell me how to make money by writing IMDb reviews please do so). I'm just someone who likes David Lynch when he's very weird but not tediously, incomprehensibly so. And that's what, for the most part, Twin Peaks the Return gives its audience."
    },
    {
      "username": "Ziglet_mir",
      "userUrl": "https://www.imdb.com/user/ur20393720",
      "reviewLink": "https://www.imdb.com/review/rw3713662",
      "warningSpoilers": false,
      "date": "22 May 2017",
      "rate": "10",
      "helpful": "198 out of 322 found this helpful.",
      "title": "David Lynch's Swan Song",
      "content": "When someone works hard at something or does something for a long time you can surmise that they well eventually get good at that thing, even masterful. Generally, this is the case for all great directors and David Lynch is no exception. With the newest Lynch-piece we are given something that is an amalgamation of all his previous work without sacrificing his style or creativity. We see the dark-industrial vibe of \"Eraserhead\", the American suburbia and the dark underbelly late-night bars/clubs/people from \"Blue Velvet\", \"Wild At Heart\", and \"Twin Peaks\", the winding roads and nightmarish features from nearly all his projects specifically \"Lost Highway\" and \"Mulholland Drive\", and then last but not least, we see the venture into the digital age with non-linear story and the craziest sound design you may possibly experience in any piece of media that we get from \"Inland Empire\". There are even remnants of design that hearken back to his old shorts. This folks, is Lynch's swan song. The Return is already like nothing else ever before on TV and this includes the original two seasons of Twin Peaks.Lynch allows the material to breathe, and gives the viewer plenty of time to absorb what's on screen. The filming is patient, and every shot is most definitely taken with care. The slow yearning shots is what Lynch uses to draw you in. The unfamiliarity of new faces leaves you with more questions than before. Also, as most already knew going in, The Return is set in many different locations--not just that charming, wholesome town of Twin Peaks. Even knowing Lynch's filmography there are moments that still have me unprepared for the amount of visuals and sounds that evoke nightmares. More terrifying than 90% of what I've seen as a film-goer.I have to admit that it is taking me some time to adjust to the new vibe of the series knowing well in advance that Lynch and Frost have stated that The Return will be more like the prequel movie FWWM. I am someone who prefers the film to the series because Lynch had more room to work toward his vision. The result is a surrealist nightmare that The Return will have beat by a landslide. With that said, there will be many of you who will not like this at all (even folks who enjoyed the original series because The Return is THAT different). Lynch is certainly an acquired taste and everything isn't for everybody, but for those of you who are willing to give it a shot and appreciate an artist in his top form then maybe there is still some redeeming qualities in this for you. The Return is no run-of-the-mill action series or soap opera so be ready for one of the craziest rides you may ever be on."
    },
    {
      "username": "rewtmoose",
      "userUrl": "https://www.imdb.com/user/ur32830756",
      "reviewLink": "https://www.imdb.com/review/rw7862092",
      "warningSpoilers": false,
      "date": "13 February 2022",
      "rate": "6",
      "helpful": "17 out of 18 found this helpful.",
      "title": "We'll never agree on this",
      "content": "Upon first viewing I absolutely hated this show. It wasn't the Twin Peaks I had been excited for, having watched the original series many times over, and I saw few, if any, redeming qualities.After a rewatch nearly five years later, I had a different mindset in place and made sure to take proper note of clues and plotlines. While I could see more interesting aspects of the \"return\" this time around, I still cannot possibly give it a positive review.Sure, there's enough subtext and complexity here for a college course, and there is obviously a high level of craftmanship behind the production, as well as a very pronounced vision guiding everything. But--and I concede that this is of course opinion--that vision clouds the entire show, prohibiting any attempt at a compelling narrative and snuffing out a lot of potentially enjoyable dialogue and acting.There is a lack of control over the tone, with scenes and performances that stick out like a sore thumb here and there in most every episode, including both completely unfunny lines and unmotivated tugs at your heartstrings. There's artwork and effects work that simply looks awful, probably with a most intentional style but that simply doesn't hold up at the viewers' end. And, as many point out, there is a huge problem in terms of pacing and payoff. Those who are somehow drawn in enough by the mystery playing out appear to ignore this, and I wish I could too!There seems to be a love-it-or-hate-it thing going on with this show. I would have liked to see more nuanced thoughts than just \"David Lynch is a genious, 10/10\" or \"wtf 1/10\". In my opinion, this is a flawed production of a misguided vision in terms of both storytelling and style, but there is enough to the mystery to warrant an attempt at watching. If it didn't waste so much time lost in its own head, it could have been significantly improved."
    },
    {
      "username": "ernesti",
      "userUrl": "https://www.imdb.com/user/ur2859500",
      "reviewLink": "https://www.imdb.com/review/rw6789258",
      "warningSpoilers": false,
      "date": "7 April 2021",
      "rate": "4",
      "helpful": "28 out of 41 found this helpful.",
      "title": "Lacks atmosphere, heart and soul of the first two seasons",
      "content": "There's always a great chance that sequels aren't going to be as good as the original and this is yet again another fine example how it usually goes.The earlier two seasons raised the bar so high that it was only going to be inevitable that the third season was going to be weak.In the first two seasons there weren't many unreasonably violent scenes and there was no sex at all. After all, great show doesn't need cheap tricks at all to work. Same can't be said of the third season which makes cheap tricks another form of art.In my opinion the decision of not playing the hypnotic music in the background was a great mistake. Nowadays directors don't even know how to use music to enhance the experience and yet again, it's no surprise that Twin peaks without the catchy music isn't quite like Twin peaks at all. All what's left is the theme that is played on each intro.It's not my Twin Peaks anymore."
    },
    {
      "username": "jjdausey",
      "userUrl": "https://www.imdb.com/user/ur2440884",
      "reviewLink": "https://www.imdb.com/review/rw6472433",
      "warningSpoilers": false,
      "date": "13 January 2021",
      "rate": "5",
      "helpful": "23 out of 32 found this helpful.",
      "title": "9 episodes stretched out to an interminable 18",
      "content": "Slow pacing is one thing. But going nowhere fast isn't my cup of tea... or coffee. But there are myriad flaws with this: limited time in Twin Peaks; cheap-looking digital look; too many newcomers; underutilized and/or misused legacy players; a terrible performance from a non-acting key player (you know who); no fan service at all; new loose ends; an ending that literally snapped me out of my romance with \"Twin Peaks.\" Sorry, but Lynch \"on heroin\" was not the alchemical formula that made the og series work. What a disappointment."
    },
    {
      "username": "akshatdave",
      "userUrl": "https://www.imdb.com/user/ur66171839",
      "reviewLink": "https://www.imdb.com/review/rw3713084",
      "warningSpoilers": true,
      "date": "21 May 2017",
      "rate": "",
      "helpful": "198 out of 335 found this helpful.",
      "title": "It is compelling enough already, perfect return of 90's masterpiece..",
      "content": "Possibly one of the best TV dramas ever, \"Twin Peaks\" managed to return in a challenging and unique way It is bizarre (not to mention intelligent) piece of television that has returned again with putting the pieces of puzzle together..Lynch introduced the first two episode in typically enigmatic fashion, recalling the tall trees which envelop the logging town-setting for Twin Peaks' supernatural mysteries.Original cast members Kyle MacLachlan, who plays FBI Special Agent Dale Cooper and Sheryl Lee (Laura Palmer), reprise their roles, while new additions include Naomi Watts and Laura Dern.In short, the new episodes are completely unlike any version of Twin Peaks we've seen in the past, and that's what's so exciting. This is no retread; this is something new. After you've seen the show for yourself, I'm guessing it's all you're going to want to talk about. It's going to be a wonderfully nightmarish summer. Music again plays an important role in establishing Twin Peaks' atmosphere with Portland, Oregon band The Chromatics contributing to the soundtrack.If you get a chance to watch Twin Peaks now, and I highly recommend that you do, it may seem strange that such a show was ever on TV at all. This is because most of television is so bland and boring and repetitious while TP is fresh and original and effective. Daring and provocative, it shattered the boundaries of most standard soap operas/TV dramas.There are great characters sprinkled throughout, my favorites being:Leland Palmer, and of course Coop, but really they're all interestingTo finish, one needs to watch that 90's version of show. It's not uniformly brilliant and sometimes just plain weird, but always rewarding and truly one of the landmarks of American television. Go get a nice piece of cherry pie, a cup of coffee, take four days off work and start watching it. Then watch how this masterpiece unfold.."
    },
    {
      "username": "TouchTheGarlicProduction",
      "userUrl": "https://www.imdb.com/user/ur52832854",
      "reviewLink": "https://www.imdb.com/review/rw3713199",
      "warningSpoilers": false,
      "date": "21 May 2017",
      "rate": "10",
      "helpful": "163 out of 307 found this helpful.",
      "title": "Bold, original, and uncompromising; well worth the wait but sure to be controversial.",
      "content": "After 25 years, Twin Peaks is back on the air. This revival is one of the most hotly anticipated events in entertainment to come along in a long time, and I think that many fans might not like this revival. This is not the goofy, bright Twin Peaks of the 90s, nor is it the bleak depressing Twin Peaks of Fire Walk With Me. This is something new. In fact, most of the first episode does not take place in Twin Peaks, with the people we know and love. When it does cut back to the titular town for a brief scene here or there, it is actually kind of jarring, as we feel that we are watching a completely different show. Nor do there at first appear to be any elements connecting the new central plots to Twin Peaks. I imagine that many people will be frustrated by this and maybe even quit watching, which is a shame because as the show goes on it gradually ties these things in to the main plot in a way that is very satisfying. So despite a rocky start, by the end of the second episode I was on board.I hope that people give this revival a chance. It really starts to come together in the second episode, but I think people's expectations might blind them to how brilliant this return is due to how unexpected many of the elements are."
    },
    {
      "username": "tor-claesson",
      "userUrl": "https://www.imdb.com/user/ur12231209",
      "reviewLink": "https://www.imdb.com/review/rw3797527",
      "warningSpoilers": true,
      "date": "4 September 2017",
      "rate": "5",
      "helpful": "123 out of 211 found this helpful.",
      "title": "Not relatable anymore, nor very likable",
      "content": "Although I've not enjoyed very much of The Return (with the exception of the exceptional Mitchum brothers and their female associates) I've done my very best to like it. To try to accept and understand it, but I find myself failing at that. Jeffries as a tea pot, an hour-long episode of a nuke going off and 15 episodes of Dougie. It's just a bit much to me. Throughout, there's just not very much to like about it.It's like a friend of my told me after a few episodes. The original series was quite an ordinary show, with an odd artsy twist to it. The Return on the hand is nothing but odd and artsy, and that's why it fails to capture me. There's nothing much to relate to anymore. Nothing much to make me care about the faith of the characters or their world(s).As for the ending, I'm quite disappointed with that as well. The idea of fate resetting, with new pieces but the same evil pulling the strings, is good. However, I feel that Lynch/Frost failed to deliver it in any sensible way, much as the failed to deliver anything in a sensible way this season.I loved the original series. The cast, the characters, the story, the atmosphere. I don't think I'll ever learn to love this show the same way. I'll keep struggling with it though. In a few years I'll have watched 3-4 times, and maybe I'll see it under a different light then. I really hope so. But I don't expect to."
    },
    {
      "username": "dierregi",
      "userUrl": "https://www.imdb.com/user/ur1090944",
      "reviewLink": "https://www.imdb.com/review/rw3878083",
      "warningSpoilers": false,
      "date": "10 December 2017",
      "rate": "1",
      "helpful": "104 out of 205 found this helpful.",
      "title": "A surreal conversation",
      "content": "David: Hey Kyle, what about playing again Agent Cooper in a totally plot-less sequel of my hit series Twin Peaks?Kyle: OK, David, but I am busy with other projects...David: No problem Kyle. In this series the main character will be Gordon, you know the FBI agent I play. He'll be the superstar, because he's much more interesting than Cooper and anybody else. This time Gordon will also be a chick magnet, with lots of women half his age flirting with him...Kyle: OK David, if you think that will work...David: Of course it will. Gordon is so interesting and irresistible. Not like that wimp Cooper.Kyle: Uh... OK... but as I said I don't have much time...David: No problem, your character will have only very few lines. In fact he's not in most episodes and when he is, he'll be catatonic. You'll just repeat the last words pronounced by the character you're speaking with and that's it.Kyle: Does not seem an interesting angle...David: There will also be the evil doppelgänger, with slightly more dialogue, but not too much. Don't forget that this series is about Gordon: His Return to Twin Peaks.Kyle: Uh... OK David - your audience love whatever you do, regardless... and I can focus on other projects, since this requires minimum effort..."
    },
    {
      "username": "MikesIDhasbeentaken",
      "userUrl": "https://www.imdb.com/user/ur25289178",
      "reviewLink": "https://www.imdb.com/review/rw3785985",
      "warningSpoilers": false,
      "date": "21 August 2017",
      "rate": "4",
      "helpful": "136 out of 265 found this helpful.",
      "title": "Notice how all the rave reviews praise the director?",
      "content": "Lynch is amazing, Lynch this Lynch that. Everyone is so desperate to love David Lynch I don't think they are watching the balls he's making. are there any reviewers that like this without creaming over how amazing David Lynch is? what other TV series does that happen with? where the guy making it can just do a load of nonsense, star himself in it, make it weird and everyone thinks it's genius.This isn't genius, the first two series were great, although it lost it's way a bit. But at least it had a goal, a story line. Which is just lost in this series.There's too many story lines that mean nothing, they won't reappear later and make sense of anything, they are there for no reason, dozens of characters you'll never see again but you wast too much time watching them think about something. each episode has 5 minutes where an awful band sing a song.. that's it, an awful band sing an awful song for 5 minutes. every episode. that's a tenth of the whole show watching a bad music video. it's ridiculous that you have to watch a 9 inch nails advert for 5 minutes before moving on with the show..Kyle Maclachlan walking around aimlessly got boring very quickly... how they persist in this the whole serious is beyond me. it's boring, the jokes are the same. Apart from that... there is some good stuff going on, a couple of clever story lines and interesting developments, enough to carry on watching, but there's just too much filler to make it anywhere near on par with the original series"
    },
    {
      "username": "FabledGentleman",
      "userUrl": "https://www.imdb.com/user/ur0406567",
      "reviewLink": "https://www.imdb.com/review/rw3713918",
      "warningSpoilers": false,
      "date": "22 May 2017",
      "rate": "8",
      "helpful": "168 out of 315 found this helpful.",
      "title": "A masterful continuation of the original saga",
      "content": "It's finally here! And the first 2 hour episode of season 3 is an absolute joy to watch. When the original series aired, i was in my early teens, but i could still enjoy the show. I might not have understood all that was going on, but as it turned out, neither did anyone else.This was the magic behind Twin Peaks, it had no conclusion, like ever. It's the everlasting chase or hunt for something, that is never found. And once the murderer was revealed in the original series, the viewers left the show quickly, it wasn't suppose to be revealing. People watched it for the mystery, and apparently this mystery could have been stretched for 10 seasons, and people would still have been glued to their seats every time a new episode aired. The show was that captivating, more so than almost anything ever aired before.This was so different from anything else back then, no one had ever dared to make something like this, almost not even with movies. Actually the show was intended to be just a TV movie, but the people that saw it went ballistic, so they decided to make 7 episodes to air. But then the show exploded in popularity and got 10+ emmy award nominations and suddenly the show became insanely popular.It's kind of a mystery how, it was definitely not a show made for everyone, but still, it ranks as one of the best shows of all time. Why? What was so special about this show? Well you could probably line up 10 professors and movie experts to try and explain it, you would probably get 10 different answers.So here we are 25+ years later. The first episode of the new season has just aired, and i am thrilled. This was an absolute joy to watch, and it captures the essence of the original series really well. You can tell that Lynch is all over it, he has total control. And just as you would expect, it is bizarre, weird, mystical, scary and incredibly entertaining. And i have no idea what so ever what is happening.When i saw this first episode i thought of Quentin Tarantino a lot and how great he is at setting up conversation scenes with lots of tension, like the pipe scene at the beginning of Inglorious Basterds. Which is one of the best scenes in all of movie history.Here in this first episode you have this kind of tension in almost every scene, and the people could be doing anything. Eating donuts, checking voicemails, deliver packages, watch TV, have sex. Whatever, the suspense is with it all the way, and i have no idea why, because i have no clue what I'm watching. It's just there.This is one of the things that makes Twin Peaks so special, you are just along for the ride, no matter where it takes you, just enjoy the moment. Let it embrace you, it is what you want it to be. And this show does this better than any other TV show in history. The new season is apparently no exception. After the first episode I'm sold, when the song was performed at the end of it, while we see many of the original cast come together, that just sealed it for me, what a way to continue the saga. Absolutely brilliant film making.I can't wait to see the rest of it, this is quality.10/10 first episode - Masterful"
    },
    {
      "username": "cjonesas",
      "userUrl": "https://www.imdb.com/user/ur79683341",
      "reviewLink": "https://www.imdb.com/review/rw5580248",
      "warningSpoilers": false,
      "date": "26 March 2020",
      "rate": "1",
      "helpful": "38 out of 71 found this helpful.",
      "title": "Completely and inadmissibly Not understandable",
      "content": "With respect to viewers sharing and viewing this piece of work as masterful and being enthusiastic about it, I couldn't have the same opinion after watching it, most of the time with lowered volume throughout the episodesI agree that some scenes are very intense and interesting, but, when you have constantly weird acting (and weird doesn't do the word justice), unbelievable scenes with completely illogical output, crazy music and soundtrack that are skating on your nerves and extra annoying sounds in all decibels coming from characters and events, then please understand and agree that a normal person cannot and won't hold for a long time.The person will feel craziness ramping all over his/her mind while having eyes popping out of their sockets with the lips either tightly pressed or mouth half-open in disbelief and shock.It was that hard to follow and finish it, but nevertheless I did it, because I rarely leave a series or movie halfway.Recommended only to \"special\" viewers, which according to the reviews are present in the dozen."
    },
    {
      "username": "horrorgasm",
      "userUrl": "https://www.imdb.com/user/ur8035952",
      "reviewLink": "https://www.imdb.com/review/rw3776177",
      "warningSpoilers": false,
      "date": "9 August 2017",
      "rate": "",
      "helpful": "243 out of 479 found this helpful.",
      "title": "The emperor's new clothes",
      "content": "What a fascinating case of mass self-delusion this has been. It's truly amazing and disgusting how heavily people are stroking themselves over their ability to force themselves to choke down something that is so very poorly executed just so they can reach that oh so \"clever\" hidden story within.Look, I know that it must be very comforting to keep talking down to people about how they just don't get the weirdness and complexity of it all (because WOW, use of metaphor and non-linear storytelling in the video medium? UNHEARD OF!), but that's really not the problem here. It's the absolutely abysmal pacing and structure. Yes people, we get it. Lynch likes to pull the same old thing out of his bag of tricks that he always has, where he tries to artificially induce unease by drawing scenes out well past their welcome, except instead of the handful of times spread out across a 2-3 hour movie we are now treated to 45/60 minutes of this filler in each episode of an 18 hour saga, leaving very little room for any actual worthwhile content. You don't need to be a mathematician to see that the ratio between the two is incredibly uneven. But OK, yippee hooray for ARTISTIC INTEGRITY! He has such complete free rein to spew out completely unfettered streams of consciousness that no one at all will dare to tell him that maybe things like having a confused old woman talking to the police about who has the keys to a door for 10 straight minutes is an absolute waste of film, and none of you will dare admit that this pile of slop is in dire need of editing because you're too busy preening about what an artistic genius Lynch is, and how open-minded and avant-garde you are by extension for being able to wrap your heads around a plot that's literally been done a hundred times before in superhero comic books. A big slow clap for you all."
    },
    {
      "username": "shanayneigh",
      "userUrl": "https://www.imdb.com/user/ur1738956",
      "reviewLink": "https://www.imdb.com/review/rw4028014",
      "warningSpoilers": true,
      "date": "9 January 2018",
      "rate": "1",
      "helpful": "47 out of 89 found this helpful.",
      "title": "Do you want to watch David Lynch masturbate for 18 hours?",
      "content": "I haven't seen anyone this convinced of and enamored with his own ego and perceived greatness since I read Norman Mailer's \"Of a Fire on the Moon\", which was an equally dreadful experience. It's once and for all clear that David Lynch is the Donald Trump of film making. But of course you have the usual sycophantic fans gushing over everything Lynch does, smugly patting themselves on the back sneering at people who just don't get it. You could have Lynch farting into a xylophone and they would be convinced that it held the key to the meaning of life. I talked to a colleague who loved this new season and when asked why said that it was so subversive to the medium of television. Fair enough, but so was Andy Warhol's \"Sleep\" and \"Empire\" to the medium of film, but I would dare anyone to call them good movies. I even doubt that this season was made by people who have actually seen the original Twin Peaks. It's like someone heard of the original Twin Peaks third hand and now is trying to tell you the gist of it in a single tweet stretched into 18 hours of television.And this is not nostalgia talking. I rewatched the original Twin Peaks immediately before taking in this new season, and it's by no means a masterpiece. Not even the first half, like a lot of people claim. It's melodramatic at times, and plays off the farce elements too much for my liking. Little did I know that the (alleged) comedy would be even worse in this new season. This little exchange between the semi-deaf Gordon Cole and Albert Rosenfield sums up the comedic sophistication of Lynch and Frost: - I would really like to get back to this fine Bordeaux. - What kind is it? - 11:05 There's your genius, ladies and gentlemen.But, and this is a big but, the original series had characters who, for most of the time, spoke like normal people, and at least the semblance of a story. The characters may have been quirky and not the sharpest tools in the shed, but at least they weren't mentally retarded to the point that even the concept of a mobile phone is so mind blowing to them that they fall off a chair in fear. In 2017, mind you. The characters in this new season are virtually unrecognizable, and I'm not talking physically. Everyone sits stares, pauses, and say their lines like they are pumped full of Valium and starring in a hostage video. Seeing Hawk, Lucy and Andy sit around a conference table talking about chocolate bunnies like they're in a coma, was painful to watch. And Kyle MacLachlan stumbling around like a child for hours in oh-so-hilarious scenes where no one around him behaves like normal people, was nothing short of torture.To call this new season slow is like saying that Donald Trump and Hillary Clinton are untrustworthy. Slow doesn't even begin to cover it. How about spray painting shovels and watching a hooker get dressed in real time? How about silent shots of a highway in the dark for minutes? I'm actually surprised and a bit disappointed that Lynch didn't show Cooper and Laura/Carrie driving from Texas to Washington in real time. Fingers crossed for season four.Let me sum it up: - Just because it's slow doesn't automatically make it profound. - Just because they pause ten seconds between each line and Lynch holds each shot ten seconds longer than it needs to be doesn't automatically make it art. - Just because it's incomprehensible doesn't automatically make it well written. This new season reminds me of two things.The first is how John Lennon after learning that an English teacher made his class analyze Beatles lyrics, wrote the lyrics to \"I am the Walrus\" to be as nonsensical and incomprehensible as possible. \"Let the f**kers work that one out\", like Lennon said.The second is a short film I made as a lark with some a friend some years ago. We cobbled together to most random things we could imagine, everything from religious imagery to scenes out of a porno for good measure, of course in black and white set to pretentious music. Our goal was to see what kind of reactions we would get if we passed it off as an art house film. You would not believe the cockamamie interpretations people came up with.I am convinced that Lynch is trolling everyone.The emperor is not only naked. His concept of clothes is a flamingo vomiting to the beat of Rimsky-Korsakov's \"Flight of the Bumblebee\".A demented octogenarian p*ssing himself for 18 hours straight would have more meaning and entertainment value than this pretentious garbage."
    },
    {
      "username": "dkwestbrook",
      "userUrl": "https://www.imdb.com/user/ur85119685",
      "reviewLink": "https://www.imdb.com/review/rw4844625",
      "warningSpoilers": false,
      "date": "12 May 2019",
      "rate": "9",
      "helpful": "45 out of 69 found this helpful.",
      "title": "Sure to be controversial but rewarding for Lynch fans",
      "content": "If you're not a fan of David Lynch then you're not going to like this show. End of story. Unless you've watched and loved Lynch's movies like Eraserhead, Blue Velvet, Wild at Heart, Lost Highway, Mulholland Drive and Inland Empire, then you're not going to like The Return. This is hardcore Lynch, challenging for even his biggest fans. I wouldn't call The Return a sequel to the original Twin Peaks. It's more a sequel to Fire Walk With Me than anything else, with a few elements of Twin Peaks sprinkled in. So, if you're just a fan of the original Twin Peaks and you're not familiar with Lynch's work, then The Return is not for you. You're not going to like it, I can assure you of that.This is ARTHOUSE TV. It's not a murder mystery like the original. It's a hardcore surrealist midnight movie style psychological horror. And while I love it because of that, I can see why some people hate it."
    },
    {
      "username": "amesmonde",
      "userUrl": "https://www.imdb.com/user/ur1761695",
      "reviewLink": "https://www.imdb.com/review/rw3715625",
      "warningSpoilers": true,
      "date": "25 May 2017",
      "rate": "",
      "helpful": "34 out of 65 found this helpful.",
      "title": "Quirky must see",
      "content": "The David Lynch and Mark Frost revival brings back the show without the restrictions of network television as a single 18-hour movie split into chunks and (I'm currently 4 episodes in) all end with a different band performance. Yes, composer Angelo Badalamenti has returned and the nostalgic Twin Peaks theme is intact with a slightly different credit sequence, the mill replaced with the Red Room's curtains.Doppelganger Cooper (Kyle MacLachlan), must return to the Black Lodge in order for the real FBI agent Dale Cooper to be freed from his 25 year slumber. But things are completed with a third Cooper (also MacLachlan) throw into the mix. While all of this is going on, other events are transpiring in New York guarded building where a mysterious large glass box has sprung to life and killed its watcher. In South Dakota, a severed head and a headless body have been found and all the various narrative threads have yet to come together in any fully coherent matter.Off the top of my head the majority of the cast return, those actors who have since passed on even show up as manipulated archive footage, notably Major Garland Briggs (Don S. Davis) floating head, David Bowie's Philip Jeffries' character is mentioned. Who knows who else will turn up. Some have passed on since filming the latest series and are acknowledged in the credits including the posthumous appearance of Catherine Coulson's The Log Lady and Miguel Ferrer, who played Albert Rosenfeld. Those who don't return have simply fallen out with Lynch and their reasons are well documented in the press.Lynch has created something just as fascinating as the various directed predecessor and what is most striking is that quirky tone of the old series is recreated without merely forcefully copying it (as the recent X-files tried too hard to do). Lynch is on form here and it's just as weird as ever. The mix of crime thriller with elements of surrealism, odd humour, soap opera outlandish off beat acting and supernatural horror is as effective as ever. If you're left flummoxed - that's the fun, because you're probably meant to be.Twin Peaks helped shape much of the modern television landscape and this latest addition is great looking with surprises, thrills and chills - season 3 is an artsy must see."
    },
    {
      "username": "jgcorrea",
      "userUrl": "https://www.imdb.com/user/ur0484367",
      "reviewLink": "https://www.imdb.com/review/rw3843515",
      "warningSpoilers": false,
      "date": "28 October 2017",
      "rate": "1",
      "helpful": "36 out of 68 found this helpful.",
      "title": "It never peaked, much less blinded me",
      "content": "Not like the first TP, or Fire Walk with Me. This is sheer nonsense and no rhythm: unbearable, charmless and humorless, with countless new characters and confusing plots that do not connect with each other. Ridiculous dialogue and too much Actors Studio Method also aggravate the nightmare. The action does NOT occur in Twin Peaks. It is a surrealistic and abstract collage of images that lack consistency. What nonsense is this of a zombie for protagonist? All this \"symbolism\" is agonizing, pseudo-sixties. What sounded at first like a great idea - to reinvigorate an icon from the '90s - has not returned what it was permissible to expect."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw3856039",
      "warningSpoilers": false,
      "date": "12 November 2017",
      "rate": "",
      "helpful": "8 out of 12 found this helpful.",
      "title": "Great mix of the unnerving, the absurd, the dark, the mystifying, and the slow",
      "content": "A few years ago I rewatched all of the original series, having not watched it since its original broadcast. Doing this reminded me how creepy, engaging, and effective, it was, but at the same time just how I didn't care for the many sections in S2 where it is soapy and disconnected from where my interests were. The Return starts in the space that interests me most, although at the same time it seems to be deliberately trying to shake off anyone not willing to go with the darker and more disturbing elements. The first two episodes offer no respite from weirdness, disturbing imagery, unsettling silence, and violent moments. It was two hours which had me wholly focused on the television, but yet with the sense of it pressing on me and making me uneasy.This continues throughout the season, although with more balance. At times it is slow; at others it is a dizzying overload of ideas. Characters and moments and ideas connect back to the original series and the to the prequel; but at the same time there are frequent characters and moments who seem to be stand-alone and it is okay if we don't know them. As a narrative I was held by it even though it spends so long doing nothing, and has elements which don't ever get resolved or connected to much else. The tone is a lot to do with this working, and Lynch's constant presence feeds a great sense of darkness being just below all of our sunny lives. Elements of the writing are extended too long, and I think even those that liked the Dougie Jones arc (including me) would concede that it was too much to take almost the entire season to deliver it. That said, Lynch builds around this very well, with plenty of colorful characters, and increasing connection to where the rest of the show is happening.This place is one of dark violence, spirits, unseen worlds, death, and yet it also has time for some characters from the show, and plenty of broad and odd comedy. The mix works very well; much better than I expected. At times the storyline tests patience, and then it will throw in a section or episode which throws loads more on the table and leaves with plenty to think about. I'll not pretend to understand it all, or to get all the references, but I enjoyed not only the watching, but then reading the fan forums to get help with all the connections and reference points. The cast seem to be entirely on board with everything that is being done, and this adds a lot to it – but essentially it seems Lynch got full support to do whatever he wants, and this is what makes it so engaging. Technically production standards are very high, but it is the sound work that really sticks with you – the space, the hums, the unsettling nature of all of it.As a total product it is bewildering, frustrating, exciting, confusing, engaging, and annoying. There is plenty to dislike, but overwhelmingly it delivers a great mix of the dark, the absurd, the cheering, and the mystifying; all with plenty of style, tone, timing, and patience."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw3753095",
      "warningSpoilers": false,
      "date": "13 July 2017",
      "rate": "8",
      "helpful": "20 out of 37 found this helpful.",
      "title": "Confusing and strange...exactly what you would expect!",
      "content": "\"Twin Peaks\" and this re-boot of the series on Showtime is a program for select audiences only. Those who consistently watch the show love it and many might try but not stick with it because there is so much strange and surreal content. This isn't a criticism...just that it's a show that would tend to have polarized reactions since it is so unique and strange...which isn't that surprising considering it's from David Lynch.The program picks up 25 years after the original series. Many of the original actors have returned, many have not (and several have died such as Bob and the Major). So, I am sure this had a big impact on how they wrote the story. And, this would probably explain why so far so little of the story is set in Twin Peaks but in places like New York City and South Dakota. It's every bit as weird as the old show and the main plot involves the activities of the evil Cooper doppleganger as well as the real, but incredibly brain-addled Cooper who has just magically returned from that weird red room.Overall, it's well directed and acted. Episode 8 is one in particular that will polarize even dedicated viewers as it seeks to explain the origins of Bob. I didn't care for it...a friend of mine thought it was one of the best episodes. Regardless, the show is incredibly original, strange and is hard to stop watching...at least for me."
    },
    {
      "username": "davidmvining",
      "userUrl": "https://www.imdb.com/user/ur110212703",
      "reviewLink": "https://www.imdb.com/review/rw6580122",
      "warningSpoilers": false,
      "date": "9 February 2021",
      "rate": "10",
      "helpful": "13 out of 22 found this helpful.",
      "title": "A capstone",
      "content": "This really is an 18-hour movie. From beginning to end, it's the same pair of writers, Mark Frost and David Lynch, the same director, Lynch, and the same cast in the same production telling one very long story. That it was released in individual episodes on Showtime makes little difference, I think. It's also my favorite piece of storytelling from the entire franchise of Twin Peaks. The first season is good, but its adherence to a pretty much dead genre, the primetime soap opera, limits my enjoyment of it. The second season has a real dip before ending strong. Fire Walk With Me is very good, but suffers from the hope that it would spawn further movies. This return is a go for broke attempt at creating the combination of quality character based storytelling and weird mythology that made Twin Peaks at its very best.There's so much to go into this in terms of story beats, as you might expect from an 18-hour long story with over two hundred speaking parts. At its most basic, this series is about FBI Special Agent Dale Cooper returning from the Black Lodge where he's been held prisoner for twenty-five years, BOB in the body of a Dale doppelganger trying to stay on Earth instead of returning in exchange for Cooper, and the events around them that lead them back to Twin Peaks, Washington for their final showdown. Along the way, we see returning faces from the original show like James, Big Ed, Norma, Deputies Hawk and Andy, Lucy, Gordon Cole, and Arthur. We are also introduced to a bevy of new characters like Richard Horne, William Hastings, the Mitchum Brothers, and Janey-E Jones. We also get introduced to new elements of the mythology like the Eyeless Lady, Judy (who might be the Experiment), tulpas, and the Woodsmen.There is a lot going on in this show, and like much of Lynch's work, there's a strong story that undergirds all of this. Well, there are several stories that all end up converging towards the end. For those who liked the original show's look at quirky characters, we have our regular look-ins at the denizens of the little Washington town and their lives like Shelly and Bobby dealing with their daughter and her scummy husband. On the other hand the film is alive with Lynch's typical brand of abstractions that color his stories. The most prominent of these is Part 8, but I'll get to that in a minute.So, Dale Cooper gets sent back, but Bad Cooper knew this day was coming and created a tulpa, a copy of himself, to try and direct Cooper into the tulpa rather than the doppelganger body BOB currently inhabits with a hit team standing by to kill Cooper in the tulpa's place as soon as it happens. Cooper is a sign of hope and life in the decaying world of Twin Peaks, so he easily evades the attempts. However, there's a twist. Cooper in the place of the tulpa is like a walking baby. He needs to be pushed in every direction anyone wants to go, even to the bathroom, and Dougie, as the tulpa is known, is one of the joys of the series. His innate goodness and positive effects on those around him is like a warm blanket. He barely knows what's going on, often just repeats the last few words of a sentence he hears, and follows signs from the White Lodge around to help guide his actions, like when he chooses slot machine after slot machine that each give him a jackpot in the Silver Mustang casino, owned by the Mitchum Brothers. This gets him on the brothers' radar, especially when they hear from Dougie's co-worker at Lucky Seven Life Insurance that Dougie was responsible for the brothers losing out on a $30 million settlement on a fire at one of their building. Through Dougie's innate goodness and help from the White Lodge, he scribbles on some insurance forms that convinces his boss that the $30 million was incorrectly denied, which gets the Mitchum Brothers to love Dougie and stay with him through the end of the story. It's kind of a pure joy to watch it all unfold.The opposite of Dougie is Bad Cooper. Everywhere he goes he spreads chaos and death. Matthew Lillard plays a high school principal, William Hastings, who was having an affair with a librarian while they investigated \"the Zone\". Bad Cooper arranges for Hastings to be framed for the librarian's death, then kills Hasting's wife with her lover's gun just because. He arranges for the murder of people with whom he's completed his use just because. Where Dale/Dougie is a force of good, Bad Cooper is a force for evil. The film would be less interesting if it were just those two forces against each other, though. The two never actually meet. Instead they influence the world around them in different ways, essentially moving pieces on a board in a chess game that Bad Cooper seems well aware of while Dougie barely knows how to get out of a car.Through the film's first sixteen and a half parts, I found the action easy to understand. There was a lot going on in a lot of different places with a lot of different characters, but it was easy to imagine everything coming together in the end. The exception to the flow of action was Part 8 where Lynch sidesteps the entire story to give an origin story for the evil haunting this world of Twin Peaks. After a few minutes showing the weird way Bad Cooper returns to life through the help of the otherworldly Woodsmen, the action jumps back in time to 1945 and the explosion of the first nuclear bomb in New Mexico. Told in a purely cinematic mode with no dialogue and only image and sound, we watch the explosion from afar, zoom in steadily, and see the explosive force from the inside. We see the oft-mentioned convenience store suddenly come alive with the presence of the Woodsmen in a violent and scratchy manner. In response to this, we see inside the White Lodge for the first time where the Fireman creates the seed that will become Lauran Palmer and sends it to earth in response. We jump ahead a few years when the Woodsmen reveal themselves to the world and the seed becomes a frog-moth creature that finds Laura's mother Sarah and crawls into her sleeping mouth. Now, it took me a few minutes to write this but it takes the film about 45 minutes to show, and it was glorious. I loved every second of it. My wife, however, hated every second of it, preferring the idea of a two-minute literal explanation rather than an extended cinematic treatment of the idea that conveys as much a feeling, probably more so, than just another piece of the overall mythos puzzle of Twin Peaks.And then we get to final part and a half, and the film moves beyond the basic story we've been following, and it makes no effort to hold the audience's hand along the way. Cooper, fully awake in Dougie's place, takes the old key from the Great Northern Hotel and passes through a door, leaving behind Diane, his old assistant, and Gordon Cole. He gets transported back in time to the events of Fire Walk With Me where he rescues Laura Palmer from her fate, but she vanishes as he leads her through the forest, and we cut back to the present day to see Sarah Palmer still anguishing over her daughter's death, even more so in that moment. He then finds himself back in the modern period, without Laura, facing Diane again, and they must travel 430 miles until they will go...somewhere else. That somewhere else is never explicitly explained. After they have sex for murky reasons, Diane disappears, and Dale finds himself in Odessa where he finds a woman who looks like Laura Palmer whom he takes all the way up to Twin Peaks and everything is wrong, including the fact that Laura's old house is owned by some strange woman who's never heard of Sarah Palmer.Now, the thing about Lynch is that focusing on the literal is often a mistake. There's a clear emotional connection he's trying to make through his abstractions, so the ending, despite its complete lack of real context, ends up working and doing what it's supposed to do. Bad Cooper is gone. BOB has been punched into oblivion by an English kid with a gardening glove permanently attached to his hand. And yet what do we want? We want these weird powers to make Laura alright, but Dale can't save her. It seems like he can change some of the circumstances of her death, but he can't prevent it. When Dale and Diane pass into the other place (our world instead of the \"world\" of Twin Peaks?) and they find the woman who looks like Laura, she's not Laura, then who is he trying to save? We had our elation at watching BOB finally die, but we can still feel a certain emptiness because Laura, the good girl abused endlessly by her father possessed by BOB, is still dead, and Dale should do something shouldn't he?The movie ends with no real answers to these questions, leaving a lot up to the audience to sift through, and I really appreciate that. It's packaged densely in the final hour and a half with little explanation, but I think the emotion is clear. I've heard and read more interpretations of the ending that go in depth about the presence of Judy, the Palmer house being the center of evil, and more, but that kind of exploration of mythos isn't what really draws me to this story.This feels like a capstone, perhaps the more traditional form of the word masterpiece. It is the work of a master that sums up his body of work at the same time that it stands alone. The culmination of Twin Peaks and Lynch's film work, The Return is a gloriously entertaining extended adventure that looks at the idea of loss and comes away sad. It examines evil full on and makes us uncomfortable. It embraces warm humanity and fills us with joy. It's a massive, complex work that I look forward to revisiting at some point in the future.And one final note: Albert is the best."
    },
    {
      "username": "wisDOM87",
      "userUrl": "https://www.imdb.com/user/ur1484694",
      "reviewLink": "https://www.imdb.com/review/rw4238523",
      "warningSpoilers": false,
      "date": "14 July 2018",
      "rate": "4",
      "helpful": "20 out of 30 found this helpful.",
      "title": "Profoundly disappointing",
      "content": "There's a scene in Episode 12 of Twin Peaks: The Return (hereafter, TP3) in which Agent Alfred Rosenfield (played by Miguel Ferrer) has some important, confidential news to impart to Agent Gordon Cole (played by David Lynch himself) and visits him in his hotel room. Cole, however, is entertaining a lady friend (whom we have not seen before); he asks her to leave. What follow is an excruciatingly drawn-out farce in which - over literally 4-5 minutes - she slowly puts on her shoes, inches her way towards the door, says goodbye, giggles coquettishly etc. all in the most desultory fashion possible, with Lynch standing there smirking away to himself the whole time. To Albert's relief she eventually leaves, after which Cole makes a joke about a turnip and informs us that \"there are 6,000 languages spoken in the world today\". The scene adds nothing to the plot. It is not especially amusing or interesting, and indeed we never see this woman in TP3 again. I focus on it as it perfectly encapsulates what's so wrong with TP3 and the basically hostile attitude it has towards its viewers.Most TV series (and films, books etc.) have one or a handful of characters who are the focus of the show and who we get to know well over the course of the series, and an overall narrative arc that the viewers can engage with and become engrossed in. The original Twin Peaks is a perfect example of this - it gave us Agent Cooper, brilliantly played by Kyle MacLachlan, who we implicitly identified with as the outsider in this strange little town, and a plot device (uncovering the murderer of Laura Palmer) that kept the viewer engaged with both the characters and the story over many episodes. Off this fairly conventional core Lynch hung his eccentric baubles, tangents and surreal subplots and it worked, as he took the viewer along with him and his surreal style gradually emerged from a solid core of character and plot-driven substance. The contrast with TP3 could not be more stark. There are a seemingly endless number of characters and sub-plots in TP3, however the overwhelming majority are not developed or explored in any depth. There are numerous scenes in which characters appear and then disappear never to be seen again (e.g. the numerous drinking scenes in the Roadhouse, the Buckhorn and Las Vegas police officers, Becky & Steven, the Buenos Aires scenes, the New York couple, the humming in the Great Northern Hotel etc.). Sometimes these characters discuss others - at length - who do not even appear in the show. The end result is that the viewer has no clue as to which characters they should emotionally invest in, which will be integral to unravelling the plot and which not, with the final result that one ceases to care about any of them. In TP3 Lynch has removed the substance and left us just with his eccentric baubles, and forced to stand alone they quickly become sterile, unengaging and ultimately boring - much like the dull, interchangeable indie-electro band performances that end each episode. There is a clear parallel here with Season 2 of Twin Peaks, where the network forced Lynch to reveal the identity of Laura Palmer's killer midway through the series, and - thus shorn of any supporting structure - the whole edifice collapsed, ratings plummeted as viewers lost interest, and the show quickly became enmeshed in an almost self-parodic series of bizarre, tedious and uninteresting subplots. In addition to the lack of plot or pacing in TP3 there are also numerous scenes of sadistic murder which serve only to allow Lynch to indulge his sad, juvenile fascination with extreme violence.In TP3 characters from the old episodes do appear, though these are basically cameo roles which add very little and seem to have been included more as a sop to fans of the original series. The new ones are largely so uninteresting and undeveloped that they might as well not have been included. This being Lynch, he has of course managed to attract some stellar actors and actresses - Tim Roth, Naomi Watts, Harry Dean Stanton, Laura Dearne, Michael Cera, Robert Forster etc. - though their considerable talents are so underutilised and wasted that they might as well not have bothered. Kyle McLachlan in particular is short-changed, forced as he is to spend a good three-quarters of the show bumbling along in a semi-catatonic state as 'Dougie Jones', in what must surely rank as one of the worst, most excruciatingly wearisome sub-plots in televisual history (not to mention including one of the most cringe-inducingly bad sex scene I've ever seen). In the unlikely event of the network commissioning a fourth series I would not be at all surprised if McLachlan declined to participate.However it's not all bad - this is Lynch after all, director of such cinematic gold as Blue Velvet, The Elephant Man and Lost Highway. Naomi Watts gives her all to what is basically the rather dull role of 'the nagging wife' stock character. The Mitchum brothers are hilarious and brilliantly portrayed, and - shock, horror! - are also given some emotional depth by the use of quiet asides that reveal some of their backstory. The dream/fantasy sequences and Red Lodge scenes are superb and a real treat for Lynch fans. And of course Lynch as ever is adept at creating a certain mood in the viewer via the use of light, mise-en-scene and music. The 'Gotta Light?' episode in particular is a wonderfully dark, genuinely unsettling piece of experimental art that's as good as anything Lynch has done, albeit marred by graphic shots of skulls getting crushed by hand.Sadly these gems shine all the brighter due to turgid muck in which they're set. If Lynch has set out to create an overly long, overly drawn-out film-poem which delights in its eschewing of things generally deemed necessary in a 16-hour TV series - such as plot or character development - as well as viciously eviscerating all the human warmth and humorous quirkiness that made the first run such a success, then he has succeeded admirably. However the flip side of this aloof approach is to leave the viewer emotionally cold and completely unengaged - bored, in a word. Of course the critics - unwilling to criticise the Lynch-god - have been praising it to the heavens. Apparently it is a bold, exciting experiment in pushing TV past such boring old traditional tropes such as 'plot' or 'character development', a glorious postmodern deconstruction of televisual norms, a conceptual art masterpiece in mood and suggestion. Well, like most postmodern conceptual art it will appeal only to a very small coterie of self-important pseuds, congratulating themselves for being so clever for 'getting it', whilst leaving the vast majority of those stuck-in-the-mud, conventional viewers and Twin Peaks fans in the cold. Now, experimental Lynch can of course work very well - however this tends to work best when he manages to first emotionally engage the viewer - as he does so expertly in Lost Highway, Mulholland Drive, the first series of Twin Peaks, or even the flawed Inland Empire. Often Lynch will introduce a fairly realistic world with characters we grow to care about, and then hit us with his surrealism and reality-shattering experimentalism. He succeeds because he takes the viewer with him as they have invested in the film and its characters and actually care about where it goes and where the characters end up, even if they don't fully understand everything they're seeing. With TP3 however the whole sagging mess just plods along, episode after increasingly dull episode (indeed a friend of mine accidentally skipped 3 episodes and didn't even notice) before eventually whimpering out in a conclusion that of course concludes nothing. To return to my opening paragraph and that scene in the hotel - we are Agent Rosenfield, patiently waiting for Lynch to get a fricking move on so we can get to the good stuff we know he can deliver. In that scene Lynch is there the whole time, quietly smirking to himself - knowing that he can do whatever he wants, knowing he can test the audience's patience repeatedly and still keep us watching because hey, it's David Lynch the artistic genius and American auteur who can do no wrong. David Lynch - the man who can make a film about a man riding a lawnmower across Iowa deeply engrossing. But as the credits roll on the final episode of TP3 one can almost hear Lynch laughing to himself- 'ha ha - gotcha, made you watch!'I would quite happily re-watch the first series of Twin Peaks, and even the flawed second. As for TP3, with the possible exception of the 'Gotta Light?' episode (which works quite well as standalone film) I will not be sitting through this endurance test again, and it is sadly destined to join Dune and Wild at Heart on the list of Lynch works I have zero desire to ever watch again. If the above critique has the feel of an almost personal betrayal, it is because I'm angry that I wasted 16 hours of my life on this purely out of loyalty to Lynch, but it is also because I love Lynch's work and know that he is capable of so much better. Deeply, deeply, deeply disappointing."
    },
    {
      "username": "hitch-34",
      "userUrl": "https://www.imdb.com/user/ur12673389",
      "reviewLink": "https://www.imdb.com/review/rw3756555",
      "warningSpoilers": false,
      "date": "16 July 2017",
      "rate": "1",
      "helpful": "196 out of 365 found this helpful.",
      "title": "At least I figured out the alleged High Ratings here on IMDb for this DRECK",
      "content": "Quite simply, I loved the original TP. I even like most of David Lynch's work, although not all of it. But in watching this, all I can say is, DL, either go BACK on your meds, or get OFF of your meds-- whichever is making you think that this crap is worth watching. If it gets renewed, I'll know that you obviously have the pictures of some studio boss somewhere, with a kid and a dog. And you KNOW what I mean.The ratings? Want to amuse yourself? All those haughty 10-star ratings, saying \"if you don't get it, well, go watch some drivel someplace?\" Click through and look at the OTHER ratings from those folks. Oh, wait...almost NONE of them have, wait for it, any other rating or review--ever. And that one review is for TP 2017, as it happens. You know, all these years, I've never really believed in the big Paid Reviewer conspiracy/meme that's been all over the Net--but I do now. All these inexplicable 10 ratings, for a show that is simply dreck--and wow!--all these raving fans of auteurs everywhere, have ONLY decided to review ONE SINGLE SHOW? C'mon...paid reviews, anyone? I'm surprised, IMDb--you're owned by Amazon, and I'd have thought you'd have tumbled to this by now, as you've banned it on the Mothership site. The show is simply unwatchable. I've tried, I have, but the myriad criticisms leveled by other reviewers here are accurate--the show is slowed down to beyond boredom level. In ep 7, Lynch runs film of a guy sweeping up a bar, for TWO MINUTES, after which, the bartender answers a phone call and has a cryptic convo about 15-y.o. hookers. Two minutes? Then we have this ridiculous discussion between Henry Horne, and Ashley Judd, wasting another 5 minutes, in her office, chasing some \"hum.\" The nonsense with Dale Cooper being a Zombie? We watch him stumble around, monosyllabic--not even knowing how to pee(??)--for WEEKS? And nobody takes him to a doc? Nobody notices that he acts like he's had a stroke? His domineering wife doesn't domineer him to a doctor?The whole \"symbolism\" shtick is simply agonizing. The psuedo-60's- trippy \"let's see someone's consciousness\" stuff is, well, 50 years old. If I see one more distorted-convo crap, I'll shoot my TV. And, of course, Lynch HAD TO put himself in there, as Deaf Albert, which wasn't that damn amusing originally, much less now. What a SHAME. I was dying to see this show...now I'm dying to never see it again. It's simply horrible. I literally cannot see any sane studio exec in charge of properties greenlighting this. I'm sure it sounded like a great idea--who wouldn't think so, reinvigorating TP, right, the cultural phenom of the 90's?--but this is NOT what anyone expected. The only thing that this has to do with TP is ripping off the same characters and same actors. Even the shtick--like the ever- idiotic Lucy--is old and tired. Watching Lucy flip backwards in her chair, because she's \"scared\" that the Sheriff walks in, while talking to her ON the phone, after a quarter century of cellphones? Oh, come ON. Lucy was naive, and sweet, and not bright, but she wasn't a moron.Enough. DL, retire gracefully from the field. This was an egregious misstep."
    },
    {
      "username": "thePopcornExplorer",
      "userUrl": "https://www.imdb.com/user/ur36922988",
      "reviewLink": "https://www.imdb.com/review/rw6622397",
      "warningSpoilers": false,
      "date": "21 February 2021",
      "rate": "5",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Oh boy, was this a ride...",
      "content": "A dark, twisted and unexpected ride I'll have some trouble breaking it down but I'll try.25 years have past and Twin Peaks gets a very anticipated return to television and probably for original viewers of the 90s version these were quite exciting news. I've just recently seen the first two seasons, which I have to say I quite enjoyed, being my first experience watching Lynch's work, it was an hypnotic atmosphere, a bold story surrounding a mystery murder filled with quirky and interesting characters, so although I didn't have to wait 25 years I was still with some expectations towards the third season - I didn't know what I was in for..First let me state that I respect cinema in all its forms , I might not like them all, but I respect the artists and their freedom to express themselves. Not all styles are liked by everyone, and clearly if this is Lynch, I definitely concluded that it is not my cup of tea, I appreciate unconventional story telling, metaphorical content, subjective topics and unexpected endings, but this goes beyond all that, this is the pure state of surrealism, it's probably the result of an awful LSD trip which you are hoping to end soon.The majority of the story moves slowly, which is fine, if there were some actually relevance to the events, I risk saying that if you miss the first 15 episodes you won't lose anything of the plot that picks up from its previous seasons, only on the latest episodes we get some interesting development and some excitement and anticipated resolution (I mean not an actual resolution but ok). There's a huge amount of screen time dedicated to random patterns, space imagery, lighting, weird figures and overall surreal art expression that is inexplicably added to the story. I'll mention again, I like unconventional story telling, one that even throws you off and makes you wonder and think of waht you saw, but its very hard to grasp any meaning from this apparent random display of scenes, some of which seem to have been created by a child, with (I would assume on purpose) awful CGI and animations that completely throw off the viewer.I've seen a lot of comments on the fact that there's nothing on TV quite like this, and I for sure agree, but that statement alone doesn't make it good, being original is something I look for on movies and TV shows but it doesn't mean it will always be good. I have no actual problem with the content itself, but here's my major problem - why call it Twin Peaks and why not making a standalone TV show or movie exploring these exact same topics? I understand that back in the 90s Lynch was very restricted and his creativity freedom was put on check (fortunately for me, bad for him I guess) and this is why the original show is so balanced between the mystery murder, dark comedy and the supernatural, with the return of the show, full freedom was given to the writers (which for most cases I would appreciate) and Lynch takes it and shifts the series up side down to the point of unrecognition, with the exception of some good moments that I do admit were present.Overall I didn't like it, it's not Twin Peaks for the most part, although I liked a lot the fact that most of the cast returned and it was nice seeing them all after so many years, and I actually find a lot of potential on the ending even though its open for interpretation, but its so all over the place for the most part that I've completely lost interest in the characters which was a shame, specially Cooper, being just a sample of what he was . If you are a Lynch fan in his true from I guess this is the perfect show, if you are a Twins Peak fan, well... check it at your own risk, for me this just happens to be called Twin Peaks and written by Lynch, these are the only two things related to the original show."
    }
  ],
  "errorMessage": ""
}