{
  "imDbId": "tt4093826",
  "title": "Twin Peaks",
  "fullTitle": "Twin Peaks (TV Series 2017–2017)",
  "type": "TVSeries",
  "year": "2017",
  "language": "en",
  "titleInLanguage": "Twin Peaks (season 3)",
  "url": "https://en.wikipedia.org/wiki/Twin_Peaks_(season_3)",
  "plotShort": {
    "plainText": "The third season of Twin Peaks, also known as Twin Peaks: The Return and Twin Peaks: A Limited Event Series, consists of 18 episodes and premiered on Showtime on May 21, 2017. Developed and written by creators David Lynch and Mark Frost, with Lynch directing, the season is a continuation of the 1990–1991 ABC series and its 1992 theatrical prequel Twin Peaks: Fire Walk with Me. An ensemble of returning and new cast members appear, led by original star Kyle MacLachlan.\r\nSet 25 years after the events of the original Twin Peaks, the season follows multiple storylines, many of which are linked to FBI Special Agent Dale Cooper (MacLachlan) and his 1989 investigation into the murder of Twin Peaks homecoming queen Laura Palmer (Sheryl Lee). In addition to the fictional Washington state town of Twin Peaks, the story extends to locations such as New York City, Las Vegas, South Dakota, New Mexico, and Texas. Showtime president David Nevins said that \"the core of is Agent Cooper's odyssey back to Twin Peaks\".\r\nThe season garnered critical acclaim, with praise centering on its unconventional narrative and structure, visual invention, and performances. Many publications, including Rolling Stone, The Washington Post, and Esquire, named it the best television show of 2017. The film journals Sight & Sound and Cahiers du cinéma named The Return the second-best and best \"film\" of the year respectively, sparking discussion about the artistic difference, if any, between theatrical film and TV series in the era of streaming. In December 2019, Vulture critics named The Return the best television series of the 2010s, while Cahiers du cinéma named it the best film of the decade.",
    "html": "<p>The third season of Twin Peaks, also known as Twin Peaks: The Return and Twin Peaks: A Limited Event Series, consists of 18 episodes and premiered on Showtime on May 21, 2017. Developed and written by creators David Lynch and Mark Frost, with Lynch directing, the season is a continuation of the 1990–1991 ABC series and its 1992 theatrical prequel Twin Peaks: Fire Walk with Me. An ensemble of returning and new cast members appear, led by original star Kyle MacLachlan.</p><p>Set 25 years after the events of the original Twin Peaks, the season follows multiple storylines, many of which are linked to FBI Special Agent Dale Cooper (MacLachlan) and his 1989 investigation into the murder of Twin Peaks homecoming queen Laura Palmer (Sheryl Lee). In addition to the fictional Washington state town of Twin Peaks, the story extends to locations such as New York City, Las Vegas, South Dakota, New Mexico, and Texas. Showtime president David Nevins said that \"the core of is Agent Cooper's odyssey back to Twin Peaks\".</p><p>The season garnered critical acclaim, with praise centering on its unconventional narrative and structure, visual invention, and performances. Many publications, including Rolling Stone, The Washington Post, and Esquire, named it the best television show of 2017. The film journals Sight & Sound and Cahiers du cinéma named The Return the second-best and best \"film\" of the year respectively, sparking discussion about the artistic difference, if any, between theatrical film and TV series in the era of streaming. In December 2019, Vulture critics named The Return the best television series of the 2010s, while Cahiers du cinéma named it the best film of the decade.</p>"
  },
  "plotFull": {
    "plainText": "The third season of Twin Peaks, also known as Twin Peaks: The Return and Twin Peaks: A Limited Event Series, consists of 18 episodes and premiered on Showtime on May 21, 2017. Developed and written by creators David Lynch and Mark Frost, with Lynch directing, the season is a continuation of the 1990–1991 ABC series and its 1992 theatrical prequel Twin Peaks: Fire Walk with Me. An ensemble of returning and new cast members appear, led by original star Kyle MacLachlan.\r\nSet 25 years after the events of the original Twin Peaks, the season follows multiple storylines, many of which are linked to FBI Special Agent Dale Cooper (MacLachlan) and his 1989 investigation into the murder of Twin Peaks homecoming queen Laura Palmer (Sheryl Lee). In addition to the fictional Washington state town of Twin Peaks, the story extends to locations such as New York City, Las Vegas, South Dakota, New Mexico, and Texas. Showtime president David Nevins said that \"the core of is Agent Cooper's odyssey back to Twin Peaks\".\r\nThe season garnered critical acclaim, with praise centering on its unconventional narrative and structure, visual invention, and performances. Many publications, including Rolling Stone, The Washington Post, and Esquire, named it the best television show of 2017. The film journals Sight & Sound and Cahiers du cinéma named The Return the second-best and best \"film\" of the year respectively, sparking discussion about the artistic difference, if any, between theatrical film and TV series in the era of streaming. In December 2019, Vulture critics named The Return the best television series of the 2010s, while Cahiers du cinéma named it the best film of the decade.\r\nSynopsis\r\nTwenty-five years after the cliffhanger ending of the original series, FBI Special Agent Dale Cooper (Kyle MacLachlan) remains trapped in the Black Lodge and prepares his return to the world. Meanwhile, Cooper's doppelgänger—host to the evil spirit Bob—lives in Cooper's place and works to prevent his own imminent return to the Black Lodge with the help of various associates. A message from the Log Lady (Catherine Coulson) leads members of the Twin Peaks Sheriff's Department to reopen investigations into the events surrounding the 1989 murder of homecoming queen Laura Palmer (Sheryl Lee). The mysterious murder of a librarian in Buckhorn, South Dakota attracts the attention of FBI Deputy Director Gordon Cole (David Lynch) and his colleagues.\r\nProduction\r\nBackground and development\r\nThe first season of Twin Peaks premiered on April 8, 1990, on ABC. It was one of the top-rated series of 1990, although its ratings declined in the second season. In subsequent years, Twin Peaks has often been listed among the greatest television dramas of all time. Aaron Spelling Productions wanted to continue the series for a third season but ABC canceled it because of declining ratings and high production costs. The studio instead decided to continue the series through a trilogy of feature-length films financed by the French company Ciby 2000. A prequel film, Twin Peaks: Fire Walk with Me, was released in 1992, but received negative reviews and a poor commercial performance, leading to the cancellation of the other two films in the series. Lynch and Frost tried to develop a spin-off series centered around Audrey Horne, but the pilot episode evolved into the unrelated theatrical film Mulholland Drive. In 2001 Lynch said that Twin Peaks was as \"dead as a doornail.\"\r\nIn 2007 artist Matt Haley began work on a graphic novel continuation, which he hoped would be included in the \"Complete Mystery\" DVD box set. Twin Peaks producer Robert Engels agreed to help write it on the condition that Lynch and Frost approved the project; Haley said: \" and I had a number of discussions about what the story would be. I was keen to use whatever notes they had for the proposed third season. I really wanted this to be a literal 'third season' of the show.\" Paramount Home Entertainment agreed to package it with the box set, also on the condition that Lynch and Frost approved. Though Frost approved the project, Lynch vetoed it, saying that he respected the effort but did not want to continue the story of Twin Peaks.\r\nIn 2013 rumors that Twin Peaks would return were dismissed by Lynch's daughter Jennifer Lynch (author of The Secret Diary of Laura Palmer) as well as by Frost. Cast member Ray Wise recounted what Lynch had said to him about a possible continuation: \"Well, Ray, you know, the town is still there. And I suppose it's possible that we could revisit it. Of course, already dead... but we could maybe work around that.\"\r\nIn January 2014 a casting call for a \"Twin Peaks promo\", directed by Lynch, was revealed to be the filming of a featurette for the Twin Peaks: The Complete Mystery Blu-ray set. In September 2014 Lynch answered a question about Twin Peaks at the Lucca Film Festival by saying it was a \"tricky question\", and that \"there's always a possibility... and you just have to wait and see.\"\r\nAnnouncement\r\nOn October 6, 2014, Showtime announced that it would air a nine-episode miniseries written by Lynch and Frost and directed by Lynch. Frost emphasized that the new episodes were not a remake or reboot but a continuation of the series. The episodes are set in the present day, and the passage of 25 years is an important element in the plot. As to whether the miniseries would become an ongoing series, Frost said: \"If we have a great time doing it and everybody loves it and they decide there's room for more, I could see it going that way.\"\r\nIn March 2015, Lynch expressed doubts about the production due to \"complications\". Showtime confirmed the season was moving forward, stating: \"Nothing is going on that's any more than any preproduction process with David Lynch. Everything is moving forward and everybody is crazy thrilled and excited.\" In April 2015 Lynch said he would not direct the nine episodes due to budget constraints. He and Showtime came to an agreement, with Lynch confirming on May 15, 2015, that he would direct, and that there would be more episodes than the originally announced nine. At a Twin Peaks panel in Seattle, cast members Sherilyn Fenn and Sheryl Lee said that the new season would consist of 18 episodes and Angelo Badalamenti would return as composer.\r\nCasting\r\nOn January 12, 2015, Kyle MacLachlan was confirmed to return to the series. In October 2015 it was confirmed that Michael Ontkean, who portrayed Sheriff Harry S. Truman and had since retired from acting, would not return for the revival, and that the role of town sheriff would be filled by Robert Forster, later confirmed as playing Frank Truman, brother of Harry. Forster had been cast as Harry in the 1990 pilot but was replaced by Ontkean due to scheduling issues. Also in October David Duchovny teased his return as Agent Denise Bryson. In November 2015 it was reported that Miguel Ferrer would reprise his role as Albert Rosenfield and that Richard Beymer and David Patrick Kelly would return as Benjamin Horne and Jerry Horne, respectively. In December 2015 Alicia Witt confirmed she would reprise her role as Gersten Hayward. Michael J. Anderson was asked to reprise his role as The Man from Another Place but declined.\r\nRuss Tamblyn underwent open-heart surgery in late 2014 and was still recovering in 2015. Lynch and Frost still hoped Tamblyn would join the cast for the new season, which was later confirmed. On September 28, 2015, Catherine E. Coulson, who reprised her role of the Log Lady in the new season, died of cancer. She filmed her final scene four days before her death.\r\nThe season's first teaser trailer, released in December 2015, confirmed the involvement of Michael Horse (Tommy \"Hawk\" Hill). In January 2016 it was reported that Sherilyn Fenn would reprise her role as Audrey Horne in a \"major presence.\" In February 2016 it was reported that Lynch would reprise his role as Gordon Cole. Frequent Lynch collaborator Laura Dern was cast in a \"top-secret pivotal role\", which eventually proved to be Diane, the previously unseen character to whom Cooper frequently dictated taped messages during the show's original run. In April 2016 a complete cast list was released, featuring 217 actors, with actors returning from the earlier series marked with asterisks. Mary Reber, who plays Alice Tremond in the finale, is the actual owner of the house used for the Palmer residence.\r\nDavid Bowie was asked to make a cameo appearance as FBI Agent Phillip Jeffries, his character from Twin Peaks: Fire Walk with Me. As Bowie's health was declining, his lawyer told Lynch that he was unavailable. Before his death in January 2016, Bowie gave the production permission to reuse old footage featuring him, but he was unhappy with the accent he had used in the film, and requested that he be dubbed over by an authentic Louisiana actor, leading to the casting of Nathan Frizzell as Jeffries's voice. In January and February 2017, respectively, cast members Miguel Ferrer and Warren Frost died, but both appear in the new season. This was Ferrer's last live action television role before his death. Harry Dean Stanton, who reprised his role as Carl Rodd, died in September 2017, less than two weeks after the last episode of the season aired.\r\nFilming\r\nIn July 2015 Frost suggested that the season would premiere in 2017 rather than 2016, as originally planned. The series began filming in September 2015 and Showtime president David Nevins said:\r\nI'm hoping we make 2016. It's not clear. It's ultimately going to be in control. I don't know. They're going to decide, I expect it to be more than nine, but it's open-ended. I know what the shooting schedule is and then we'll have him cut it into however many episodes it feels best at.\r\nIn January 2016 Nevins confirmed that the season would premiere in the first half of 2017. The season was shot continuously from a single, long shooting script before being edited into episodes. Filming was completed by April 2016.\r\nMusic\r\nThe season's score contains new and reused compositions by Angelo Badalamenti, dark ambient music and sound design by Dean Hurley and David Lynch (including some from The Air Is on Fire), and unreleased music from Lynch and Badalamenti's 1990s project Thought Gang, two of which previously appeared in Fire Walk with Me. Hurley's contributions were released on the album Anthology Resource Vol. 1: △△ on August 6, 2017, by Sacred Bones Records. Several tracks from Johnny Jewel's album Windswept also appear throughout. Threnody for the Victims of Hiroshima by Krzysztof Penderecki appears in key scenes.\r\nAngelo Badalamenti's score was released on September 8, 2017, by Rhino Records as Twin Peaks: Limited Event Series Original Soundtrack.\r\nAdditionally, multiple episodes contain musical performances at the Roadhouse. Lynch hand-picked several of the bands, including Nine Inch Nails, Sharon Van Etten, Chromatics, and Eddie Vedder. Twin Peaks: Music from the Limited Event Series, an album containing many of these performances along with other songs heard on the season, was released by Rhino Records on September 8, 2017.\r\nOther music, mostly played diegetically includes:\r\n\"American Woman\" (David Lynch Remix) by Muddy Magnolias\r\n\"Take Five\" by Dave Brubeck\r\n\"I Love How You Love Me\" by The Paris Sisters\r\n\"I Am (Old School Hip Hop Beat)\" by Blunted Beatz\r\n\"Habit\" and \"Tabloid\" by Uniform\r\n\"Sleep Walk\" by Santo & Johnny\r\n\"Green Onions\" by Booker T. & the M.G.'s\r\n\"My Prayer\" by The Platters\r\n\"Charmaine\" by Mantovani\r\n\"Viva Las Vegas\" by Shawn Colvin\r\n\"I've Been Loving You Too Long\" (Live) by Otis Redding\r\n\"Sharp Dressed Man\" by ZZ Top\r\n\"Windswept\", “Slow Dreams”, “The Flame” by Johnny Jewel\r\nBeethoven's Moonlight Sonata and \"Last Call\" by David Lynch are played slowed down significantly.\r\nCast\r\nKyle MacLachlan as: Special Agent Dale Cooper Cooper's doppelgänger Douglas \"Dougie\" Jones Richard Cooper's Tulpa\r\nSpecial Agent Dale Cooper\r\nCooper's doppelgänger\r\nDouglas \"Dougie\" Jones\r\nRichard\r\nCooper's Tulpa\r\nTwin Peaks\r\nJay Aaseng as Drunk\r\nMädchen Amick as Shelly Briggs\r\nDana Ashbrook as Deputy Sheriff Bobby Briggs\r\nPhoebe Augustine as Ronette Pulaski\r\nRichard Beymer as Benjamin Horne\r\nGia Carides as Hannah\r\nVincent Castellanos as Federico\r\nMichael Cera as Wally \"Brando\" Brennan\r\nJoan Chen as Josie Packard\r\nCandy Clark as Doris Truman\r\nScott Coffey as Trick\r\nCatherine E. Coulson as Margaret Lanterman / \"The Log Lady\"\r\nGrace Victoria Cox as Charlotte\r\nJan D'Arcy as Sylvia Horne\r\nEric Da Re as Leo Johnson\r\nAna de la Reguera as Natalie\r\nHugh Dillon as Tom Paige\r\nEamon Farren as Richard Horne\r\nSherilyn Fenn as Audrey Horne\r\nSky Ferreira as Ella\r\nRobert Forster as Sheriff Frank Truman\r\nMark Frost as Cyril Pons\r\nWarren Frost as Dr. Will Hayward\r\nBalthazar Getty as Red\r\nHarry Goaz as Deputy Sheriff Andy Brennan\r\nGrant Goodeve as Walter Lawford\r\nAndrea Hays as Heidi\r\nGary Hershberger as Mike Nelson\r\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\r\nCaleb Landry Jones as Steven Burnett\r\nAshley Judd as Beverly Paige\r\nDavid Patrick Kelly as Jerry Horne\r\nPiper Laurie as Catherine Martell\r\nJane Levy as Elizabeth\r\nPeggy Lipton as Norma Jennings\r\nSarah Jean Long as Miriam Sullivan\r\nRiley Lynch as Bing\r\nJames Marshall as James Hurley\r\nEverett McGill as Ed Hurley\r\nClark Middleton as Charlie\r\nJack Nance as Pete Martell\r\nWalter Olkewicz as Jacques Renault and Jean-Michel Renault\r\nJohn Pirruccello as Deputy Sheriff Chad Broxford\r\nMary Reber as Alice Tremond\r\nKimmy Robertson as Lucy Brennan\r\nWendy Robie as Nadine Hurley\r\nEric Rondell as Johnny Horne\r\nMarvin \"Marv\" Rosand as Toad\r\nRod Rowland as Chuck\r\nAmanda Seyfried as Rebecca 'Becky' Burnett\r\nHarry Dean Stanton as Carl Rodd\r\nJR Starr as MC\r\nCharlotte Stewart as Betty Briggs\r\nJessica Szohr as Renee\r\nRuss Tamblyn as Dr. Lawrence Jacoby\r\nJodi Thelen as Maggie\r\nLauren Tewes as Gersten's neighbor\r\nJake Wardle as Freddie Sykes\r\nAlicia Witt as Gersten Hayward\r\nKarolina Wydra as Chloe\r\nCharlyne Yi as Ruby\r\nGrace Zabriskie as Sarah Palmer\r\nGovernment\r\nChrysta Bell as Special Agent Tammy Preston\r\nRichard Chamberlain as Bill Kennedy\r\nLaura Dern as Diane Evans\r\nDavid Duchovny as FBI Chief of Staff Denise Bryson\r\nJay R. Ferguson as Special Agent Randall Headley\r\nMiguel Ferrer as Special Agent Albert Rosenfield\r\nErnie Hudson as Colonel Davis\r\nDavid Lynch as FBI Deputy Director Gordon Cole\r\nAdele René as Lieutenant Cynthia Knox\r\nOwain Rhys-Davies as Agent Wilson\r\nLas Vegas\r\nAlon Aboutboul as Head Mover\r\nJoe Adler as Roger\r\nTammie Baird as Lorraine\r\nJim Belushi as Bradley Mitchum\r\nJohn Billingsley as Doctor Ben\r\nRonnie Gene Blevins as Tommy\r\nWes Brown as Darren\r\nJuan Carlos Cantu as Officer Reynaldo\r\nLarry Clarke as Detective T. Fusco\r\nJonny Coyne as Polish Accountant\r\nGiselle Damier as Sandie\r\nDavid Dastmalchian as Pit Boss Warrick\r\nJeremy Davies as Jimmy\r\nEric Edelstein as Detective \"Smiley\" Fusco\r\nJohn Ennis as Slot Machine Man\r\nJosh Fadem as Phil Bisby\r\nRebecca Field as Another Mom\r\nPatrick Fischler as Duncan Todd\r\nMeg Foster as Cashier\r\nPierce Gagnon as Sonny Jim Jones\r\nHailey Gates as Drugged-out Mother\r\nBrett Gelman as Supervisor Burns\r\nIvy George as 5-Year-Old Girl\r\nRobert Knepper as Rodney Mitchum\r\nDavid Koechner as Detective D. Fusco\r\nJay Larson as Limo Driver\r\nAndrea Leal as Mandie\r\nBellina Logan as Female Doctor\r\nJosh McDermitt as Wise Guy\r\nDon Murray as Bushnell Mullins\r\nSara Paxton as Candy Shaker\r\nLinda Porter as Lady Slot-Addict\r\nElena Satine as Rhonda\r\nJohn Savage as Detective Clark\r\nAmy Shiels as Candie\r\nTom Sizemore as Anthony Sinclair\r\nBob Stephenson as Frank\r\nEthan Suplee as Bill Shaker\r\nSabrina S. Sutherland as Floor Attendant Jackie\r\nNaomi Watts as Janey-E Jones\r\nNafessa Williams as Jade\r\nChristophe Zajac-Denek as Ike \"The Spike\" Stadtler\r\nSouth Dakota\r\nJane Adams as Constance Talbot\r\nBrent Briscoe as Detective Dave Macklay\r\nBailey Chase as Detective Don Harrison\r\nNeil Dickson as George Bautzer\r\nGeorge Griffith as Ray Monroe\r\nCornelia Guest as Phyllis Hastings\r\nNicole LaLiberte as Darya\r\nJennifer Jason Leigh as Chantal Hutchens\r\nMatthew Lillard as William Hastings\r\nKarl Makinen as Inspector Randy Hollister\r\nBérénice Marlohe as French Woman\r\nJames Morrison as Warden Dwight Murphy\r\nChristopher Murray as Officer Olson\r\nMax Perlich as Hank\r\nTim Roth as Gary \"Hutch\" Hutchens\r\nMary Stofle as Ruth Davenport\r\nSupernatural\r\nPhoebe Augustine as American Girl\r\nMonica Bellucci as herself\r\nDavid Bowie as Phillip JeffriesNathan Frizzell as the voice of Phillip Jeffries\r\nNathan Frizzell as the voice of Phillip Jeffries\r\nRobert Broski as Woodsman\r\nDon S. Davis as Major Garland Briggs\r\nErica Eynon as Experiment\r\nSheryl Lee as Laura Palmer\r\nJoy Nash as Señorita Dido\r\nCarlton Lee Russell as the Jumping Man\r\nFrank Silva as Killer BOB\r\nMalachy Sreenan as Bosomy Lady\r\nAl Strobel as Phillip Michael Gerard / MIKE\r\nCarel Struycken as The Fireman\r\nRay Wise as Leland Palmer\r\nNae Yuuki as Naido\r\nMichael J. Anderson did not reprise his role as The Man from Another Place, who instead appears as a treelike computer-generated effect and is voiced by an uncredited actor. When asked who provided the voice for the CGI character, executive producer Sabrina Sutherland replied, \"Unfortunately, I think this question should remain a mystery and not be answered.\"\r\nOther\r\nNew York\r\nMichael Bisping as Guard\r\nBenjamin Rosenfield as Sam Colby\r\nMadeline Zima as Tracey Barberato\r\nNew Mexico, 1956\r\nLeslie Berger as New Mexico Wife\r\nCullen Douglas as Disc Jockey\r\nTikaeni Faircrest as Girl\r\nTad Griffith as New Mexico Husband\r\nXolo Maridueña as Boy\r\nTracy Philips as Receptionist\r\nMontana\r\nFrank Collison as Muddy\r\nDerek Mears as Renzo\r\nOdessa\r\nMatt Battaglia as Cowboy 3\r\nFrancesca Eastwood as Texas Waitress Kristi\r\nHeath Hensley as Cowboy 1\r\nRob Mars as Cowboy 2\r\nSheryl Lee as Carrie Page\r\nNotes\r\nEpisodes\r\nRelease\r\nThe season premiered on Showtime on May 21, 2017, with a two-hour episode. After the airing, the premiere and an additional two episodes became available online, and the season aired in weekly increments from that point onwards (at Lynch's insistence). Overall, the series consists of 18 episodes. It concluded on September 3, 2017, with a two-part finale.\r\nIn the United Kingdom, Sky Atlantic simulcast the first two episodes beginning at 2:00 am British Summer Time on May 22, 2017, and the next two episodes were released on Sky UK's on-demand service after the premiere. In the Nordic countries, the season is broadcast on HBO Nordic, with the two-hour premiere airing on May 22, and subsequent episodes being made available the day after its U.S. airing. In Canada, the season is available on CraveTV and The Movie Network, and debuted simultaneously with the U.S. broadcast. In Australia, episodes of the season are available to stream on Stan the same day as the original U.S. broadcast. In Japan, the season aired on the satellite television network Wowow, which also aired the original series.\r\nTwo episodes were screened at the 2017 Cannes Film Festival. The Return was screened in its entirety from January 5–7, 2018, at the Museum of Modern Art, as part of the museum's annual series on \"the year's finest films\".\r\nReception\r\nOn Rotten Tomatoes the season has a 94% rating with an average score of 7.8 out of 10 based on 459 reviews. The site's critical consensus reads, \"Surreal, suspenseful, and visually stunning, this new Twin Peaks is an auteurist triumph for David Lynch.\" On Metacritic, Twin Peaks has a score of 74 out of 100 based on 26 reviews.\r\nSean T. Collins of Rolling Stone called the season \"one of the most groundbreaking TV series ever\", praising its original, complex storylines and the performances of its cast, particularly Kyle MacLachlan. Matt Zoller Seitz of Vulture wrote that the show was \"the most original and disturbing to hit TV drama since The Sopranos\". In his season review for IGN, Matt Fowler noted that Twin Peaks \"came back as a true artistic force that challenged just about every storytelling convention we know\" and scored it an 8.8 out of 10.\r\nOf the season's two-part premiere, Sonia Saraiya of Variety wrote \"Twin Peaks: The Return is weird and creepy and slow. But it is interesting. The show is very stubbornly itself—not quite film and not quite TV, rejecting both standard storytelling and standard forms. It's not especially fun to watch and it can be quite disturbing. But there is never a sense that you are watching something devoid of vision or intention. Lynch's vision is so total and absolute that he can get away with what wouldn't be otherwise acceptable.\"\r\nThe Hollywood Reporter's Daniel Fienberg wrote of the season's format:\r\nIt's obvious this Twin Peaks is going to be an 18-hour unit. There was no discernible separation between hours and if credits hadn't rolled, the second hour could probably just as easily have flowed into the third. This isn't episodic TV. It's another thing.\r\nIn her \"A\" grade review of the premiere, Emily L. Stephens of The A.V. Club wrote of its possible reception by critics and viewers:\r\nIf you were looking forward to a return of the sometimes campy, sometimes cozy humor of the original two seasons of Twin Peaks, this premiere could come as a shock. If you were anticipating that once jolting, now familiar blend of genres, this is... not that... but pure Lynchian horror.\r\nLynch screened the two-hour premiere of the season at the 2017 Cannes Film Festival and received a five-minute standing ovation from the crowd.\r\nSight & Sound and Cahiers du cinéma magazines named Twin Peaks: The Return respectively as the second-best and the best \"film\" of the year, with Sight & Sound placing it behind only the psychological horror film Get Out. Metacritic ranked Twin Peaks the second-best TV series of 2017; 20 major publications ranked it the best show of the year. In 2019, Twin Peaks: The Return was ranked 22nd on The Guardian's list of the 100 best TV shows of the 21st century.\r\nWriter-director Jim Jarmusch called the season \"a masterpiece\" and the single best piece of American cinema from the last 10 years.\r\nCritics' top ten lists\r\nRatings\r\nThe two-hour premiere on May 21, 2017, received 506,000 viewers on Showtime, which Deadline Hollywood called \"soft for such a strongly promoted prestige project\". Ratings increased to 626,000 after the encore broadcasts that night and the premiere also had over 450,000 viewers via streaming and on-demand.\r\nViewership for the premiere increased to 804,000 in Live+3 ratings, and it had a viewership of 1.7 million across streaming and on-demand platforms. Showtime announced that the weekend of the Twin Peaks premiere had the most signups to their streaming service ever. Prior to the finale, the season was averaging 2 million weekly viewers, when including time-shifting, encores and streaming. Showtime president David Nevins said that Twin Peaks \"has exceeded expectations\" from a financial perspective.\r\nAwards and nominations\r\nHome media\r\nThe season was released on Blu-ray and DVD on December 5, 2017, under the title Twin Peaks: A Limited Event Series. The set includes more than six hours of behind-the-scenes content.\r\nIn the 2017 Home Media Awards, which honor the year's best home video releases, Twin Peaks: A Limited Event Series won four awards: Title of the Year, TV on Disc of the Year, Best TV Movie or Miniseries, and Best Extras/Bonus Material.\r\nFuture\r\nLynch and Frost have expressed interest in making another season of Twin Peaks, but Lynch has noted that such a project would not immediately follow The Return, given that it took them four and a half years to write and film the third season. In June 2018, Lynch said the story was \"calling\", but that \"there are a lot of disturbances\"; in August, he said he was working through ideas with producer Sabrina Sutherland. In April 2020, he said \"nothing was happening\" regarding further Twin Peaks.",
    "html": "<p>The third season of Twin Peaks, also known as Twin Peaks: The Return and Twin Peaks: A Limited Event Series, consists of 18 episodes and premiered on Showtime on May 21, 2017. Developed and written by creators David Lynch and Mark Frost, with Lynch directing, the season is a continuation of the 1990–1991 ABC series and its 1992 theatrical prequel Twin Peaks: Fire Walk with Me. An ensemble of returning and new cast members appear, led by original star Kyle MacLachlan.</p><p>Set 25 years after the events of the original Twin Peaks, the season follows multiple storylines, many of which are linked to FBI Special Agent Dale Cooper (MacLachlan) and his 1989 investigation into the murder of Twin Peaks homecoming queen Laura Palmer (Sheryl Lee). In addition to the fictional Washington state town of Twin Peaks, the story extends to locations such as New York City, Las Vegas, South Dakota, New Mexico, and Texas. Showtime president David Nevins said that \"the core of is Agent Cooper's odyssey back to Twin Peaks\".</p><p>The season garnered critical acclaim, with praise centering on its unconventional narrative and structure, visual invention, and performances. Many publications, including Rolling Stone, The Washington Post, and Esquire, named it the best television show of 2017. The film journals Sight & Sound and Cahiers du cinéma named The Return the second-best and best \"film\" of the year respectively, sparking discussion about the artistic difference, if any, between theatrical film and TV series in the era of streaming. In December 2019, Vulture critics named The Return the best television series of the 2010s, while Cahiers du cinéma named it the best film of the decade.</p><br/><h3>Synopsis</h3><p>Twenty-five years after the cliffhanger ending of the original series, FBI Special Agent Dale Cooper (Kyle MacLachlan) remains trapped in the Black Lodge and prepares his return to the world. Meanwhile, Cooper's doppelgänger—host to the evil spirit Bob—lives in Cooper's place and works to prevent his own imminent return to the Black Lodge with the help of various associates. A message from the Log Lady (Catherine Coulson) leads members of the Twin Peaks Sheriff's Department to reopen investigations into the events surrounding the 1989 murder of homecoming queen Laura Palmer (Sheryl Lee). The mysterious murder of a librarian in Buckhorn, South Dakota attracts the attention of FBI Deputy Director Gordon Cole (David Lynch) and his colleagues.</p><br/><h3>Production</h3><h4>Background and development</h4><p>The first season of Twin Peaks premiered on April 8, 1990, on ABC. It was one of the top-rated series of 1990, although its ratings declined in the second season. In subsequent years, Twin Peaks has often been listed among the greatest television dramas of all time. Aaron Spelling Productions wanted to continue the series for a third season but ABC canceled it because of declining ratings and high production costs. The studio instead decided to continue the series through a trilogy of feature-length films financed by the French company Ciby 2000. A prequel film, Twin Peaks: Fire Walk with Me, was released in 1992, but received negative reviews and a poor commercial performance, leading to the cancellation of the other two films in the series. Lynch and Frost tried to develop a spin-off series centered around Audrey Horne, but the pilot episode evolved into the unrelated theatrical film Mulholland Drive. In 2001 Lynch said that Twin Peaks was as \"dead as a doornail.\"</p><p>In 2007 artist Matt Haley began work on a graphic novel continuation, which he hoped would be included in the \"Complete Mystery\" DVD box set. Twin Peaks producer Robert Engels agreed to help write it on the condition that Lynch and Frost approved the project; Haley said: \" and I had a number of discussions about what the story would be. I was keen to use whatever notes they had for the proposed third season. I really wanted this to be a literal 'third season' of the show.\" Paramount Home Entertainment agreed to package it with the box set, also on the condition that Lynch and Frost approved. Though Frost approved the project, Lynch vetoed it, saying that he respected the effort but did not want to continue the story of Twin Peaks.</p><p>In 2013 rumors that Twin Peaks would return were dismissed by Lynch's daughter Jennifer Lynch (author of The Secret Diary of Laura Palmer) as well as by Frost. Cast member Ray Wise recounted what Lynch had said to him about a possible continuation: \"Well, Ray, you know, the town is still there. And I suppose it's possible that we could revisit it. Of course, already dead... but we could maybe work around that.\"</p><p>In January 2014 a casting call for a \"Twin Peaks promo\", directed by Lynch, was revealed to be the filming of a featurette for the Twin Peaks: The Complete Mystery Blu-ray set. In September 2014 Lynch answered a question about Twin Peaks at the Lucca Film Festival by saying it was a \"tricky question\", and that \"there's always a possibility... and you just have to wait and see.\"</p><h4>Announcement</h4><p>On October 6, 2014, Showtime announced that it would air a nine-episode miniseries written by Lynch and Frost and directed by Lynch. Frost emphasized that the new episodes were not a remake or reboot but a continuation of the series. The episodes are set in the present day, and the passage of 25 years is an important element in the plot. As to whether the miniseries would become an ongoing series, Frost said: \"If we have a great time doing it and everybody loves it and they decide there's room for more, I could see it going that way.\"</p><p>In March 2015, Lynch expressed doubts about the production due to \"complications\". Showtime confirmed the season was moving forward, stating: \"Nothing is going on that's any more than any preproduction process with David Lynch. Everything is moving forward and everybody is crazy thrilled and excited.\" In April 2015 Lynch said he would not direct the nine episodes due to budget constraints. He and Showtime came to an agreement, with Lynch confirming on May 15, 2015, that he would direct, and that there would be more episodes than the originally announced nine. At a Twin Peaks panel in Seattle, cast members Sherilyn Fenn and Sheryl Lee said that the new season would consist of 18 episodes and Angelo Badalamenti would return as composer.</p><h4>Casting</h4><p>On January 12, 2015, Kyle MacLachlan was confirmed to return to the series. In October 2015 it was confirmed that Michael Ontkean, who portrayed Sheriff Harry S. Truman and had since retired from acting, would not return for the revival, and that the role of town sheriff would be filled by Robert Forster, later confirmed as playing Frank Truman, brother of Harry. Forster had been cast as Harry in the 1990 pilot but was replaced by Ontkean due to scheduling issues. Also in October David Duchovny teased his return as Agent Denise Bryson. In November 2015 it was reported that Miguel Ferrer would reprise his role as Albert Rosenfield and that Richard Beymer and David Patrick Kelly would return as Benjamin Horne and Jerry Horne, respectively. In December 2015 Alicia Witt confirmed she would reprise her role as Gersten Hayward. Michael J. Anderson was asked to reprise his role as The Man from Another Place but declined.</p><p>Russ Tamblyn underwent open-heart surgery in late 2014 and was still recovering in 2015. Lynch and Frost still hoped Tamblyn would join the cast for the new season, which was later confirmed. On September 28, 2015, Catherine E. Coulson, who reprised her role of the Log Lady in the new season, died of cancer. She filmed her final scene four days before her death.</p><p>The season's first teaser trailer, released in December 2015, confirmed the involvement of Michael Horse (Tommy \"Hawk\" Hill). In January 2016 it was reported that Sherilyn Fenn would reprise her role as Audrey Horne in a \"major presence.\" In February 2016 it was reported that Lynch would reprise his role as Gordon Cole. Frequent Lynch collaborator Laura Dern was cast in a \"top-secret pivotal role\", which eventually proved to be Diane, the previously unseen character to whom Cooper frequently dictated taped messages during the show's original run. In April 2016 a complete cast list was released, featuring 217 actors, with actors returning from the earlier series marked with asterisks. Mary Reber, who plays Alice Tremond in the finale, is the actual owner of the house used for the Palmer residence.</p><p>David Bowie was asked to make a cameo appearance as FBI Agent Phillip Jeffries, his character from Twin Peaks: Fire Walk with Me. As Bowie's health was declining, his lawyer told Lynch that he was unavailable. Before his death in January 2016, Bowie gave the production permission to reuse old footage featuring him, but he was unhappy with the accent he had used in the film, and requested that he be dubbed over by an authentic Louisiana actor, leading to the casting of Nathan Frizzell as Jeffries's voice. In January and February 2017, respectively, cast members Miguel Ferrer and Warren Frost died, but both appear in the new season. This was Ferrer's last live action television role before his death. Harry Dean Stanton, who reprised his role as Carl Rodd, died in September 2017, less than two weeks after the last episode of the season aired.</p><h4>Filming</h4><p>In July 2015 Frost suggested that the season would premiere in 2017 rather than 2016, as originally planned. The series began filming in September 2015 and Showtime president David Nevins said:</p><blockquote>I'm hoping we make 2016. It's not clear. It's ultimately going to be in control. I don't know. They're going to decide, I expect it to be more than nine, but it's open-ended. I know what the shooting schedule is and then we'll have him cut it into however many episodes it feels best at.</blockquote><p>In January 2016 Nevins confirmed that the season would premiere in the first half of 2017. The season was shot continuously from a single, long shooting script before being edited into episodes. Filming was completed by April 2016.</p><h4>Music</h4><p>The season's score contains new and reused compositions by Angelo Badalamenti, dark ambient music and sound design by Dean Hurley and David Lynch (including some from The Air Is on Fire), and unreleased music from Lynch and Badalamenti's 1990s project Thought Gang, two of which previously appeared in Fire Walk with Me. Hurley's contributions were released on the album Anthology Resource Vol. 1: △△ on August 6, 2017, by Sacred Bones Records. Several tracks from Johnny Jewel's album Windswept also appear throughout. Threnody for the Victims of Hiroshima by Krzysztof Penderecki appears in key scenes.</p><p>Angelo Badalamenti's score was released on September 8, 2017, by Rhino Records as Twin Peaks: Limited Event Series Original Soundtrack.</p><p>Additionally, multiple episodes contain musical performances at the Roadhouse. Lynch hand-picked several of the bands, including Nine Inch Nails, Sharon Van Etten, Chromatics, and Eddie Vedder. Twin Peaks: Music from the Limited Event Series, an album containing many of these performances along with other songs heard on the season, was released by Rhino Records on September 8, 2017.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Episode(s)</th><th scope=\"col\">Artist</th><th scope=\"col\">Song</th></tr><tr><td><span>Part 2</span><br>Part 12</td><th scope=\"row\" style=\"text-align:center\"><span>Chromatics</span> (<span>Ruth Radelet</span>, Adam Miller, <span>Johnny Jewel</span> and Nat Walker)</th><td>\"Shadow\" (Part 2)<br>\"Saturday\" (Part 12)</td></tr><tr><td><span>Part 3</span></td><th scope=\"row\" style=\"text-align:center\"><span>The Cactus Blossoms</span> (Jack Torrey, Page Burkum, Joel Paterson, Beau Sample and Alex Hall)</th><td>\"Mississippi\"</td></tr><tr><td>Part 4<br>Part 9</td><th scope=\"row\" style=\"text-align:center\"><span>Au Revoir Simone</span> (Heather D'Angelo, Erika Forster and Annie Hart)</th><td>\"<span>Lark</span>\" (Part 4)<br>\"<span>A Violent Yet Flammable World</span>\" (Part 9)</td></tr><tr><td>Part 5</td><th scope=\"row\" style=\"text-align:center\">Trouble (Riley Lynch, <span>Alex Zhang Hungtai</span>, Sam Smith and Dean Hurley)</th><td>\"Snake Eyes\"</td></tr><tr><td>Part 6</td><th scope=\"row\" style=\"text-align:center\"><span>Sharon Van Etten</span>, with Carolyn Pennypacker Riggs, John Phillip Irons III and Zeke Hutchins</th><td>\"<span>Tarifa</span>\"</td></tr><tr><td><span>Part 8</span></td><th scope=\"row\" style=\"text-align:center\">The <span>Nine Inch Nails</span> (<span>Trent Reznor</span>, <span>Atticus Ross</span>, <span>Mariqueen Maandig</span>, <span>Robin Finck</span>, <span>Alessandro Cortini</span> and <span>Joey Castillo</span>)</th><td>\"<span>She's Gone Away</span>\"</td></tr><tr><td>Part 9</td><th scope=\"row\" style=\"text-align:center\"><span>Hudson Mohawke</span></th><td>\"Human\"</td></tr><tr><td>Part 10</td><th scope=\"row\" style=\"text-align:center\"><span>Rebekah Del Rio</span> with <span>Moby</span></th><td>\"No Stars\"</td></tr><tr><td>Part 13</td><th scope=\"row\" style=\"text-align:center\"><span>James Marshall</span> (as James Hurley)</th><td>\"<span>Just You</span>\"</td></tr><tr><td>Part 14</td><th scope=\"row\" style=\"text-align:center\"><span>Lissie</span>, with Eric Sullivan, Lewis Keller and Jesse Siebenberg</th><td>\"<span>Wild West</span>\"</td></tr><tr><td>Part 15</td><th scope=\"row\" style=\"text-align:center\"><span>The Veils</span> (<span>Finn Andrews</span>, Sophia Burn and Uberto Rapisardi)</th><td>\"<span>Axolotl</span>\"</td></tr><tr><td>Part 16</td><th scope=\"row\" style=\"text-align:center\"><span>Eddie Vedder</span> (introduced as Edward Louis Severson III)</th><td>\"Out of Sand\"</td></tr><tr><td><span>Part 17</span></td><th scope=\"row\" style=\"text-align:center\"><span>Julee Cruise</span>, with Chromatics</th><td>\"The World Spins\"</td></tr></tbody></table><p>Other music, mostly played diegetically includes:</p><ul><li>\"American Woman\" (David Lynch Remix) by Muddy Magnolias</li><li>\"Take Five\" by Dave Brubeck</li><li>\"I Love How You Love Me\" by The Paris Sisters</li><li>\"I Am (Old School Hip Hop Beat)\" by Blunted Beatz</li><li>\"Habit\" and \"Tabloid\" by Uniform</li><li>\"Sleep Walk\" by Santo & Johnny</li><li>\"Green Onions\" by Booker T. & the M.G.'s</li><li>\"My Prayer\" by The Platters</li><li>\"Charmaine\" by Mantovani</li><li>\"Viva Las Vegas\" by Shawn Colvin</li><li>\"I've Been Loving You Too Long\" (Live) by Otis Redding</li><li>\"Sharp Dressed Man\" by ZZ Top</li><li>\"Windswept\", “Slow Dreams”, “The Flame” by Johnny Jewel</li></ul><p>Beethoven's Moonlight Sonata and \"Last Call\" by David Lynch are played slowed down significantly.</p><br/><h3>Cast</h3><ul><li>Kyle MacLachlan as: Special Agent Dale Cooper Cooper's doppelgänger Douglas \"Dougie\" Jones Richard Cooper's Tulpa</li><li>Special Agent Dale Cooper</li><li>Cooper's doppelgänger</li><li>Douglas \"Dougie\" Jones</li><li>Richard</li><li>Cooper's Tulpa</li></ul><p>Twin Peaks</p><ul><li>Jay Aaseng as Drunk</li><li>Mädchen Amick as Shelly Briggs</li><li>Dana Ashbrook as Deputy Sheriff Bobby Briggs</li><li>Phoebe Augustine as Ronette Pulaski</li><li>Richard Beymer as Benjamin Horne</li><li>Gia Carides as Hannah</li><li>Vincent Castellanos as Federico</li><li>Michael Cera as Wally \"Brando\" Brennan</li><li>Joan Chen as Josie Packard</li><li>Candy Clark as Doris Truman</li><li>Scott Coffey as Trick</li><li>Catherine E. Coulson as Margaret Lanterman / \"The Log Lady\"</li><li>Grace Victoria Cox as Charlotte</li><li>Jan D'Arcy as Sylvia Horne</li><li>Eric Da Re as Leo Johnson</li><li>Ana de la Reguera as Natalie</li><li>Hugh Dillon as Tom Paige</li><li>Eamon Farren as Richard Horne</li><li>Sherilyn Fenn as Audrey Horne</li><li>Sky Ferreira as Ella</li><li>Robert Forster as Sheriff Frank Truman</li><li>Mark Frost as Cyril Pons</li><li>Warren Frost as Dr. Will Hayward</li><li>Balthazar Getty as Red</li><li>Harry Goaz as Deputy Sheriff Andy Brennan</li><li>Grant Goodeve as Walter Lawford</li><li>Andrea Hays as Heidi</li><li>Gary Hershberger as Mike Nelson</li><li>Michael Horse as Deputy Chief Tommy \"Hawk\" Hill</li><li>Caleb Landry Jones as Steven Burnett</li><li>Ashley Judd as Beverly Paige</li><li>David Patrick Kelly as Jerry Horne</li><li>Piper Laurie as Catherine Martell</li><li>Jane Levy as Elizabeth</li><li>Peggy Lipton as Norma Jennings</li><li>Sarah Jean Long as Miriam Sullivan</li><li>Riley Lynch as Bing</li><li>James Marshall as James Hurley</li><li>Everett McGill as Ed Hurley</li><li>Clark Middleton as Charlie</li><li>Jack Nance as Pete Martell</li><li>Walter Olkewicz as Jacques Renault and Jean-Michel Renault</li><li>John Pirruccello as Deputy Sheriff Chad Broxford</li><li>Mary Reber as Alice Tremond</li><li>Kimmy Robertson as Lucy Brennan</li><li>Wendy Robie as Nadine Hurley</li><li>Eric Rondell as Johnny Horne</li><li>Marvin \"Marv\" Rosand as Toad</li><li>Rod Rowland as Chuck</li><li>Amanda Seyfried as Rebecca 'Becky' Burnett</li><li>Harry Dean Stanton as Carl Rodd</li><li>JR Starr as MC</li><li>Charlotte Stewart as Betty Briggs</li><li>Jessica Szohr as Renee</li><li>Russ Tamblyn as Dr. Lawrence Jacoby</li><li>Jodi Thelen as Maggie</li><li>Lauren Tewes as Gersten's neighbor</li><li>Jake Wardle as Freddie Sykes</li><li>Alicia Witt as Gersten Hayward</li><li>Karolina Wydra as Chloe</li><li>Charlyne Yi as Ruby</li><li>Grace Zabriskie as Sarah Palmer</li></ul><p>Government</p><ul><li>Chrysta Bell as Special Agent Tammy Preston</li><li>Richard Chamberlain as Bill Kennedy</li><li>Laura Dern as Diane Evans</li><li>David Duchovny as FBI Chief of Staff Denise Bryson</li><li>Jay R. Ferguson as Special Agent Randall Headley</li><li>Miguel Ferrer as Special Agent Albert Rosenfield</li><li>Ernie Hudson as Colonel Davis</li><li>David Lynch as FBI Deputy Director Gordon Cole</li><li>Adele René as Lieutenant Cynthia Knox</li><li>Owain Rhys-Davies as Agent Wilson</li></ul><p>Las Vegas</p><ul><li>Alon Aboutboul as Head Mover</li><li>Joe Adler as Roger</li><li>Tammie Baird as Lorraine</li><li>Jim Belushi as Bradley Mitchum</li><li>John Billingsley as Doctor Ben</li><li>Ronnie Gene Blevins as Tommy</li><li>Wes Brown as Darren</li><li>Juan Carlos Cantu as Officer Reynaldo</li><li>Larry Clarke as Detective T. Fusco</li><li>Jonny Coyne as Polish Accountant</li><li>Giselle Damier as Sandie</li><li>David Dastmalchian as Pit Boss Warrick</li><li>Jeremy Davies as Jimmy</li><li>Eric Edelstein as Detective \"Smiley\" Fusco</li><li>John Ennis as Slot Machine Man</li><li>Josh Fadem as Phil Bisby</li><li>Rebecca Field as Another Mom</li><li>Patrick Fischler as Duncan Todd</li><li>Meg Foster as Cashier</li><li>Pierce Gagnon as Sonny Jim Jones</li><li>Hailey Gates as Drugged-out Mother</li><li>Brett Gelman as Supervisor Burns</li><li>Ivy George as 5-Year-Old Girl</li><li>Robert Knepper as Rodney Mitchum</li><li>David Koechner as Detective D. Fusco</li><li>Jay Larson as Limo Driver</li><li>Andrea Leal as Mandie</li><li>Bellina Logan as Female Doctor</li><li>Josh McDermitt as Wise Guy</li><li>Don Murray as Bushnell Mullins</li><li>Sara Paxton as Candy Shaker</li><li>Linda Porter as Lady Slot-Addict</li><li>Elena Satine as Rhonda</li><li>John Savage as Detective Clark</li><li>Amy Shiels as Candie</li><li>Tom Sizemore as Anthony Sinclair</li><li>Bob Stephenson as Frank</li><li>Ethan Suplee as Bill Shaker</li><li>Sabrina S. Sutherland as Floor Attendant Jackie</li><li>Naomi Watts as Janey-E Jones</li><li>Nafessa Williams as Jade</li><li>Christophe Zajac-Denek as Ike \"The Spike\" Stadtler</li></ul><p>South Dakota</p><ul><li>Jane Adams as Constance Talbot</li><li>Brent Briscoe as Detective Dave Macklay</li><li>Bailey Chase as Detective Don Harrison</li><li>Neil Dickson as George Bautzer</li><li>George Griffith as Ray Monroe</li><li>Cornelia Guest as Phyllis Hastings</li><li>Nicole LaLiberte as Darya</li><li>Jennifer Jason Leigh as Chantal Hutchens</li><li>Matthew Lillard as William Hastings</li><li>Karl Makinen as Inspector Randy Hollister</li><li>Bérénice Marlohe as French Woman</li><li>James Morrison as Warden Dwight Murphy</li><li>Christopher Murray as Officer Olson</li><li>Max Perlich as Hank</li><li>Tim Roth as Gary \"Hutch\" Hutchens</li><li>Mary Stofle as Ruth Davenport</li></ul><p>Supernatural</p><ul><li>Phoebe Augustine as American Girl</li><li>Monica Bellucci as herself</li><li>David Bowie as Phillip JeffriesNathan Frizzell as the voice of Phillip Jeffries</li><li>Nathan Frizzell as the voice of Phillip Jeffries</li><li>Robert Broski as Woodsman</li><li>Don S. Davis as Major Garland Briggs</li><li>Erica Eynon as Experiment</li><li>Sheryl Lee as Laura Palmer</li><li>Joy Nash as Señorita Dido</li><li>Carlton Lee Russell as the Jumping Man</li><li>Frank Silva as Killer BOB</li><li>Malachy Sreenan as Bosomy Lady</li><li>Al Strobel as Phillip Michael Gerard / MIKE</li><li>Carel Struycken as The Fireman</li><li>Ray Wise as Leland Palmer</li><li>Nae Yuuki as Naido</li></ul><p>Michael J. Anderson did not reprise his role as The Man from Another Place, who instead appears as a treelike computer-generated effect and is voiced by an uncredited actor. When asked who provided the voice for the CGI character, executive producer Sabrina Sutherland replied, \"Unfortunately, I think this question should remain a mystery and not be answered.\"</p><p>Other</p><p>New York</p><ul><li>Michael Bisping as Guard</li><li>Benjamin Rosenfield as Sam Colby</li><li>Madeline Zima as Tracey Barberato</li></ul><p>New Mexico, 1956</p><ul><li>Leslie Berger as New Mexico Wife</li><li>Cullen Douglas as Disc Jockey</li><li>Tikaeni Faircrest as Girl</li><li>Tad Griffith as New Mexico Husband</li><li>Xolo Maridueña as Boy</li><li>Tracy Philips as Receptionist</li></ul><p>Montana</p><ul><li>Frank Collison as Muddy</li><li>Derek Mears as Renzo</li></ul><p>Odessa</p><ul><li>Matt Battaglia as Cowboy 3</li><li>Francesca Eastwood as Texas Waitress Kristi</li><li>Heath Hensley as Cowboy 1</li><li>Rob Mars as Cowboy 2</li><li>Sheryl Lee as Carrie Page</li></ul><p>Notes</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#445848;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#445848;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#445848;width:24%\">Title</th><th scope=\"col\" style=\"background:#445848;width:13%\">Directed by</th><th scope=\"col\" style=\"background:#445848;width:27%\">Written by</th><th scope=\"col\" style=\"background:#445848;width:15%\">Original air date</th><th scope=\"col\" style=\"background:#445848;width:11%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep31\" style=\"text-align:center\">31</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Part 1</span>\"<br>\"My Log Has a Message for You\"</td><td style=\"text-align:center\"><span>David Lynch</span></td><td style=\"text-align:center\"><span>Mark Frost</span> &amp; David Lynch</td><td style=\"text-align:center\">May 21, 2017</td><td style=\"text-align:center\">0.506</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">FBI agent <span>Dale Cooper</span> remains trapped in the <span class=\"mw-redirect\">Black Lodge</span>. <span>The Fireman</span> tells him to remember \"430\" and \"Richard and Linda\". In Twin Peaks, Dr. Jacoby receives a shipment. Great Northern hotel owner Ben Horne introduces his brother Jerry to his new secretary, Beverly. Deputy Chief Hawk gets a call from the <span>Log Lady</span>, who tells him evidence relating to Dale Cooper is missing. In a <span>New York City</span> warehouse, a young man, Sam, is employed to observe a glass box. When the security guard is absent, Sam and a young woman, Tracey, have sex. An androgynous entity, the Experiment, materializes in the box and murders both of them. In Buckhorn, <span>South Dakota</span>, Cooper's <span>doppelgänger</span>—a sinister, long-haired man with black <span>irises</span>—retrieves two associates, Ray and Darya. Police find the severed head of Buckhorn librarian Ruth Davenport placed on the headless corpse of a <span>John Doe</span>. Local school principal Bill Hastings's fingerprints are found and he is arrested. Hastings denies guilt, but fumbles his alibi.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep32\" style=\"text-align:center\">32</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Part 2</span>\"<br>\"The Stars Turn and a Time Presents Itself\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">May 21, 2017</td><td style=\"text-align:center\">0.506</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Bill Hastings's wife visits him in jail and is later murdered by Cooper's doppelgänger so she will not implicate him in the murder that she hired him to commit to frame Bill. In Las Vegas, businessman Duncan Todd sends money to an unseen woman for a future job. Cooper's doppelgänger employs Darya, Ray and Jack to obtain information. Perceiving that Jack and Darya have turned on him, he murders them. He has a plan to avoid his due return to the Black Lodge and has a telephone conversation with someone he believes is missing FBI agent Phillip Jeffries, who mentions Major Briggs and BOB, the evil spirit inside the doppelgänger. The Cooper doppelgänger sets out for the South Dakota prison where Ray is imprisoned. Hawk approaches the entrance to the Black Lodge near Twin Peaks. Inside the Black Lodge, Cooper encounters the one-armed spirit MIKE and murdered schoolgirl <span>Laura Palmer</span>, who opens her face, revealing light. <span>The Arm</span>, who has evolved into a skeletal tree, says Cooper's doppelgänger must return before Cooper can leave. The Arm's doppelgänger attacks Cooper and he falls into the glass box in New York City (at the same time as Sam welcomes Tracey), then into space. In Twin Peaks, Shelly flirts with Red while her friend Renee notices James Hurley staring at her.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep33\" style=\"text-align:center\">33</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Part 3</span>\"<br>\"Call for Help\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">May 28, 2017</td><td style=\"text-align:center\">0.195</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Cooper lands in a building above a purple-colored sea, where he is protected from an unseen threat by two women, one of them eyeless. The eyeless woman, Naido, pulls a lever and falls into space. Cooper leaves through a portal. Cooper's doppelgänger and a second, \"manufactured\" doppelgänger, Dougie Jones, become sick and see the Black Lodge's curtains. The first doppelgänger crashes his car and is apprehended by the police. Dougie is drawn into the Black Lodge, where he dissolves into a golden seed. Free from the Black Lodge, but having lost his entire memory, Cooper takes Dougie's place in Las Vegas, where Jade, a prostitute, finds him in a disoriented state and drops him off at a casino. Jade also finds Cooper's old room key for the Great Northern Hotel in his pockets. Criminals pursuing Dougie place a bomb under his car. Cooper wanders around the casino and plays slot machines marked by signals from the Black Lodge, winning megajackpots every time. At the Twin Peaks Sheriff's Department, Hawk, Andy and Lucy are unable to discern what is missing. At the FBI headquarters in Philadelphia, Deputy Director Gordon Cole receives a call stating that Cooper has been found in South Dakota.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep34\" style=\"text-align:center\">34</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 4\"<br>\"...Brings Back Some Memories\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">May 28, 2017</td><td style=\"text-align:center\">0.195</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Cooper wins 30 megajackpots at the casino and is driven to Dougie's home. Dougie's wife, Janey-E, is relieved that they can pay his large gambling debts. Cooper, near-catatonic with his state of mind still damaged, has difficulty settling into his new life as Dougie. He sees a vision of MIKE, who informs him that either he or his doppelgänger must die. At the Sheriff's Department, Sheriff Frank Truman gets an update on Hawk's investigation, and Deputy Bobby Briggs recalls that Cooper was the last person to see his father, Major Briggs, before his death. Andy and Lucy's son Wally Brando arrives at the Sheriff's Department to pay his respects to his ill godfather, Harry Truman. Gordon and fellow FBI agents Albert Rosenfield and Tammy Preston travel to South Dakota to interview Cooper's doppelgänger, who claims to have been working undercover with Jeffries. Gordon and Albert discuss their misgivings, suspect a \"Blue Rose\" case and decide to contact a woman they think can help.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep35\" style=\"text-align:center\">35</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 5\"<br>\"Case Files\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">June 4, 2017</td><td style=\"text-align:center\">0.254</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Dougie's would-be assassins call their terrified boss, Lorraine, who sends a message that activates a black box in <span>Buenos Aires</span>. In Buckhorn, an autopsy finds Dougie's wedding ring in the headless corpse's stomach. Looking into a mirror, Cooper's doppelgänger sees that BOB is still within him. At Dougie's office workplace, Cooper reacts to a statue, coffee, and the words \"agent\" and \"case files\". A light above his colleague Anthony Sinclair spurs Cooper to accuse him of lying, angering Sinclair and their boss, Bushnell Mullins. The casino's owners, the Mitchum brothers, beat and fire a supervisor, believing him complicit in Cooper's winning streak. Car thieves trigger the bomb under Dougie's car. Jade drops Cooper's Great Northern Hotel room key in a mailbox. Becky and her jobless husband, Steven Burnett, snort drugs after borrowing money from Becky's mother, Shelly. In Twin Peaks, Dr. Jacoby broadcasts conspiracy theories, watched by Jerry Horne and Nadine Hurley. At the <span>Pentagon</span>, Colonel Davis learns the headless corpse's fingerprints match those of Major Briggs. At the Roadhouse, Richard Horne bribes Deputy Chad and molests a woman. Tammy discovers Cooper's on-file fingerprints are the reverse of the doppelgänger's. Cooper's doppelgänger uses his prison phone call to disrupt the security system. The black box becomes a silver ball.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep36\" style=\"text-align:center\">36</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 6\"<br>\"Don't Die\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">June 11, 2017</td><td style=\"text-align:center\">0.270</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Police take Cooper to Dougie's home and Janey-E receives a photo of Dougie with Jade from criminals demanding Dougie's gambling debts plus exorbitant interest. Janey-E convinces the criminals to accept a smaller sum. Cooper draws cryptic images on the case files, guided by lights on the pages. Bushnell recognizes a pattern in the drawings and thanks Cooper. Cooper has another vision of MIKE urging him to \"wake up\". Todd sends an envelope marked with a black spot to hitman Ike \"The Spike\" Stadtler, ordering him to kill Lorraine and Dougie. Ike kills Lorraine and her coworkers, destroying his signature weapon in the process. Albert finds Diane, Cooper's erstwhile assistant, in a bar. In Twin Peaks, Red, revealed as a drug supplier, charges Richard Horne with a delivery. Richard speeds in his truck, running over and killing a young boy. Carl Rodd comforts the boy's mother. At the Sheriff's Station, Hawk drops a coin in the restroom and finds pages torn from Laura's diary hidden inside a stall door.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep37\" style=\"text-align:center\">37</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 7\"<br>\"There's a Body All Right\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">June 18, 2017</td><td style=\"text-align:center\">0.294</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Hawk and Frank examine the pages, which describe a dream in which Annie tells Laura that the good Dale is trapped in the Black Lodge. Frank calls Doc Hayward, who recalls that after returning from the Black Lodge, Cooper sneaked out of intensive care, where <span>Audrey Horne</span> was in a coma after being critically injured in the Twin Peaks Savings and Loan explosion that killed several people including Pete Martel and Andrew Packard. Navy Lt. Knox arrives in Buckhorn and learns that Major Briggs's fingerprints come from a body in its forties, not seventies. Albert and Gordon convince Diane to speak to Cooper in prison. She is upset by the conversation and tells Gordon the man is not Cooper. At the same time, the Cooper doppelgänger blackmails Warden Murphy into releasing him and Ray. Police visit Cooper at Dougie's workplace to question him about his destroyed car. As he leaves with Janey-E, Ike runs at them with a gun, but Cooper expertly disarms him while having a vision of the Arm. In Twin Peaks, the owner of the truck driven by Richard in the hit-and-run fails to arrive for a meeting with Andy. Beverly tries to locate the source of a hum in Ben Horne's office, then returns home to her terminally ill husband, Tom. A young man bursts into the <span class=\"mw-redirect\">Double R Diner</span>, looking for Billy.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep38\" style=\"text-align:center\">38</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Part 8</span>\"<br>\"Gotta Light?\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">June 25, 2017</td><td style=\"text-align:center\">0.246</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">In a standoff, Ray shoots Cooper's doppelgänger. Woodsmen tear at his body, revealing an orb with BOB's face. Ray flees and informs Jeffries that the doppelgänger may have survived. The doppelgänger awakens. In 1945 New Mexico, <span>the first atomic bomb is detonated</span>. Woodsmen occupy a convenience store and the Experiment spews smoke containing an orb bearing BOB's face. In the building above the purple sea, the Fireman observes these events and levitates, emanating a golden mist and an orb containing Laura Palmer's face. His companion, Señorita Dido, sends the orb to Earth. In 1956 New Mexico, a woodsman descends to the ground, enters a radio station and repeatedly broadcasts a mysterious message, rendering listeners unconscious. A bug/frog-like creature hatches from an egg, enters an unconscious girl's room and climbs down her throat.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep39\" style=\"text-align:center\">39</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 9\"<br>\"This Is the Chair\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">July 9, 2017</td><td style=\"text-align:center\">0.355</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Cooper's doppelgänger meets hitmen Hutch and Chantal at a farm and orders them to kill Warden Murphy. He sends a text to Diane and calls Todd to ask if he has done \"it\" yet. Dougie's boss says that Dougie sometimes has episodes due to a car accident. The Las Vegas police discover no record of Dougie Jones before 1997 and take fingerprints and DNA from his coffee mug. Ike leaves a phone message for a \"JT\" and is arrested. Bobby visits his mother with Frank and Hawk to ask about Cooper; her husband Major Briggs long ago foretold their arrival, and she gives them a cylinder containing a location, date, and Cooper's name written twice. The FBI stops in Buckhorn to examine the corpse with Major Briggs's fingerprints. Hastings tells Tammy that he and Ruth visited Briggs in another dimension, where he had been \"hibernating\" for years, and witnessed his beheading as he was saying \"Cooper, Cooper\". Johnny Horne injures himself, and Jerry Horne hallucinates that his foot is talking.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep40\" style=\"text-align:center\">40</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 10\"<br>\"Laura Is the One\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">July 16, 2017</td><td style=\"text-align:center\">0.267</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Richard Horne confronts Miriam, a teacher who witnessed his hit-and-run. She tells him she has written to the sheriff. He attacks her and leaves her for dead in her trailer, then has Deputy Chad intercept the letter. The Mitchums see a news story about Ike's arrest, and recognize Cooper as \"Mr. Jackpots\". Janey-E notices that her husband's physique has improved and has sex with him. Nadine Hurley watches Jacoby's latest broadcast from her drapery store. Richard attacks his grandmother Sylvia in her home and robs her. She calls Ben and demands money from him. Todd orders Anthony Sinclair to frame Dougie for the denial of an arson insurance claim that lost the Mitchums $30 million. Gordon has a vision of Laura. Albert informs him that the FBI has intercepted a text message from Diane informing someone of Hastings's arrest. Tammy shows them a photo that links Cooper's doppelgänger with the glass box in New York. Hawk receives another phone call from the Log Lady, who tells him \"Laura is the one.\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep41\" style=\"text-align:center\">41</th><td style=\"text-align:center\">11</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 11\"<br>\"There's Fire Where You Are Going\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">July 23, 2017</td><td style=\"text-align:center\">0.219</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">A group of children discover Miriam crawling from the underbrush. Becky learns Steven has been cheating on her with Gersten Hayward. She drives to Gersten's apartment and shoots through the door, but the couple are elsewhere. At the Double R Diner, Becky's parents, Shelly and Bobby, discuss the incident with her. Red arrives and Shelly leaves to kiss him. A child fires a gun through the diner window, causing a commotion. At the location where Hastings met Major Briggs, the FBI finds Ruth's body with coordinates written on one arm. Gordon sees woodsmen in a vortex and is drawn back by Albert. One of the woodsmen sneaks up on Hastings and kills him. While Hawk and Frank study an ancient map, the Log Lady calls Hawk and tells him \"There's fire where you are going.\" Dougie's boss sends Cooper to give the Mitchums a $30 million check after realizing their claim is legitimate. The Mitchums plan to kill Cooper, but after Bradley has a prophetic dream, they decide he is not their enemy and take him for drinks, where Cooper reacts to the words \"damn good\" while eating cherry pie.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep42\" style=\"text-align:center\">42</th><td style=\"text-align:center\">12</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 12\"<br>\"Let's Rock\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">July 30, 2017</td><td style=\"text-align:center\">0.240</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Gordon and Albert recruit Tammy and deputize Diane to the Blue Rose task force. Sarah Palmer has an unsettling experience in a grocery store, which leads Deputy Chief Hawk to check on her at her house, where he hears a sound behind Sarah. Albert interrupts Gordon and his French lady friend to show him a text message Diane received asking about Las Vegas. In Twin Peaks, Audrey Horne demands that her husband, Charlie, help her find Billy, her missing lover. He reluctantly phones Tina, and is astonished by what she tells him, but does not tell Audrey what Tina said. Chantal and Hutch assassinate Warden Murphy. Frank visits Ben Horne to tell him his grandson Richard killed the boy in the hit-and-run, and attempted to kill the only witness. Ben agrees to pay her medical costs and gives Cooper's old room key to Frank as a memento for Harry. Diane finds that the coordinates on Ruth Davenport's arm point to Twin Peaks.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep43\" style=\"text-align:center\">43</th><td style=\"text-align:center\">13</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 13\"<br>\"What Story is That, Charlie?\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">August 6, 2017</td><td style=\"text-align:center\">0.280</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">The Mitchums thank Dougie and Bushnell with gifts. Anthony Sinclair is about to poison Dougie, but relents and confesses his collusion with Todd to Bushnell. The Las Vegas police dismiss Dougie's fingerprint analysis. Cooper's doppelgänger arrives in Montana, where Ray is with a gang. The doppelgänger defeats the gang leader in an arm-wrestling match, then kills him, with the gang (including Richard) watching. He questions Ray about the assassination attempt, forces him to give up the coordinates, and shoots him, sending him to the Black Lodge. Hutch and Chantal drive through Utah. At the Double R Diner, Big Ed and Bobby have dinner while Norma meets Walter, who helped franchise her business. Nadine and Jacoby meet for the first time in years. Sarah watches a loop of a boxing match. Audrey tells Charlie she does not know who or where she is and cannot leave the house. James, performing at the Roadhouse, moves Renee to tears.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep44\" style=\"text-align:center\">44</th><td style=\"text-align:center\">14</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 14\"<br>\"We Are Like the Dreamer\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">August 13, 2017</td><td style=\"text-align:center\">0.253</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Frank informs Gordon that pages found from Laura's diary suggest two Coopers. Albert tells Tammy about the first Blue Rose case, which involved doppelgängers. Diane identifies Janey-E as her estranged half-sister. Gordon orders the Las Vegas office to search for the Joneses. Chad is arrested. Frank, Hawk, Bobby and Andy follow Major Briggs's instructions to \"Jack Rabbit's Palace\" in the woods, where they find a naked Naido. Andy is transported to the Fireman, who shows him visions of the events in New Mexico, Laura, two Coopers, Lucy and an electrical pole numbered 6. For her safety the police place Naido in a cell in the Sheriff's Department, next to cells containing Chad and a drunk bleeding from his face. James learns how fellow Great Northern security guard Freddie Sykes bought a strength-enhancing glove and moved to Twin Peaks from London after a vision of the Fireman. James notices a hum in the boiler room. When a trucker insults her in a bar, Sarah opens her face, revealing darkness, and bites his throat, killing him. At the Roadhouse, Megan and Sophie discuss Billy, who stormed into Megan's kitchen, bleeding from his nose and mouth.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep45\" style=\"text-align:center\">45</th><td style=\"text-align:center\">15</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 15\"<br>\"There's Some Fear in Letting Go\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">August 20, 2017</td><td style=\"text-align:center\">0.329</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Cooper's doppelgänger arrives at the convenience store to ask Jeffries (whose voice comes from a machine) about the assassination attempt and his reference to \"Judy\". Jeffries tells him he has already met Judy and gives him coordinates. Outside, Richard attacks the doppelgänger, whom he recognized as an FBI agent his mother Audrey knew, but is subdued. In Las Vegas, Chantal assassinates Todd and his assistant. Cooper reacts to hearing Gordon's name on TV (in <i><span>Sunset Boulevard</span></i>), and sticks a fork into an electrical socket. Inspired by Jacoby's show, Nadine tells Ed he is free to pursue Norma. Norma lets Walter buy out the Double R Diner franchise, then accepts Ed's marriage proposal. Gersten attempts to console an armed, suicidal Steven in the woods; hiding from a passerby, she hears a gunshot. The Log Lady calls Hawk and gives him a final message before dying from cancer. Audrey and Charlie continue arguing. At the Roadhouse, James is attacked by Renee's jealous husband, Chuck, whom Freddie punches out with his glove; Freddie and James are arrested. A young woman crawls across the Roadhouse floor and screams.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep46\" style=\"text-align:center\">46</th><td style=\"text-align:center\">16</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 16\"<br>\"No Knock, No Doorbell\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">August 27, 2017</td><td style=\"text-align:center\">0.267</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Cooper's doppelgänger and Richard Horne follow two of three coordinates the doppelgänger obtained. Observed by Jerry Horne, the doppelgänger sends Richard ahead to the site, where he is electrocuted, and then calls Richard his son. While Cooper lies in a coma, both the FBI and Chantal and Hutch are waiting outside the Jones residence. Chantal and Hutch are killed by a neighbor they provoked in a parking dispute. Cooper awakes from his coma. MIKE tells him that the doppelgänger is still at large and gives him the Owl Cave ring. Cooper gives MIKE some of his hair, asking him to make another <span>tulpa</span>, then has the Mitchums organize a flight to <span>Spokane, Washington</span>. Having received a text from the doppelgänger, Diane tells the task force that, years ago, Cooper raped her and took her to an old gas station. Exclaiming \"I'm in the sheriff's station... I'm not me\", she pulls a gun but is shot by Albert and Tammy. Diane is drawn to the Black Lodge and dissolves into a seed. Tammy realizes that the Diane they had been associating with is actually a tulpa. At the Roadhouse, Audrey dances to \"<span>Audrey's Dance</span>\". When a fight breaks out, Audrey begs Charlie to take her home. Suddenly she wakes up, confused and looking into a mirror.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep47\" style=\"text-align:center\">47</th><td style=\"text-align:center\">17</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Part 17</span>\"<br>\"The Past Dictates the Future\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">September 3, 2017</td><td style=\"text-align:center\">0.254</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Gordon tells Albert of a secret plan to find \"Judy\", an \"extreme negative force\" originally known as \"Jowday\", and is informed that Cooper is headed for Twin Peaks. The remaining coordinates lead Cooper's doppelgänger to \"Jack Rabbit's Palace\". He is transported to the Fireman, then to the Sheriff's Department, and mistaken for the real Cooper. While talking to the doppelgänger, Frank receives a call from Cooper. The doppelgänger draws a gun but is shot by Lucy. Cooper, the FBI and the Mitchums arrive. Woodsmen tear at the Cooper doppelgänger's body, releasing BOB's orb. Freddie knocks out Chad, who had escaped his cell, and smashes BOB's orb with several punches. Cooper puts the Owl Cave ring on the doppelgänger's finger, sending him to the Black Lodge. Naido transforms into Diane. Cooper unlocks a door at the Great Northern, where MIKE takes him to Jeffries, who transports Cooper back in time to the night Laura died. Cooper prevents Laura's murder; in the morning, her corpse vanishes. As he leads her through the woods, she disappears and a woman's scream is heard. In Sarah's house, Sarah smashes Laura's photo, though the photograph itself cannot be torn.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep48\" style=\"text-align:center\">48</th><td style=\"text-align:center\">18</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Part 18</span>\"<br>\"What Is Your Name?\"</td><td style=\"text-align:center\">David Lynch</td><td style=\"text-align:center\">Mark Frost &amp; David Lynch</td><td style=\"text-align:center\">September 3, 2017</td><td style=\"text-align:center\">0.240</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #445848\">Cooper's doppelgänger burns in the Black Lodge. MIKE creates another Dougie, who returns to Janey-E and Sonny Jim. Cooper appears in the Black Lodge again, encountering MIKE and the Arm. He emerges and meets Diane in the woods. They drive on a highway for 430 miles and \"cross over\" an electrical field, then drive to a motel and have sex. Cooper wakes up the next morning alone and finds a note left to \"Richard\" from \"Linda\". Arriving at Judy's Diner in <span>Odessa, Texas</span>, Cooper saves a waitress from harassment and obtains the address of another waitress, Carrie Page, who resembles Laura Palmer. Believing she is Laura, he drives her to Twin Peaks, but finds the Palmer house occupied by different owners. Confused, Cooper asks Carrie what year it is. Carrie hears Sarah calling Laura's name and screams. The house lights go out. The series closes with a visual callback to Laura whispering to Cooper in the Red Room.</td></tr></tbody></table><br/><h3>Release</h3><p>The season premiered on Showtime on May 21, 2017, with a two-hour episode. After the airing, the premiere and an additional two episodes became available online, and the season aired in weekly increments from that point onwards (at Lynch's insistence). Overall, the series consists of 18 episodes. It concluded on September 3, 2017, with a two-part finale.</p><p>In the United Kingdom, Sky Atlantic simulcast the first two episodes beginning at 2:00 am British Summer Time on May 22, 2017, and the next two episodes were released on Sky UK's on-demand service after the premiere. In the Nordic countries, the season is broadcast on HBO Nordic, with the two-hour premiere airing on May 22, and subsequent episodes being made available the day after its U.S. airing. In Canada, the season is available on CraveTV and The Movie Network, and debuted simultaneously with the U.S. broadcast. In Australia, episodes of the season are available to stream on Stan the same day as the original U.S. broadcast. In Japan, the season aired on the satellite television network Wowow, which also aired the original series.</p><p>Two episodes were screened at the 2017 Cannes Film Festival. The Return was screened in its entirety from January 5–7, 2018, at the Museum of Modern Art, as part of the museum's annual series on \"the year's finest films\".</p><br/><h3>Reception</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Twin Peaks</i>(season 3): Critical reception by episode</caption><tbody><tr><td><style data-mw-deduplicate=\"TemplateStyles:r1039153519\">@media all and (max-width:720px){body.skin-minerva .mw-parser-output .mw-graph{min-width:100%!important;max-width:100%;overflow-x:auto;overflow-y:visible}}.mw-parser-output .mw-graph-img{width:inherit;height:inherit}</style><style data-mw-deduplicate=\"TemplateStyles:r1097763485\">.mw-parser-output .ambox{border:1px solid #a2a9b1;border-left:10px solid #36c;background-color:#fbfbfb;box-sizing:border-box}.mw-parser-output .ambox+link+.ambox,.mw-parser-output .ambox+link+style+.ambox,.mw-parser-output .ambox+link+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+style+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+link+.ambox{margin-top:-1px}html body.mediawiki .mw-parser-output .ambox.mbox-small-left{margin:4px 1em 4px 0;overflow:hidden;width:238px;border-collapse:collapse;font-size:88%;line-height:1.25em}.mw-parser-output .ambox-speedy{border-left:10px solid #b32424;background-color:#fee7e6}.mw-parser-output .ambox-delete{border-left:10px solid #b32424}.mw-parser-output .ambox-content{border-left:10px solid #f28500}.mw-parser-output .ambox-style{border-left:10px solid #fc3}.mw-parser-output .ambox-move{border-left:10px solid #9932cc}.mw-parser-output .ambox-protection{border-left:10px solid #a2a9b1}.mw-parser-output .ambox .mbox-text{border:none;padding:0.25em 0.5em;width:100%}.mw-parser-output .ambox .mbox-image{border:none;padding:2px 0 2px 0.5em;text-align:center}.mw-parser-output .ambox .mbox-imageright{border:none;padding:2px 0.5em 2px 0;text-align:center}.mw-parser-output .ambox .mbox-empty-cell{border:none;padding:0;width:1px}.mw-parser-output .ambox .mbox-image-div{width:52px}html.client-js body.skin-minerva .mw-parser-output .mbox-text-span{margin-left:23px!important}@media(min-width:720px){.mw-parser-output .ambox{margin:0 10%}}</style><table class=\"box-Notice plainlinks metadata ambox ambox-notice\" role=\"presentation\" style=\"width:100%;margin:0;\"><tbody><tr><td class=\"mbox-text\" style=\"text-align: left;\"><div class=\"mbox-text-span\">Graphs are temporarily unavailable due to technical issues.</div></td></tr></tbody></table><p><b><span style=\"color:#3D424A\">Season 3 (2017)</span></b>: Percentage of positive critics' reviews tracked by the website <span>Rotten Tomatoes</span></p></td></tr></tbody></table><p>On Rotten Tomatoes the season has a 94% rating with an average score of 7.8 out of 10 based on 459 reviews. The site's critical consensus reads, \"Surreal, suspenseful, and visually stunning, this new Twin Peaks is an auteurist triumph for David Lynch.\" On Metacritic, Twin Peaks has a score of 74 out of 100 based on 26 reviews.</p><p>Sean T. Collins of Rolling Stone called the season \"one of the most groundbreaking TV series ever\", praising its original, complex storylines and the performances of its cast, particularly Kyle MacLachlan. Matt Zoller Seitz of Vulture wrote that the show was \"the most original and disturbing to hit TV drama since The Sopranos\". In his season review for IGN, Matt Fowler noted that Twin Peaks \"came back as a true artistic force that challenged just about every storytelling convention we know\" and scored it an 8.8 out of 10.</p><p>Of the season's two-part premiere, Sonia Saraiya of Variety wrote \"Twin Peaks: The Return is weird and creepy and slow. But it is interesting. The show is very stubbornly itself—not quite film and not quite TV, rejecting both standard storytelling and standard forms. It's not especially fun to watch and it can be quite disturbing. But there is never a sense that you are watching something devoid of vision or intention. Lynch's vision is so total and absolute that he can get away with what wouldn't be otherwise acceptable.\"</p><p>The Hollywood Reporter's Daniel Fienberg wrote of the season's format:</p><blockquote>It's obvious this Twin Peaks is going to be an 18-hour unit. There was no discernible separation between hours and if credits hadn't rolled, the second hour could probably just as easily have flowed into the third. This isn't episodic TV. It's another thing.</blockquote><p>In her \"A\" grade review of the premiere, Emily L. Stephens of The A.V. Club wrote of its possible reception by critics and viewers:</p><blockquote>If you were looking forward to a return of the sometimes campy, sometimes cozy humor of the original two seasons of Twin Peaks, this premiere could come as a shock. If you were anticipating that once jolting, now familiar blend of genres, this is... not that... but pure Lynchian horror.</blockquote><p>Lynch screened the two-hour premiere of the season at the 2017 Cannes Film Festival and received a five-minute standing ovation from the crowd.</p><p>Sight & Sound and Cahiers du cinéma magazines named Twin Peaks: The Return respectively as the second-best and the best \"film\" of the year, with Sight & Sound placing it behind only the psychological horror film Get Out. Metacritic ranked Twin Peaks the second-best TV series of 2017; 20 major publications ranked it the best show of the year. In 2019, Twin Peaks: The Return was ranked 22nd on The Guardian's list of the 100 best TV shows of the 21st century.</p><p>Writer-director Jim Jarmusch called the season \"a masterpiece\" and the single best piece of American cinema from the last 10 years.</p><h4>Critics' top ten lists</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"text-align: left; vertical-align: top;\"><table class=\"collapsible collapsed\"><tbody><tr><th style=\"width:14em; background:#C4C3D0; text-align:left\">2017</th></tr><tr><td colspan=\"\"><ul><li>No. 1 <i><span>Rolling Stone</span></i></li><li>No. 1 <span>Matt Zoller Seitz</span> of <i><span>Vulture</span></i></li><li>No. 1 <i><span>Collider</span></i></li><li>No. 1 <i><span>Esquire</span></i></li><li>No. 1 <i><span>The Washington Post</span></i></li><li>No. 1 <i><span>The Playlist</span></i></li><li>No. 1 <i><span>Thrillist</span></i></li><li>No. 2 <i><span>The A.V. Club</span></i></li><li>No. 2 <i><span>Entertainment Weekly</span></i></li><li>No. 2 <i><span>Now</span></i></li><li>No. 2 <i><span>The Ringer</span></i></li><li>No. 3 <i><span>IndieWire</span></i></li><li>No. 3 <i><span>Slant Magazine</span></i></li><li>No. 4 <i><span>Variety</span></i></li><li>No. 5 <i><span>Paste</span></i></li><li>No. 6 <i><span>Uproxx</span></i></li><li>No. 10 <i><span>Adweek</span></i></li><li> - <i><span>The Atlantic</span></i></li><li> - <i><span>NPR</span></i></li><li> - <i><span>Los Angeles Times</span></i></li><li> - <i><span>The New York Times</span></i></li><li> - <i><span>Vogue</span></i></li></ul></td></tr></tbody></table><p> </p></td></tr></tbody></table><h4>Ratings</h4><p>The two-hour premiere on May 21, 2017, received 506,000 viewers on Showtime, which Deadline Hollywood called \"soft for such a strongly promoted prestige project\". Ratings increased to 626,000 after the encore broadcasts that night and the premiere also had over 450,000 viewers via streaming and on-demand.</p><p>Viewership for the premiere increased to 804,000 in Live+3 ratings, and it had a viewership of 1.7 million across streaming and on-demand platforms. Showtime announced that the weekend of the Twin Peaks premiere had the most signups to their streaming service ever. Prior to the finale, the season was averaging 2 million weekly viewers, when including time-shifting, encores and streaming. Showtime president David Nevins said that Twin Peaks \"has exceeded expectations\" from a financial perspective.</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" width=\"5%\">Year</th><th scope=\"col\" width=\"22%\">Ceremony</th><th scope=\"col\" width=\"46%\">Category</th><th scope=\"col\" width=\"15%\">Recipient(s)</th><th scope=\"col\" width=\"9%\">Result</th><th scope=\"col\" width=\"3%\" class=\"unsortable\"><abbr title=\"Reference\">Ref.</abbr></th></tr><tr><td rowspan=\"21\" align=\"center\">2018</td><td><span>Art Directors Guild Awards</span></td><td><span class=\"mw-redirect\">One-Hour Contemporary Single-Camera Television Series</span></td><td>Ruth De Jong</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Cinema Audio Society Awards</span></td><td>Outstanding Achievement In Sound Mixing – Television Movie or Mini-Series</td><td>Douglas Axtell, Ron Eng, Dean Hurley</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"2\"><span>Dorian Awards</span></td><td>TV Drama of the Year</td><td><i>Twin Peaks: The Return</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>TV Performance of the Year – Actor</td><td><span>Kyle MacLachlan</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Golden Globe Awards</span></td><td><span>Best Actor – Miniseries or Television Film</span></td><td>Kyle MacLachlan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Golden Reel Awards</span></td><td>Outstanding Achievement in Sound Editing – Episodic Short Form</td><td><span>David Lynch</span>, Dean Hurley</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"5\"><span>Saturn Awards</span></td><td><span>Best Television Presentation</span></td><td><i>Twin Peaks: The Return</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"5\"></td></tr><tr><td><span>Best Actor on Television</span></td><td>Kyle MacLachlan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor on Television</span></td><td><span>Miguel Ferrer</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Guest Performance in a Television Series</span></td><td>David Lynch</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best DVD or Blu-ray Television Release</span></td><td><i>Twin Peaks: A Limited Event Series</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">TCA Award</span></td><td><span>Outstanding Achievement in Movies, Miniseries and Specials</span></td><td><i>Twin Peaks: The Return</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"2\"><span>70th Primetime Emmy Awards</span></td><td><span class=\"mw-redirect\">Outstanding Writing for a Limited Series, Movie or Drama Special</span></td><td>David Lynch and <span>Mark Frost</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span class=\"mw-redirect\">Outstanding Directing for a Limited Series, Movie or Drama Special</span></td><td>David Lynch</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"7\"><span>70th Primetime Creative Arts Emmy Awards</span></td><td>Outstanding Production Design for a Narrative Contemporary Program (One Hour or More)</td><td>Ruth De Jong, Cara Brower, Florencia Martin</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"7\"></td></tr><tr><td><span class=\"mw-redirect\">Outstanding Cinematography for a Limited Series or Movie</span></td><td><span>Peter Deming</span> for \"Part 8\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Single-Camera Picture Editing for a Limited Series or Movie</span></td><td><span>Duwayne Dunham</span> for \"Part 8\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Hairstyling for a Limited Series or Movie</span></td><td>Clare M. Corsick, Bryn Leetch</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Makeup for a Limited Series or Movie (Non-Prosthetic)</span></td><td>Debbie Zoller, Richard Redlefsen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Sound Editing for a Limited Series, Movie or Special</span></td><td>Ron Eng, Dean Hurley, David Lynch, David A. Cohen, Kerry Dean Williams, <span>Luke Gibleon</span>, Willard Overstreet for \"Part 8\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Sound Mixing for a Limited Series or Movie</span></td><td>Ron Eng, Dean Hurley, Douglas Axtell for \"Part 8\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><br/><h3>Home media</h3><p>The season was released on Blu-ray and DVD on December 5, 2017, under the title Twin Peaks: A Limited Event Series. The set includes more than six hours of behind-the-scenes content.</p><p>In the 2017 Home Media Awards, which honor the year's best home video releases, Twin Peaks: A Limited Event Series won four awards: Title of the Year, TV on Disc of the Year, Best TV Movie or Miniseries, and Best Extras/Bonus Material.</p><br/><h3>Future</h3><p>Lynch and Frost have expressed interest in making another season of Twin Peaks, but Lynch has noted that such a project would not immediately follow The Return, given that it took them four and a half years to write and film the third season. In June 2018, Lynch said the story was \"calling\", but that \"there are a lot of disturbances\"; in August, he said he was working through ideas with producer Sabrina Sutherland. In April 2020, he said \"nothing was happening\" regarding further Twin Peaks.</p><br/>"
  },
  "errorMessage": ""
}