{
  "imDbId": "tt4299972",
  "title": "The Jinx: The Life and Deaths of Robert Durst",
  "fullTitle": "The Jinx: The Life and Deaths of Robert Durst (TV Series 2015–2015)",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "ThomasDrufke",
      "userUrl": "https://www.imdb.com/user/ur39517558",
      "reviewLink": "https://www.imdb.com/review/rw3240164",
      "warningSpoilers": true,
      "date": "17 May 2015",
      "rate": "9",
      "helpful": "33 out of 37 found this helpful.",
      "title": "Blink of an Eye",
      "content": "I had never heard of Robert Durst before finding out about a 6 part documentary that HBO had done while listening to ESPN 1000 in Chicago. It was a pretty strange way to hear about a TV series, but I'm sure glad I did. The Jinx is a disturbing look at a once accused murderer who ended up getting away with several crimes. Now of course I say that now that I have seen the series. So I have a pretty good idea whether or not he did what he was accused of. But the impressive part about Andrew Jarecki's approach is that as bad as this person is to us, he paints the picture in a way that there's a possibility that what we think may actually be wrong. He tells us what he thinks in the later episodes, but he does so after years of research, and even after meeting the man himself.The early episodes give us an inside look at the actual process done by the police and law enforcement officials in each case. It was nice getting the complete background before we saw Robert Durst on screen yet. I believe it was episode 3 that we found out Durst reached out to Jarecki in order to tell his own story for the series. It immediately smelled rotten. As much as I think he did kill the 3 people, and maybe even more, Durst was a fascinating person to watch. He's a smart man, and even though he blinks way too much like people are saying, I don't think that was a dead giveaway. He's a very strange person that perhaps could have just been in the wrong place at the wrong time? No, I highly doubt that, but I'm glad Jarecki still interviewed people from both sides. I also didn't find the recreation scenes to be distracting like I do with most documentaries. The whole process of filming and interviewing was handled really well.The final few episodes were really chilling as Durst slipped up on the microphone and accidentally said some things that could be held against him on a later date. Fortunately, I think Durst is currently on trial or arrested for something if I remember reading correctly. Anyway, Jarecki gave us a unique documentary here that serialized something that I didn't think could really be serialized. It was a compelling and disturbing look into a possible murderers life, pre and post crimes.+Jarecki's directing style +Took its time and gave evidence for both sides +Recreation scenes 9.0/10"
    },
    {
      "username": "paul-allaer",
      "userUrl": "https://www.imdb.com/user/ur48675674",
      "reviewLink": "https://www.imdb.com/review/rw5750142",
      "warningSpoilers": true,
      "date": "18 May 2020",
      "rate": "8",
      "helpful": "22 out of 24 found this helpful.",
      "title": "Outstanding true crime documentary badly in need of a post-release update",
      "content": "\"The Jinx\" (2015 release; 6 episodes of about 45 min. Each) is a TV documentary mini-series about New York multi-millionaire Robert Durst. As Episode 1 \"A Body In the Bay\" opens, it is \"Galveston, September 2001\" and a teenager makes the gruesome discovery of a dismembered body in the bay, with some body parts in black plastic bags floating in the bay. Resulting from some nifty police detective work, they are quick to zero in on Robert Durst, who had fled New York to live and anonymous life in Galveston. Then, shockingly, Durst doesn't show up for his arraignment and goes on the lam... At this point we are 15 min. Into Episode 1.Couple of comments: this is the latest from writer-director Andrew Jarecki, who previously gave us the excellent \"Capturing the Friedmans\" documentary. Here he examines the curious case of Robert Durst, the eccentric and ultra-rich New Yorker who may or may not be guilty of one or more murders. Taking advantage of the full 4 1/2 hrs. Running time, we dive deep into the mindset of Durst and of a number of other characters playing a significant role in all of this. I need to be careful as obviously I don't want to spoil anything. Then get ready for Episodes 5 and 6, where it all comes together... Incidentally, this documentary is billed in many planes (including here on IMDb) as \"The Jinx: The Life and Deaths of Robert Durst\", but in the documentary itself, it simply is showing as \"The Jinx\", period.This documentary mini-series premiered on HBO in 2015 to immediate critical acclaim, and more. I binge-watched it this past weekend at HBO On Demand, and found it riveting to watch. That said, the documentary is now 5 years old, and the story of Durst did not end in 2015. In other words: this documentary is badly in need of an update of what has happened since its original 2015 release. Surely I am not the only one who feels that way?"
    },
    {
      "username": "kajmel",
      "userUrl": "https://www.imdb.com/user/ur2514519",
      "reviewLink": "https://www.imdb.com/review/rw3211342",
      "warningSpoilers": false,
      "date": "21 March 2015",
      "rate": "10",
      "helpful": "73 out of 78 found this helpful.",
      "title": "Amazing Documentary Series!",
      "content": "Just finished the entire series. This was such a good watch!! At first it didn't sound interesting enough, but after a few episodes of seeing bits and pieces while my husband watched, I was hooked.I won't give away any spoilers, but this show basically did the amount of investigative research that you'd hope police detectives would do (but apparently, in this case, didn't). Jarecki and his team did a wonderful job... I don't know how this could have been any better. Also love the scenes and music in the beginning credits (Fresh Blood, by Eels).The last two episodes are just breathtaking. I don't think anyone expected the outcome of this show when they first watched (or started filming)!This show definitely deserves some Emmys next year!!"
    },
    {
      "username": "peefyn",
      "userUrl": "https://www.imdb.com/user/ur24140850",
      "reviewLink": "https://www.imdb.com/review/rw3209154",
      "warningSpoilers": false,
      "date": "27 March 2015",
      "rate": "8",
      "helpful": "32 out of 42 found this helpful.",
      "title": "Blurs the line between journalism and entertainment",
      "content": "The Jinx is a great show. I am not American, and I had never heard about the case nor the Durst family before this show. Going in knowing nothing led to some of the revelations being really shocking. The fact that the show is so exciting is at least partly due to the case itself being absolutely bonkers on many levels.But what makes it more exciting is the wealth of information, people and footage they got access to. You really felt that you were thrown into the middle of an investigation, and saw the case unraveling in front of you. And Robert Dust is a compelling figure. It's difficult to place him as either an eccentric evil genius, or a lucky loony. Probably he is somewhere in the middle. Some of the stuff he does seems more like a bumbling fool than an educated criminal, while other things seems really well thought out. It keeps you on the edge of your seat. His mannerisms and just his character in general is also perfect for a show like this. Because despite everything: He can be pretty funny.So, as entertainment it was really good. That said: I did not like the reenactments. It felt cheap and out of place, and was not needed for the documentary. There were other parts that should have been left out as well, like when they start annoying a man working security in one of the Durst buildings.But I guess one of the more important questions to ask yourself here is: should journalism go more in this direction? Because this was, have no doubt about it, made to entertain. Here's my initial thoughts: Except the literal victims here, there are no other victims of this show that I can think of. The friends and family of both victims and others involved seems to have gotten their say, or at least had the chance to. The producers did a really good job researching and investigating the case, and the presentation seems truthful enough. The focus on Robert never turns him entirely into a movie character. Througot the series you start to understand him more as a human being. Or at least the producers impression of him. For now I am in the position that journalism is probably going to go more in this direction, but it is a dangerous path, for it can very easily focus too much on the entertainment and to little on the responsibility of a journalist presenting a case."
    },
    {
      "username": "room102",
      "userUrl": "https://www.imdb.com/user/ur0629528",
      "reviewLink": "https://www.imdb.com/review/rw3274482",
      "warningSpoilers": false,
      "date": "11 July 2015",
      "rate": "8",
      "helpful": "15 out of 18 found this helpful.",
      "title": "Andrew Jarecki Capturing Again",
      "content": "A 4.5 hours HBO investigation/court documentary split into 6 episodes (or chapters).This is a fascinating documentary by Andrew Jarecki, who also directed \"Capturing the Friedmans (2003)\" - one of the best court documentaries I've ever seen. It also tells the real life story of the man on which the movie \"All Good Things (2010)\", also directed by Jarecki, is loosely based.Like in two other amazing investigation/court documentaries - those about serial killer Aileen Wuornos and the West Memphis Three - this is another example where the filmmaker finds himself getting involved in the story and having a direct and major affect on the case.If you haven't heard about this in the news, you might want to avoid reading about the case before watching the documentary - although I did read about it (and then recalled the news several months ago) and it didn't spoil the fascination of watching it.The documentary follows the life of Robert Durst, who is the son of the late Seymour Durst, one of New York's richest real estate investors and developers. For years Robert has been suspected of killing 3 people: His wife, his female friend, and his neighbor. However, he always managed to \"walk between the drops without getting wet\".The film has tons of material, showing old footage, evidence, interviews with the people, reenactment of events, actual footage from court,and amazing of all - interviews and full cooperation from Robert Durst himself.Each episode focuses mainly on one thing. Starting from episode 4 you'll be glued to your chair. Episode 5 is where the filmmakers themselves are getting into their own documentary and becoming a part of it. I don't want to \"spoil\" anything for you, but episode 6 is simply amazing. You can't invent stuff like that. The very last minute is simply something that is taken from the movies."
    },
    {
      "username": "nikita-chikita",
      "userUrl": "https://www.imdb.com/user/ur40569876",
      "reviewLink": "https://www.imdb.com/review/rw3260336",
      "warningSpoilers": false,
      "date": "18 June 2015",
      "rate": "10",
      "helpful": "27 out of 31 found this helpful.",
      "title": "True detectives in real life,greatest documentary i've ever seen.",
      "content": "I don't write reviews that often,but i had to say something about this.It made me literally jump out of my skin,the whole time i was watching it.I can't even begin to explain what i liked the most.I guess i'll begin with the authenticity.It was like watching a fantastic crime TV show,but without the great looking actors.Imagine watching a TV show that combines True Detective,The Killing,CSI,Twin Peaks and all your favorite crime shows of all time(But,the most disturbing part is that this is 100% REAL).Secondly,the storyline was so well constructed.Began very slow and then it got more and more thrilling.I don't wanna say too much about the documentary,because i want you to experience it for yourself and just think about the whole case and draw your own conclusion.This is a must-watch."
    },
    {
      "username": "Lippi_1982",
      "userUrl": "https://www.imdb.com/user/ur51007370",
      "reviewLink": "https://www.imdb.com/review/rw3297052",
      "warningSpoilers": false,
      "date": "14 August 2015",
      "rate": "10",
      "helpful": "22 out of 27 found this helpful.",
      "title": "better than fiction ...waaaaaaay better !",
      "content": "This is one of those movies\\docs, that you'll find yourself waiting and crying for more and more ...still, you'll have the chance to drown into six episodes of a pure crime and suspense gem. I am I fan of shows such as True Detective, Fargo, etc, but this one, you'll have to see with a different eye, the eye that allow you to see through the detectives, director and, the killers eye ! Something that I do believe was never done before and that's what keeps this show one (or a thousand)steps further.Every time i do the shows review is because i do believe some shows are more than just good or great, they are imperative to watch,because we cannot pass through life without paying attention to some things that are really worth to be noticed, a lot of rubbish is dumped on TV ,but a lot of art is also available , you just have to make a choice,and i really want you to chose this one here ;)"
    },
    {
      "username": "bhudson-3",
      "userUrl": "https://www.imdb.com/user/ur9987967",
      "reviewLink": "https://www.imdb.com/review/rw3239376",
      "warningSpoilers": false,
      "date": "16 May 2015",
      "rate": "9",
      "helpful": "19 out of 22 found this helpful.",
      "title": "Well structured and compelling documentary.",
      "content": "This is a documentary which follows Andrew Jarecki, as he pulls together the story of Robert Durst, who is suspected of killing his wife along with two others.Robert Durst is part of the Durst family, a prominent property investment force in New York. Andrew Jarecki interviews Robert Durst extensively, along with other key players. He and his team are party to the uncovering of new evidence for these old crimes.Amazingly, the tension is built and sustained then built again and again - I am sure whether to congratulate Andrew Jarecki as incredibly lucky for the revelations he gets to reveal, or his mastery as a film maker.I believe that this series is a rare combination of both.Highly recommended."
    },
    {
      "username": "kumpfcorey",
      "userUrl": "https://www.imdb.com/user/ur47375407",
      "reviewLink": "https://www.imdb.com/review/rw3220304",
      "warningSpoilers": true,
      "date": "14 April 2015",
      "rate": "10",
      "helpful": "54 out of 59 found this helpful.",
      "title": "More dramatic than anything you'll find on TV or theater",
      "content": "I don't typically watch documentaries and many I often find boring. I also don't typically write reviews. The Jinx however, is the most compelling and dramatic thing I've ever seen. On one side it has the feel of a featured film murder mystery like Gone Girl. Almost seeming written, and even features an amazing intro and theme song similar to True Detective. On the other side you acknowledge this is actually a documentary, and the interviews from the man himself are chilling. For lack of a better comparison , It's like an episode of Dateline NBC on super steroids and 10 times more interesting. I love how it was broken into separate episodes rather than a lengthy one piece. This gives them the ability to leave cliff hangers for the next episode and that makes you want to binge watch(which I did). This series also leaves you wanting more, and you'll find yourself searching the internet for other details about Robert at the case itself. This puts anything else that calls itself \"reality television\" to shame. Overall, I find it to be more powerful and dramatic than anything I've ever watched in a feature film or on television."
    },
    {
      "username": "Pastore10",
      "userUrl": "https://www.imdb.com/user/ur23709292",
      "reviewLink": "https://www.imdb.com/review/rw3422256",
      "warningSpoilers": false,
      "date": "26 February 2016",
      "rate": "10",
      "helpful": "29 out of 31 found this helpful.",
      "title": "It doesn't get much better than this",
      "content": "Almost perfectly done, this documentary series has a solid base on its impeccable research and in the interviews with Robert Durst, the man with a disturbed personality who is, at the same time, incredibly charismatic. Episode by episode, we dive more deeply in the mind of this troubled man and also in the doubt that surrounds his actions. Producer Andrew Jarecki knew how to \"feed\" the spectator with the information in the correct pace, without spoiling the upcoming revelations and lead a true investigation that enlightened things that happened 30 years ago. If you like crime stories, you most definitely should watch. You'll not believe this is a real story being portrayed on the screen!"
    },
    {
      "username": "ar_brierley",
      "userUrl": "https://www.imdb.com/user/ur96471124",
      "reviewLink": "https://www.imdb.com/review/rw5186301",
      "warningSpoilers": false,
      "date": "13 October 2019",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "This is INCREDIBLE!!!!",
      "content": "This is the BEST true crime documentary I have EVER seen!! It starts off slowly, but don't give up - stick with it all the way, get the full story, and you won't be disappointed - the ending is explosive!! (Don't look it up beforehand, just go in cold and watch it - you'll see the documentary makers' true skill)."
    },
    {
      "username": "neorkgjn",
      "userUrl": "https://www.imdb.com/user/ur32488925",
      "reviewLink": "https://www.imdb.com/review/rw3195472",
      "warningSpoilers": true,
      "date": "28 February 2015",
      "rate": "9",
      "helpful": "35 out of 41 found this helpful.",
      "title": "The story of Robert Durst and his connections to three mysterious deaths.",
      "content": "Spoiler Alert. This is my first review. Normally i wouldn't but no one has reviewed it and i think members might read this as an indication of it's appeal. Do not be misled, this is well worth your time.I went into this due to the relatively high ratings and comparisons to True Detective. Having watched it i would describe it as more \"Serial\" the pod-cast. I was thrown off for a minute or two as i realized it's a documentary but was soon convinced, very convinced. Imagine a documentary that plays out like a great fiction movie. The truth is stranger than fiction here.I won't ruin it for you by going into story details. This is a journey that's best experienced first hand. Trust me on that. If you're the kind of person that insists on knowing what it is before watching it, here's an interview of the director on the latimes.com: http://lat.ms/1wz0PndFrom the cinematography alone you know you've found quality cinema and can now schedule your weeks ahead :-) It is well directed by Andrew Jarecki (Who made Capturing the Friedmans (2003). He also made \"All Good Things\", which is also about Robert Durst. Jinx is well written where it is. The journalism aspect of it is on point, the lack of bias by the interviewer is refreshing. It allows one to explore the characters objectively. Going from episode to episode one does not know what to expect; the surprises keep coming. I love how each episode resolves intelligently but leaves one looking forward to the next.If you're like me and refuse to see any series that scores below 8 on IMDb- I recommend Jinx for you. Do not waste any time; run towards it.I am from Joburg SA. City Of Gold&Gunpowder."
    },
    {
      "username": "Geeky Randy",
      "userUrl": "https://www.imdb.com/user/ur0756238",
      "reviewLink": "https://www.imdb.com/review/rw3205973",
      "warningSpoilers": false,
      "date": "21 March 2015",
      "rate": "9",
      "helpful": "17 out of 26 found this helpful.",
      "title": "Geeky Randy's summary",
      "content": "Groundbreaking HBO miniseries about Robert Durst. Directed by Andrew Jarecki, who previously directed the Durst-inspired ALL GOOD THINGS (2010). The show follows the reclusive real estate scion through three unsolved murders with plenty of history and mystery—all of which Durst himself became a suspect in—as well as taking some time to detail Durst's complex early life that could either explain his eccentricity or perhaps suggest his ability to commit the crimes in question. The documentary incorporates in-person interviews and phone conversations over the course of many years, all building up to a historical finale.***½ (out of four)"
    },
    {
      "username": "jonmccann",
      "userUrl": "https://www.imdb.com/user/ur12353447",
      "reviewLink": "https://www.imdb.com/review/rw3597625",
      "warningSpoilers": false,
      "date": "12 December 2016",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "How have we not seen this sooner?!",
      "content": "Firstly, I do not understand why the likes of Amazon Prime have not picked this up as a feature, maybe the release date technically prohibits this, but with Netflix garnering so much attention from 'Making a Murderer', this would be the ideal documentary to blow that out of the water....And it does!All views are of my own opinion, just to be clear! I enjoyed Making a Murderer, I thought it was well thought out, maybe sometimes a bit too scripted in terms of 'cliffhangers', but overall it gave insight into what some feel is a miscarriage of justice, and others feel is well overdue, for a possibly sadistic murderer/s. For what is a true documentary, however, or should i say but, it was based on circumspect, it was based on fallible evidence and differences of individual opinions, and ultimately, whilst the cold hard facts were there, there were also reasons, excuses, possibilities etc that could explain them. In fact the focus was very much, have the cops done wrong, or did they do right?!The Jinx is not in that realm, in fact it is far above it, and the only reason for this is, they took the case to the heart of the issue....The 'possible' killer. Though woaaahh, they don't just stump up outside his home and ask him, they use the best possible style and technique, they ask questions, they probe his thoughts, his emotions, his feelings, and they ask the difficult questions, in a way only a late night talk show host could hope to do! This is a documentary of cat and mouse proportions. You will see reviews about the accused, and his interview techniques, each has their own opinion, my only opinion on this was what an insight into a sociopath and possible murderer...If not true serial killer. It is rare to get an insight into such an individual person, yet I would hazard a guess that if Phil Spector was to face similar scrutiny, we would experience a similar documentary!This is what your CSI, Law and Order, Criminal Minds etc, interrogations are about, except they don't shout and demand and have it done within 10 mins, they simply ask with subtlety and let the 'subject' do the rest, albeit over an extensive time period.I did mention earlier about Sociopaths, in my opinion, Robert Durst is one of the most intelligent Sociopaths (which technically I guess brain docs will tell you they all are!) to ever (so far) get away with murder, that's maybe because he didn't do it as one jury has decided, or maybe because he balanced his need for attention and accreditation, with need for solitude and time out from the limelight of his actions, I suppose it remains to be seen, but then, have you heard of Robert Durst?!? :-)"
    },
    {
      "username": "jerryp65",
      "userUrl": "https://www.imdb.com/user/ur36593051",
      "reviewLink": "https://www.imdb.com/review/rw4504662",
      "warningSpoilers": true,
      "date": "10 December 2018",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Crafty Robert",
      "content": "Mr Durst is a stone cold killer. As the series progresses one can make up from the circumstantial evidence that he is a muderer. I cannot understand how this man, especially in America, got away with what he did. He should've at least been charged with dismemberment and identity fraud and other minor charges. The fact that he cut up someone after killing the victim in self defense doesn't make any sense whatsoever. Normally you would call emergency services after that would happen? He is not much different from Ted Bundy. A crafty sly psychopath who is intelligent and lucky.It was a very interesting documentary and the interviewers were really good at exposing him in the end. I would like to see another follow up about what will happen to Durst now he is suspected of 3 or more killings."
    },
    {
      "username": "soulchild-45229",
      "userUrl": "https://www.imdb.com/user/ur119203771",
      "reviewLink": "https://www.imdb.com/review/rw7936329",
      "warningSpoilers": false,
      "date": "10 March 2022",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "PHENOMENAL",
      "content": "This is probably one of the best real crime docu-series out there. At least since documentaries like \"Paradise Lost\" or \"The Staircase\", we should know how important this genre has become, solving a lot of cases. Really recommend this one."
    },
    {
      "username": "ronancraven",
      "userUrl": "https://www.imdb.com/user/ur18008829",
      "reviewLink": "https://www.imdb.com/review/rw3248062",
      "warningSpoilers": false,
      "date": "30 May 2015",
      "rate": "10",
      "helpful": "16 out of 22 found this helpful.",
      "title": "Most definitely a 10!!!!!!!",
      "content": "It was 11pm last Thursday night and i'm up for work at 7.30am Friday morning. I put on the 1st episode of the Jinx before sleep because i'm thinking it might be good as it was recommended to me by a reliable source who's never let me down before and is very very selective about recommending anything. 5 hours later i finish watching the lot and am amazed at this story. I won't explain what the story is about just in case it ruins it for anyone and also because i'm too lazy. I will say it is fabulous television and a must see for everyone. It should appeal to pretty much everyone. Give this a shot, it's brilliant!!!!!! Huge well done to everyone involved with the making of this documentary. And a huge thanks. Just wish i could watch it fresh again........"
    },
    {
      "username": "toryjackson-27743",
      "userUrl": "https://www.imdb.com/user/ur83416557",
      "reviewLink": "https://www.imdb.com/review/rw5004672",
      "warningSpoilers": false,
      "date": "19 July 2019",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Chilling",
      "content": "One of my favourite pastimes is watching documentaries, used to be reading but as I've gotten older it helps to have a visual. This is by far the best documentary I've ever seen."
    },
    {
      "username": "cheer88",
      "userUrl": "https://www.imdb.com/user/ur52892613",
      "reviewLink": "https://www.imdb.com/review/rw4254309",
      "warningSpoilers": false,
      "date": "26 July 2018",
      "rate": "9",
      "helpful": "6 out of 8 found this helpful.",
      "title": "A great documentry",
      "content": "I saw \" All good things\" a few years back and was curious about the alleged suspect, Robert Durst. Later, I watched several news programs about him. Somehow, it was only natural to come across this title eventually.I watched two similar crime series on Netflix, \"Making a Murderer\" and \"The Staircase\". None of them were convincing to me. Both suspects in these two cases were convicted as murderers. However, those two film makers indeed tried to portrait their innocence, otherwise. Especially, the suspect in \"Making a Murderer\" is undoubtedly guilty . The film makers somehow misled audience to believe suspects' innocence with their bias directing skills. This one is neutral and journalistic.The main focus of this documentary is on Robert Durst entirely not on any particularly alleged crimes he committed. The history of him is very well to depict his psychopathic personality. He got away with those murders because of his wealth and connections. When he agreed to participate this documentary against his lawyer's cautious advises, he wasn't aware that his fate was about to take turn for worse. This also coincided with those analyses of psychopathic behaviors. Despite of all the complexities of psychopath, Robert Durst is a real life psychopath who is now behind bars because of this film. I would say so far this is the best outcome anyone could hope for.This is a good journalist work. It did not only have its entertaining value but also serve justice for victims. What could be better than that? I would recommend it."
    },
    {
      "username": "shanayneigh",
      "userUrl": "https://www.imdb.com/user/ur1738956",
      "reviewLink": "https://www.imdb.com/review/rw3374541",
      "warningSpoilers": true,
      "date": "18 December 2015",
      "rate": "3",
      "helpful": "18 out of 47 found this helpful.",
      "title": "A swing and a miss",
      "content": "First of all, I, precisely like you, have no idea if Robert Durst is guilty or not.As a big fan of documentaries I am of the view that no documentary is or can be neutral or objective. In fact, some of the best documentaries, in my view, are thesis driven ones with a strong point of view. Andrew Jarecki made such a documentary twelve years ago, Capturing the Friedmans, which is one of the most fascinating documentaries I've ever seen. But the risk with making such a documentary is that you may cross the line and it becomes a hatchet job. My view is that Jarecki crossed that line in The Jinx. It is clear that Jarecki swings for the fences, but this time he comes up short. And I have to say that there is something quite unsettling about the style in which he made this documentary.It features a lot of talking heads. Jarecki manages to come up with exactly one person, not counting Durst's former lawyers, who isn't outright hostile towards Durst. Over and over again they call Durst, who at that point hasn't been charged with, or convicted of, anything in connection with the disappearance of Kathie Durst and the death of Susan Berman, a \"murderer\". Having watched this series for the second time now, I can't think of an instance where Jarecki asks even one single critical question to these people. Which is problematic since he has long since crossed the line from documentarian into something else completely. In episode 2 Jarecki jokes with Kathie Durst's friends that they in search for answers \"have become junior detectives\". Well, this is also an apt description of Jarecki's role. It's blatantly obvious that he from the start of the documentary is out to get Durst. Maybe that wasn't the intention when he started filming, but it's certainly clear in the editing of the episodes that Jarecki is building a case against Durst, most evident in the last episode where they prepare the interrogation (\"interview\" is not the correct word) of Durst.Too bad for Jarecki that his case is quite weak. No \"proof\" is too small to be included in the show. For instance the ridiculous argument that only someone with medical knowledge would use the word \"cadaver\". And since Durst's disappeared wife was a medical student where they use cadavers for training purposes, Durst must obviously be the person who wrote the \"cadaver letter\". QED. Or, you know, someone with a larger vocabulary than a middle school student.And the intended coup de grace, Durst's bathroom \"confession\" in the last minutes of the series, is a dud. Having worked in this business for quite some time, I for one don't buy for a single second that the filmmakers were unaware of Durst's \"confession\", discovering it in editing one or two years later as they claim. First of all, they kept the microphone on Durst after the interview was done. Secondly, there is no reason for the camera which is recording the audio to still be running after they wrap up, turn off the lights etc. Given that Durst was seen talking into his microphone being unaware that they were recording earlier in the series, it's quite clear that the filmmakers were keeping their fingers crossed for something like that to happen again. And bingo. Or so they thought. You don't have to be Johnnie Cochran or a John Grisham protagonist to make the argument that he was talking sarcastically, or playing out scenarios in his head of what other people might say about him. Exhibit A: The Jinx, where Durst does so several times.There are plenty of armchair amateur psychologists writing about Durst, not at least on the IMDb boards. He has \"dead eyes\" like \"a shark\", which if course is proof of him being a sociopath or psychopath. His blinking is \"a tell that he is covering up his lies\", a \"technique taught to CIA and spies all over the world to beat 'the lie detector' and interrogators\" no less. And as we all know, burping is the true mark of a killer. Again, I have no idea of Robert Durst is guilty or not, but unlike the junior PI's on the IMDb boards I have seen people with tics before. One of my best friends has Tourettes, and his blinking tics are very similar to Durst's. And using someone's \"dead\" or \"black\" eyes as some sort of proof of guilt, you might as well be using phrenology which is of equal validity.One other thing that is unsettling is the impeccable timing of Durst's arrest which took place on the evening before the final episode aired, prompting the question of whether there has been a conflation between criminal investigation and documentary filmmaking. That has been done before, and very successfully at that. The Thin Blue Line and Serial are two examples on the top of my head. The difference however between those two shows and The Jinx is that the former two aimed at exonerating someone of a crime, or at least casting a shadow of reasonable doubt, while the latter tries to prove that someone is guilty, and if you want to do that you better make sure you have an almost iron-clad case which The Jinx is far from being. With great accusations come great responsibility, to paraphrase a well-known superhero."
    },
    {
      "username": "kshoals",
      "userUrl": "https://www.imdb.com/user/ur59129168",
      "reviewLink": "https://www.imdb.com/review/rw3198538",
      "warningSpoilers": true,
      "date": "8 March 2015",
      "rate": "8",
      "helpful": "24 out of 33 found this helpful.",
      "title": "Definitely worth a watch",
      "content": "I didn't want to watch it, for fear of seeing some gory tale of murder upon murder. However, on a cold Sunday, my other half could not tear himself away from it, so I was stuck under his arm and found myself enthralled.We watched it in a marathon, and I'm still confused, did he or did he not kill?! The wife is gone, the friend is murdered, the neighbor is in pieces... but, they can't prove anything he doesn't admit to. He even testifies, but his matter-of-fact tone leads one to believe everything he says. What is going on?!So interesting... the journey, presentation of information, the direction, delivery... simply well done. Watch it and decide for yourself."
    },
    {
      "username": "emilyclairegreenwood",
      "userUrl": "https://www.imdb.com/user/ur73085733",
      "reviewLink": "https://www.imdb.com/review/rw3644090",
      "warningSpoilers": false,
      "date": "20 February 2017",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Even better than \"Making a Murderer\"",
      "content": "I'm not sure why this series isn't as well known as Making A Murderer. What an amazing insight into the story behind an accused killer who is such a strange and curios character. It's only a short series, but OH so worth it! I really like how the director and producer really probe Robert Durst with some real, juicy questions!"
    },
    {
      "username": "scottoerlemans",
      "userUrl": "https://www.imdb.com/user/ur59479402",
      "reviewLink": "https://www.imdb.com/review/rw3209112",
      "warningSpoilers": true,
      "date": "27 March 2015",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Stunning piece of work",
      "content": "I started watching \"The Jinx\" one night, hungover and tired, and fell asleep within 10 minutes. Two days later after finding myself in another alcohol induced state I decided to watch it - this time it was a slight hangover with a more tired effect. After watching the first episode I was enthralled and curious to find out what happened next - what's the hurt in one more episode, right?... 6 hours later, I found myself finished the entire series with my mouth to the floor.Without giving anything away, this is a crime documentary that goes above and beyond what the genre will dictate. After finishing, and finding myself reading review after review to try to find some sense in what you have watched - there is a moment where you stumble on the comparisons to different crime documentary genres - such as: Serial, Dateline, the entire ID Network. This, however, is incorrect - being as the only comparison is the genre.\"The Jinx: The Life and Deaths Of Robert Durst\" should be seen as one of the crowning achievements of television. A gripping drama about the grey lines of our society, the dark individuals that slither in between these lines, and the big money that turns its cheek in the sake of continual prominence."
    },
    {
      "username": "lawrelwill",
      "userUrl": "https://www.imdb.com/user/ur14473621",
      "reviewLink": "https://www.imdb.com/review/rw3722982",
      "warningSpoilers": true,
      "date": "3 June 2017",
      "rate": "9",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Well Done, 1 Exception",
      "content": "I really enjoyed this documentary and find this story fascinating. The one detail the filmmaker missed is this: The reason Robert Durst sent the cadáver letter is bc he was concerned about Susan Berman's 2 dogs NOT about her. He did not want her dogs left unattended with her dead body for several days. Look at all the photos of him with dogs, including on his wedding day when he is holding the husky.He cared about animals but not people."
    },
    {
      "username": "thorbo-45908",
      "userUrl": "https://www.imdb.com/user/ur59775553",
      "reviewLink": "https://www.imdb.com/review/rw3220514",
      "warningSpoilers": true,
      "date": "15 April 2015",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Great",
      "content": "I cant believe i haven't heard of this case before and i follow most true crime events its very intriguing, its one of the best true crime documentaries I've seen in my life really good entertainment, especially the parts that he doesn't know his microphone is still turned on, i'm watching the movie \"all good things\" at the moment and i saw \"the jinx\" documentary first. and after watching the documentary i think the movie is very underrated considering what really happened, I've done no research into Robert Durst after the Documentary came out and the conclusion, but both of them are worth a watch if your interested in the true crime mystery genre, My personal views are i really don't know what happened, either this guy is one of the smartest killers or he is the most unluckiest men, even the parts when he talks to himself are interesting because i can relate to such things myself, this documentary and the movie combined are defiantly worth a watch."
    }
  ],
  "errorMessage": ""
}