{
  "imDbId": "tt4299972",
  "title": "The Jinx: The Life and Deaths of Robert Durst",
  "fullTitle": "The Jinx: The Life and Deaths of Robert Durst (TV Series 2015–2015)",
  "type": "TVSeries",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "The Jinx (miniseries)",
  "url": "https://en.wikipedia.org/wiki/The_Jinx_(miniseries)",
  "plotShort": {
    "plainText": "The Jinx: The Life and Deaths of Robert Durst is a 2015 HBO documentary miniseries about New York real estate heir Robert Durst, a convicted murderer. It was written by Andrew Jarecki, Marc Smerling, and Zac Stuart-Pontier.\r\nThe series was directed by Jarecki, who had previously directed the feature fictional film All Good Things (2010), inspired by Durst's biography. Durst had professed admiration for the film All Good Things and telephoned Jarecki after its release, offering to be interviewed (this conversation was recorded and incorporated into the documentary). Durst sat with Jarecki for more than 20 hours over several years, despite having never previously cooperated with any journalist.\r\nThe Jinx gained widespread exposure when Durst was arrested on first-degree murder charges for the death of his friend Susan Berman, the day before its finale aired.",
    "html": "<p>The Jinx: The Life and Deaths of Robert Durst is a 2015 HBO documentary miniseries about New York real estate heir Robert Durst, a convicted murderer. It was written by Andrew Jarecki, Marc Smerling, and Zac Stuart-Pontier.</p><p>The series was directed by Jarecki, who had previously directed the feature fictional film All Good Things (2010), inspired by Durst's biography. Durst had professed admiration for the film All Good Things and telephoned Jarecki after its release, offering to be interviewed (this conversation was recorded and incorporated into the documentary). Durst sat with Jarecki for more than 20 hours over several years, despite having never previously cooperated with any journalist.</p><p>The Jinx gained widespread exposure when Durst was arrested on first-degree murder charges for the death of his friend Susan Berman, the day before its finale aired.</p>"
  },
  "plotFull": {
    "plainText": "The Jinx: The Life and Deaths of Robert Durst is a 2015 HBO documentary miniseries about New York real estate heir Robert Durst, a convicted murderer. It was written by Andrew Jarecki, Marc Smerling, and Zac Stuart-Pontier.\r\nThe series was directed by Jarecki, who had previously directed the feature fictional film All Good Things (2010), inspired by Durst's biography. Durst had professed admiration for the film All Good Things and telephoned Jarecki after its release, offering to be interviewed (this conversation was recorded and incorporated into the documentary). Durst sat with Jarecki for more than 20 hours over several years, despite having never previously cooperated with any journalist.\r\nThe Jinx gained widespread exposure when Durst was arrested on first-degree murder charges for the death of his friend Susan Berman, the day before its finale aired.\r\nSynopsis\r\nThe series investigates the unsolved 1982 disappearance of Durst's wife Kathie, the 2000 execution-style killing of writer Susan Berman, and the 2001 death and dismemberment of Durst's neighbor Morris Black in Galveston, Texas. Durst was suspected of involvement in the first two murders and confessed to the third, but claimed self defense and was acquitted at trial. The series incorporates a wide array of existing media including news footage, security footage, police evidence, and archival interviews, combined with footage shot by Jarecki. It is composed of contemporary interviews, visual reenactments (some of which were shot at Jarecki's upstate New York home), and self-reflexive footage of Jarecki's film-making process and odd working relationship with Durst. Its complex editing style and narrative construction emphasize the contradictions within both Durst's life and the bizarre and grisly murders he committed.\r\nDuring the conclusion of the fifth episode, Sareb Kaufman, Berman's stepson, contacts the filmmakers asking them to review material that was left by Berman after her murder. In it, he highlights an envelope from Durst to Berman sent in March 1999: the envelope's block letter handwriting matches and contains the same \"Beverley Hills\" misspelling as an anonymous envelope sent to police in December 2000 to alert them to Berman's murder. The filmmakers, shocked by the revelation, place both envelopes in a safety deposit box, and decide to get a second interview from Durst.\r\nIn the sixth and final episode, the filmmakers visit a forensic document examiner. After analyzing both envelopes and other documents in Durst's block letter writing, he states that the two writings have characteristics that can come from \"one person, and only one person\". Jarecki attempts to get a second interview with Durst, who suddenly becomes evasive and uninterested in a follow-up. At one point he claims to be in Spain, but Kaufman says that Durst told him he was in Los Angeles. After Durst is arrested for violating a restraining order filed by his brother Douglas, Jarecki convinces Durst to conduct a second interview. During their session, Jarecki confronts Durst about the match in handwriting on the two envelopes - Durst acknowledges the similarity, but denies writing the letter about Berman's murder. After the interview Durst goes to the bathroom. Apparently unaware that his microphone is still recording, he makes a rambling, off-camera statement to himself, ending with, \"What the hell did I do? Killed them all, of course.\"\r\nEpisodes\r\n^Note A Chapter 6 is referred to as \"The Second Interview\" on some promotional platforms.\r\nCast\r\nIn order of appearance:\r\nGary Jones (detective, Galveston Police Department)\r\nJoel Bennett (Assistant District Attorney, Galveston)\r\nCody Cazalas (detective, Galveston Police Department)\r\nRandy Burrows (member of Galveston Dive Team)\r\nDebrah Lee Charatan (current wife of Robert Durst)\r\nCharles V. Bagli (reporter, The New York Times)\r\nJeanine Pirro (former District Attorney, Westchester County, New York)\r\nDouglas Durst (younger brother of Robert Durst; chairman, Durst Organization)\r\nRobert Durst\r\nJohn Waldron (attorney for Robert Durst)\r\nMichael Kennedy (Durst family attorney)\r\nDick DeGuerin (attorney for Robert Durst)\r\nAndrew Jarecki (director and producer, All Good Things)\r\nMarc Smerling (writer and producer, All Good Things)\r\nEamonn Bowles (Magnolia Pictures, distributor, All Good Things)\r\nAnn McCormack (mother of Kathie Durst)\r\nJim McCormack (brother of Kathie Durst)\r\nGilberte Najamy (friend of Kathie Durst)\r\nGeraldine McInerney (McCormack family friend)\r\nEleanor Schwank (friend of Kathie Durst)\r\nMichael Struk (former detective, New York City Police Department)\r\nEllen Strauss (friend of Kathie Durst)\r\nBill Mayer (neighbor of Robert Durst)\r\nJoe Becerra (detective, New York State Police)\r\nGabrielle Colquitt (later owner of Durst lake house)\r\nEd Murphy (senior investigator, Westchester District Attorney's Office)\r\nSusan Berman (friend of Robert Durst)\r\nTom Padden Sr., Tom Padden Jr. (cousins of Susan Berman)\r\nKim Lankford (friend of Susan Berman)\r\nLynda Obst (friend of Susan Berman)\r\nJulie Smith (friend of Susan Berman)\r\nKevin Hynes (former Assistant District Attorney, Westchester County, New York)\r\nSareb and Mella Kaufman (children of Susan Berman's boyfriend)\r\nDeni Marcus (cousin of Susan Berman)\r\nPaul Coulter (detective, Los Angeles Police Department)\r\nStephen Silverman (friend of Susan Berman)\r\nKurt Sistrunk (former District Attorney, Galveston County, Texas)\r\nMichael Ramsey (attorney for Robert Durst)\r\nSusan Criss (judge, Galveston County, Texas)\r\nChris Lovell, Joanne Gongora (jurors, Texas v. Durst)\r\nChip Lewis (attorney for Robert Durst)\r\nEvan Kreeger (nephew of Robert Durst)\r\nEdward Wright (former private investigator)\r\nElizabeth McCormack (niece of Kathie Durst)\r\nRoss Vitalie (cab driver, Eureka, California)\r\nJohn Osborn (forensic document examiner)\r\nCast (reenactment)\r\nGary Napoli as Robert Durst\r\nEric Rizk as Seymour Durst Michael Antonio as Young Robert Durst\r\nMichael Antonio as Young Robert Durst\r\nCandace Bryant as Ellen Strauss\r\nJuliette Campa as Susan Berman\r\nSara Canter as Geraldine\r\nRose Cordova as Eleanor Schwank\r\nGus Lynch as Beverly Hills Postal Worker\r\nDillon Mathews as Struk\r\nAmelie McKendry as Mary McCormack\r\nHanan Miller as Douglas Durst\r\nJohn Ohkuma as Jim McCormack\r\nAftermath\r\nDouglas Durst, estranged brother of Robert and head of the Durst Organization, was apprehensive about the documentary's portrayal of the Durst family and, in particular, its use of videotaped depositions that had been subject to a confidentiality agreement. He petitioned the New York Supreme Court in January 2015 to compel Jarecki to reveal his sources. \"Douglas Durst is worried The Jinx will be a violent broadside against the family name and history,” the petition stated. By showing that Robert or wife Debrah Lee Charatan violated a Westchester County judge's 2006 order sealing the material, Douglas could sue to recover a $65 million family trust settlement. According to The New York Times, Robert gave filmmakers \"unrestricted access\" to his personal files, which included the videotaped testimony.\r\nA lawyer for Douglas argued that The Jinx is a \"sensationalized docudrama\" and that its director is exempt from New York's shield law, designed to protect journalists. Jarecki replied that his use of dramatic reenactments (by actors whose faces were never shown) was not evidence of fictionalization. Despite attempting to \"portray Robert Durst as a human being in a fashion that could help explain some of his behavior, rather than as a burlesque figure,\" Jarecki never promised Durst that his film would ultimately defend his innocence.\r\nOn March 14, 2015, the eve of the final episode's airing, Durst was arrested in New Orleans by the FBI on a first-degree murder warrant obtained by the LAPD in connection to Berman's death. They had undertaken an investigation based on new evidence presented in the miniseries. The Associated Press reported that the 1999 letter written by Durst to Berman, unearthed by the filmmakers, provided \"key new evidence\" leading to the filing of murder charges. According to The New York Times, the filmmakers sought legal advice on when to share the letter with law enforcement, weighing journalistic privilege against possible claims of evidentiary inadmissibility in a future trial.\r\nInterviewed ten days after his brother's arrest, Douglas told The New York Times that his brother had stalked him as recently as February 22, 2015, in Palm Beach, Florida. He felt \"a tremendous sense of relief\" at the turn of events which led to Robert's arrest. Although sharply disputing some assumptions about the Durst family presented in Jarecki's documentary (which he had not seen), and continuing to stress the threat Robert posed to him and others, Douglas sounded a conciliatory note: “I no longer am looking over my shoulder,” he said. “I’m very grateful to ‘The Jinx’ for having brought this about.” Douglas dropped his legal action against Jarecki in late April 2015, and was reportedly considering a move to freeze $74 million of his estranged brother's assets.\r\nIn April 2019, during Durst's trial, a transcript from the series revealed that Durst's final remarks had been edited and presented out of order. According to the transcript filed in court, Durst's complete remarks were as follows:\r\n\" I don't know what you expected to get. I don't know what's in the house. Oh, I want this. Killed them all, of course. I want to do something new. There's nothing new about that. He was right. I was wrong. The burping. I'm having difficulty with the question. What the hell did I do?\"\r\nJarecki, Smerling, and Stuart-Pontier defended the edits as \"entirely representative of what Durst said\". Documentary filmmaker Mark Jonathan Harris described the edits as \"problematic\", saying that Durst's statements are \"definitely more ambiguous in the transcript\" and the edit made them \"damning\".\r\nSoundtrack\r\nThe theme song is \"Fresh Blood\" performed by Eels. The original score was composed by West Dylan Thordson with co-composition by John Kusiak. Musical saw, performed by Natalia Paruz, is featured throughout the series.\r\nReception\r\nThe Jinx received widespread critical acclaim and media buzz, particularly upon airing its revelatory finale. John Hendrickson at Esquire called the series' ending \"one of the most jaw-dropping moments in television history.\" Mike Hale from The New York Times said it was \"gut-wrenching, remarkable television.\" Sean T. Collins of The New York Observer called the series \"a documentarian’s unicorn: a quest for the truth that, it seems, found it, and found it spectacularly,\" adding that in comparison to usual television true-crime documentary fare, The Jinx \"pulls an SUV with a vanity plate that reads 'BEVERLEY' up on the curb and mows it all down.\"\r\nOther critics accused the documentary of charting an uncomfortable line between storytelling and journalism. Two days after Durst's arrest and one day after the final installment of The Jinx was aired, The New Yorker reported that \"he filmmakers, having been quizzed on the time line of events as represented, have cancelled forthcoming interviews.\" Specifically, when challenged over whether Robert Durst's arrest for trespassing on his brother Douglas Durst's property occurred before the filmmakers' second interview with Robert, as implied by The Jinx, Andrew Jarecki replied, \"Yeah, I think I’ve got to get back to you with a proper response on that.\" Several media outlets questioned how long the filmmakers had sat on evidence damaging to Durst before turning it over to law enforcement.\r\nJarecki subsequently sent an explanation to multiple media outlets:\r\n“Given that we are likely to be called as witnesses in any case law enforcement may decide to bring against Robert Durst, it is not appropriate for us to comment further on these pending matters. We can confirm that evidence (including the envelope and the washroom recording) was turned over to authorities months ago.”\r\nA study of Westchester County case notes by The Guardian indicated that, contrary to then-District Attorney Jeanine Pirro's assertions in The Jinx that \"we were about to speak with\" Susan Berman about Kathie Durst's disappearance, New York investigators had not yet scheduled an interview nor funded an investigator to visit Berman in California at the time of her December 23, 2000, murder. Durst said in a 2005 deposition, excerpted in The Jinx, that Berman called him shortly before her death and said: \"The Los Angeles police contacted me. They wanted to talk about Kathie Durst’s disappearance.”\r\nAlthough the Los Angeles Police Department denied any connection between Durst's arrest and HBO's airing of The Jinx finale, Dick DeGuerin, Durst's defense attorney, lashed out at the timing. “Do I think this is a coincidence? Hell, no,” he said. “There has been rumor, innuendo and speculation for a number of years, and now we’re going to get our day in court on this.”\r\nAwards\r\nThe Jinx was nominated for six and won two Primetime Creative Arts Emmy Awards in 2015: Outstanding Documentary or Nonfiction Series and Outstanding Picture Editing for Nonfiction Programming. It received nominations for Outstanding Cinematography for Nonfiction Programming, Outstanding Directing for Nonfiction Programming, Outstanding Sound Editing for Nonfiction Programming (Single or Multi-Camera), and Outstanding Sound Mixing for Nonfiction Programming.\r\nThe Jinx was also awarded a 2015 Peabody Award, as well as the TCA Award for Outstanding Achievement in Movies, Miniseries and Specials from the Television Critics Association. Marc Smerling, Andrew Jarecki, and Jason Blum won the Producers Guild of America Award for Outstanding Producer of Non-Fiction Television.\r\nInternational broadcast\r\nThe miniseries premiered in Australia on May 7, 2015, on Showcase. The Jinx premiered in India on June 9, 2015, on HBO Defined.",
    "html": "<p>The Jinx: The Life and Deaths of Robert Durst is a 2015 HBO documentary miniseries about New York real estate heir Robert Durst, a convicted murderer. It was written by Andrew Jarecki, Marc Smerling, and Zac Stuart-Pontier.</p><p>The series was directed by Jarecki, who had previously directed the feature fictional film All Good Things (2010), inspired by Durst's biography. Durst had professed admiration for the film All Good Things and telephoned Jarecki after its release, offering to be interviewed (this conversation was recorded and incorporated into the documentary). Durst sat with Jarecki for more than 20 hours over several years, despite having never previously cooperated with any journalist.</p><p>The Jinx gained widespread exposure when Durst was arrested on first-degree murder charges for the death of his friend Susan Berman, the day before its finale aired.</p><br/><h3>Synopsis</h3><p>The series investigates the unsolved 1982 disappearance of Durst's wife Kathie, the 2000 execution-style killing of writer Susan Berman, and the 2001 death and dismemberment of Durst's neighbor Morris Black in Galveston, Texas. Durst was suspected of involvement in the first two murders and confessed to the third, but claimed self defense and was acquitted at trial. The series incorporates a wide array of existing media including news footage, security footage, police evidence, and archival interviews, combined with footage shot by Jarecki. It is composed of contemporary interviews, visual reenactments (some of which were shot at Jarecki's upstate New York home), and self-reflexive footage of Jarecki's film-making process and odd working relationship with Durst. Its complex editing style and narrative construction emphasize the contradictions within both Durst's life and the bizarre and grisly murders he committed.</p><p>During the conclusion of the fifth episode, Sareb Kaufman, Berman's stepson, contacts the filmmakers asking them to review material that was left by Berman after her murder. In it, he highlights an envelope from Durst to Berman sent in March 1999: the envelope's block letter handwriting matches and contains the same \"Beverley Hills\" misspelling as an anonymous envelope sent to police in December 2000 to alert them to Berman's murder. The filmmakers, shocked by the revelation, place both envelopes in a safety deposit box, and decide to get a second interview from Durst.</p><p>In the sixth and final episode, the filmmakers visit a forensic document examiner. After analyzing both envelopes and other documents in Durst's block letter writing, he states that the two writings have characteristics that can come from \"one person, and only one person\". Jarecki attempts to get a second interview with Durst, who suddenly becomes evasive and uninterested in a follow-up. At one point he claims to be in Spain, but Kaufman says that Durst told him he was in Los Angeles. After Durst is arrested for violating a restraining order filed by his brother Douglas, Jarecki convinces Durst to conduct a second interview. During their session, Jarecki confronts Durst about the match in handwriting on the two envelopes - Durst acknowledges the similarity, but denies writing the letter about Berman's murder. After the interview Durst goes to the bathroom. Apparently unaware that his microphone is still recording, he makes a rambling, off-camera statement to himself, ending with, \"What the hell did I do? Killed them all, of course.\"</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#292929;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#292929\">Title</th><th scope=\"col\" style=\"background:#292929\">Original air date</th><th scope=\"col\" style=\"background:#292929;width:10%\">US viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Chapter 1: A Body in the Bay\"</td><td style=\"text-align:center\">February 8, 2015</td><td style=\"text-align:center\">0.752</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Chapter 2: Poor Little Rich Boy\"</td><td style=\"text-align:center\">February 15, 2015</td><td style=\"text-align:center\">0.321</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Chapter 3: The Gangster's Daughter\"</td><td style=\"text-align:center\">February 22, 2015</td><td style=\"text-align:center\">0.381</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Chapter 4: The State of Texas vs. Robert Durst\"</td><td style=\"text-align:center\">March 1, 2015</td><td style=\"text-align:center\">0.388</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Chapter 5: Family Values\"</td><td style=\"text-align:center\">March 8, 2015</td><td style=\"text-align:center\">0.446</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_1\"><span>A</span></sup></th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Chapter 6: What the Hell Did I Do?\"</td><td style=\"text-align:center\">March 15, 2015</td><td style=\"text-align:center\">0.802</td></tr></tbody></table><p>^Note A Chapter 6 is referred to as \"The Second Interview\" on some promotional platforms.</p><br/><h3>Cast</h3><p>In order of appearance:</p><ul><li>Gary Jones (detective, Galveston Police Department)</li><li>Joel Bennett (Assistant District Attorney, Galveston)</li><li>Cody Cazalas (detective, Galveston Police Department)</li><li>Randy Burrows (member of Galveston Dive Team)</li><li>Debrah Lee Charatan (current wife of Robert Durst)</li><li>Charles V. Bagli (reporter, The New York Times)</li><li>Jeanine Pirro (former District Attorney, Westchester County, New York)</li><li>Douglas Durst (younger brother of Robert Durst; chairman, Durst Organization)</li><li>Robert Durst</li><li>John Waldron (attorney for Robert Durst)</li><li>Michael Kennedy (Durst family attorney)</li><li>Dick DeGuerin (attorney for Robert Durst)</li><li>Andrew Jarecki (director and producer, All Good Things)</li><li>Marc Smerling (writer and producer, All Good Things)</li><li>Eamonn Bowles (Magnolia Pictures, distributor, All Good Things)</li><li>Ann McCormack (mother of Kathie Durst)</li><li>Jim McCormack (brother of Kathie Durst)</li><li>Gilberte Najamy (friend of Kathie Durst)</li><li>Geraldine McInerney (McCormack family friend)</li><li>Eleanor Schwank (friend of Kathie Durst)</li><li>Michael Struk (former detective, New York City Police Department)</li><li>Ellen Strauss (friend of Kathie Durst)</li><li>Bill Mayer (neighbor of Robert Durst)</li><li>Joe Becerra (detective, New York State Police)</li><li>Gabrielle Colquitt (later owner of Durst lake house)</li><li>Ed Murphy (senior investigator, Westchester District Attorney's Office)</li><li>Susan Berman (friend of Robert Durst)</li><li>Tom Padden Sr., Tom Padden Jr. (cousins of Susan Berman)</li><li>Kim Lankford (friend of Susan Berman)</li><li>Lynda Obst (friend of Susan Berman)</li><li>Julie Smith (friend of Susan Berman)</li><li>Kevin Hynes (former Assistant District Attorney, Westchester County, New York)</li><li>Sareb and Mella Kaufman (children of Susan Berman's boyfriend)</li><li>Deni Marcus (cousin of Susan Berman)</li><li>Paul Coulter (detective, Los Angeles Police Department)</li><li>Stephen Silverman (friend of Susan Berman)</li><li>Kurt Sistrunk (former District Attorney, Galveston County, Texas)</li><li>Michael Ramsey (attorney for Robert Durst)</li><li>Susan Criss (judge, Galveston County, Texas)</li><li>Chris Lovell, Joanne Gongora (jurors, Texas v. Durst)</li><li>Chip Lewis (attorney for Robert Durst)</li><li>Evan Kreeger (nephew of Robert Durst)</li><li>Edward Wright (former private investigator)</li><li>Elizabeth McCormack (niece of Kathie Durst)</li><li>Ross Vitalie (cab driver, Eureka, California)</li><li>John Osborn (forensic document examiner)</li></ul><h4>Cast (reenactment)</h4><ul><li>Gary Napoli as Robert Durst</li><li>Eric Rizk as Seymour Durst Michael Antonio as Young Robert Durst</li><li>Michael Antonio as Young Robert Durst</li><li>Candace Bryant as Ellen Strauss</li><li>Juliette Campa as Susan Berman</li><li>Sara Canter as Geraldine</li><li>Rose Cordova as Eleanor Schwank</li><li>Gus Lynch as Beverly Hills Postal Worker</li><li>Dillon Mathews as Struk</li><li>Amelie McKendry as Mary McCormack</li><li>Hanan Miller as Douglas Durst</li><li>John Ohkuma as Jim McCormack</li></ul><br/><h3>Aftermath</h3><p>Douglas Durst, estranged brother of Robert and head of the Durst Organization, was apprehensive about the documentary's portrayal of the Durst family and, in particular, its use of videotaped depositions that had been subject to a confidentiality agreement. He petitioned the New York Supreme Court in January 2015 to compel Jarecki to reveal his sources. \"Douglas Durst is worried The Jinx will be a violent broadside against the family name and history,” the petition stated. By showing that Robert or wife Debrah Lee Charatan violated a Westchester County judge's 2006 order sealing the material, Douglas could sue to recover a $65 million family trust settlement. According to The New York Times, Robert gave filmmakers \"unrestricted access\" to his personal files, which included the videotaped testimony.</p><p>A lawyer for Douglas argued that The Jinx is a \"sensationalized docudrama\" and that its director is exempt from New York's shield law, designed to protect journalists. Jarecki replied that his use of dramatic reenactments (by actors whose faces were never shown) was not evidence of fictionalization. Despite attempting to \"portray Robert Durst as a human being in a fashion that could help explain some of his behavior, rather than as a burlesque figure,\" Jarecki never promised Durst that his film would ultimately defend his innocence.</p><p>On March 14, 2015, the eve of the final episode's airing, Durst was arrested in New Orleans by the FBI on a first-degree murder warrant obtained by the LAPD in connection to Berman's death. They had undertaken an investigation based on new evidence presented in the miniseries. The Associated Press reported that the 1999 letter written by Durst to Berman, unearthed by the filmmakers, provided \"key new evidence\" leading to the filing of murder charges. According to The New York Times, the filmmakers sought legal advice on when to share the letter with law enforcement, weighing journalistic privilege against possible claims of evidentiary inadmissibility in a future trial.</p><p>Interviewed ten days after his brother's arrest, Douglas told The New York Times that his brother had stalked him as recently as February 22, 2015, in Palm Beach, Florida. He felt \"a tremendous sense of relief\" at the turn of events which led to Robert's arrest. Although sharply disputing some assumptions about the Durst family presented in Jarecki's documentary (which he had not seen), and continuing to stress the threat Robert posed to him and others, Douglas sounded a conciliatory note: “I no longer am looking over my shoulder,” he said. “I’m very grateful to ‘The Jinx’ for having brought this about.” Douglas dropped his legal action against Jarecki in late April 2015, and was reportedly considering a move to freeze $74 million of his estranged brother's assets.</p><p>In April 2019, during Durst's trial, a transcript from the series revealed that Durst's final remarks had been edited and presented out of order. According to the transcript filed in court, Durst's complete remarks were as follows:</p><blockquote>\" I don't know what you expected to get. I don't know what's in the house. Oh, I want this. Killed them all, of course. I want to do something new. There's nothing new about that. He was right. I was wrong. The burping. I'm having difficulty with the question. What the hell did I do?\"</blockquote><p>Jarecki, Smerling, and Stuart-Pontier defended the edits as \"entirely representative of what Durst said\". Documentary filmmaker Mark Jonathan Harris described the edits as \"problematic\", saying that Durst's statements are \"definitely more ambiguous in the transcript\" and the edit made them \"damning\".</p><br/><h3>Soundtrack</h3><p>The theme song is \"Fresh Blood\" performed by Eels. The original score was composed by West Dylan Thordson with co-composition by John Kusiak. Musical saw, performed by Natalia Paruz, is featured throughout the series.</p><br/><h3>Reception</h3><p>The Jinx received widespread critical acclaim and media buzz, particularly upon airing its revelatory finale. John Hendrickson at Esquire called the series' ending \"one of the most jaw-dropping moments in television history.\" Mike Hale from The New York Times said it was \"gut-wrenching, remarkable television.\" Sean T. Collins of The New York Observer called the series \"a documentarian’s unicorn: a quest for the truth that, it seems, found it, and found it spectacularly,\" adding that in comparison to usual television true-crime documentary fare, The Jinx \"pulls an SUV with a vanity plate that reads 'BEVERLEY' up on the curb and mows it all down.\"</p><p>Other critics accused the documentary of charting an uncomfortable line between storytelling and journalism. Two days after Durst's arrest and one day after the final installment of The Jinx was aired, The New Yorker reported that \"he filmmakers, having been quizzed on the time line of events as represented, have cancelled forthcoming interviews.\" Specifically, when challenged over whether Robert Durst's arrest for trespassing on his brother Douglas Durst's property occurred before the filmmakers' second interview with Robert, as implied by The Jinx, Andrew Jarecki replied, \"Yeah, I think I’ve got to get back to you with a proper response on that.\" Several media outlets questioned how long the filmmakers had sat on evidence damaging to Durst before turning it over to law enforcement.</p><p>Jarecki subsequently sent an explanation to multiple media outlets:</p><blockquote>“Given that we are likely to be called as witnesses in any case law enforcement may decide to bring against Robert Durst, it is not appropriate for us to comment further on these pending matters. We can confirm that evidence (including the envelope and the washroom recording) was turned over to authorities months ago.”</blockquote><p>A study of Westchester County case notes by The Guardian indicated that, contrary to then-District Attorney Jeanine Pirro's assertions in The Jinx that \"we were about to speak with\" Susan Berman about Kathie Durst's disappearance, New York investigators had not yet scheduled an interview nor funded an investigator to visit Berman in California at the time of her December 23, 2000, murder. Durst said in a 2005 deposition, excerpted in The Jinx, that Berman called him shortly before her death and said: \"The Los Angeles police contacted me. They wanted to talk about Kathie Durst’s disappearance.”</p><p>Although the Los Angeles Police Department denied any connection between Durst's arrest and HBO's airing of The Jinx finale, Dick DeGuerin, Durst's defense attorney, lashed out at the timing. “Do I think this is a coincidence? Hell, no,” he said. “There has been rumor, innuendo and speculation for a number of years, and now we’re going to get our day in court on this.”</p><br/><h3>Awards</h3><p>The Jinx was nominated for six and won two Primetime Creative Arts Emmy Awards in 2015: Outstanding Documentary or Nonfiction Series and Outstanding Picture Editing for Nonfiction Programming. It received nominations for Outstanding Cinematography for Nonfiction Programming, Outstanding Directing for Nonfiction Programming, Outstanding Sound Editing for Nonfiction Programming (Single or Multi-Camera), and Outstanding Sound Mixing for Nonfiction Programming.</p><p>The Jinx was also awarded a 2015 Peabody Award, as well as the TCA Award for Outstanding Achievement in Movies, Miniseries and Specials from the Television Critics Association. Marc Smerling, Andrew Jarecki, and Jason Blum won the Producers Guild of America Award for Outstanding Producer of Non-Fiction Television.</p><br/><h3>International broadcast</h3><p>The miniseries premiered in Australia on May 7, 2015, on Showcase. The Jinx premiered in India on June 9, 2015, on HBO Defined.</p><br/>"
  },
  "errorMessage": ""
}