{
  "imDbId": "tt6741278",
  "title": "Invincible",
  "fullTitle": "Invincible (TV Series 2021– )",
  "type": "TVSeries",
  "year": "2021",
  "items": [
    {
      "username": "ThomDerd",
      "userUrl": "https://www.imdb.com/user/ur73053202",
      "reviewLink": "https://www.imdb.com/review/rw6876574",
      "warningSpoilers": false,
      "date": "3 May 2021",
      "rate": "9",
      "helpful": "227 out of 270 found this helpful.",
      "title": "I don't like it, I love it.",
      "content": "Great voice cast and a very good story makes this series a must if you are a fan of the superhero genre . I know this is from a comic dated around 2003 but i never read it and it doesn't matter. You can enjoy this without any prior info; its still pretty darn good.Maybe you will need to be a bit patient for the story to clearly develop at the end of the 1st episode. From that point on, it's a winner.The story arc between mother, father and son is excellent. And further on some of the characters which you will encounter are just phenomenal; Machine head, Robot, Rexplode and Cecil are just a few. They are also voiced by an amazing selection of actors which will entertain you. Let alone the world building; one of the best in the superhero genre.And yes...it's super woke, but so what? It didn't affect the main story line and the connection between the characters.Just keep in mind that this is an adult show due to the violence.9/10 for the great voice cast and good story. Give it a go."
    },
    {
      "username": "cjonesas",
      "userUrl": "https://www.imdb.com/user/ur79683341",
      "reviewLink": "https://www.imdb.com/review/rw6868959",
      "warningSpoilers": true,
      "date": "1 May 2021",
      "rate": "9",
      "helpful": "47 out of 59 found this helpful.",
      "title": "[8.9] Do teeth re-grow?!",
      "content": "At last! (as one user pointed out too), an adult animation action series, encompassing full-length episodes with gut-wrenching animations, splashing blood & brain 360° and having you thinking about no other production but Invincible, till the last episode has been watched and finished!The last two episodes are the most memorable ones with Crazy Everything.. Till the next greater attack..Kudos! Robert Kirkman, you showed that your talent for serious animation script is way bigger than your FTWD camera-wielding beauty \"zombies\".Screenplay/story: 8.5Development: 9.5Realism: 9.5Entertainment: 9.5Cast: 8.5Animation: 9.5Music/score: 9Depth: 9Logic: 8Flow: 9.5Action/suspense: 9.5Ending: 7.5."
    },
    {
      "username": "Bwent",
      "userUrl": "https://www.imdb.com/user/ur34522146",
      "reviewLink": "https://www.imdb.com/review/rw6743111",
      "warningSpoilers": false,
      "date": "26 March 2021",
      "rate": "10",
      "helpful": "224 out of 283 found this helpful.",
      "title": "hot damn.",
      "content": "I think I'm gonna like this show. Violent, irreverent, entertaining. Seems like it will be able to hit all the same marks as \"the boys\" but without budget limitations. Which is awesome. And the star power of this show is incredible. Seriously look at that cast list. I'll definitely be eagerly awaiting new episodes."
    },
    {
      "username": "Johnny-the-Film-Sentinel-2187",
      "userUrl": "https://www.imdb.com/user/ur24085266",
      "reviewLink": "https://www.imdb.com/review/rw6968386",
      "warningSpoilers": false,
      "date": "26 May 2021",
      "rate": "9",
      "helpful": "25 out of 31 found this helpful.",
      "title": "An awesome evolution for Superhero Animation.",
      "content": "Invincible takes the classic Image Comics series and gives us the best mature animated superhero series since Spawn: The Animated Series. Considering both are Image properties, it's also no surprise that the violence in them is something that a Bruce-Timm-Batman cartoon wouldn't touch with a ten-foot poll, or Spider-Man toons even. However, the 'splashes' of humour and quippy dialogue IS something Invincible does honour and lean into when it comes to revering other superhero shows like Batman; this show takes something like the DCAU and decides to use it as a launchpad for Uber-violence and character-centric world-building focusing on sex and grey morality in a MARVEL-like universe.Invincible feels like an extension of the shows so many of us grew up with, and a maturing of the kinds of stories Bruce Timm started off years ago, without losing the sense of superhero fun. It's character-drama, action-adventure, 'cape-opera', and universe-making stuff that proves it's truly special.Invincible is must-watch television. Thank goodness it's been renewed for seasons 2 & 3."
    },
    {
      "username": "kthngm",
      "userUrl": "https://www.imdb.com/user/ur130448563",
      "reviewLink": "https://www.imdb.com/review/rw6744200",
      "warningSpoilers": false,
      "date": "26 March 2021",
      "rate": "9",
      "helpful": "192 out of 240 found this helpful.",
      "title": "What we needed in animated series",
      "content": "Invincible really increases the standards in animated tv or web series by showing good character development, emotion, great ton of action and pg-18 violence which is kinda cool. Best thing is, every episode is 40 minutes instead of 20 😬"
    },
    {
      "username": "sexyrocks18",
      "userUrl": "https://www.imdb.com/user/ur29591048",
      "reviewLink": "https://www.imdb.com/review/rw6747137",
      "warningSpoilers": false,
      "date": "27 March 2021",
      "rate": "9",
      "helpful": "134 out of 172 found this helpful.",
      "title": "Amazing",
      "content": "I have no clue of the source material but happy they kept it animated. Not what I was expecting but epsidoe had me hooked!"
    },
    {
      "username": "learntoreadbitch",
      "userUrl": "https://www.imdb.com/user/ur23401958",
      "reviewLink": "https://www.imdb.com/review/rw6747558",
      "warningSpoilers": true,
      "date": "27 March 2021",
      "rate": "10",
      "helpful": "435 out of 517 found this helpful.",
      "title": "tOtAL RiP oFf!",
      "content": "My favorite terrible review here is the guy complaining that this is a ripoff of \"the awsomes\" (his words not mine) from \"5 years ago\". Bro. The comic this is based on started in 2003."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw7014573",
      "warningSpoilers": false,
      "date": "9 June 2021",
      "rate": "10",
      "helpful": "39 out of 55 found this helpful.",
      "title": "Amazing mix of The Boys, Sky High and any good cartoon!",
      "content": "Mind blowing epic series that gets exceedingly better as it goes on! It's great that Robert Kirkman is involved he's perfect at sticking to the comics. I love the adult vibes, character development is spot on, color design is really nice, and the exciting feelings you'd get because it's about super heroes that kick ass."
    },
    {
      "username": "jonathancg-12884",
      "userUrl": "https://www.imdb.com/user/ur72505795",
      "reviewLink": "https://www.imdb.com/review/rw6747566",
      "warningSpoilers": false,
      "date": "27 March 2021",
      "rate": "10",
      "helpful": "130 out of 170 found this helpful.",
      "title": "Promising",
      "content": "I watched the first episode and after the ending i just had to binge watch the next two. It was just as mindblowing as when i first read the Omniman arc.I don't know why people are so mad that there's gore in this show. I mean, it's not for kids, the story is mature and trust me, if there were superheroes and supervillains in real life, the gory deaths would be an everyday thing. I have read all the comic book series and for the people that thinks everything is predictable i just have to say that they're right... and they're totally wrong as well. Just keep watching.The plot is well written, characters are credible, voice acting is good, animation is not perfect but not bad either. I'm getting hyped with every episode and i just can't wait to things that will come next. Mindblowing will be a recurring word as you watch this show."
    },
    {
      "username": "Clive_W",
      "userUrl": "https://www.imdb.com/user/ur30888832",
      "reviewLink": "https://www.imdb.com/review/rw6757002",
      "warningSpoilers": false,
      "date": "29 March 2021",
      "rate": "10",
      "helpful": "75 out of 108 found this helpful.",
      "title": "Awesome fun!!",
      "content": "Hell to the yes, so far off to a very strong start, some nice changes to the source material (These aren't major changes more rearranging of events), I would recommend giving this a try, the animation is fantastic, an all star cast of actors, and an awesome eventful story, I look forward to seeing where the show will take us. And if you haven't read the source material maybe watching this will get you interested. Sit back and enjoy, just don't forget the popcorn!Update from s01 finale, just wow, that was an awesome, adrenaline fuelled first series, I can not wait for the next instalment, bring on Conquest!!! If you haven't read the comics I won't spoil what is next to come.This show has to be one of my new favourites out there, great story, great voice actors, awesome animation and wow the carnage is just top level. Had me on the edge my seat, jumping in the air for excitement. Also loving the little additions to the story and the alterations to the source material. If you haven't seen this yet, check it out, well worth the watch, just make sure your got plenty of munches around as you won't want to leave."
    },
    {
      "username": "Movi3DO",
      "userUrl": "https://www.imdb.com/user/ur130195767",
      "reviewLink": "https://www.imdb.com/review/rw6875638",
      "warningSpoilers": false,
      "date": "3 May 2021",
      "rate": "9",
      "helpful": "14 out of 19 found this helpful.",
      "title": "Awesome Superhero Show",
      "content": "Heard about this series from a friend. The first episode had a pretty similar feel to The Boys, but then it all changed at the end of the episode. This was a very gory and violent superhero series. This created a huge mystery that stayed in my mind as I continued to watch the show until the end.As much as I loved the gore, I appreciated that the gore served a purpose. It was not just for gore sake, but it emphasized the disturbing plot. This was abundantly clear at the last episode.Character-wise, Omni-man, voiced wonderfully by the J. K. Simmons, was the most interesting and mysterious. As the mystery became closer to be revealed, he became more menacing and fearsome. The main protagonist, Invincible, had decent development, but his character wasn't too unique. The other characters were pretty okay.Plot-wise, there were multiple side-stories. Some were quite shocking or sweet, like the Robot and Titan plots. The variety of subplots and the dark main story made this show felt unique. However, a problem was that the side stories did not affect the main story much.Overall, a dark and entertaining show. Highly recommend. Can't wait for season 2 and 3. 9/10."
    },
    {
      "username": "doomedmac",
      "userUrl": "https://www.imdb.com/user/ur111092901",
      "reviewLink": "https://www.imdb.com/review/rw7075605",
      "warningSpoilers": false,
      "date": "30 June 2021",
      "rate": "10",
      "helpful": "23 out of 34 found this helpful.",
      "title": "Perfect",
      "content": "A flawless piece of animated entertainment. The final was brutal to the point of breaking me, and the journey was worth every second. Truly amazing."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8147607",
      "warningSpoilers": false,
      "date": "16 May 2022",
      "rate": "8",
      "helpful": "12 out of 16 found this helpful.",
      "title": "I enjoyed it!",
      "content": "So far, Invincible has been everything I expected and more. I never read the comics so I was exactly sure what to expect but from reading up on it and watching the trailer I knew it's the type of show I usually like so I thought I'd give it a chance. I'm glad I did bc so far it's pretty good! The voice over cast has to be one of, if not the best, of any series ever! It almost has the star power of a animated movie."
    },
    {
      "username": "JTReviewsPlus",
      "userUrl": "https://www.imdb.com/user/ur106718893",
      "reviewLink": "https://www.imdb.com/review/rw6743772",
      "warningSpoilers": false,
      "date": "26 March 2021",
      "rate": "9",
      "helpful": "79 out of 120 found this helpful.",
      "title": "JLA Meets The Boys And Then Some",
      "content": "Prime Video's (and Robert Kirkman's) Invincible adds another interesting take to the popular superhero genre. Filling the void of The Boys this year, Invincible is: mature, action-packed, visually stunning, charmingly written, perfectly acted, and so much more. I admittedly haven't read the comics but I was always aware of them and from my understanding, the show so far is staying true to the source material which is amazing. I love the world the creators setup, the heroes are oddly familiar in terms of looks and powers yet they are strangely different at times. It's extremely reminiscent of The Boys in that sense. The characters are heroic, funny, and transparent with one another (for the most part) similar to the Justice League animated series. While Invincible contains some superhero tropes, it's done on purpose and there's always something interesting happening thanks to the strong writing and perfect cast. I cannot wait to see what happens next. Suffice to say it'll be very hard for me to wait so I may just read the comics too!"
    },
    {
      "username": "killedgrilledandfried",
      "userUrl": "https://www.imdb.com/user/ur125243623",
      "reviewLink": "https://www.imdb.com/review/rw6902799",
      "warningSpoilers": false,
      "date": "11 May 2021",
      "rate": "8",
      "helpful": "32 out of 41 found this helpful.",
      "title": "Good lord, this is intense!",
      "content": "I am completely unfamiliar with the comics this is based on and I don't really care unless they leave the story unfinished, so I can't say anything about how well it adheres to the source material but I do know this: You gotta watch this show!When I started with the first episode all the characters seemed annoying and I couldn't care less about the teen melodrama or whatever so I was questioning my decision. And then... the ending of that episode... holy hell! I was not expecting that at all and I was caught, hook, line and sinker. If you are squeamish, stay away from this one but I got desensitized to the violence and gore by the second episode and you're gonna *have* to do that.The plot is extremely interesting while some of the characters are not. Most of the characters weren't really likable for me but I was intrigued by them. They're not really relatable but still interesting? I don't really know how else to put this. Couldn't care less about the love lives of the teenagers but I suppose it's mandatory or something and it becomes tolerable eventually except for the bit with the legal loli(?).Omni man is the MVP without a doubt and Homelander can learn a few things from this fellow. Speaking of which I had strong 'The Boys' vibes from this show throughout but it was still quite different. I am indifferent towards the main character though (that goes for most characters actually), I don't know what but something doesn't feel right with him. He should be going through some very strong issues but it seems like he's pretty unaffected by it all. Human lives aren't valuable here at all to any of the characters, it seems. The voice acting is great and the animation is good for the most part even though the show tends to get attacked by bad CGI quite a lot. But still, the setting is so unique and interesting that it just completely overshadows all the negatives one can have.Highly recommended and I can't wait for the 2nd season."
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw7016636",
      "warningSpoilers": false,
      "date": "10 June 2021",
      "rate": "9",
      "helpful": "36 out of 59 found this helpful.",
      "title": "in the tradition of The Boys",
      "content": "Trashes traditional comic plot arcs and takes you on a wild ride."
    },
    {
      "username": "bradleycarrington",
      "userUrl": "https://www.imdb.com/user/ur122996171",
      "reviewLink": "https://www.imdb.com/review/rw6883167",
      "warningSpoilers": false,
      "date": "5 May 2021",
      "rate": "8",
      "helpful": "23 out of 31 found this helpful.",
      "title": "Compelling story with great action, but not without it's flaws.",
      "content": "I just binged the first season of invincible and loved it. It felt like being a kid again and watching my favorite super hero cartoon since it's basically the same thing but with adult themes. I will say the first episode is very slow and feels like a cheap DC knockoff. I feel like they did that purposely just so they could show the twist at the end and give us that feeling of \"just kidding, it's not what you expected\". But the first 40 min were so bland that I almost stopped watching. Also, even though this has more of a game of thrones vibe, where you never know if a character will live past the scene, there is still no shortage of plot armor and plot holes. Some characters will be strong enough to destroy a planet without breaking a sweat, but then find themselves struggling in a fight against something that is brought down relatively easily. And then vice versa some weak characters manage to survive when their stronger counterparts are brutally killed.So it's not as true to life as I was hoping for from a gritty Superhero show where the good guy doesn't always win. However if you're just looking to relive your youth through a gritty adult lense and aren't affected by the occasional cartoon cliche or plot hole, then I can't recommend this enough!"
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw7992583",
      "warningSpoilers": false,
      "date": "21 March 2022",
      "rate": "9",
      "helpful": "10 out of 14 found this helpful.",
      "title": "This might look like a children's superhero cartoon but it isn't!",
      "content": "Mark Greyson appears to be an ordinary high school student; if anything he is a little weak, getting beaten up after trying to stand up for a girl. What nobody around him knows is that his father is Omni-Man, the world's most powerful superhero, and that Mark should gain the same powers very shortly. This happens in the first episode and he sets about finding a superhero identity and learning how to use his skills. He ends up working with a group of junior superheroes who find themselves promoted to the big leagues when the premier superhero team is eliminated in an attack. The identity of the killer isn't hidden from the viewer but the authorities, who have their suspicions can't act yet. As the series progresses Mark develops his skills and helps take on various villains; he also befriends fellow superhero Atom Eve who helps him get closer to schoolmate Amber Bennett... will he be able to balance his new superhero responsibilities with a developing relationship?I really enjoyed this series; its look reminded me of the superhero cartoons I watched as a child but its tone was distinctly for older viewers. There are moments of extreme violence, some robust language and some sex references. The story starts well, the opening episode sets up the assumed protagonists before its shocking conclusion. Things then progress well as Adam becomes involved with the up and coming team. The personal issues in his life balance his work fighting various dangers. This work provides plenty of exciting scenes; while nobody is likely to fear for Mark's life he is frequently injured and there is a sense of danger for those around him. The voice cast does a solid job and includes several well-known actors. The animation might not be 'shiny and modern' but it suits the material... the fact that it looks like the superhero cartoons of old makes the contrast of violent, morally ambiguous content with its squeaky clean predecessors stand out all the more. Overall I'd recommend this to animation fans looking for a new superhero series. I'm looking forward to the next season."
    },
    {
      "username": "tristanostara",
      "userUrl": "https://www.imdb.com/user/ur102244705",
      "reviewLink": "https://www.imdb.com/review/rw6748661",
      "warningSpoilers": false,
      "date": "27 March 2021",
      "rate": "10",
      "helpful": "37 out of 65 found this helpful.",
      "title": "Great show make more",
      "content": "Hurry up and make more episodes, it is a great show."
    },
    {
      "username": "pwiesike-98761",
      "userUrl": "https://www.imdb.com/user/ur78773882",
      "reviewLink": "https://www.imdb.com/review/rw8368467",
      "warningSpoilers": false,
      "date": "25 July 2022",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Blown Away - Just Watch It",
      "content": "I know - another superhero show - the last thing we need. But this is one of the best animated shows I have ever seen and it features some pretty incredible action sequences, stellar animation, great characters/voice acting and a fantastic story with lots of twists and turns. It has some seriously jaw dropping moments. Can't wait for the next season and I may have to read the source material."
    },
    {
      "username": "mhorg2018",
      "userUrl": "https://www.imdb.com/user/ur22761455",
      "reviewLink": "https://www.imdb.com/review/rw6879526",
      "warningSpoilers": true,
      "date": "4 May 2021",
      "rate": "8",
      "helpful": "10 out of 16 found this helpful.",
      "title": "Not Marvel or DC - Crazy original!",
      "content": "A great adaptation of Kirkman's comic, which, like the Walking Dead - he ended. Probably because he ran out of ideas - how often can the main hero be beaten nearly to death and recover? Well, that's that. Honestly, I like the show even more than the comic. Kirkman is a bit verbose and tends to cram a lot of words into panels. The animated show avoids that while keeping the story pretty intact. The voice cast (several from The Walking Dead and Killing Eve, as well as the absolutely phenomenal 'Does he Ever Rest?\" J. K. Simmons) are superb. The action is NOT FOR THE KIDDIES. This is not your daddy's superhero show. I'm really hoping amazon gives it a full run to finish the entire story. This makes up for their atrocious adaptation of Without Remorse."
    },
    {
      "username": "diogolaforga",
      "userUrl": "https://www.imdb.com/user/ur66152628",
      "reviewLink": "https://www.imdb.com/review/rw6790266",
      "warningSpoilers": false,
      "date": "7 April 2021",
      "rate": "7",
      "helpful": "27 out of 43 found this helpful.",
      "title": "Invincible is here and it is good",
      "content": "Invincible is an adaptation from the Image comics, that tells the coming of age story of Mark Grayson and his family in a world full of super people and tries to have another take at the super hero genre, by imbuing it full of drama, action and adventure.Despite the colourfull cartoons and the juvenile setting, Invincible is pretty much an adult show.The animation for the most part is pretty fluid and impactful and the story engaging and full of twists and turns.I´m not a purist by all means but comparisons are inevitable. The structure of the story was tampered with and I still think that it was way better in the comics. I can apreciate the fact that the show screen writers tried not to simply copy from the source, however, the story ultimately suffers from these alterations by making it more standard and formulaic. In the comics the characters also have more depth and it takes the time to explore other themes and introduce everyone, but that´s understandable.Most notably, the twist that comes in the form of the revelation of said character, in the animation it sort of happens as you are watching but in the comics the revelation is shown differently and comes with a big bite that scars deeply.My only gripe with the show is that it fails to depict the parody that Invincible story telling was famed for. The fact that it didnt take itself too serious alowed it to show and toy with the clichês that the genre had popularized.The \"cartoony\" art direction consolidated this further, so when the violence kicks in the contrast is very intense and everything worked in tandem to that effect. It elevated the series by differentiated itself from the overpopulated genre.In the show it just looks like another world event like Marvel or Dc , where they take everything as serious as it can be expected, wich in this case makes the violence feel like an aesthetic choice, just to subvert your expectation, you konw, because this is a cartoon.That said, it is a great show with lots of entertainment and full of promise."
    },
    {
      "username": "stephenboud-35237",
      "userUrl": "https://www.imdb.com/user/ur130736791",
      "reviewLink": "https://www.imdb.com/review/rw6746868",
      "warningSpoilers": false,
      "date": "27 March 2021",
      "rate": "10",
      "helpful": "108 out of 148 found this helpful.",
      "title": "Well worth the wait",
      "content": "Stays true to the source material while changing small details around so it doesn't follow the comic scene by scene.Nearly all character designs and animation are extremely well done and stays faithful to the comic book. Some of the minor characters have had their ethnicity changed so you may not recognise them at first but it won't matter to viewer's who have never read the comics.The voice acting is excellent with a incredible cast which really brings the comic book to life.The shocking scenes and gore are even more detailed and added too than the comic book was giving both fans of the comic and people who are new to the series a suspenseful, exhilarating and gut wrenching watch.Simply a brilliant show to watch so far."
    },
    {
      "username": "archangestelle",
      "userUrl": "https://www.imdb.com/user/ur70243870",
      "reviewLink": "https://www.imdb.com/review/rw6749521",
      "warningSpoilers": false,
      "date": "27 March 2021",
      "rate": "8",
      "helpful": "47 out of 93 found this helpful.",
      "title": "Don't watch this with children!",
      "content": "I did not know anything about the comics. The first episode shocked me so hard I am still not ready to continue. No words.Don't watch this with children!"
    },
    {
      "username": "brendoom",
      "userUrl": "https://www.imdb.com/user/ur98051756",
      "reviewLink": "https://www.imdb.com/review/rw6887222",
      "warningSpoilers": false,
      "date": "7 May 2021",
      "rate": "4",
      "helpful": "19 out of 27 found this helpful.",
      "title": "Fun to watch but not that great",
      "content": "This is just a regular show, it really isn't anything special, you've seen all of this before, all of the characters have little depth (except Omni-man) and you've seen all of these situations before. Again, I like this show, it's just nothing outstanding or creative. The last two episodes were pretty good but the rest was, ehhhh, like I said, there is NOTHING new here and that is really disappointing."
    }
  ],
  "errorMessage": ""
}