{
  "imDbId": "tt6741278",
  "title": "Invincible",
  "fullTitle": "Invincible (TV Series 2021– )",
  "type": "TVSeries",
  "year": "2021",
  "language": "en",
  "titleInLanguage": "Invincible (TV series)",
  "url": "https://en.wikipedia.org/wiki/Invincible_(TV_series)",
  "plotShort": {
    "plainText": "Invincible is an adult animated superhero television series created by Robert Kirkman for Amazon Prime Video and premiered on March 25, 2021. Based on the Image Comics series of the same name by Kirkman, Cory Walker, and Ryan Ottley, the show follows 17-year-old Mark Grayson and his transformation into a superhero under the guidance of his father Omni-Man, the most powerful superhero on the planet. During his transformation, Mark finds himself struggling between his personal life and superhero duties, where he will be forced to prove that he can be the hero that his father is. The series stars Steven Yeun, Sandra Oh, and J. K. Simmons as the Grayson family, while the rest of the cast serve as recurring characters.\r\nFollowing its release, the series received widespread acclaim from critics and audiences, with praise for its animation, action sequences, story, writing, voice acting, emotional weight, and faithfulness to the comics. In April 2021, ahead of season one's finale, Amazon renewed the series for a second and third season. The second season is set to premiere sometime in late 2023.",
    "html": "<p>Invincible is an adult animated superhero television series created by Robert Kirkman for Amazon Prime Video and premiered on March 25, 2021. Based on the Image Comics series of the same name by Kirkman, Cory Walker, and Ryan Ottley, the show follows 17-year-old Mark Grayson and his transformation into a superhero under the guidance of his father Omni-Man, the most powerful superhero on the planet. During his transformation, Mark finds himself struggling between his personal life and superhero duties, where he will be forced to prove that he can be the hero that his father is. The series stars Steven Yeun, Sandra Oh, and J. K. Simmons as the Grayson family, while the rest of the cast serve as recurring characters.</p><p>Following its release, the series received widespread acclaim from critics and audiences, with praise for its animation, action sequences, story, writing, voice acting, emotional weight, and faithfulness to the comics. In April 2021, ahead of season one's finale, Amazon renewed the series for a second and third season. The second season is set to premiere sometime in late 2023.</p>"
  },
  "plotFull": {
    "plainText": "Invincible is an adult animated superhero television series created by Robert Kirkman for Amazon Prime Video and premiered on March 25, 2021. Based on the Image Comics series of the same name by Kirkman, Cory Walker, and Ryan Ottley, the show follows 17-year-old Mark Grayson and his transformation into a superhero under the guidance of his father Omni-Man, the most powerful superhero on the planet. During his transformation, Mark finds himself struggling between his personal life and superhero duties, where he will be forced to prove that he can be the hero that his father is. The series stars Steven Yeun, Sandra Oh, and J. K. Simmons as the Grayson family, while the rest of the cast serve as recurring characters.\r\nFollowing its release, the series received widespread acclaim from critics and audiences, with praise for its animation, action sequences, story, writing, voice acting, emotional weight, and faithfulness to the comics. In April 2021, ahead of season one's finale, Amazon renewed the series for a second and third season. The second season is set to premiere sometime in late 2023.\r\nPremise\r\nMark Grayson is a seemingly normal teenager, except for the fact that his father, Nolan, is the most powerful superhero on the planet, and that shortly after his seventeenth birthday, Mark begins to develop powers of his own and learns how to wield them with help from his father.\r\nCharacters\r\nMain\r\nMark Grayson / Invincible (voiced by Steven Yeun): The eponymous main character. After gaining his powers at 17 years old, Mark discovers the harsh realities of being a superhero while struggling to define himself. He is shown to have a berserker side when fighting the Flaxans and Machine Head's villains, revealed to be a Viltrumite trait.\r\nDebbie Grayson (voiced by Sandra Oh): Mark's mother and Nolan's wife. Debbie is an experienced realtor, once long adjusted to being a superhero's spouse, before entering into a drunken spiral of depression following her husbands betrayal at the end of the first season.\r\nNolan Grayson / Omni-Man (voiced by J. K. Simmons): Mark's father and Debbie's husband. Born on the planet Viltrum to a superpowered alien race known as the Viltrumites, his parents died in his youth before he joined the Viltrum Empire's intergalactic expansion several thousand years ago. After arriving on Earth 20 years before the series, Nolan is considered the most powerful superhero on the planet, with a civilian identity of a rich travel writer.\r\nRecurring\r\nSamantha Eve Wilkins / Atom Eve (voiced by Gillian Jacobs): A matter/energy manipulating superheroine. Formerly a member of the Teen Team and new Guardians rosters, she quits after her ex-boyfriend Rex Splode cheats on her with Dupli-Kate. Struggling to find self-meaning, she chooses to help people directly with humanitarian actions.\r\nWilliam Clockwell (voiced by Andrew Rannells): Mark's best friend and civilian confidant.\r\nGlobal Defense Agency: A clandestine organization that organizes global superhero responses and utilizes advanced technology in expediting their recovery or resuscitation after death. Cecil Stedman (voiced by Walton Goggins): Director of the GDA who possesses a long-range personal teleporter and inducts Invincible at the start of his hero career. Donald Ferguson (voiced by Chris Diamantopoulos): A high-ranking GDA agent who serves directly under Cecil Stedman and is in charge of overseeing the secret projects meant to incapacitate or kill Nolan, only to die in a massive explosion in a futile attempt to kill Nolan.\r\nCecil Stedman (voiced by Walton Goggins): Director of the GDA who possesses a long-range personal teleporter and inducts Invincible at the start of his hero career.\r\nDonald Ferguson (voiced by Chris Diamantopoulos): A high-ranking GDA agent who serves directly under Cecil Stedman and is in charge of overseeing the secret projects meant to incapacitate or kill Nolan, only to die in a massive explosion in a futile attempt to kill Nolan.\r\nGuardians of the Globe (new roster): Heroes who were formerly of the Teen Team merged with other experienced heroes with diverse skill sets. Rudolph \"Rudy\" Connors / Robot (voiced by Zachary Quinto and Ross Marquand): A deformed individual who operates a series of robotic drones and has a sizable personal fortune. He has a condition where outside air burns his lungs, forcing him to live in a pod to survive. Using \"Robot\", Connors formerly led the Teen Team before creating a new Guardians roster. He also uses Rex Splode's DNA and the Mauler Twins' expertise in cloning to make a new body for himself. Quinto voices the character in his Robot form and human form while Marquand voices the clone version. Rex Sloan / Rex Splode (voiced by Jason Mantzoukas): An incorrigible superhero who can charge potential energy into anything he touches to create explosives and a former member of the Teen Team who is selected to join the new Guardians roster. Sloan shows some maturity after Omni-Man's public betrayal, growing closer to the team. Kate Cha / Dupli-Kate (voiced by Malese Jow): A self-replicating superheroine, formerly of the Teen Team, before she is selected to join the new Guardians roster. All Kates are numbered, which decreases in losses so that whichever remains with \"1\" is the prime Kate. She also has a telepathic link with her doubles, which causes her to feel what they feel. Shrinking Rae (voiced by Grey Griffin): A size-manipulating superheroine selected to join the new Guardians roster. Her name is a reference to the Shrink Ray device. She is one of the few characters from the comics to be gender-swapped. Amanda / Monster Girl (voiced by Grey Griffin and Kevin Michael Richardson): A cursed superheroine whose powers allow her to transform into a powerful masculine-like ogre. She begins the series chronologically at 24 years old but is physically at age 12 due to her powers making her younger with each use. Markus Grimshaw / Black Samson (voiced by Khary Payton): An original Guardian from the team's early days who left after losing his powers. Donning an armored super-suit to continue as a hero, he joins the new roster as the veteran voice. After being hospitalized by Battle Beast, his powers return to accelerate his recovery and he shelves his armor.\r\nRudolph \"Rudy\" Connors / Robot (voiced by Zachary Quinto and Ross Marquand): A deformed individual who operates a series of robotic drones and has a sizable personal fortune. He has a condition where outside air burns his lungs, forcing him to live in a pod to survive. Using \"Robot\", Connors formerly led the Teen Team before creating a new Guardians roster. He also uses Rex Splode's DNA and the Mauler Twins' expertise in cloning to make a new body for himself. Quinto voices the character in his Robot form and human form while Marquand voices the clone version.\r\nRex Sloan / Rex Splode (voiced by Jason Mantzoukas): An incorrigible superhero who can charge potential energy into anything he touches to create explosives and a former member of the Teen Team who is selected to join the new Guardians roster. Sloan shows some maturity after Omni-Man's public betrayal, growing closer to the team.\r\nKate Cha / Dupli-Kate (voiced by Malese Jow): A self-replicating superheroine, formerly of the Teen Team, before she is selected to join the new Guardians roster. All Kates are numbered, which decreases in losses so that whichever remains with \"1\" is the prime Kate. She also has a telepathic link with her doubles, which causes her to feel what they feel.\r\nShrinking Rae (voiced by Grey Griffin): A size-manipulating superheroine selected to join the new Guardians roster. Her name is a reference to the Shrink Ray device. She is one of the few characters from the comics to be gender-swapped.\r\nAmanda / Monster Girl (voiced by Grey Griffin and Kevin Michael Richardson): A cursed superheroine whose powers allow her to transform into a powerful masculine-like ogre. She begins the series chronologically at 24 years old but is physically at age 12 due to her powers making her younger with each use.\r\nMarkus Grimshaw / Black Samson (voiced by Khary Payton): An original Guardian from the team's early days who left after losing his powers. Donning an armored super-suit to continue as a hero, he joins the new roster as the veteran voice. After being hospitalized by Battle Beast, his powers return to accelerate his recovery and he shelves his armor.\r\nAmber Bennett (voiced by Zazie Beetz): Mark's classmate and girlfriend. She was redesigned from her comic book source with a resemblance to her voice actress for the series. She is depicted with an insight to her, deducing Mark's identity before he tells her.\r\nThe Mauler Twins (both voiced by Kevin Michael Richardson): Two blue-skinned, hyper-powerful, super-genius superhumans and long-time adversaries of the original Guardians. Despite their name, they are not actual twins but rather clones of each other. Both proclaim to be the original while stating the other is a clone.\r\nArt Rosenbaum (voiced by Mark Hamill): A superhero suit tailor and long-time friend to many superheroes, mainly Omni-Man. He helps Debbie uncover the truth about the Guardians murder at the hands of Nolan.\r\nDamien Darkblood (voiced by Clancy Brown): A demon detective who escaped Hell to seek justice for others and save his soul, whose presence triggers a sudden cold in the ambient temperature. Cecil exiles him back to Hell to prevent him from exposing Nolan too early as a criminal.\r\nGuest\r\nAllen the Alien (voiced by Seth Rogen): An assessor of member world candidates for the Coalition of Planets whose homeworld was destroyed by the Viltrumites. He initially has a scuffle with Invincible near the Moon's orbit, but realizes that he mistakenly went to Earth when he was supposed to travel to the planet Urath.\r\nKill Cannon (voiced by Fred Tatasciore): A supervillain armed with an arm-mounted laser cannon whom Mark defeated.\r\nSteve (voiced by Jon Hamm): A Secret Service agent who guards the White House's front gate.\r\nMatt (voiced by Max Burkholder): Steve's stepson.\r\nGuardians of the Globe (original roster): A decades-old superhero team massacred by Omni-Man. Afterwards, a new roster is created. The Immortal (voiced by Ross Marquand): The millennia-old leader of the Guardians who was once a Celtic warrior before he was exposed to a cosmic anomaly and went on to fight in the Crusades and become Abraham Lincoln. The Maulers later revive him to fight Robot and the New Guardians, but the Immortal goes to fight Omni-Man instead. While the Immortal is subsequently killed again, he recovers in the GDA's custody. Holly / War Woman (voiced by Lauren Cohan): A powerful ancient warrior and co-benefactor of the Guardians whom Nolan killed. Alana / Green Ghost (voiced by Sonequa Martin-Green): A superheroine encased in a green suit with ghost-like powers whom Nolan killed. She is one of the few characters from the comics to be gender swapped. Martian Man (voiced by Chad L. Coleman): An exiled, shapeshifting Martian superhero whom Nolan killed. Josef / Red Rush (voiced by Michael Cudlitz) A Russian speedster and the team's first responder whom Nolan killed. Darkwing (voiced by Lennie James): A gadget-wielding caped crusader and co-benefactor of the Guardians whom Nolan killed. Aquarus (voiced by Ross Marquand): A hydrokinetic, piscine humanoid and king of an underwater nation whom Nolan killed.\r\nThe Immortal (voiced by Ross Marquand): The millennia-old leader of the Guardians who was once a Celtic warrior before he was exposed to a cosmic anomaly and went on to fight in the Crusades and become Abraham Lincoln. The Maulers later revive him to fight Robot and the New Guardians, but the Immortal goes to fight Omni-Man instead. While the Immortal is subsequently killed again, he recovers in the GDA's custody.\r\nHolly / War Woman (voiced by Lauren Cohan): A powerful ancient warrior and co-benefactor of the Guardians whom Nolan killed.\r\nAlana / Green Ghost (voiced by Sonequa Martin-Green): A superheroine encased in a green suit with ghost-like powers whom Nolan killed. She is one of the few characters from the comics to be gender swapped.\r\nMartian Man (voiced by Chad L. Coleman): An exiled, shapeshifting Martian superhero whom Nolan killed.\r\nJosef / Red Rush (voiced by Michael Cudlitz) A Russian speedster and the team's first responder whom Nolan killed.\r\nDarkwing (voiced by Lennie James): A gadget-wielding caped crusader and co-benefactor of the Guardians whom Nolan killed.\r\nAquarus (voiced by Ross Marquand): A hydrokinetic, piscine humanoid and king of an underwater nation whom Nolan killed.\r\nConnie (voiced by Mae Whitman): War Woman's co-worker and business partner in the heroine's civilian identity.\r\nPrincipal Winslow (voiced by Reginald VelJohnson): Mark's high school principal.\r\nDoc Seismic (voiced by Chris Diamantopoulos): A mad scientist who holds socially progressive views towards the U.S. government and its past leaders. He uses a couple of earthquake-generating wristbands that give him concussions every time he uses them. He is then shown commanding an army of lava monsters at the end of the first season.\r\nBi-Plane (voiced by Ross Marquand): A flight suit-empowered supervillain who attempted to destroy Denver, only to be thrown into space by the Immortal. His corpse is later shown in space when Mark heads off to Mars.\r\nKursk (voiced by Ross Marquand): A Russian electrokinetic supervillain.\r\nTitan (voiced by Mahershala Ali): A criminal enforcer who can manifest regenerative stone armor at will. He and his family live in poverty and feels looked down on by superheroes. He later becomes a crime lord after his boss, Machine Head, is arrested and works to protect people that are overlooked by superheroes.\r\nThe Flaxans: A warrior race of aliens who seek to conquer Earth despite three failed attempts and Omni-Man attacking their planet. Slash (voiced by Djimon Hounsou): The leader who aims to kill Invincible for scarring him and conquer Earth before he is killed by Omni-Man.\r\nSlash (voiced by Djimon Hounsou): The leader who aims to kill Invincible for scarring him and conquer Earth before he is killed by Omni-Man.\r\nOlga (voiced by Grey Griffin): Red Rush's widow. She moves back to Moscow following his death.\r\nMartian Emperor (voiced by Djimon Hounsou): The ruler of Mars who quarantines the planet to isolate the parasitic Sequids from the rest of the universe.\r\nVanessa (voiced by Nicole Byer): Titan's wife.\r\nFiona (voiced by Nicole Byer): Titan's daughter.\r\nMachine Head (voiced by Jeffrey Donovan): A cyborg crime lord with an auto-tuned voice, extensive illicit funding, and Titan's former boss. Currently in GDA custody.\r\nTether Tyrant (voiced by Reginald VelJohnson): A supervillain hired by Machine Head.\r\nBattle Beast (voiced by Michael Dorn): A space-faring leonine alien warrior seeking to find worthy opponents to fight.\r\nD.A. Sinclair (voiced by Ezra Miller): A mad scientist with an obsession for \"improving\" humanity. After his tech overwhelms Invincible, Cecil Stedman hires Sinclair to mass-produce zombie cyborg super soldiers, or \"Reanimen\", to fight Omni-Man and counter the Viltrumites' impending invasion.\r\nRick Sheridan (voiced by Jonathan Groff): William's love interest who is kidnapped and converted into a Reaniman by D.A. Sinclair.\r\nAdam Wilkins (voiced by Fred Tatasciore): Eve's father who vocally disapproves of her being a superhero.\r\nMrs. Wilkins (voiced by Grey Griffin): A soft-spoken woman who acts as a buffer between her husband and daughter.\r\nDoug Cheston (voiced by Justin Roiland): A student at Upstate University who is kidnapped and converted into a Reaniman by D.A. Sinclair. He commits suicide during a fight with Invincible after becoming horrified by his appearance.\r\nKyle (voiced by Khary Payton): A nerdy frat-boy who befriends Amber at Upstate.\r\nEpisodes\r\nSeason 1 (2021)\r\nSeason 2 (2023)\r\nSeason 2 is expected to release sometime in late 2023.\r\nProduction\r\nDevelopment\r\nOn April 4, 2017, it was announced that a live-action film about Invincible was being developed by Universal Pictures. It was also revealed that Evan Goldberg and Seth Rogen would be the directors of the film after their collaboration on the AMC TV series Preacher. It was also revealed that the film would be rated R, to keep its faithfulness to the comic series. Skybound Entertainment and Point Grey Pictures would be producing the film. However, when the series was announced, the film remained in hiatus, until on January 26, 2021, it was revealed that the film was still in development and would exist separately from the series. In a 2023 interview, Rogen stated that the animated series has had a strong influence on the live-action film version in development with Universal, which is essentially being developed as a live-action version of the animated series.\r\nOn August 11, 2017, Robert Kirkman signed a deal with Amazon to develop various series for Amazon Prime Video, with his company Skybound Entertainment. However, it was revealed that series that are already in production or development with other studios, will not be developed for Amazon. Kirkman revealed that he was interested on developing a series of the Invincible comic series, but that would not be possible at the moment because Universal was developing a film based on the comic series.\r\nHowever, on June 19, 2018, it was announced that Amazon had given a series order to the project for a first season consisting of eight episodes. It was also revealed that the series would be animated and its episodes would be hourlong. Simon Racioppa serves as showrunner for the series and also serves as executive producer alongside Kirkman, David Alpert, and Catherine Winder. Production companies involved with the series include Skybound. Coincidentally, executive producers Evan Goldberg and Seth Rogen (who also provides a voice on the show) are working on a live-action film adaptation of the comic, which is separate from the animated series, as co-directors, writers, and producers. On April 29, 2021, after the release of the final episode of the first season, Amazon renewed the series for a second and third season. In April 2023, series creator Robert Kirkman stated that season 2 would focus on Angstrom Levy, a supervillain with access to multiple dimensions.\r\nCasting\r\nOn January 31, 2019, the cast of the series was revealed, with Steven Yeun to portray Mark Grayson / Invincible and J. K. Simmons portraying Nolan Grayson / Omni-Man. Sandra Oh, Mark Hamill, Seth Rogen, Gillian Jacobs, Andrew Rannells, Zazie Beetz, Walton Goggins, Jason Mantzoukas, Mae Whitman, Chris Diamantopoulos, Malese Jow, Kevin Michael Richardson, Grey Griffin and Max Burkholder also joined the cast of the series. On July 18, 2020, Robert Kirkman confirmed the casting in a live video on Twitter.\r\nAnimation and title sequence\r\nWhen the show was confirmed to be animated, it was confirmed that Wind Sun Sky Entertainment and its partner company, Skybound North, would be co-producing and animating the series.\r\nThe series title sequence is recognized by appearing right where a character would have said \"Invincible\" for the first time at each episode. However, the title sequence also becomes bloodier with each episode. Invincible's creator Robert Kirkman revealed that he wanted to represent the dark days that lie ahead by using the increasingly bloody title cards. Simon Racioppa revealed that he wanted each episode to be different from the previous ones to convince the audience to not skip it. The animation style borrows from the look of Saturday morning cartoons from the early 2000s.\r\nMusic\r\nOn December 2, 2020, it was revealed that John Paesano would be composing the score to the series.\r\nRelease\r\nAfter Amazon ordered the first season of the series, it was confirmed that the series would be consisting of eight episodes. On January 22, 2021, during a live-stream celebrating the 18th anniversary of Invincible #1, Kirkman revealed that the series would debut on March 25, 2021 (midnight EST), with the first 3 episodes. The remaining episodes would release weekly thereafter. On January 20, 2023, a teaser trailer was released, in which Steven Yeun and Seth Rogen discuss the upcoming season, and it was announced that season 2 will debut in late 2023.\r\nReception\r\nThe review aggregator website Rotten Tomatoes reported a 98% approval rating for the first season based on 86 critic reviews. The website's critical consensus reads, \"With bold animation, bloody action, and an all-star cast led by the charming Steven Yeun, Invincible smartly adapts its source material without sacrificing its nuanced perspective on the price of superpowers.\" Metacritic reported a score of 73 out of 100 based on 16 critics, indicating \"generally favorable reviews\" for the first season.\r\nBen Travers of IndieWire gave the show a B grade, stating that \"Kirkman's adaptation is provocative, surprising, and sometimes challenging, as it constantly tries to disrupt the accepted ideas of its genre, whether that's the superhero genre, the teen drama genre, or the misguided notion that animation is a genre unto itself.\" Kathryn VanArendonk of Vulture states \"the series has a palpable 'more of an eight-hour movie' thing going on, and the potential of that model is that it will all coalesce in the end into this glorious, big, transfixing story\" but also adds that \"the pitfall is that it makes these opening episodes a little weaker; there are so many characters happening here, so many story threads to put in place, that it's hard to know what to invest in as a viewer.\" Caroline Framke from Variety commented: \"Now, of course, Kirkman is the wildly successful co-creator and executive producer of 'The Walking Dead,' so even those who might not have picked up an 'Invincible' comic might be interested in this spry, hourlong animated series that somehow manages to be both snarky and earnest within the same breath.\" William Hughes from The A.V. Club praised the series for its animation and stated: \"Funny, exciting, and emotionally smart—seriously, Sandra Oh is killing it here—Invincible isn't bulletproof. But, like its increasingly burdened hero, it's trying. And sometimes, in the superhero game, that's all you can really do.\" Bob Strauss from Datebook praised the show, commenting: \"While you can't describe 'Invincible' as gritty, it does feel like the right kind of animated super-show for an era marked by Zack Snyder's dark-hued 'Justice League' reconstruction and Amazon's own, ultra-pathological take on the genre, 'The Boys.' It's as clean-looking as any program we grew up with, but it has the dirtier stuff we secretly wanted.\"\r\nSiddhant Adlakha of IGN gave the first season an 8 out of 10, stating the season \"is great, thanks to its unique action and strong character-centric gravitas\" and that the show \"combines familiar superhero tropes with unexpected gore and moving character dynamics, resulting in the year's most surprising superhero series.\" Alan Sepinwall from Rolling Stone stated: \"As the series moves along, Kirkman and company begin introducing twists to what we think is the formula — perhaps too many. Even within three episodes, the number of reversals and secrets pile so high that it can be hard to invest in certain characters and scenes, rather than trying to guess what will come next.\" Roxana Hadadi from RogerEbert.com praised the series for its story and animation, commenting: \"'Invincible' sets up those questions quickly and engagingly in these first three installments, wraps them in a mystery, and then splatters them with blood. It's not an entirely new approach for this genre, but the familiarity of 'Invincible' is forgivable in light of the confidence that both Kirkman and Yeun bring to the material. They're the reason to watch.\" Niv M. Sultan from Slant Magazine gave the first season 3.5 stars of 4, and commented \"Invincible recaptures what our current glut of superhero fiction largely loses sight of: the pleasure that superheroes must feel when wielding their powers. Not the sacred satisfaction of helping the downtrodden, but the id-centered thrills of soaring through the sky and inflicting hurt on those deemed deserving.\" Louis Chilton from The Independent gave the series 3 stars of 5 and stated \"Invincible often seems derivative; perhaps its ideas were more groundbreaking in the original early-2000s comics. Some of its characters are unapologetic parodies (the Batman facsimile \"Darkwing\", for example), and you could easily go through picking out elements or story ideas that have cropped up in Watchmen, or The Incredibles, or Sky High, or Misfits. But there are still some good bones to its premise, and just enough subversiveness to let you ignore the fact this is a story you've seen a hundred times before.\"\r\nAccolades\r\nIn other media\r\nThe series' eighth episode spawned a popular Internet meme called \"Think, Mark, Think\".\r\nControversy\r\nInvincible creator Robert Kirkman was sued by comic book colorist William Crabtree, citing a rights and profits concern, on January 10, 2022.",
    "html": "<p>Invincible is an adult animated superhero television series created by Robert Kirkman for Amazon Prime Video and premiered on March 25, 2021. Based on the Image Comics series of the same name by Kirkman, Cory Walker, and Ryan Ottley, the show follows 17-year-old Mark Grayson and his transformation into a superhero under the guidance of his father Omni-Man, the most powerful superhero on the planet. During his transformation, Mark finds himself struggling between his personal life and superhero duties, where he will be forced to prove that he can be the hero that his father is. The series stars Steven Yeun, Sandra Oh, and J. K. Simmons as the Grayson family, while the rest of the cast serve as recurring characters.</p><p>Following its release, the series received widespread acclaim from critics and audiences, with praise for its animation, action sequences, story, writing, voice acting, emotional weight, and faithfulness to the comics. In April 2021, ahead of season one's finale, Amazon renewed the series for a second and third season. The second season is set to premiere sometime in late 2023.</p><br/><h3>Premise</h3><p>Mark Grayson is a seemingly normal teenager, except for the fact that his father, Nolan, is the most powerful superhero on the planet, and that shortly after his seventeenth birthday, Mark begins to develop powers of his own and learns how to wield them with help from his father.</p><br/><h3>Characters</h3><h4>Main</h4><ul><li>Mark Grayson / Invincible (voiced by Steven Yeun): The eponymous main character. After gaining his powers at 17 years old, Mark discovers the harsh realities of being a superhero while struggling to define himself. He is shown to have a berserker side when fighting the Flaxans and Machine Head's villains, revealed to be a Viltrumite trait.</li><li>Debbie Grayson (voiced by Sandra Oh): Mark's mother and Nolan's wife. Debbie is an experienced realtor, once long adjusted to being a superhero's spouse, before entering into a drunken spiral of depression following her husbands betrayal at the end of the first season.</li><li>Nolan Grayson / Omni-Man (voiced by J. K. Simmons): Mark's father and Debbie's husband. Born on the planet Viltrum to a superpowered alien race known as the Viltrumites, his parents died in his youth before he joined the Viltrum Empire's intergalactic expansion several thousand years ago. After arriving on Earth 20 years before the series, Nolan is considered the most powerful superhero on the planet, with a civilian identity of a rich travel writer.</li></ul><h4>Recurring</h4><ul><li>Samantha Eve Wilkins / Atom Eve (voiced by Gillian Jacobs): A matter/energy manipulating superheroine. Formerly a member of the Teen Team and new Guardians rosters, she quits after her ex-boyfriend Rex Splode cheats on her with Dupli-Kate. Struggling to find self-meaning, she chooses to help people directly with humanitarian actions.</li><li>William Clockwell (voiced by Andrew Rannells): Mark's best friend and civilian confidant.</li><li>Global Defense Agency: A clandestine organization that organizes global superhero responses and utilizes advanced technology in expediting their recovery or resuscitation after death. Cecil Stedman (voiced by Walton Goggins): Director of the GDA who possesses a long-range personal teleporter and inducts Invincible at the start of his hero career. Donald Ferguson (voiced by Chris Diamantopoulos): A high-ranking GDA agent who serves directly under Cecil Stedman and is in charge of overseeing the secret projects meant to incapacitate or kill Nolan, only to die in a massive explosion in a futile attempt to kill Nolan.</li><li>Cecil Stedman (voiced by Walton Goggins): Director of the GDA who possesses a long-range personal teleporter and inducts Invincible at the start of his hero career.</li><li>Donald Ferguson (voiced by Chris Diamantopoulos): A high-ranking GDA agent who serves directly under Cecil Stedman and is in charge of overseeing the secret projects meant to incapacitate or kill Nolan, only to die in a massive explosion in a futile attempt to kill Nolan.</li><li>Guardians of the Globe (new roster): Heroes who were formerly of the Teen Team merged with other experienced heroes with diverse skill sets. Rudolph \"Rudy\" Connors / Robot (voiced by Zachary Quinto and Ross Marquand): A deformed individual who operates a series of robotic drones and has a sizable personal fortune. He has a condition where outside air burns his lungs, forcing him to live in a pod to survive. Using \"Robot\", Connors formerly led the Teen Team before creating a new Guardians roster. He also uses Rex Splode's DNA and the Mauler Twins' expertise in cloning to make a new body for himself. Quinto voices the character in his Robot form and human form while Marquand voices the clone version. Rex Sloan / Rex Splode (voiced by Jason Mantzoukas): An incorrigible superhero who can charge potential energy into anything he touches to create explosives and a former member of the Teen Team who is selected to join the new Guardians roster. Sloan shows some maturity after Omni-Man's public betrayal, growing closer to the team. Kate Cha / Dupli-Kate (voiced by Malese Jow): A self-replicating superheroine, formerly of the Teen Team, before she is selected to join the new Guardians roster. All Kates are numbered, which decreases in losses so that whichever remains with \"1\" is the prime Kate. She also has a telepathic link with her doubles, which causes her to feel what they feel. Shrinking Rae (voiced by Grey Griffin): A size-manipulating superheroine selected to join the new Guardians roster. Her name is a reference to the Shrink Ray device. She is one of the few characters from the comics to be gender-swapped. Amanda / Monster Girl (voiced by Grey Griffin and Kevin Michael Richardson): A cursed superheroine whose powers allow her to transform into a powerful masculine-like ogre. She begins the series chronologically at 24 years old but is physically at age 12 due to her powers making her younger with each use. Markus Grimshaw / Black Samson (voiced by Khary Payton): An original Guardian from the team's early days who left after losing his powers. Donning an armored super-suit to continue as a hero, he joins the new roster as the veteran voice. After being hospitalized by Battle Beast, his powers return to accelerate his recovery and he shelves his armor.</li><li>Rudolph \"Rudy\" Connors / Robot (voiced by Zachary Quinto and Ross Marquand): A deformed individual who operates a series of robotic drones and has a sizable personal fortune. He has a condition where outside air burns his lungs, forcing him to live in a pod to survive. Using \"Robot\", Connors formerly led the Teen Team before creating a new Guardians roster. He also uses Rex Splode's DNA and the Mauler Twins' expertise in cloning to make a new body for himself. Quinto voices the character in his Robot form and human form while Marquand voices the clone version.</li><li>Rex Sloan / Rex Splode (voiced by Jason Mantzoukas): An incorrigible superhero who can charge potential energy into anything he touches to create explosives and a former member of the Teen Team who is selected to join the new Guardians roster. Sloan shows some maturity after Omni-Man's public betrayal, growing closer to the team.</li><li>Kate Cha / Dupli-Kate (voiced by Malese Jow): A self-replicating superheroine, formerly of the Teen Team, before she is selected to join the new Guardians roster. All Kates are numbered, which decreases in losses so that whichever remains with \"1\" is the prime Kate. She also has a telepathic link with her doubles, which causes her to feel what they feel.</li><li>Shrinking Rae (voiced by Grey Griffin): A size-manipulating superheroine selected to join the new Guardians roster. Her name is a reference to the Shrink Ray device. She is one of the few characters from the comics to be gender-swapped.</li><li>Amanda / Monster Girl (voiced by Grey Griffin and Kevin Michael Richardson): A cursed superheroine whose powers allow her to transform into a powerful masculine-like ogre. She begins the series chronologically at 24 years old but is physically at age 12 due to her powers making her younger with each use.</li><li>Markus Grimshaw / Black Samson (voiced by Khary Payton): An original Guardian from the team's early days who left after losing his powers. Donning an armored super-suit to continue as a hero, he joins the new roster as the veteran voice. After being hospitalized by Battle Beast, his powers return to accelerate his recovery and he shelves his armor.</li><li>Amber Bennett (voiced by Zazie Beetz): Mark's classmate and girlfriend. She was redesigned from her comic book source with a resemblance to her voice actress for the series. She is depicted with an insight to her, deducing Mark's identity before he tells her.</li><li>The Mauler Twins (both voiced by Kevin Michael Richardson): Two blue-skinned, hyper-powerful, super-genius superhumans and long-time adversaries of the original Guardians. Despite their name, they are not actual twins but rather clones of each other. Both proclaim to be the original while stating the other is a clone.</li><li>Art Rosenbaum (voiced by Mark Hamill): A superhero suit tailor and long-time friend to many superheroes, mainly Omni-Man. He helps Debbie uncover the truth about the Guardians murder at the hands of Nolan.</li><li>Damien Darkblood (voiced by Clancy Brown): A demon detective who escaped Hell to seek justice for others and save his soul, whose presence triggers a sudden cold in the ambient temperature. Cecil exiles him back to Hell to prevent him from exposing Nolan too early as a criminal.</li></ul><h4>Guest</h4><ul><li>Allen the Alien (voiced by Seth Rogen): An assessor of member world candidates for the Coalition of Planets whose homeworld was destroyed by the Viltrumites. He initially has a scuffle with Invincible near the Moon's orbit, but realizes that he mistakenly went to Earth when he was supposed to travel to the planet Urath.</li><li>Kill Cannon (voiced by Fred Tatasciore): A supervillain armed with an arm-mounted laser cannon whom Mark defeated.</li><li>Steve (voiced by Jon Hamm): A Secret Service agent who guards the White House's front gate.</li><li>Matt (voiced by Max Burkholder): Steve's stepson.</li><li>Guardians of the Globe (original roster): A decades-old superhero team massacred by Omni-Man. Afterwards, a new roster is created. The Immortal (voiced by Ross Marquand): The millennia-old leader of the Guardians who was once a Celtic warrior before he was exposed to a cosmic anomaly and went on to fight in the Crusades and become Abraham Lincoln. The Maulers later revive him to fight Robot and the New Guardians, but the Immortal goes to fight Omni-Man instead. While the Immortal is subsequently killed again, he recovers in the GDA's custody. Holly / War Woman (voiced by Lauren Cohan): A powerful ancient warrior and co-benefactor of the Guardians whom Nolan killed. Alana / Green Ghost (voiced by Sonequa Martin-Green): A superheroine encased in a green suit with ghost-like powers whom Nolan killed. She is one of the few characters from the comics to be gender swapped. Martian Man (voiced by Chad L. Coleman): An exiled, shapeshifting Martian superhero whom Nolan killed. Josef / Red Rush (voiced by Michael Cudlitz) A Russian speedster and the team's first responder whom Nolan killed. Darkwing (voiced by Lennie James): A gadget-wielding caped crusader and co-benefactor of the Guardians whom Nolan killed. Aquarus (voiced by Ross Marquand): A hydrokinetic, piscine humanoid and king of an underwater nation whom Nolan killed.</li><li>The Immortal (voiced by Ross Marquand): The millennia-old leader of the Guardians who was once a Celtic warrior before he was exposed to a cosmic anomaly and went on to fight in the Crusades and become Abraham Lincoln. The Maulers later revive him to fight Robot and the New Guardians, but the Immortal goes to fight Omni-Man instead. While the Immortal is subsequently killed again, he recovers in the GDA's custody.</li><li>Holly / War Woman (voiced by Lauren Cohan): A powerful ancient warrior and co-benefactor of the Guardians whom Nolan killed.</li><li>Alana / Green Ghost (voiced by Sonequa Martin-Green): A superheroine encased in a green suit with ghost-like powers whom Nolan killed. She is one of the few characters from the comics to be gender swapped.</li><li>Martian Man (voiced by Chad L. Coleman): An exiled, shapeshifting Martian superhero whom Nolan killed.</li><li>Josef / Red Rush (voiced by Michael Cudlitz) A Russian speedster and the team's first responder whom Nolan killed.</li><li>Darkwing (voiced by Lennie James): A gadget-wielding caped crusader and co-benefactor of the Guardians whom Nolan killed.</li><li>Aquarus (voiced by Ross Marquand): A hydrokinetic, piscine humanoid and king of an underwater nation whom Nolan killed.</li><li>Connie (voiced by Mae Whitman): War Woman's co-worker and business partner in the heroine's civilian identity.</li><li>Principal Winslow (voiced by Reginald VelJohnson): Mark's high school principal.</li><li>Doc Seismic (voiced by Chris Diamantopoulos): A mad scientist who holds socially progressive views towards the U.S. government and its past leaders. He uses a couple of earthquake-generating wristbands that give him concussions every time he uses them. He is then shown commanding an army of lava monsters at the end of the first season.</li><li>Bi-Plane (voiced by Ross Marquand): A flight suit-empowered supervillain who attempted to destroy Denver, only to be thrown into space by the Immortal. His corpse is later shown in space when Mark heads off to Mars.</li><li>Kursk (voiced by Ross Marquand): A Russian electrokinetic supervillain.</li><li>Titan (voiced by Mahershala Ali): A criminal enforcer who can manifest regenerative stone armor at will. He and his family live in poverty and feels looked down on by superheroes. He later becomes a crime lord after his boss, Machine Head, is arrested and works to protect people that are overlooked by superheroes.</li><li>The Flaxans: A warrior race of aliens who seek to conquer Earth despite three failed attempts and Omni-Man attacking their planet. Slash (voiced by Djimon Hounsou): The leader who aims to kill Invincible for scarring him and conquer Earth before he is killed by Omni-Man.</li><li>Slash (voiced by Djimon Hounsou): The leader who aims to kill Invincible for scarring him and conquer Earth before he is killed by Omni-Man.</li><li>Olga (voiced by Grey Griffin): Red Rush's widow. She moves back to Moscow following his death.</li><li>Martian Emperor (voiced by Djimon Hounsou): The ruler of Mars who quarantines the planet to isolate the parasitic Sequids from the rest of the universe.</li><li>Vanessa (voiced by Nicole Byer): Titan's wife.</li><li>Fiona (voiced by Nicole Byer): Titan's daughter.</li><li>Machine Head (voiced by Jeffrey Donovan): A cyborg crime lord with an auto-tuned voice, extensive illicit funding, and Titan's former boss. Currently in GDA custody.</li><li>Tether Tyrant (voiced by Reginald VelJohnson): A supervillain hired by Machine Head.</li><li>Battle Beast (voiced by Michael Dorn): A space-faring leonine alien warrior seeking to find worthy opponents to fight.</li><li>D.A. Sinclair (voiced by Ezra Miller): A mad scientist with an obsession for \"improving\" humanity. After his tech overwhelms Invincible, Cecil Stedman hires Sinclair to mass-produce zombie cyborg super soldiers, or \"Reanimen\", to fight Omni-Man and counter the Viltrumites' impending invasion.</li><li>Rick Sheridan (voiced by Jonathan Groff): William's love interest who is kidnapped and converted into a Reaniman by D.A. Sinclair.</li><li>Adam Wilkins (voiced by Fred Tatasciore): Eve's father who vocally disapproves of her being a superhero.</li><li>Mrs. Wilkins (voiced by Grey Griffin): A soft-spoken woman who acts as a buffer between her husband and daughter.</li><li>Doug Cheston (voiced by Justin Roiland): A student at Upstate University who is kidnapped and converted into a Reaniman by D.A. Sinclair. He commits suicide during a fight with Invincible after becoming horrified by his appearance.</li><li>Kyle (voiced by Khary Payton): A nerdy frat-boy who befriends Amber at Upstate.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 26, 2021</td><td style=\"padding:0 8px\">April 30, 2021</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td data-sort-value=\"\" class=\"table-na\" colspan=\"2\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\">TBA</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">Late 2023</td><td data-sort-value=\"\" class=\"table-na\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center; ;padding:0 8px\">TBA</td></tr></tbody></table><h4>Season 1 (2021)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#FFF209;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#FFF209\">Title</th><th scope=\"col\" style=\"background:#FFF209\">Directed by</th><th scope=\"col\" style=\"background:#FFF209\">Written by</th><th scope=\"col\" style=\"background:#FFF209\">Original release date <span></span></th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"It's About Time\"</td><td style=\"text-align:center\"><span>Robert Valley</span></td><td style=\"text-align:center\"><span>Robert Kirkman</span></td><td style=\"text-align:center\">March 25, 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #FFF209\">When hulking villainous scientists, the Mauler Twins, attack the White House, they are repelled by the <span>Guardians of the Globe</span> and <span>Nolan Grayson / Omni-Man</span>. Nolan's son <span>Mark</span>, who is waiting for his powers to emerge, goes to school and defends classmate Amber Bennett from bully Todd. After Todd punches Mark to the ground, Amber saves the latter and develops an interest in him. Later, Mark's superpowers emerge, and he finishes work to tell his parents at dinner. While Nolan is initially uncertain, he still begins to train Mark on how to use them. However, wishing to emphasize the severity of being a superhero, Mark is caught off-guard by his father punching too hard. Feeling hurt emotionally and physically, Mark blows off steam by stopping a robbery in a homemade suit. After a heart-to-heart with his son, Nolan takes Mark to meet superhero suit tailor Art Rosenbaum, who creates a proper superhero suit for Mark after he chooses to call himself \"Invincible\". Later, Nolan secretly ambushes the Guardians at their headquarters and kills them all before falling unconscious from damage sustained from their resistance.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Here Goes Nothing\"</td><td style=\"text-align:center\">Paul Furminger</td><td style=\"text-align:center\">Simon Racioppa</td><td style=\"text-align:center\">March 25, 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #FFF209\">The clandestine Global Defense Agency nurses a comatose Nolan in their secret hospital underneath <span>The Pentagon</span>, but fails to revive the Guardians, so Director Cecil Stedman informs Mark and his mother Debbie. As extra-dimensional aliens called the Flaxans attack, Mark helps the Teen Team hold off their forces. When the Flaxans rapidly age and retreat, Teen Team leader Robot deduces this was due to a <span>time dilation</span> difference between the Flaxans' dimension and Earth. As Mark recognizes <span class=\"mw-redirect\">Atom Eve</span> as classmate Samantha Eve Wilkins, they share their identities and become friends. The Flaxans return with anti-aging technology, but Mark and the Teen Team destroy them, forcing another retreat. The Flaxans return once again and nearly succeed until a recuperated Nolan forces them back to their dimension, where he devastates their planet in retaliation before returning as news breaks of the Guardians' deaths. Meanwhile, Mark skirmishes with Allen the Alien, who wants to test Earth's defenses for the Coalition of Planets. Calling a time-out to talk and learning of Allen's mission, Mark corrects his mistaking \"Earth\" for another planet, \"Urath\". Allen leaves, bidding a friendly farewell. Concurrently, demon detective Damien Darkblood investigates the deaths of the Guardians for Cecil, theorizing the killer was among the heroes.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Who You Calling Ugly?\"</td><td style=\"text-align:center\">Jeff Allen</td><td style=\"text-align:center\"><span>Chris Black</span></td><td style=\"text-align:center\">March 25, 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #FFF209\">After a televised funeral, the Graysons attend the Guardians' private burial with their loved ones, where Darkblood questions Nolan privately and hints at his suspicions. Cecil commissions Robot to form a new Guardians roster of his choosing, given his handling of the Flaxan invasions, so Robot merges the Teen Team with other heroes Monster Girl, Black Samson, and Shrinking Rae. However, Eve immediately quits, still resentful of her teammate and boyfriend <span class=\"mw-redirect\">Rex Splode</span> after catching him cheating with teammate Dupli-Kate. When Mark gets Amber's number, he sets up a \"study date\", which gets interrupted when he helps Eve stop Doc Seismic from attacking <span>Mount Rushmore</span>. Despite waiting, Amber still stays for their date out of intrigue. When Rex tries apologizing to Eve, she refuses to accept and seeks out Mark, only to discover him with Amber and leaves unnoticed. With Robot's unseen help, the Maulers escape from their GDA prison, though one sacrifices the other. When Darkblood questions Debbie, he finds Nolan shared little with her. This encounter leaves her suspicious of Nolan, who senses Darkblood's lingering presence.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Neil Armstrong, Eat Your Heart Out\"</td><td style=\"text-align:center\">Cory Evans</td><td style=\"text-align:center\">Ryan Ridley</td><td style=\"text-align:center\">April 1, 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #FFF209\">Angry that the GDA has not caught the Guardians' killer yet, Red Rush's widow, Olga, commissions Debbie to sell her house so she can return to <span>Moscow</span>. Cecil asks Nolan to protect the first mission to <span>Mars</span>, but the latter refuses, citing his responsibilities protecting Earth, so Mark volunteers. Despite a successful landing, Mark's inattentiveness allows <span class=\"mw-redirect\">Martians</span> to abduct the astronauts. The Martian Emperor orders their execution to prevent the parasitic Sequids from reaching Earth and destroying the universe. Mark hastily evacuates the astronauts to their shuttle, unaware that a Martian had replaced one of them. The astronaut that was left behind is possessed by the Sequids and unleashes them on the Martians. Meanwhile, as Nolan and Debbie vacation in <span>Rome</span> to rekindle their relationship, he manipulatively regains her trust with half-truths. Cecil realizes Nolan is the killer, but cannot act until he determines the latter's motive and a way to stop him. Knowing he will not drop the case, Cecil exiles Darkblood back to <span>Hell</span>, unaware that the detective hid his notepad in Debbie's closet. As the surviving Mauler begins cloning himself, Robot monitors his progress and methods before stealing a DNA sample from Rex to present to his real self, the deformed Rudy Connors.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"That Actually Hurt\"</td><td style=\"text-align:center\">Jay Baker</td><td style=\"text-align:center\">Christine Lavaf</td><td style=\"text-align:center\">April 8, 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #FFF209\">After Debbie finds Darkblood's notepad, her lingering suspicions return, and she locates Nolan's bloodied super-suit while he is away. After Black Samson lectures his teammates on failing to protect civilians due to their infighting, Robot secretly approaches the restored Mauler Twins with a job offer. Meanwhile, Mark promises to help Amber at a soup kitchen she volunteers at as recompense since he neglected her while working as Invincible. However, he must also help superpowered enforcer Titan defeat his boss Machine Head, who predicted their attack and hired multiple villains for security. The Guardians arrive to help, but Mark, Monster Girl, and Black Samson are beaten and severely wounded by Battle Beast, which prompts the rest of the Guardians to act as a team. Seeing the other villains swiftly defeated, Battle Beast abandons the battle due to its ignominy. The GDA arrest Machine Head and <span>medevac</span> Mark and the others, allowing Titan to take over Machine Head's operation. Eve also volunteers alongside Amber, needing direction after quitting being a superhero, but leaves when Cecil calls her about Mark's hospitalization. Elsewhere, GDA scientists test samples of Mark's blood, discovering that the cells are invulnerable to every lethal test they run.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"You Look Kinda Dead\"</td><td style=\"text-align:center\">Paul Furminger / Jae Harm</td><td style=\"text-align:center\">Curtis Gwinn</td><td style=\"text-align:center\">April 15, 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #FFF209\">Humbled by his week-long recovery, Mark reconciles with Amber before both accompany his best friend William on a weekend visit to Upstate University to see his crush Rick Sheridan. However, a cyborg experiment of mad scientist, D.A. Sinclair, escapes confinement and fights Mark before killing himself. As William deduces Mark's identity, Amber breaks up with Mark due to his \"absence\" during the cyborg's rampage, and he sacrifices reconciliation to rescue William and Rick from Sinclair. Seeing Rick converted into a cyborg, William's pleas for help enable Rick to overcome his alteration and help Mark defeat Sinclair. Following Sinclair's arrest, Cecil takes an interest in his technology, which overwhelmed Mark's physiology. Meanwhile, Rosenbaum examines Nolan's bloodied suit for Debbie, confirming Nolan killed the Guardians. Both fearfully agree to stay silent, but the revelation sends Debbie into a drunken depression. Having studied her biology beforehand, Robot gathers magical ingredients to heal Monster Girl. While the Maulers continue to grow a body for Robot, they also exhume the Immortal's corpse in order to resurrect him as their enthralled weapon against Robot. Concurrently, Eve is inspired by Amber to skip college and use her powers in direct humanitarian endeavors.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"We Need to Talk\"</td><td style=\"text-align:center\">Vinton Heuck</td><td style=\"text-align:center\">Simon Racioppa</td><td style=\"text-align:center\">April 22, 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #FFF209\">After Debbie relocates to the GDA, Cecil explains the truth before both witness Nolan kill Cecil's associate, Donald Ferguson, and several GDA agents. Adding a neural link upgrade, the \"Rudy\" clone reluctantly euthanizes his progenitor. Paying and betraying the Maulers, the new Rudy leaves for a Guardians summons. He explains himself to the team, who are taken aback by Rudy's revelations before learning the truth about Omni-Man and their predecessors' fates. Cecil buys time by talking to Nolan before retreating to deploy Sinclair's \"Reanimen\" and a modified <span>Kaiju</span> to kill him. Unfazed by Mark revealing his superhero identity, having deduced the truth weeks earlier, Amber dumps him as he never trusted her before. Mark seeks Eve's wisdom, but she criticizes his selfish behavior. When the two intercept Nolan's fight with the Kaiju, Cecil orders Eve to leave Mark and rendezvous with the Guardians. When the Maulers revive the Immortal, he flies off to battle Omni-Man in an attempt to avenge the death of his team, while Mark narrowly subdues the Kaiju. News helicopters capture Omni-Man killing the Immortal in a live global broadcast, before Nolan finally asks to talk with a bewildered Mark.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Where I Really Come From\"</td><td style=\"text-align:center\">William Ruzicka</td><td style=\"text-align:center\">Robert Kirkman</td><td style=\"text-align:center\">April 29, 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #FFF209\">After revealing himself as an infiltrator for the Viltrum Empire sent to conquer Earth, Nolan fails to convince Mark to join him and overpowers his son, devastating <span>Chicago</span> and killing thousands. Despite being beaten nearly to death, Mark makes Nolan remember his love for his family. Unable to reconcile this with his duty, Nolan tearfully abandons Earth. The Guardians and Eve mobilize to aid Chicago relief efforts as the world learns of Omni-Man's betrayal while Cecil helps Debbie and Mark by falsifying Nolan's civilian death. A devastated Debbie shares a drink with Rosenbaum, also hurt by Nolan's betrayal, as Mark and Amber rekindle their relationship after his two-week recovery. As Amber and William learn Eve is also a superhero, Cecil sends Mark to intercept an approaching Allen and updates him on recent events. Allen warns Mark that a Viltrumite fleet will come for Earth, given Nolan's uncharacteristic abandoning of his post, but he thinks that Mark can help the Coalition stop the Viltrumites' expansion. As Mark plans to finish high school, the Maulers are arrested while the Immortal recuperates under GDA protection. Villainous forces conspire to return as Cecil commissions Sinclair to mass-produce Reanimen contingency troops.</td></tr></tbody></table><h4>Season 2 (2023)</h4><p>Season 2 is expected to release sometime in late 2023.</p><br/><h3>Production</h3><h4>Development</h4><p>On April 4, 2017, it was announced that a live-action film about Invincible was being developed by Universal Pictures. It was also revealed that Evan Goldberg and Seth Rogen would be the directors of the film after their collaboration on the AMC TV series Preacher. It was also revealed that the film would be rated R, to keep its faithfulness to the comic series. Skybound Entertainment and Point Grey Pictures would be producing the film. However, when the series was announced, the film remained in hiatus, until on January 26, 2021, it was revealed that the film was still in development and would exist separately from the series. In a 2023 interview, Rogen stated that the animated series has had a strong influence on the live-action film version in development with Universal, which is essentially being developed as a live-action version of the animated series.</p><p>On August 11, 2017, Robert Kirkman signed a deal with Amazon to develop various series for Amazon Prime Video, with his company Skybound Entertainment. However, it was revealed that series that are already in production or development with other studios, will not be developed for Amazon. Kirkman revealed that he was interested on developing a series of the Invincible comic series, but that would not be possible at the moment because Universal was developing a film based on the comic series.</p><p>However, on June 19, 2018, it was announced that Amazon had given a series order to the project for a first season consisting of eight episodes. It was also revealed that the series would be animated and its episodes would be hourlong. Simon Racioppa serves as showrunner for the series and also serves as executive producer alongside Kirkman, David Alpert, and Catherine Winder. Production companies involved with the series include Skybound. Coincidentally, executive producers Evan Goldberg and Seth Rogen (who also provides a voice on the show) are working on a live-action film adaptation of the comic, which is separate from the animated series, as co-directors, writers, and producers. On April 29, 2021, after the release of the final episode of the first season, Amazon renewed the series for a second and third season. In April 2023, series creator Robert Kirkman stated that season 2 would focus on Angstrom Levy, a supervillain with access to multiple dimensions.</p><h4>Casting</h4><p>On January 31, 2019, the cast of the series was revealed, with Steven Yeun to portray Mark Grayson / Invincible and J. K. Simmons portraying Nolan Grayson / Omni-Man. Sandra Oh, Mark Hamill, Seth Rogen, Gillian Jacobs, Andrew Rannells, Zazie Beetz, Walton Goggins, Jason Mantzoukas, Mae Whitman, Chris Diamantopoulos, Malese Jow, Kevin Michael Richardson, Grey Griffin and Max Burkholder also joined the cast of the series. On July 18, 2020, Robert Kirkman confirmed the casting in a live video on Twitter.</p><h4>Animation and title sequence</h4><p>When the show was confirmed to be animated, it was confirmed that Wind Sun Sky Entertainment and its partner company, Skybound North, would be co-producing and animating the series.</p><p>The series title sequence is recognized by appearing right where a character would have said \"Invincible\" for the first time at each episode. However, the title sequence also becomes bloodier with each episode. Invincible's creator Robert Kirkman revealed that he wanted to represent the dark days that lie ahead by using the increasingly bloody title cards. Simon Racioppa revealed that he wanted each episode to be different from the previous ones to convince the audience to not skip it. The animation style borrows from the look of Saturday morning cartoons from the early 2000s.</p><h4>Music</h4><p>On December 2, 2020, it was revealed that John Paesano would be composing the score to the series.</p><br/><h3>Release</h3><p>After Amazon ordered the first season of the series, it was confirmed that the series would be consisting of eight episodes. On January 22, 2021, during a live-stream celebrating the 18th anniversary of Invincible #1, Kirkman revealed that the series would debut on March 25, 2021 (midnight EST), with the first 3 episodes. The remaining episodes would release weekly thereafter. On January 20, 2023, a teaser trailer was released, in which Steven Yeun and Seth Rogen discuss the upcoming season, and it was announced that season 2 will debut in late 2023.</p><br/><h3>Reception</h3><p>The review aggregator website Rotten Tomatoes reported a 98% approval rating for the first season based on 86 critic reviews. The website's critical consensus reads, \"With bold animation, bloody action, and an all-star cast led by the charming Steven Yeun, Invincible smartly adapts its source material without sacrificing its nuanced perspective on the price of superpowers.\" Metacritic reported a score of 73 out of 100 based on 16 critics, indicating \"generally favorable reviews\" for the first season.</p><p>Ben Travers of IndieWire gave the show a B grade, stating that \"Kirkman's adaptation is provocative, surprising, and sometimes challenging, as it constantly tries to disrupt the accepted ideas of its genre, whether that's the superhero genre, the teen drama genre, or the misguided notion that animation is a genre unto itself.\" Kathryn VanArendonk of Vulture states \"the series has a palpable 'more of an eight-hour movie' thing going on, and the potential of that model is that it will all coalesce in the end into this glorious, big, transfixing story\" but also adds that \"the pitfall is that it makes these opening episodes a little weaker; there are so many characters happening here, so many story threads to put in place, that it's hard to know what to invest in as a viewer.\" Caroline Framke from Variety commented: \"Now, of course, Kirkman is the wildly successful co-creator and executive producer of 'The Walking Dead,' so even those who might not have picked up an 'Invincible' comic might be interested in this spry, hourlong animated series that somehow manages to be both snarky and earnest within the same breath.\" William Hughes from The A.V. Club praised the series for its animation and stated: \"Funny, exciting, and emotionally smart—seriously, Sandra Oh is killing it here—Invincible isn't bulletproof. But, like its increasingly burdened hero, it's trying. And sometimes, in the superhero game, that's all you can really do.\" Bob Strauss from Datebook praised the show, commenting: \"While you can't describe 'Invincible' as gritty, it does feel like the right kind of animated super-show for an era marked by Zack Snyder's dark-hued 'Justice League' reconstruction and Amazon's own, ultra-pathological take on the genre, 'The Boys.' It's as clean-looking as any program we grew up with, but it has the dirtier stuff we secretly wanted.\"</p><p>Siddhant Adlakha of IGN gave the first season an 8 out of 10, stating the season \"is great, thanks to its unique action and strong character-centric gravitas\" and that the show \"combines familiar superhero tropes with unexpected gore and moving character dynamics, resulting in the year's most surprising superhero series.\" Alan Sepinwall from Rolling Stone stated: \"As the series moves along, Kirkman and company begin introducing twists to what we think is the formula — perhaps too many. Even within three episodes, the number of reversals and secrets pile so high that it can be hard to invest in certain characters and scenes, rather than trying to guess what will come next.\" Roxana Hadadi from RogerEbert.com praised the series for its story and animation, commenting: \"'Invincible' sets up those questions quickly and engagingly in these first three installments, wraps them in a mystery, and then splatters them with blood. It's not an entirely new approach for this genre, but the familiarity of 'Invincible' is forgivable in light of the confidence that both Kirkman and Yeun bring to the material. They're the reason to watch.\" Niv M. Sultan from Slant Magazine gave the first season 3.5 stars of 4, and commented \"Invincible recaptures what our current glut of superhero fiction largely loses sight of: the pleasure that superheroes must feel when wielding their powers. Not the sacred satisfaction of helping the downtrodden, but the id-centered thrills of soaring through the sky and inflicting hurt on those deemed deserving.\" Louis Chilton from The Independent gave the series 3 stars of 5 and stated \"Invincible often seems derivative; perhaps its ideas were more groundbreaking in the original early-2000s comics. Some of its characters are unapologetic parodies (the Batman facsimile \"Darkwing\", for example), and you could easily go through picking out elements or story ideas that have cropped up in Watchmen, or The Incredibles, or Sky High, or Misfits. But there are still some good bones to its premise, and just enough subversiveness to let you ignore the fact this is a story you've seen a hundred times before.\"</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" style=\"width:22%;\">Award</th><th scope=\"col\">Date of ceremony</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference(s)\">Ref(s)</abbr></th></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>Hollywood Critics Association TV Awards</span></th><td>August 22, 2021</td><td>Best Animated Series or Animated Television Movie</td><td rowspan=\"3\"><i>Invincible</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>Dorian TV Awards</span></th><td>August 29, 2021</td><td>Best Animated Show</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>Saturn Awards</span></th><td>October 25, 2022</td><td>Best Animated Television Series</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr></tbody></table><h4>In other media</h4><p>The series' eighth episode spawned a popular Internet meme called \"Think, Mark, Think\".</p><h4>Controversy</h4><p>Invincible creator Robert Kirkman was sued by comic book colorist William Crabtree, citing a rights and profits concern, on January 10, 2022.</p><br/>"
  },
  "errorMessage": ""
}