{
  "imDbId": "tt5788792",
  "title": "The Marvelous Mrs. Maisel",
  "fullTitle": "The Marvelous Mrs. Maisel (TV Series 2017–2023)",
  "type": "TVSeries",
  "year": "2017",
  "items": [
    {
      "username": "quidnunq",
      "userUrl": "https://www.imdb.com/user/ur45245619",
      "reviewLink": "https://www.imdb.com/review/rw9080226",
      "warningSpoilers": false,
      "date": "26 May 2023",
      "rate": "10",
      "helpful": "53 out of 56 found this helpful.",
      "title": "Just finished the very last episode!",
      "content": "I've been on top of this series right from the moment it premiered. I looked forward to every single season and even set notifications to make sure I wouldn't forget to start watching again once a new season came out. The Marvelous Mrs. Maisel did something that not many other series have ever done before, which is getting better and better with every new season! I don't even think I've seen a single episode that bored me. Not even a little! The character building, the actors, the settings, the outfits, the jokes, the storyline, all of it was absolute perfection.I've told so many people about this series and it amazes me - but equally annoys me - that this series got so little media attention (at least where I'm from). It should've gotten at least as much attention as Game of Thrones and The Walking Dead. (Both of which actually DID have several to many episodes that bored the hell out of me, just saying. I didn't even finish The Walking Dead - I mean, who did?! - because at some point the series literally died and kept walking.)I'm sure some people might not agree with me, but let's be honest; the rating doesn't lie. This series is an absolute and unique piece of art!About the actors. Rachel Brosnahan did an amazing job as Midge Maisel... but the series wouldn't have been the same without Alex Borstein (Susy Myerson) and Tony Shalhoub (Abe Weissman)! These two take comedy to a whole new level and I love them for it!"
    },
    {
      "username": "Songwriter_90210",
      "userUrl": "https://www.imdb.com/user/ur29043205",
      "reviewLink": "https://www.imdb.com/review/rw3857689",
      "warningSpoilers": false,
      "date": "14 November 2017",
      "rate": "9",
      "helpful": "264 out of 326 found this helpful.",
      "title": "I had to run to IMDb to review this one.",
      "content": "This. This is what it a real comedy series should be. They've also found a real charmer in Rachel Brosnahan, who's not just lovely and energetic, but genuinely funny. A cast of bright characters with great writing rounds out this great show. The other guys could learn a thing or three from The Marvelous Mrs. Maisel.This fresh-feeling comedy, the brainchild of Daniel Palladino & Amy Sherman-Palladino leaves almost nothing to be desired. This is a full-bodied comedy series that really grabs your attention and never lets it go. Everything from the camera work, to the sets, to costuming is very well done and does a more than adequate job in immersing you in a lush, colorful, mid-century snapshot of 1960's New York.Miriam \"Midge\" Maisel, the matriarch-in-training of her young nuclear family, exceeds by every measure to be the wife she believes her husband deserves. She dotes on him, cares for his emotional well- being, and is perfectly happy. Until changes happen that sets her on a path she's not sure she's able to handle.I can name, both with TV shows and movies, many where the focus was to witness the genesis of a stand-up comedian, or where we look into the life of a seasoned comedian, or view the last bits of a comedian's career. Usually the actor portraying the comedian (or even sometimes an actual comedian portraying one) just isn't funny. We see the story taking pains to make us believe they're hilarious by cracking up the on screen audiences, winning awards or accolades, and receiving praise. It never really works, because unless you can make ME, the real audience, believe he or she is funny, it hasn't done its job. Rachel Brosnahan is funny. Her timing is perfect. And obviously the jokes have to be good, so the writers are no slouches either, but the material goes nowhere unless you have the right person delivering that dialogue. They've found her. Effortlessly, Brosnahan delivers line after line of well written material with a confidence, brashness, and stereo-typically New York swagger that has you saying \"yeah, I can see her doing stand-up\". That's rare, and that's very special. De Niro couldn't do it in \"The Comedian\". Sally Field couldn't do it in \"Punchline\". Heck, Adam Sandler couldn't really pull it off well in \"Funny People\". And it has FUNNY in the name for Christ's sake!The rest of the cast is a manic pleasure, and the show has done a great job with who they've cast to be her family. Tony Shalhoub wasn't in the pilot much, but now that the rest of the episodes have become available for streaming, I see that he stands out with great dialogue he was given and an intensity I hadn't before seen in him. It works. As well, Marin Hinkle who plays Midge's mom, does a wonderful job in the role. We see her character expand exponentially from the pilot with the new episodes. Every fall that rolls around, I get excited to see the shows and which ones I think will swim or sink, and I believe we have a winner here. What may seem to be a standard, formulaic \"dramedy\" really has a feel of its own. There are comparable shows in level of quality, but as far as I'm concerned, none just outright better. I hope it maintains its quality and has a nice, long run."
    },
    {
      "username": "redmondgarmony",
      "userUrl": "https://www.imdb.com/user/ur95542617",
      "reviewLink": "https://www.imdb.com/review/rw4500367",
      "warningSpoilers": false,
      "date": "8 December 2018",
      "rate": "10",
      "helpful": "176 out of 226 found this helpful.",
      "title": "Bring on Season 3 PLEASE!!!",
      "content": "Superb writing, comic geniuses are definitely on board. The sight gags in Series 2 (eg Susie's plunger and camp stalker, the telethon) are especially priceless. Arguably the funniest and most philosophical show, well balanced with drama, I've ever seen. The setting, wardrobe, music and production is impeccable and elevates this above anything in decades."
    },
    {
      "username": "penniweninger",
      "userUrl": "https://www.imdb.com/user/ur17677651",
      "reviewLink": "https://www.imdb.com/review/rw3666879",
      "warningSpoilers": false,
      "date": "20 March 2017",
      "rate": "10",
      "helpful": "271 out of 343 found this helpful.",
      "title": "Crisp, fresh, hilarious",
      "content": "We've recently retired and are enjoying a lot of television time. The good news is there is a lot of TV available. The bad news is that it can't possibly all be good. At some point as you flick through the options, you can't help but laugh at the absurdity of some of these shows. I get the challenge to producers and artists to fill hundreds of channels, 24/7, I really do. I've learned to seriously adjust my expectations. But frankly, the ones that look promising and don't deliver are more disappointing than the ones that didn't look appetizing in the first place. You get what I'm saying, right? All that said - don't be afraid to have high expectations of this show. Just make sure you listen closely to the dialog so you don't miss one delicious bit of hilarity which often occurs in simultaneous dialogue at a dramatic moment.The acting is crisp, the caricatures of a rich New York Jewish family in the 50s are spot on. Rachel Brosnahan is intelligent, independent, strong and funny. Her energy paired with Alex Borstein's drollness leaves me clamoring to find out how this all plays out. (PS - if you like it, I encourage you to take the time to fill out Amazon's survey which will help them decide whether to continue this series. I'd hate to see it go the way of their terrific series, Good Girls Revolt, which was discontinued after one season because it premiered in the thick of the 2016 election when its primary audience was otherwise occupied.)"
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw8000809",
      "warningSpoilers": false,
      "date": "24 March 2022",
      "rate": "7",
      "helpful": "96 out of 140 found this helpful.",
      "title": "Brilliant start but the shine goes off by Season 2 and by Season 3 it's annoyingly stale and repetitive",
      "content": "(Reviewed after Season 4).It's 1958 and Miriam \"Midge\" Maisel and her husband Joel seem to have everything they ever wanted. Then Joel leaves Midge for his secretary and her world falls apart. In a drunken rage she lets out all of her anger and frustration in a passionate rant...and discovers she has a talent for comedy. Could this be her calling?I was hooked on this show almost from the first minute and in Season 1 it just seemed to get better and better. Very funny with a decent plot and some good dramatic moments. Rachel Brosnahan is wonderful, and gorgeous, as Midge, giving her character a great sense of fun, gaiety and quick-wittedness and making for a great amount of character engagement.Equally impressive is Alex Borstein (of Family Guy fame) as Susie Myerson, Midge's agent. The banter between her and Midge is off-the-charts great, especially in the first two seasons or so.Completing a trio of great performances and characters is Luke Kirby as the great Lenny Bruce. Weaving in an historic comedian, and one of the magnitude and influence of Lenny Bruce, adds a great sense of realism to proceedings.Throw in a solid performance by Michael Zegen as Joel and some great supporting characters - Imogene (played by Bailey De Young), Zelda the maid (Matilda Szydagis), the hysterical fortune teller (who really should get much more screentime she's that funny) - and you have a warm, funny, engaging show.Not all the characters are great though and this is where the negatives start. All four parents of Midge and Joel are incredibly irritating - individually obsessive-compulsive, prissy, overbearing, rude and intrusive. Their traits are initially quirky and funny but the writers keep using these over and over again as punchlines. It becomes very repetitive and annoying, very quickly.Worse still, these four characters get more and more screentime as the series goes on. Initially I thought they were just there as background characters, to show Midge and Joel's life and the effect of them splitting up, and that they would just fade from the scene as Midge's career takes off. Unfortunately, the opposite occurs. They become major characters, with their own sub-plots, independent of Midge's life.This makes for an uneven viewing experience from Season 2 onwards. On the one hand we have the engaging, funny scenes involving Midge and Susie (and Lenny Bruce or Imogene on occasion) and on the other the irritating scenes involving the parents.Season 3 took another step backwards when some of the Midge-Susie sub-plots and developments became quite silly. There's still the occasional zinger but the writing lacks the freshness of Season 1, relying largely on quickfire banter that by now is repetitive and annoying.Season 4 is more of the same, complete with plot development that doesn't make much sense. Every time Midge catches a break she deliberately messes it up or turns it down, seemingly based on the flimsiest of principles. The engagement factor wanes when the hero keeps making stupid, self-destructive decisions. It's as if the producers and writers are deliberately avoiding progressing the plot, likely to draw out the number of seasons and thus maximise revenue.Minimise the screentime of the parents, focus entirely on Midge, have a plot that moves forward rather than goes around in circles and this would make a brilliant mini-series. But where's the money in only making 10 or so episodes...?If there is a Season 5 (and it looks like there will be), I won't be watching it.Season ratings: S1 9/10, S2 8/10, S3 6/10, S4 5/10."
    },
    {
      "username": "karenn1",
      "userUrl": "https://www.imdb.com/user/ur7151326",
      "reviewLink": "https://www.imdb.com/review/rw4237244",
      "warningSpoilers": false,
      "date": "13 July 2018",
      "rate": "10",
      "helpful": "112 out of 141 found this helpful.",
      "title": "What a Gem! Amazing Doesn't Begin to Cover it.",
      "content": "I almost missed this series. I was half way through the first episode, wasn't invested in any of the characters, and saw nothing amazing enough to make we watch the second episode. But, I hung in, deciding to watch the entire episode, as I had some free time to waste. There's something like a nuclear bomb that gets dropped just before this episode ends, and if you miss that, you'll miss the brilliance behind the rest of the series. Midge suddenly becomes, and remains, so much more than amazing. She's one of the most delicious characters I've seen in a very long time. Clever repartee, an array of quirky characters, and a machine gun approach to dialogue that drew me into hanging onto every exchange, even though I usually agonize through four letter words. They aren't constant enough to assault those who don't appreciate them, so it was a small price to pay for some of the best screenwriting I've seen in a long time. Don't miss this series!"
    },
    {
      "username": "martinpersson97",
      "userUrl": "https://www.imdb.com/user/ur45812214",
      "reviewLink": "https://www.imdb.com/review/rw9093117",
      "warningSpoilers": false,
      "date": "1 June 2023",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "One of the best TV shows ever made",
      "content": "A lot of people would say we are in a \"Golden Age\" of television, providing feature quality series with acclaimed actors and indepth writing. And whilst it is of course somewhat debatable as there has always been great shows, it is indeed true that TV has gone through a great revolution.The Marvelous Mrs. Maisel is a great period-piece that offers great drama, in a somewhat lighthearted fashion, and showcasing incredible actors who sells the melancholiness and satire that one coveys beautifully.It is a very near show overall, in terms of both cinematography, cutting and editing and writing and acting. Definitely a unique and great piece that I can not recommend enough!"
    },
    {
      "username": "postofficecb",
      "userUrl": "https://www.imdb.com/user/ur115622090",
      "reviewLink": "https://www.imdb.com/review/rw7826168",
      "warningSpoilers": false,
      "date": "2 February 2022",
      "rate": "9",
      "helpful": "25 out of 31 found this helpful.",
      "title": "The most refreshing comedy in years",
      "content": "This is a comedy about stand-up comedy, so it has to be pretty darn witty. And it is. But it's so much more.The characters are incredibly likeable, particularly the lead who suffers sexism and setbacks with a plucky determination and a dream all her own. Those surrounding her are fascinating and unique, from her father (wonderfully played by Tony Shalhoub) to her manager and others, including a recurring version of Lenny Bruce, which is quite a gas.The setting offers more flavour as we see, hear and smell late 50s Manhattan, particularly through the lens of an upper middle class Jewish-American family.It's a show that is rich in personality and consistently so over 3 seasons. You'll be hooked by episode 2. Enjoy and, ahem, \"tits up\"."
    },
    {
      "username": "mazzacurry",
      "userUrl": "https://www.imdb.com/user/ur67734750",
      "reviewLink": "https://www.imdb.com/review/rw9080731",
      "warningSpoilers": false,
      "date": "27 May 2023",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "I wish it wouldn't end!!",
      "content": "That being said it's one of the best endings of a series I've ever seen. I Love that all the supporting actors were included, too many times they are left behind when in reality they make the show more interesting and relevant. It's hard to find shows that are this well written, not to mention the authentic amazing sets and fashion. It's refreshing to have a story without the shock and awe, or violence. This was such a poignant story on so many levels, but you always laugh!! I don't know how they got the set to capture NYC so amazingly and realistic! A bow to to the costume designer and wardrobe, brilliant and accurate fashion design!! More please!"
    },
    {
      "username": "jordan2240",
      "userUrl": "https://www.imdb.com/user/ur1602433",
      "reviewLink": "https://www.imdb.com/review/rw5357482",
      "warningSpoilers": false,
      "date": "27 December 2019",
      "rate": "5",
      "helpful": "96 out of 145 found this helpful.",
      "title": "We keep watching, but I'm not sure why",
      "content": "By season 3, the main character has gotten almost too annoying to watch. I find the rhythm in her dialog delivery grating, and the character herself is deserving of little respect and empathy. The Susie and Abe characters generally delivered the only humorous lines in the show (which were few and far between), but Susie has gotten to the point where they are relying solely on vulgarity for humor, which misses more than it hits (though it does hit occasionally). I think they've added too many story lines in season 3, and they've also added a number of musical sequences, most of which just make the episode longer than necessary. I think they could have easily cut each episode down to about half and hour, which would make it a bit easier to sit through. If there is a season 4, I'm not sure I'll continue watching. Can't speak for the wife, but she rarely even chuckles during any of the episodes, so I'm not sure how entertained she is by them either. This has become one of those series where we feel almost obligated to finish a season because we've already invested so much time in it, but as with 'The Affair,' which we stopped watching after the first couple of shows in season 5, we might not give the next season much time to impress us."
    },
    {
      "username": "supermellowcali",
      "userUrl": "https://www.imdb.com/user/ur133004424",
      "reviewLink": "https://www.imdb.com/review/rw7885031",
      "warningSpoilers": false,
      "date": "21 February 2022",
      "rate": "4",
      "helpful": "54 out of 81 found this helpful.",
      "title": "Exhausted itself",
      "content": "I thought this was a good story and a fun show in season 1. Maybe it just ran its course but the season 4 episode I just watched was tedious and not funny. Maybe if her jokes were better? The scenes were interesting at first, and shocking the audience was fun but, after that wears off, it's not very interesting."
    },
    {
      "username": "moviemom23",
      "userUrl": "https://www.imdb.com/user/ur67612591",
      "reviewLink": "https://www.imdb.com/review/rw5322099",
      "warningSpoilers": true,
      "date": "15 December 2019",
      "rate": "6",
      "helpful": "47 out of 68 found this helpful.",
      "title": "Started s. 3 but I think I might be done",
      "content": "Season 1 was amazing. Season 2 was a mixed bag but I mostly enjoyed it. Season 3 is getting unwatchable for me.It's weird, I still do love the main characters, but something happened when Shy Baldwin came on the scene. It's not the same. He was great for a foil for her success, but as a main character it feels very forced and now there's just too many side stories. What happened to Ben? She just drops him like a hot potato, and boom he's gone... I feel like watching Season 2 was a waste of time.And I must agree with many other reviewers, she's an awful mother. Her son is disturbing to watch, I feel so sorry for the kid. She truly doesn't give a crap about him!Sure, it's a shallow show, it's fun, colorful, and frenetic, I get that. It feels like a silly Broadway show at times. But when the serious stuff gets shoved in, it feels wrong. Season 3 is a mess. Characters acting out of character, new characters and side storylines are annoying (the beatnicks, ugh). When it's not funny, it's hard to forgive the glaring inconsistencies. I think this show needs to decide what it wants to be, and make a commitment to who the main characters are and stick with them, let them grow but don't make them do stuff the person in Season 1 would NEVER do (Abe opening his home to those weirdos, the Mom giving up her inheritance..nope)So yeah, unless nothing else is on, I'm done. It was fun while it lasted!"
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw5621568",
      "warningSpoilers": false,
      "date": "9 April 2020",
      "rate": "7",
      "helpful": "53 out of 82 found this helpful.",
      "title": "show commits suicide in S03 -- no note found at the scene",
      "content": "Wasn't streaming supposed to usher in a new universe where shows got better over time without the network watchdogs on their heels? First season brilliant. Awards. Prestige. Double everyone's salary. Learn how to graciously accept awards. Second season did not raise the bar but thankfully held it. Third season cringe-worthy, episodes so off-track you will wear out the fast forward button. As if the writers/producers developed amnesia and forgot what made the show a hit in the first place."
    },
    {
      "username": "mainspring-03696",
      "userUrl": "https://www.imdb.com/user/ur89256601",
      "reviewLink": "https://www.imdb.com/review/rw7905030",
      "warningSpoilers": false,
      "date": "28 February 2022",
      "rate": "4",
      "helpful": "27 out of 35 found this helpful.",
      "title": "Season 4 has got to pot",
      "content": "The show has gone so far away from Seasons 1-3 that after watching S04 Ep 1, we won't waste any more time on this show.What on earth happened to the writers and video crew? Perhaps they were on pot and forgot what they were supposed to be doing."
    },
    {
      "username": "samsonchui",
      "userUrl": "https://www.imdb.com/user/ur117947687",
      "reviewLink": "https://www.imdb.com/review/rw7896237",
      "warningSpoilers": false,
      "date": "25 February 2022",
      "rate": "5",
      "helpful": "39 out of 47 found this helpful.",
      "title": "Season 4? You mean season bore",
      "content": "My favourite show for last 3 seasons..... Then it became dull AFI've watched 4 episodes of season 4, and I'm like what am I watching?It's gotten so bad that I wonder what happened?So much yelling....so much less funny.Please go back to her career.So far it doesn't even seem you watch any Mrs Maisel, more like \"the main actress couldn't make it so.....let's do 4 episodes about Abe and The in laws\".I know it's too late to give my opinion, hoping they'll make a better season 4.But, maybe if this previously amazing show doesn't get canceled they'll fix season 5?"
    },
    {
      "username": "fwdixon",
      "userUrl": "https://www.imdb.com/user/ur12637906",
      "reviewLink": "https://www.imdb.com/review/rw4776327",
      "warningSpoilers": false,
      "date": "12 April 2019",
      "rate": "5",
      "helpful": "65 out of 99 found this helpful.",
      "title": "Meh",
      "content": "I just binge watched both seasons of Mrs. Maisel.Frankly, I was not impressed, especially by Season 2, in which the show went completely off the tracks.The Mrs. Maisel stand up comedy is, well, not funny, rarely bringing a smile to my face.Are we to believe 50's audiences would enjoy this woman's constant self-pitying whining and kvetching?Since the entire premise of the show is what a fantastic talent Mrs. M is (as her Greek chorus of sycophants never tire of telling us), this is a serious problem.I also have a problem with the rapid rise of Mrs. M in the stand up world and her amazing ability to meet celebrities of the era, it's way too contrived.But the main problem is that the Mrs. Maisel character isn't likeable - she's a spoiled, self-centered, self-pitying Jewish American princess with an overinflated sense of entitlement. She treats her children like accessories, dumping them off at her parents while she pursues her questionable comedy career.EDIT: Season 3 wasn't bad and Season 4 left me wanting to see more Midge."
    },
    {
      "username": "trademarcdesigns",
      "userUrl": "https://www.imdb.com/user/ur89157373",
      "reviewLink": "https://www.imdb.com/review/rw7666187",
      "warningSpoilers": false,
      "date": "21 December 2021",
      "rate": "7",
      "helpful": "16 out of 20 found this helpful.",
      "title": "Great start but slipping off the rails",
      "content": "I thought Season 1 was great. By no means an accurate reflection of life in the 1950's, but hey, all sitcoms are 90% fantasy, right?Season 2 seemed to start going off the rails a bit. Not too far off, but the show was slipping.By Season 3 I was beginning to wonder if I was watching the same show. Instead of seeing Midge's stand-up routines - one of the funniest parts of the two previous seasons - we were now listening to Shy Baldwin crooning - again and again and again - often the same song, always the same style. It got old fast.The narration, which was new to the 3rd season and might have been quirky as a one-off, very quickly became forced and tedious. And by the end of the season, Midge Maisel is no longer the up-and-coming comedy star, but rather the schlemiel who can't win for losing. I wonder how they plan to recover from this...I intend to check out Season 4 on the chance that Season 3 was an aberration, but I won't be holding my breath.And finally, I hope everyone realizes that some of those fabulous hats were worn backwards. The pretty bows usually went in the back or on the side. Just sayin'..."
    },
    {
      "username": "Scott_Mercer",
      "userUrl": "https://www.imdb.com/user/ur2169553",
      "reviewLink": "https://www.imdb.com/review/rw5403923",
      "warningSpoilers": false,
      "date": "13 January 2020",
      "rate": "1",
      "helpful": "98 out of 162 found this helpful.",
      "title": "Irritating",
      "content": "Unrealistic overwritten dialog, contrived storytelling and woeful plot mechanics.Can't identify with any of the characters as they are not real people but cardboard stereotypes, so the viewer has no stakes in the outcome.If you want good 50s/60s atmosphere with cars, clothing, etc., instead watch Mad Men again, one of finest television programs ever made."
    },
    {
      "username": "hedrummond",
      "userUrl": "https://www.imdb.com/user/ur15505227",
      "reviewLink": "https://www.imdb.com/review/rw9080013",
      "warningSpoilers": false,
      "date": "26 May 2023",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "The Best Show Ever",
      "content": "I was so surprised that so many people were writing such crap about this show. I mean their lack of intelligence and breeding clearly exhibits what has gone wrong with the Trumpers of this country. This is perhaps the best show that there ever was. I saw where people were saying season five was bad - it wasn't. Some people said it was unfunny when in fact my neighbor and I were falling out of our chairs laughing at the antics other shows never had the guts to try. Mrs. Maisel's last monologue clearly was the funniest I have ever seen and also the most heartfelt as it brought tears to my eyes and a lump in my throat. I am going to miss this show as it is the one series that I look forward to watching. I am going to be 80 in July and I can truly say the show really depicted the era it was about and that last scene between Lenny Bruce and Midge was so sad because it was probably the last time the two characters would probably be sitting down for dinner together as it wasn't long afterwards that Lenny was bound dead in his bathroom of a drug overdose Lenny Bruce was a tragedy waiting to happen. What a lot of these miscreants and naysayers don't get is that sometimes there is pathos in humor which is sad, because you have to have experienced sadness to truly experience comedy because it's comedy that gets you through the times that truly suck."
    },
    {
      "username": "jgreco7",
      "userUrl": "https://www.imdb.com/user/ur14033065",
      "reviewLink": "https://www.imdb.com/review/rw9016663",
      "warningSpoilers": false,
      "date": "25 April 2023",
      "rate": "5",
      "helpful": "20 out of 27 found this helpful.",
      "title": "A bagel with a schmear",
      "content": "\"The Marvelous Mrs. Maisel,\" in its fifth and final season (oy gevalt!), is proof that even for a clever idea, like Mrs. Adler's Gefilte fish, there is no such thing as an unlimited shelf-life. What began six years ago as a nostalgic trip to the halcyon fifties and a housewife's unlikely rise in stand-up, harking back to those early days of Borscht Belt comedy, has now reverted to type: a potpourri of Jewish jokes as as stale as week-old challah.Reuniting the team of Brosnahan and Borstein, in their Emmy-winning roles as comic and agent, the series resumes Amy Sherman-Palladino's feminist fantasy that poses a what-if story about a Joan Rivers type and the actual Lenny Bruce, who meet cute (in lockup for indecency, of course) and become fast friends and lovers. Granted, an improbable premise, yet a promising one that delivers at first, but soon goes trite and forced, and so unconvincing as to be less fiction than science fiction.Rivers was, arguably, a trailblazing performer, like Bruce, but far more mainstream and middle-America acceptable than he (at least in early days). After all, one doesn't become Ed Sullivan's favorite, as Rivers was proud to admit, with off-color humor and an arsenal of f-bombs like that of Pallidino's dream girl. The salty gal from Larchmont in Channel suits and pearls is reimagined here as an upper east-side JAP with children and brisket, who assumes her husband's unsuccessful sideline in stand-up one night in a drunken free-for-all, expletives not deleted. It's a lark with schtick that sets her on a path to moderate success. (Although Rivers is apparently the inspiration, the more likely one would be Jewish actress and screenwriter Gertrude Berg, of the Park Avenue Bergs, who never hung a wash out a window.) With her inveterate cap-wearing sidekick in tow, Mrs. Maisel, as she's billed, sets out on a series of improbable--yet comically hopeful and emancipating--adventures in show biz, in pristine period sets and clothes, the way a fantasist always remembers the past. Her humor doles out slices of life, more indoctrinating than self-effacing like Rivers, and always seems filtered through a contemporary, me-too sensibility, as if to suggest a routine of a comic transported backward in time (hence, science fiction). Unfortunately, the jokes fall flat, as they usually do in movies about stand-up comics (compare \"This Is My Life,\" \"Punchline,\" and \"Lenny\"), where only the on-screen audience provides laughter, on cue.Palladino, a cockeyed visionary, and a likely student of screwball comedy, especially its sharp-witted, snappy banter, has taken great pains to make her dialogue swing in true screwball spirit; however, her wisecracking comes off not so much as effortlessly as labored, and more imposed for effect than natural (compare Mark Sandrich, Ernst Lubitsch, Billy Wilder, and Leo McCarey).After six seasons, tedium has set in like rigor mortise. If you suspend credulity, as the series has done, you might watch just to enjoy the scenery, the mid-century decor and couture (apparently, everyone in the fifties followed the latest trends), as well as the popular tunes on the hit parade. After all, chopped liver ain't chopped liver without some schmaltz."
    },
    {
      "username": "jkp-309-258974",
      "userUrl": "https://www.imdb.com/user/ur32151722",
      "reviewLink": "https://www.imdb.com/review/rw5357760",
      "warningSpoilers": false,
      "date": "27 December 2019",
      "rate": "6",
      "helpful": "34 out of 44 found this helpful.",
      "title": "Season 3, Episode 1, shark has been jumped.",
      "content": "Season 1: 9/10, Season 2: 9/10, Season 3: 1/10 equals 6 stars overall. I'm not great at math, but you get the idea.Really enjoyed the first two seasons. It was a different, quirky comedy with a fantastic cast. So many great Actors in this show! There are a lot of reviews of those first two seasons, and I'll leave you to read those and I will concentrate on the disappointing, disastrous season 3.What a struggle it's been to get through these eight episodes! As I was watching episode one, I kept waiting for the show I expected. Instead I got a lot of singing and lots of absolutely nothing happening. And the episodes after, I still got a lot of singing. So strange to spend that much time listening to a guy with a very nice voice but who I care nothing about.Everything just comes crashing down. You are left not liking any of the characters you have come to love. What a waste! Who in the heck approved these scripts?!?My advice is to stop after season two, because the shark jump is so painful you won't remember the good times."
    },
    {
      "username": "jiju10",
      "userUrl": "https://www.imdb.com/user/ur15594199",
      "reviewLink": "https://www.imdb.com/review/rw8133475",
      "warningSpoilers": false,
      "date": "11 May 2022",
      "rate": "5",
      "helpful": "26 out of 32 found this helpful.",
      "title": "Loved it till Season 4",
      "content": "When Marvelous Mrs Maisel premiered in 2017, it brought with it an intriguing, powerful, and well-written critique on women in society. The show managed to create a terrific balance of comedy and drama because to Miriam's wit and comedic prowess on stage, more than holding her own against husband Joel.Unfortunately, great visuals and sets can only take you so far. All of your hard work will be for naught if you don't have an engaging story or effective character development. Season 4 broadcasts out to hush, which is a shame because there are glimmers of brilliance in this series, but instead of loud laughs."
    },
    {
      "username": "riverzak",
      "userUrl": "https://www.imdb.com/user/ur36356297",
      "reviewLink": "https://www.imdb.com/review/rw8018899",
      "warningSpoilers": false,
      "date": "30 March 2022",
      "rate": "2",
      "helpful": "24 out of 33 found this helpful.",
      "title": "Season Four Has Lost Its Way",
      "content": "It took a few episodes of season one before I was hooked. The story arc through the first three seasons was interesting and the characters were well written and entertaining. That all goes away in season four where Midge's career has come to a standstill. Season four seems to have no forward momentum at all, and now we are just treated to characters who talk non-stop rapid-fire. It would be one thing if the dialog was interesting, but unfortunately it's just annoying."
    },
    {
      "username": "caeevans",
      "userUrl": "https://www.imdb.com/user/ur20491709",
      "reviewLink": "https://www.imdb.com/review/rw7920291",
      "warningSpoilers": false,
      "date": "5 March 2022",
      "rate": "2",
      "helpful": "29 out of 39 found this helpful.",
      "title": "Season 4, is this a comedy?",
      "content": "I don't know what the ... happened, but this season is appalling. It is not funny, the story line is repeating itself and some of the choices the characters are making, just don't make sense. I understand that there will be a season 5, but let's face it, if anyone keeps watching, it will only be to see Susie."
    },
    {
      "username": "mmwea",
      "userUrl": "https://www.imdb.com/user/ur102886446",
      "reviewLink": "https://www.imdb.com/review/rw5313800",
      "warningSpoilers": false,
      "date": "11 December 2019",
      "rate": "1",
      "helpful": "73 out of 110 found this helpful.",
      "title": "UNWATCHABLE-ABOVE ALL, UNFUNNY!",
      "content": "I am so tired of hearing people rave about this juvenile show. What is the matter with our culture-to think that this inane show is worth watching? I have tried and tried; I think I've watched the first three or four episodes at least twice each, but I always just get angry. Have our standards really fallen that much? The worst thing about it is that she never says a single thing that's funny. You have all these audiences laughing their heads off, and you don't even smile, because none of it is funny. It's just awful. It's also loaded with period anachronisms and NY Jewish stereotypes, but that's another story. Ugh!"
    }
  ],
  "errorMessage": ""
}