{
  "imDbId": "tt5788792",
  "title": "The Marvelous Mrs. Maisel",
  "fullTitle": "The Marvelous Mrs. Maisel (TV Series 2017–2023)",
  "type": "TVSeries",
  "year": "2017",
  "language": "en",
  "titleInLanguage": "The Marvelous Mrs. Maisel",
  "url": "https://en.wikipedia.org/wiki/The_Marvelous_Mrs._Maisel",
  "plotShort": {
    "plainText": "The Marvelous Mrs. Maisel is an American period comedy-drama television series that was created by Amy Sherman-Palladino, and premiered on Amazon Prime Video on March 17, 2017. It takes place mainly in the late 1950s and early 1960s, with flashforwards to later decades in the final season, and stars Rachel Brosnahan as Miriam \"Midge\" Maisel: a New York housewife who discovers she has a talent for stand-up comedy and pursues a career in this field. It also stars Alex Borstein, Michael Zegen, Marin Hinkle, Tony Shalhoub, Kevin Pollak, Caroline Aaron, Jane Lynch and Luke Kirby. The pilot episode received critical acclaim and the series was picked up by Amazon Studios. The fifth and final season premiered on April 14, 2023, and concluded on May 26, 2023.\r\nThe series has also received critical acclaim. It won the Golden Globe Award for Best Television Series – Musical or Comedy in 2017 and the Primetime Emmy Award for Outstanding Comedy Series in 2018, with Sherman-Palladino receiving the awards for Outstanding Directing and Outstanding Writing at the latter ceremony. Brosnahan won the Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series in 2018 and two consecutive Golden Globe Awards for Best Actress – Television Series Musical or Comedy in 2018 and 2019. Borstein won the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series twice consecutively, in 2018 and 2019; and Shalhoub and Kirby won Outstanding Supporting Actor in a Comedy Series and Outstanding Guest Actor in a Comedy Series in 2019, respectively.",
    "html": "<p>The Marvelous Mrs. Maisel is an American period comedy-drama television series that was created by Amy Sherman-Palladino, and premiered on Amazon Prime Video on March 17, 2017. It takes place mainly in the late 1950s and early 1960s, with flashforwards to later decades in the final season, and stars Rachel Brosnahan as Miriam \"Midge\" Maisel: a New York housewife who discovers she has a talent for stand-up comedy and pursues a career in this field. It also stars Alex Borstein, Michael Zegen, Marin Hinkle, Tony Shalhoub, Kevin Pollak, Caroline Aaron, Jane Lynch and Luke Kirby. The pilot episode received critical acclaim and the series was picked up by Amazon Studios. The fifth and final season premiered on April 14, 2023, and concluded on May 26, 2023.</p><p>The series has also received critical acclaim. It won the Golden Globe Award for Best Television Series – Musical or Comedy in 2017 and the Primetime Emmy Award for Outstanding Comedy Series in 2018, with Sherman-Palladino receiving the awards for Outstanding Directing and Outstanding Writing at the latter ceremony. Brosnahan won the Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series in 2018 and two consecutive Golden Globe Awards for Best Actress – Television Series Musical or Comedy in 2018 and 2019. Borstein won the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series twice consecutively, in 2018 and 2019; and Shalhoub and Kirby won Outstanding Supporting Actor in a Comedy Series and Outstanding Guest Actor in a Comedy Series in 2019, respectively.</p>"
  },
  "plotFull": {
    "plainText": "The Marvelous Mrs. Maisel is an American period comedy-drama television series that was created by Amy Sherman-Palladino, and premiered on Amazon Prime Video on March 17, 2017. It takes place mainly in the late 1950s and early 1960s, with flashforwards to later decades in the final season, and stars Rachel Brosnahan as Miriam \"Midge\" Maisel: a New York housewife who discovers she has a talent for stand-up comedy and pursues a career in this field. It also stars Alex Borstein, Michael Zegen, Marin Hinkle, Tony Shalhoub, Kevin Pollak, Caroline Aaron, Jane Lynch and Luke Kirby. The pilot episode received critical acclaim and the series was picked up by Amazon Studios. The fifth and final season premiered on April 14, 2023, and concluded on May 26, 2023.\r\nThe series has also received critical acclaim. It won the Golden Globe Award for Best Television Series – Musical or Comedy in 2017 and the Primetime Emmy Award for Outstanding Comedy Series in 2018, with Sherman-Palladino receiving the awards for Outstanding Directing and Outstanding Writing at the latter ceremony. Brosnahan won the Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series in 2018 and two consecutive Golden Globe Awards for Best Actress – Television Series Musical or Comedy in 2018 and 2019. Borstein won the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series twice consecutively, in 2018 and 2019; and Shalhoub and Kirby won Outstanding Supporting Actor in a Comedy Series and Outstanding Guest Actor in a Comedy Series in 2019, respectively.\r\nPremise\r\nSeason 1: In 1958 New York City, Miriam \"Midge\" Maisel, a young, affluent Jewish-American housewife, embarks on a stand-up comedy career after husband Joel, an untalented amateur comic, abruptly leaves her following his dismal set at The Gaslight Café. Drunk and dejected, Midge returns to the Gaslight in her nightgown, and in a bawdy impromptu set, vents her predicament before being arrested for indecency. Midge meets famed comic Lenny Bruce when he is arrested the same night for using profanity in his act. Gaslight manager Susie Myerson, recognizing Midge's raw talent, coaches her on improv comedy.\r\nSeason 2: As Midge secretly hones her comic skills at the Gaslight Café, she and Susie also hit the road. Touring is hard and female comics are generally disparaged and discriminated against. Midge rejects comedian Sophie Lennon's notion that female comics need a gimmicky persona to compete in a male-dominated field and instead performs as herself, adopting the stage name, \"Mrs. Maisel\". After Midge disparages Sophie's corny act, Sophie's vindictive manager gets Midge blacklisted from New York clubs. Midge perseveres and gets a huge break as the opening act for famous singer Shy Baldwin's upcoming tour.\r\nSeason 3: Midge balances career and family life while touring with Shy Baldwin; she retools her act for non-New York audiences. After divorcing, Midge and Joel remain in each other's lives while navigating new relationships. Joel branches out by opening a small nightclub in New York's Chinatown, soon discovering the landlords operate an illegal gambling den downstairs. Tensions arise when Midge objects to Susie managing other clients, including Sophie Lennon, though she eventually relents. However, Midge is unaware that Susie increasingly relies on mob connections for professional assistance. After carelessly alluding to Shy's homosexuality during a set, Midge is fired.\r\nSeason 4: Following the Shy Baldwin debacle, Midge vows to only do headliner gigs, though with little success. Sophie Lennon gives Midge a professional break before jealously thwarting her career again. Meanwhile, Joel's busy nightclub draws unwanted attention to his landlords' illegal activities. Midge becomes the comic emcee at the Wolford burlesque club, contentedly languishing there until a police raid closes it. Lenny Bruce helps Midge regain her confidence and reboot her career.\r\nSeason 5: The story covers the 1960s – 2000s. In the early 60s, Midge, still struggling professionally, is hired as a writer for The Gordon Ford Show and competes against male co-workers. Glimpses into the future reveal: Midge fires manager Susie after learning her mob ties entangled Joel in illegal activities to protect Midge. As Midge's career climbs, Lenny Bruce descends into drug addiction. After seizing an opportunity, Midge becomes a major comedy star but has a messy personal life with multiple marriages, lost loved ones, strained relationships, including her two adult children, and eventual reconciliations. Throughout, Midge and Joel stay close.\r\nCast and characters\r\nMain\r\nRachel Brosnahan as Miriam \"Midge\" Maisel (née Weissman), an upper-middle class Jewish American housewife and mother who discovers her flair for stand-up comedy after husband Joel abruptly leaves her. Fashion-obsessed and hyper-competent, Midge is hired as a make-up counter girl at B. Altman and starts performing stand-up comedy in clubs across New York, eventually becoming a world-famous comedian.\r\nAlex Borstein as Susie Myerson, who runs the Gaslight Cafe and later becomes Midge's manager after recognizing Midge's natural talent.\r\nMichael Zegen as Joel Maisel, Midge's estranged, later ex-husband, who leaves Midge for his secretary, Penny Pann. He is an aspiring, though untalented, stand-up comic who copies Bob Newhart's routines. Joel quits his uncle's plastics company, later works at his father's garment factory, then opens his own nightclub. Lenny Palmieri portrays a thirteen-year-old Joel in a guest appearance in the episode \"Put That On Your Plate!\".\r\nMarin Hinkle as Rose Weissman (née Lehman), Midge's fashionable and society-conscious mother who later becomes a matchmaker\r\nTony Shalhoub as Abraham \"Abe\" Weissman, Midge's fastidious erudite father, who is a tenured mathematics professor at Columbia University and a researcher at Bell Labs. He leaves academia to return to his social activist roots and later becomes the theater critic for The Village Voice.\r\nKevin Pollak as Moishe Maisel (seasons 2–5, recurring season 1), Joel's supportive father and the owner of Maisel & Roth Garment Company\r\nCaroline Aaron as Shirley Maisel (seasons 3–5, recurring seasons 1–2), Joel's somewhat overbearing but loving mother\r\nJane Lynch as Sophie Lennon (season 3, recurring seasons 2 and 4, guest seasons 1 and 5), a successful stand-up comic who uses a fat suit and shtick gimmicks to portray a frumpy, uncouth housewife from Queens in her act. In reality, she is a rich, egotistical, snobbish Manhattan socialite with refined tastes. She professionally clashes with Midge.\r\nLuke Kirby as Lenny Bruce (season 4, recurring seasons 1–3 and 5), a well-known New York City comedian and Midge's close friend and ally\r\nReid Scott as Gordon Ford (season 5, recurring season 4), a popular late-night TV talk show host who later hires Midge as a staff writer for The Gordon Ford Show\r\nAlfie Fuller as Dinah Rutledge (season 5, recurring season 4), Susie's secretary; she later is the main manager of Susie's talent agency\r\nJason Ralph as Mike Carr (season 5, recurring season 4), a talent booker and later a producer on The Gordon Ford Show\r\nRecurring\r\nJoel Johnstone as Archie Cleary, Imogene's husband and Joel's close friend and coworker\r\nBailey De Young as Imogene Cleary, Midge's best friend\r\nMatilda Szydagis as Zelda, the Weissmans' maid\r\nNunzio and Matteo Pascal (seasons 1–4), Colin Keane (season 5) as Ethan Maisel, Midge and Joel's elder child. Ben Rosenfield as an older Ethan Maisel (season 5)\r\nBen Rosenfield as an older Ethan Maisel (season 5)\r\nCandace and Kiera Magyar (season 1), Kasey and Morgan Scheuermann (seasons 2–3), Avigayl and Emunah Rosenblatt (season 4), Ireland Jade and Sedona Rose Carvajal (season 5) as Esther Maisel, Midge and Joel's younger child. Alexandra Socha as older Esther Maisel (season 5)\r\nAlexandra Socha as older Esther Maisel (season 5)\r\nBrian Tarantina as Jackie, the emcee at the Gaslight. After Tarantina's death, his character dies offscreen of a stroke in season 4.\r\nCynthia Darlow as Mrs. Moskowitz, Joel's secretary, former childhood nanny, and Penny Pann's replacement\r\nHolly Curran as Penny Pann, Joel's former secretary and girlfriend\r\nWill Brill as Noah Weissman, Midge's brother. He is secretly an analyst for the CIA.\r\nJoanna Glushak as Mrs. O'Toole, the floor supervisor at B. Altman\r\nJustine Lupe as Astrid, Midge's sister-in-law, who converted to Judaism to marry Noah Weissman. Insecure about not being born Jewish, she obsessively observes all religious practices and traditions.\r\nDavid Paymer as Harry Drake, a powerful talent agent with clients including Sophie Lennon\r\nDavid Aaron Baker as Charles Connelly, Abe's boss at Bell Labs\r\nMax Casella as Michael Kessler, Midge's lawyer and a former activist acquaintance of Abe's\r\nSteven Hauck as Dawes, Sophie Lennon's acerbic butler\r\nZachary Levi as Dr. Benjamin Ettenberg, a doctor whom Midge meets in the Catskills and is briefly engaged to after divorcing Joel\r\nErik Palladino as Frank, a low-level mob enforcer partnered with Nicky and later develops a friendship with Susie\r\nJohn Scurti as Nick, a low-level mob enforcer partnered with Frank and later develops a friendship with Susie\r\nLeroy McClain as Shy Baldwin, a popular singer who gives Midge her big break as his opening act on tour\r\nEmily Bergl as Tessie, Susie's sister\r\nColby Minifie as Ginger, Midge's B. Altman co-worker who works at the switchboard\r\nAndrew Polk as Fred, an agent that Susie networks with for booking Midge's gigs\r\nConnor Ratliff as Chester, who stalks Susie and later becomes her roommate\r\nTeddy Coluca as Manny, a worker at Maisel & Roth\r\nSterling K. Brown as Reggie, Shy Baldwin's manager\r\nStephanie Hsu as Mei Lin, a mysterious Chinese-American woman Joel dates and who has connections to an illegal gambling ring underneath Joel's new club\r\nLiza Weil as Carole Keen, a bass player in Baldwin's orchestra who becomes a friendly mentor to Midge; she is very loosely modeled on bassist Carol Kaye, though Kaye found the character an insulting representation\r\nCary Elwes as Gavin Hawk, a renowned actor and Sophie Lennon's co-star in Miss Julie\r\nJason Alexander as Asher Friedman, Abe's old friend who is a playwright\r\nWanda Sykes as comedian Moms Mabley\r\nKayli Carter as Gloria, a burlesque dancer at the Wolford\r\nGideon Glick as Alfie Zielenski, a quirky magician who Susie manages\r\nSantino Fontana as Boise, the stage manager at Wolford's, a Manhattan burlesque club\r\nHari Nef as L. Roy Dunham, a newspaper critic reviewing Midge's career\r\nKelly Bishop as Benedetta, the leader of a matchmaking consortium based in NYC\r\nJackie Hoffman as Gitta, a NYC matchmaker\r\nPatrice Johnson Chevannes as Miss Em, a NYC matchmaker\r\nMarceline Hugot as Molly, a NYC matchmaker\r\nChris Eigeman as Gabe, editor of The Village Voice\r\nMilo Ventimiglia as Sylvio, a man Midge meets at Riverside Park\r\nNina Arianda as Hedy, Gordon Ford's wife\r\nPeter Friedman as George Toledano, producer of The Gordon Ford Show\r\nGibson Frazier as Dr. Elie Klein\r\nAlexander Gemignani as Janusz, Zelda's boyfriend\r\nAustin Basis as Alvin, head writer at The Gordon Ford Show\r\nJosh Grisetti as Ralph, a staff writer at The Gordon Ford Show\r\nLucas Kavner as Cecil, a staff writer at The Gordon Ford Show\r\nEddie Kaye Thomas as Adam, a staff writer at The Gordon Ford Show\r\nMichael Cyril Creighton as Mel, a staff writer at The Gordon Ford Show\r\nEpisodes\r\nSeason 1 (2017)\r\nSeason 2 (2018)\r\nSeason 3 (2019)\r\nSeason 4 (2022)\r\nSeason 5 (2023)\r\nProduction\r\nDevelopment\r\nIn developing the series, Amy Sherman-Palladino was inspired by childhood memories of her father, a standup comedian based in New York City, and an admiration for early female comics such as Joan Rivers and Totie Fields.\r\nIn June 2016, Amazon gave the production a pilot order, with the pilot episode written and executive produced by Sherman-Palladino. In April 2017, Amazon gave the production a two-season order, to be executive produced by Sherman-Palladino and Daniel Palladino with Dhana Gilbert as a producer. On May 20, 2018, Amazon renewed the series for a third season of eight episodes. One week after season three was released, Amazon renewed the show for a fourth season. On February 17, 2022, Amazon renewed the series for a fifth and final season.\r\nCasting\r\nOn August 5, 2016, Rachel Brosnahan was cast in the pilot's lead role. In September 2016, it was reported that Tony Shalhoub and Michael Zegen had joined the pilot's main cast. On October 6, 2016, Marin Hinkle was cast in one of the pilot's main roles. In May 2017, it was reported that Joel Johnstone, Caroline Aaron, Kevin Pollak, and Bailey De Young were set to appear in recurring roles.\r\nOn May 23, 2018, Zachary Levi was announced to appear in the second season in a recurring capacity. On August 15, 2018, it was reported that Jane Lynch would reprise her role of Sophie Lennon in recurring capacity in season two.\r\nOn April 15, 2019, it was announced that Sterling K. Brown would appear in the third season in an undisclosed role. The October 14, 2019, release of the season's teaser trailer revealed that Liza Weil would also play an undisclosed character.\r\nOn June 21, 2021, Kayli Carter was announced to appear in the fourth season in a recurring capacity. Other season 4 guest stars include Milo Ventimiglia and Kelly Bishop, who both appeared on Gilmore Girls which was created by Amy Sherman-Palladino. Additional season 4 guest stars include Jason Ralph (who is Rachel Brosnahan's real-life husband) and filmmaker John Waters. For the fifth season, Reid Scott, Alfie Fuller, and Jason Ralph, were promoted to series regulars after having recurring roles in the fourth season.\r\nFilming\r\nPrincipal photography for the pilot took place from September 27 to October 14, 2016, in Manhattan. Filming for the fourth season began on January 20, 2021 and wrapped in early July 2021. Filming for the fifth season began in late February 2022 in New York City.\r\nLocations\r\nExterior shots for the Gaslight Club were filmed in October 2016 outside 96 St. Mark's Place in the Lower East Side, the building featured on the cover of Led Zeppelin's 1975 album Physical Graffiti. The building's residents were reportedly unhappy about the disruption that the production would cause.\r\nOther New York locations included The Village Vanguard jazz club on Seventh Avenue South, a vintage record store on West 4th Street, and Albanese Meats & Poultry, a butcher shop on Elizabeth Street in Little Italy. Exterior scenes set at the B. Altman department store were filmed at the B. Altman and Company Building at Fifth Avenue, while interiors were shot in a disused bank in Brooklyn.\r\nSeason 2's scenes set at the holiday resort in the Catskills were filmed on location at a holiday resort on the Oquaga Lake near Deposit. Paris scenes were filmed at various real-life locations in the 2nd arrondissement of Paris, and at the Musée Rodin at Hôtel Biron. One of the hotels in season 3 was the Fontainebleau Miami Beach.\r\nOners\r\nThe show makes frequent use of \"oners\", extended single-shot scenes. \"Going to the Catskills\" offers a two-minute oner depicting Midge and her family getting rambunctiously resettled in their summer home in the Catskills. It included a half-dozen overlapping vignettes. In \"Strike Up the Band\", in a 12-page scene, Midge comes into their apartment to find her parents fighting, with her clothes scattered everywhere. In another, Midge and Susie ride in an open Jeep to an airplane hangar where Midge will later open for Shy. The camera follows them from the Jeep into the hangar, where soldiers manhandle her onto the stage, which she crosses while waving to the nearly 1,000 soldiers facing her before she is lifted back into the Jeep.\r\nDesign\r\nThe \"apartment\" where Midge and her husband Joel live was created on the same set as the apartment where Midge's parents live, but with more modern (late-1950s) design, inspired in part by Doris Day movies, according to production designer Bill Groom. The \"retro\" typeface used for the show's logo is Sparkly by Stuart Sandler of Font Diner. The show's distinctive designs and costumes—most notably the women's hats and dresses—led the Paley Center for Media to create an exhibit called \"Making Maisel Marvelous\" in 2019.\r\nThe design of a Cuban dance number in episode 5 of season 3 was inspired by the 1964 film I Am Cuba, which is a favorite film of series cinematographer M. David Mullen.\r\nIn December 2019, two costumes from the series were acquired by the National Museum of American History at the Smithsonian Institution.\r\nRelease\r\nMarketing\r\nOn October 10, 2017, the official trailer for the first season was released. On August 9, 2018, a teaser trailer for the second season was released. On October 24, 2018, the official trailer for season two was released. From December 1–8, 2018, Amazon opened up a pop-up restaurant in Manhattan's Nolita neighborhood modeled after Carnegie Deli as it appeared during the 1950s. The restaurant served a menu much more limited than what was actually offered at the original deli with the only two sandwich options being \"The Maisel\" and \"The Susie.\" Other items offered included mini knishes, black and white cookies, cheesecake, and pickles. As the restaurant was purely for promotional purposes, nothing on the menu cost more than 99 cents, and all the proceeds went to support the Lower Eastside Girls Club.\r\nIn August 2019, to promote the show for the upcoming 71st Primetime Emmy Awards, Amazon partnered with various businesses in and around Santa Monica, California, to provide goods and services at 1959 prices. The offer to sell gasoline at $0.30 per gallon led to long queues and traffic jams in front of the gas station that offered the promotion, forcing police to intervene.\r\nPremiere\r\nThe series held its official premiere on November 13, 2017, at the Village East Cinema in New York City. It premiered as a part of Amazon's Spring 2017 pilot season on March 17, 2017. The remainder of the first season was released on November 29, 2017. The second season premiered on December 5, 2018, and the third season premiered December 6, 2019.\r\nSeason 4's release format changed from the all-at-once binge of previous seasons to weekly releases of two episodes each; the season premiered on February 18, 2022. The fifth and final season, which consists of 9 episodes, premiered on April 14, 2023.\r\nReception\r\nThe series has received broad critical acclaim. On Rotten Tomatoes, it received an overall score of 90% and an overall score of 78 on Metacritic.\r\nSeason 1\r\nOn review aggregator Rotten Tomatoes, the first season holds a 94% approval rating, with an average rating of 7.6 out of 10 based on 82 reviews. The website's critical consensus reads, \"The Marvelous Mrs. Maisel is an upbeat addition to Amazon's original offerings, propelled by a playful yet poignant performance by Rachel Brosnahan.\" On Metacritic, the series has an average weighted score of 80 out of 100, based on 27 critics, indicating \"generally favorable reviews\".\r\nThe pilot episode of The Marvelous Mrs. Maisel was one of Amazon Video's most successful ever, achieving an average viewer rating of 4.9 (out of 5). The review of the pilot in The Guardian praised the combination of Sherman-Palladino's \"banging dialogue and the utterly winning charm of Brosnahan\", while The A.V. Club praised the \"outstanding\" production design and said \"this is a series that's as confident as its heroine—and what a heroine she is.\" A critic for Slate called the episode \"a knockout\", stating that the stand-up element \"introduces a welcome streak of discipline, both verbal and thematic, into Sherman-Palladino's charming but manic work.\"\r\nThe Jerusalem Post highlighted the exceptionally well done \"Jewishness\" of the work, calling it a \"comedic delight of a show, combining Sherman-Palladino's knack for witty dialogue with the colorful, rich world of 1950s New York and the intensity of family drama and changing times.\" NPR similarly highlighted the effectiveness of the comedy in the show, calling it \"a heroic fantasy.\"\r\nSeason 2\r\nOn Rotten Tomatoes, the second season holds a 92% approval rating, with an average rating of 8.2 out of 10 based on 72 reviews. The website's critical consensus reads, \"Like Midge herself, The Marvelous Mrs. Maisel charges full speed ahead in a second season brimming with warmth, empowerment, and a whole lot of laughs.\" Metacritic assigned the season a score of 85 out of 100 based on 24 critics, indicating \"universal acclaim\". Karen Lehrman Bloch called it \"a timeless, transcendent work of art\".\r\nSeason 3\r\nOn Rotten Tomatoes, the third season holds a 79% approval rating, with an average rating of 7.6 out of 10 based on 52 reviews. The website's critical consensus reads, \"As visually spectacular as ever, The Marvelous Mrs. Maisel's banter and pace still fly with comedic fury – but shallow social commentary and wandering storylines highlight the show's increasingly superficial tendencies.\" Metacritic assigned the season a score of 75 out of 100 based on 19 critics, indicating \"generally favorable reviews\". Alan Sepinwall of Rolling Stone wrote that it offered \"a lot of energy and fancy footwork that often makes no sense\".\r\nSeason 4\r\nOn Rotten Tomatoes, the fourth season holds a 92% approval rating, with an average rating of 7.7 out of 10 based on 66 reviews. The website's critical consensus reads, \"The Marvelous Mrs. Maisel has seemingly run out of fresh material, but it continues to reward fans with expert delivery and snappy presentation.\" Metacritic assigned the season a score of 65 out of 100 based on 17 critics, indicating \"generally favorable reviews\".\r\nSeason 5\r\nOn Rotten Tomatoes, the fifth season holds a 97% approval rating, with an average rating of 7.8 out of 10 based on 38 reviews. The website's critical consensus reads, \"All good comedy sets must arrive at a final punchline, and The Marvelous Mrs. Maisel reliably nails its own with a fifth season that wisely puts Rachel Brosnahan and Alex Borstein's repartee front and center. Metacritic assigned the season a score of 80 out of 100 based on 15 critics, indicating \"generally favorable reviews\".\r\nAwards and nominations",
    "html": "<p>The Marvelous Mrs. Maisel is an American period comedy-drama television series that was created by Amy Sherman-Palladino, and premiered on Amazon Prime Video on March 17, 2017. It takes place mainly in the late 1950s and early 1960s, with flashforwards to later decades in the final season, and stars Rachel Brosnahan as Miriam \"Midge\" Maisel: a New York housewife who discovers she has a talent for stand-up comedy and pursues a career in this field. It also stars Alex Borstein, Michael Zegen, Marin Hinkle, Tony Shalhoub, Kevin Pollak, Caroline Aaron, Jane Lynch and Luke Kirby. The pilot episode received critical acclaim and the series was picked up by Amazon Studios. The fifth and final season premiered on April 14, 2023, and concluded on May 26, 2023.</p><p>The series has also received critical acclaim. It won the Golden Globe Award for Best Television Series – Musical or Comedy in 2017 and the Primetime Emmy Award for Outstanding Comedy Series in 2018, with Sherman-Palladino receiving the awards for Outstanding Directing and Outstanding Writing at the latter ceremony. Brosnahan won the Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series in 2018 and two consecutive Golden Globe Awards for Best Actress – Television Series Musical or Comedy in 2018 and 2019. Borstein won the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series twice consecutively, in 2018 and 2019; and Shalhoub and Kirby won Outstanding Supporting Actor in a Comedy Series and Outstanding Guest Actor in a Comedy Series in 2019, respectively.</p><br/><h3>Premise</h3><p>Season 1: In 1958 New York City, Miriam \"Midge\" Maisel, a young, affluent Jewish-American housewife, embarks on a stand-up comedy career after husband Joel, an untalented amateur comic, abruptly leaves her following his dismal set at The Gaslight Café. Drunk and dejected, Midge returns to the Gaslight in her nightgown, and in a bawdy impromptu set, vents her predicament before being arrested for indecency. Midge meets famed comic Lenny Bruce when he is arrested the same night for using profanity in his act. Gaslight manager Susie Myerson, recognizing Midge's raw talent, coaches her on improv comedy.</p><p>Season 2: As Midge secretly hones her comic skills at the Gaslight Café, she and Susie also hit the road. Touring is hard and female comics are generally disparaged and discriminated against. Midge rejects comedian Sophie Lennon's notion that female comics need a gimmicky persona to compete in a male-dominated field and instead performs as herself, adopting the stage name, \"Mrs. Maisel\". After Midge disparages Sophie's corny act, Sophie's vindictive manager gets Midge blacklisted from New York clubs. Midge perseveres and gets a huge break as the opening act for famous singer Shy Baldwin's upcoming tour.</p><p>Season 3: Midge balances career and family life while touring with Shy Baldwin; she retools her act for non-New York audiences. After divorcing, Midge and Joel remain in each other's lives while navigating new relationships. Joel branches out by opening a small nightclub in New York's Chinatown, soon discovering the landlords operate an illegal gambling den downstairs. Tensions arise when Midge objects to Susie managing other clients, including Sophie Lennon, though she eventually relents. However, Midge is unaware that Susie increasingly relies on mob connections for professional assistance. After carelessly alluding to Shy's homosexuality during a set, Midge is fired.</p><p>Season 4: Following the Shy Baldwin debacle, Midge vows to only do headliner gigs, though with little success. Sophie Lennon gives Midge a professional break before jealously thwarting her career again. Meanwhile, Joel's busy nightclub draws unwanted attention to his landlords' illegal activities. Midge becomes the comic emcee at the Wolford burlesque club, contentedly languishing there until a police raid closes it. Lenny Bruce helps Midge regain her confidence and reboot her career.</p><p>Season 5: The story covers the 1960s – 2000s. In the early 60s, Midge, still struggling professionally, is hired as a writer for The Gordon Ford Show and competes against male co-workers. Glimpses into the future reveal: Midge fires manager Susie after learning her mob ties entangled Joel in illegal activities to protect Midge. As Midge's career climbs, Lenny Bruce descends into drug addiction. After seizing an opportunity, Midge becomes a major comedy star but has a messy personal life with multiple marriages, lost loved ones, strained relationships, including her two adult children, and eventual reconciliations. Throughout, Midge and Joel stay close.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Rachel Brosnahan as Miriam \"Midge\" Maisel (née Weissman), an upper-middle class Jewish American housewife and mother who discovers her flair for stand-up comedy after husband Joel abruptly leaves her. Fashion-obsessed and hyper-competent, Midge is hired as a make-up counter girl at B. Altman and starts performing stand-up comedy in clubs across New York, eventually becoming a world-famous comedian.</li><li>Alex Borstein as Susie Myerson, who runs the Gaslight Cafe and later becomes Midge's manager after recognizing Midge's natural talent.</li><li>Michael Zegen as Joel Maisel, Midge's estranged, later ex-husband, who leaves Midge for his secretary, Penny Pann. He is an aspiring, though untalented, stand-up comic who copies Bob Newhart's routines. Joel quits his uncle's plastics company, later works at his father's garment factory, then opens his own nightclub. Lenny Palmieri portrays a thirteen-year-old Joel in a guest appearance in the episode \"Put That On Your Plate!\".</li><li>Marin Hinkle as Rose Weissman (née Lehman), Midge's fashionable and society-conscious mother who later becomes a matchmaker</li><li>Tony Shalhoub as Abraham \"Abe\" Weissman, Midge's fastidious erudite father, who is a tenured mathematics professor at Columbia University and a researcher at Bell Labs. He leaves academia to return to his social activist roots and later becomes the theater critic for The Village Voice.</li><li>Kevin Pollak as Moishe Maisel (seasons 2–5, recurring season 1), Joel's supportive father and the owner of Maisel & Roth Garment Company</li><li>Caroline Aaron as Shirley Maisel (seasons 3–5, recurring seasons 1–2), Joel's somewhat overbearing but loving mother</li><li>Jane Lynch as Sophie Lennon (season 3, recurring seasons 2 and 4, guest seasons 1 and 5), a successful stand-up comic who uses a fat suit and shtick gimmicks to portray a frumpy, uncouth housewife from Queens in her act. In reality, she is a rich, egotistical, snobbish Manhattan socialite with refined tastes. She professionally clashes with Midge.</li><li>Luke Kirby as Lenny Bruce (season 4, recurring seasons 1–3 and 5), a well-known New York City comedian and Midge's close friend and ally</li><li>Reid Scott as Gordon Ford (season 5, recurring season 4), a popular late-night TV talk show host who later hires Midge as a staff writer for The Gordon Ford Show</li><li>Alfie Fuller as Dinah Rutledge (season 5, recurring season 4), Susie's secretary; she later is the main manager of Susie's talent agency</li><li>Jason Ralph as Mike Carr (season 5, recurring season 4), a talent booker and later a producer on The Gordon Ford Show</li></ul><h4>Recurring</h4><ul><li>Joel Johnstone as Archie Cleary, Imogene's husband and Joel's close friend and coworker</li><li>Bailey De Young as Imogene Cleary, Midge's best friend</li><li>Matilda Szydagis as Zelda, the Weissmans' maid</li><li>Nunzio and Matteo Pascal (seasons 1–4), Colin Keane (season 5) as Ethan Maisel, Midge and Joel's elder child. Ben Rosenfield as an older Ethan Maisel (season 5)</li><li>Ben Rosenfield as an older Ethan Maisel (season 5)</li><li>Candace and Kiera Magyar (season 1), Kasey and Morgan Scheuermann (seasons 2–3), Avigayl and Emunah Rosenblatt (season 4), Ireland Jade and Sedona Rose Carvajal (season 5) as Esther Maisel, Midge and Joel's younger child. Alexandra Socha as older Esther Maisel (season 5)</li><li>Alexandra Socha as older Esther Maisel (season 5)</li><li>Brian Tarantina as Jackie, the emcee at the Gaslight. After Tarantina's death, his character dies offscreen of a stroke in season 4.</li><li>Cynthia Darlow as Mrs. Moskowitz, Joel's secretary, former childhood nanny, and Penny Pann's replacement</li><li>Holly Curran as Penny Pann, Joel's former secretary and girlfriend</li><li>Will Brill as Noah Weissman, Midge's brother. He is secretly an analyst for the CIA.</li><li>Joanna Glushak as Mrs. O'Toole, the floor supervisor at B. Altman</li><li>Justine Lupe as Astrid, Midge's sister-in-law, who converted to Judaism to marry Noah Weissman. Insecure about not being born Jewish, she obsessively observes all religious practices and traditions.</li><li>David Paymer as Harry Drake, a powerful talent agent with clients including Sophie Lennon</li><li>David Aaron Baker as Charles Connelly, Abe's boss at Bell Labs</li><li>Max Casella as Michael Kessler, Midge's lawyer and a former activist acquaintance of Abe's</li><li>Steven Hauck as Dawes, Sophie Lennon's acerbic butler</li></ul><ul><li>Zachary Levi as Dr. Benjamin Ettenberg, a doctor whom Midge meets in the Catskills and is briefly engaged to after divorcing Joel</li><li>Erik Palladino as Frank, a low-level mob enforcer partnered with Nicky and later develops a friendship with Susie</li><li>John Scurti as Nick, a low-level mob enforcer partnered with Frank and later develops a friendship with Susie</li><li>Leroy McClain as Shy Baldwin, a popular singer who gives Midge her big break as his opening act on tour</li><li>Emily Bergl as Tessie, Susie's sister</li><li>Colby Minifie as Ginger, Midge's B. Altman co-worker who works at the switchboard</li><li>Andrew Polk as Fred, an agent that Susie networks with for booking Midge's gigs</li><li>Connor Ratliff as Chester, who stalks Susie and later becomes her roommate</li><li>Teddy Coluca as Manny, a worker at Maisel & Roth</li></ul><ul><li>Sterling K. Brown as Reggie, Shy Baldwin's manager</li><li>Stephanie Hsu as Mei Lin, a mysterious Chinese-American woman Joel dates and who has connections to an illegal gambling ring underneath Joel's new club</li><li>Liza Weil as Carole Keen, a bass player in Baldwin's orchestra who becomes a friendly mentor to Midge; she is very loosely modeled on bassist Carol Kaye, though Kaye found the character an insulting representation</li><li>Cary Elwes as Gavin Hawk, a renowned actor and Sophie Lennon's co-star in Miss Julie</li><li>Jason Alexander as Asher Friedman, Abe's old friend who is a playwright</li><li>Wanda Sykes as comedian Moms Mabley</li></ul><ul><li>Kayli Carter as Gloria, a burlesque dancer at the Wolford</li><li>Gideon Glick as Alfie Zielenski, a quirky magician who Susie manages</li><li>Santino Fontana as Boise, the stage manager at Wolford's, a Manhattan burlesque club</li><li>Hari Nef as L. Roy Dunham, a newspaper critic reviewing Midge's career</li><li>Kelly Bishop as Benedetta, the leader of a matchmaking consortium based in NYC</li><li>Jackie Hoffman as Gitta, a NYC matchmaker</li><li>Patrice Johnson Chevannes as Miss Em, a NYC matchmaker</li><li>Marceline Hugot as Molly, a NYC matchmaker</li><li>Chris Eigeman as Gabe, editor of The Village Voice</li><li>Milo Ventimiglia as Sylvio, a man Midge meets at Riverside Park</li></ul><ul><li>Nina Arianda as Hedy, Gordon Ford's wife</li><li>Peter Friedman as George Toledano, producer of The Gordon Ford Show</li><li>Gibson Frazier as Dr. Elie Klein</li><li>Alexander Gemignani as Janusz, Zelda's boyfriend</li><li>Austin Basis as Alvin, head writer at The Gordon Ford Show</li><li>Josh Grisetti as Ralph, a staff writer at The Gordon Ford Show</li><li>Lucas Kavner as Cecil, a staff writer at The Gordon Ford Show</li><li>Eddie Kaye Thomas as Adam, a staff writer at The Gordon Ford Show</li><li>Michael Cyril Creighton as Mel, a staff writer at The Gordon Ford Show</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally released</th></tr><tr><th scope=\"col\">First released</th><th scope=\"col\">Last released</th></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"1\" rowspan=\"2\">8</td><td colspan=\"1\">1</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">March 17, 2017</td></tr><tr style=\"height:100%\"><td colspan=\"1\">7</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">November 29, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">December 5, 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">December 6, 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 17, 2022</td><td style=\"padding:0 8px\">March 11, 2022</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">9</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 14, 2023</td><td style=\"padding:0 8px\">May 26, 2023</td></tr></tbody></table><h4>Season 1 (2017)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#FF549F;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#FF549F;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#FF549F;width:32%\">Title</th><th scope=\"col\" style=\"background:#FF549F;width:19%\">Directed by</th><th scope=\"col\" style=\"background:#FF549F;width:20%\">Written by</th><th scope=\"col\" style=\"background:#FF549F;width:19%\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Pilot\"</td><td style=\"text-align:center\"><span>Amy Sherman-Palladino</span></td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">March 17, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF549F\">In 1958 New York City, Miriam \"Midge\" Maisel is a young affluent <span class=\"mw-redirect\">Jewish-American</span>. Joel, Midge's husband of four years, works at his uncle's plastics company while she raises their two children. Midge facilitates her untalented husband's weekly stand-up comedy routine at <span>the Gaslight Cafe</span>, unaware he wants to be a professional comic. After a particularly dismal performance, Joel upends their idyllic life by leaving Midge for his secretary, Penny Pann. Midge drunkenly returns to the Gaslight in her nightgown. In a spontaneous, profanity-laced rant, she unloads her misery, giving a hilarious performance. After baring her breasts, Midge lands in a police car with comedian <span>Lenny Bruce</span>, who was arrested for using obscene language in his act. Gaslight manager Susie Myerson, recognizing Midge's natural talent, bails her out of jail. The next morning, Midge bails out Lenny Bruce.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Ya Shivu v Bolshom Dome Na Kholme\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">November 29, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF549F\">Midge rebuffs Susie's suggestion to become a professional stand-up comic. Midge and Joel's breakup upsets both families. Midge's parents, Abe and Rose Weissman, blame Midge and want her to fix the marriage. Attempting to calm everyone, Midge invites her parents, in-laws Moishe and Shirley Maisel, and Joel to dinner to discuss the situation. Midge is shocked when Moishe announces that he owns Joel and Midge's apartment and that Joel is nearly broke. Also, Moishe is evicting Midge. A stunned Midge returns to the Gaslight and gives another impromptu performance, this time getting arrested for using obscene language.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Because You Left\"</td><td style=\"text-align:center\"><span>Daniel Palladino</span></td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">November 29, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF549F\">Lenny Bruce bails Midge out of jail. Midge starts performing at the Gaslight, baffling her parents by their daughter's new single life and late-night hours. In court, Midge clashes with the judge, landing her in jail for contempt until paying a $200 fine and she apologizes. Joel gives Midge the money without any questions. Joel's father, Moishe, accepts Abe's offer to buy half of Midge and Joel's apartment, in the event the couple reconciles.  Midge joins Lenny Bruce at the <span>Village Vanguard</span> where she does a short set. Susie barges into the <span>Friars Club</span> to discuss Midge with talent agent Harry Drake (<span>David Paymer</span>). Later, Joel wants to reconcile with Midge, but she refuses. Her reason: because he left.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Disappointment of the Dionne Quintuplets\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">November 29, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF549F\">Midge moves in with Abe and Rose. Joel's new apartment is only a few blocks from their old one, which he shares with Penny. Midge is furious that he is living a nearly identical life to their previous one. Susie has Midge listen to underground comedy records and they attend different nightclubs to study other comics, including <span>Red Skelton</span>. Midge wants her and Susie to be friends, but Susie prefers a professional relationship. Midge keeps her budding comedy career secret from her family, but after arriving home particularly late, Abe and Rose are unreasonably angry. When Abe refuses to buy a second TV so Midge's son, Ethan, can watch his programs, she gets a job.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Doink\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">November 29, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF549F\">Midge works at <span class=\"mw-redirect\">B. Altman</span>'s cosmetics counter during the day and performs at the Gaslight at night. After bombing during a set, Midge hires a comedy writer. When she bombs even worse using the corny jokes, Midge wants to quit stand-up. Susie assures her it is only a minor setback. Meanwhile, Moishe and Shirley meet Penny Pann and find her charming but unsuitable for Joel. Midge's close friend, Imogene, refuses to socialize with Joel and Penny after her husband Archie, who is Joel's best friend, plans an evening out with the couple. At a party with work friends, Midge entertains guests with an impromptu comic routine. To act as Midge's agent, Susie installs a telephone in her tiny apartment and types her own business cards.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Mrs. X at the Gaslight\"</td><td style=\"text-align:center\"><span>Scott Ellis</span></td><td style=\"text-align:center\">Sheila Lawrence</td><td style=\"text-align:center\">November 29, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF549F\">Midge regularly entertains (unpaid) at co-workers parties, performing alongside Randall (<span>Nate Corddry</span>), a comic who introduces her to his William Morris agent. When Abe, a tenured <span>Columbia University</span> math professor, is recruited by <span>Bell Labs</span>, he, Midge, Rose, and Midge's brother, Noah, plus his wife, Astrid (a <span>gentile</span> who converted to Judaism), celebrate at a Chinese restaurant. The occasion turns awkward when Joel and Penny Pann are also dining there. Susie tells Midge to stop entertaining at parties and start seriously pursuing a comedy career. After Susie discovers Midge talked to another agent, Midge apologizes, and they formalize their partnership. Later, Virgil and Oz from the record store are laughing at a tape recording of Midge's first comic performance. They label the tape, \"Mrs. X at the Gaslight\", intending to sell it.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Put That On Your Plate!\"</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">November 29, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF549F\">Midge hones her act and tries different stage names while Susie works to get her hired as comedian Sophie Lennon's opening act. Rose seeks consolation from her psychic after Midge refuses to reconcile with Joel, who broke up with Penny Pann. After being promoted at work, Joel shows Abe how he will support Midge and the children, though Abe notes little is leftover for Joel. When Midge is invited to Sophie Lennon's home, she discovers that the beloved comedian from <span>Queens</span> is actually a rich and arrogant <span>Yale</span> drama graduate. Onstage, \"Sophie\" is a gimmicky character in a fat suit. Lennon claims female comics need a fake persona to succeed in comedy and advises Midge to create one. Later at the Gaslight, Midge lampoons expectations imposed on female comedians; she ridicules Sophie Lennon's corny act and exposes her real life. Sophie's agent, Harry Drake, watching Midge perform, is furious.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Thank You and Good Night\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">November 29, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF549F\">Susie and Midge fear Harry Drake's retribution after Midge lambasted Sophie Lennon in her act. Midge and Joel reconnect at son Ethan's birthday party. They sleep together in her childhood bedroom and may reconcile. Later, while at Virgil and Oz's record shop, Joel overhears the bootleg tape of Midge's boozy first Gaslight appearance. He storms out upset, then quits his job. After a vindictive Harry Drakes gets Midge blacklisted from most New York clubs, Susie persuades Lenny Bruce to perform at the Gaslight to help out Midge. Her opening set is a huge hit, though Joel, secretly watching, is stung by unflattering comments about their marriage. Outside, he attacks a heckler while proclaiming that Midge is great. Midge ends the set by calling herself, \"Mrs. Maisel\".</td></tr></tbody></table><h4>Season 2 (2018)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#A3DEFF;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#A3DEFF;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#A3DEFF;width:32%\">Title</th><th scope=\"col\" style=\"background:#A3DEFF;width:19%\">Directed by</th><th scope=\"col\" style=\"background:#A3DEFF;width:20%\">Written by</th><th scope=\"col\" style=\"background:#A3DEFF;width:19%\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Simone\"</td><td style=\"text-align:center\"><span>Amy Sherman-Palladino</span></td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">December 5, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #A3DEFF\">Midge is demoted to switchboard operator after Penny Pann makes a scene at B. Altman, blaming Midge for Joel leaving her. When an unhappy Rose moves to Paris, Midge and Abe follow to persuade her to return home, but to no avail. Nicky and Frank, two hoodlums working for Harry Drake, abduct Susie as retaliation for Midge insulting Sophie Lennon in her act. Susie befriends them after learning they are all from the same neighborhood. They release Susie, warning that other thugs may come looking for her. Midge calls Joel from Paris, wanting to reconcile. Though he supports her comedy career, he cannot tolerate being fodder for her stand-up routines and demands she quit comedy. Midge refuses.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Mid-way to Mid-town\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">December 5, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #A3DEFF\">Midge lands a comedy club gig, but finds male comics consider female counterparts inferior. After getting bumped to the last slot, Midge hilariously retaliates during her act. Meanwhile, in Paris, Rose and Abe acclimate to Parisian life while reconnecting. Abe eventually persuades Rose to return home. Back in New York, Joel, temporarily living with Moishe and Shirley, discovers sloppy business practices at his father's garment factory, though his stubborn parents resist change. Midge rejects Joel's offer to rent an apartment for her and their children so she would no longer have to work.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Punishment Room\"</td><td style=\"text-align:center\"><span>Scott Ellis</span></td><td style=\"text-align:center\"><span>Daniel Palladino</span></td><td style=\"text-align:center\">December 5, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #A3DEFF\">Midge is temporarily promoted from switchboard operator to coat check girl, though things quickly go awry. Midge helps plan her B. Altman friend Mary's wedding, but at the reception, she impulsively gives a risqué speech that inadvertently reveals it is a <span>shotgun wedding</span>. Abe pulls strings for Rose to audit art classes at <span>Columbia</span>. However, Rose receives a shock on her first day in life-drawing class, then  lands herself and Abe in trouble with the dean after she disillusions the female students regarding their dismal future prospects with an art degree. Joel follows Shirley's \"treasure map\", showing where his parents stashed money over the years. Susie berates Virgil and Oz after discovering they are selling bootleg recordings of Midge's first Gaslight performance at their record store.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>We're Going to the Catskills!</span>\"</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">December 5, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #A3DEFF\">The Weissmans and Midge depart for their annual two-month vacation at Steiner's Resort in the <span>Catskill Mountains</span>. Joel and the Maisels are also vacationing there. Susie, angry that Midge is interrupting her comedy career for an extended vacation, follows her there. She poses as a staff member while working to book Midge comedy gigs in the area. Joel inadvertently discovers Abe's early-morning exercise routine, embarrassing him and his father-in-law. Midge resists being maneuvered into meeting Benjamin Ettenberg, an eligible New York doctor staying at the resort.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Midnight at the Concord\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">December 5, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #A3DEFF\">Midge rushes back to New York when B. Altman needs a temporary fill-in at the cosmetics counter. She dates Benjamin, despite her earlier resistance. After taking him to see Lenny Bruce perform, she reveals she is also a stand-up comic. She returns to the Catskills for a late-night gig at a hotel. Her set includes risqué material, including her parents' sex life, then discovers mid-act that Abe is in the audience.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Let's Face the Music and Dance\"</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">December 5, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #A3DEFF\">Tension increases between Midge and Abe after he discovers her comedy career, though he agrees to keep it secret. To worsen matters, Abe, who had hoped to have his son, Noah, work at Bell Labs, discovers he is working on a secret project for a <span>government agency</span>. Abe is confused when his superiors warn him to cease talking so much about Noah. Joel continues adjusting to renewed bachelorhood. Susie becomes overly immersed in her Steiner-staff persona.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep15\" style=\"text-align:center\">15</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Look, She Made a Hat\"</td><td style=\"text-align:center\"><span>Jamie Babbit</span></td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">December 5, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #A3DEFF\">Declan Howell, a well-known but eccentric artist, propositions Midge after Benjamin introduces her to New York's art world. During the family's <span>Yom Kippur</span> dinner, on the first anniversary of Midge and Joel's separation, Midge finally reveals she is pursuing a comedy career; she then rushes off for a scheduled performance. Susie wants to book Midge a short comedy tour. Needing funds, Susie asks her dysfunctional family for help.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep16\" style=\"text-align:center\">16</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Someday...\"</td><td style=\"text-align:center\">Jamie Babbit</td><td style=\"text-align:center\"><span>Kate Fodor</span></td><td style=\"text-align:center\">December 5, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #A3DEFF\">Midge and Susie hit the road in a vintage <span class=\"mw-redirect\">Model A Ford</span> that Susie's sister, Tess, \"borrowed\" from their alcoholic mother. Touring is harder than either Midge or Susie expected and made worse by the discrimination against female comics. Joel forcefully intervenes when a club owner refuses to pay Midge and mockingly locks Susie in a closet. Midge wonders if her growing comic success is worth personal and family sacrifice.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep17\" style=\"text-align:center\">17</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Vote for Kennedy, Vote for Kennedy\"</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">December 5, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #A3DEFF\">Midge's first television appearance on a fundraising telethon is marred when she and Susie discover Sophie Lennon is also appearing. Joel, now working for his father, immerses himself into turning Maisel &amp; Roth around. Joel's father offers him $60,000 to leave the company to instead pursue something he really wants in life. Joel considers opening a nightclub. Abe is not as happy at Bell Labs as he originally expected. After a still-vengeful Sophie uses her influence to bump Midge to the telethon's latest time slot, Susie angrily confronts Sophie. Midge perseveres and turns Sophie's \"punishment\" into a success.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep18\" style=\"text-align:center\">18</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"All Alone\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">December 5, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #A3DEFF\">Rose's psychic \"sees\" Midge in front of a large crowd, which Rose interprets as a wedding. A flashback shows Joel proposing to Midge (without first asking her father's permission). Meanwhile, Benjamin asks Abe's consent to marry Midge, despite her still being married to Joel. Abe requires Ben's personal details before consenting. Abe wants to quit Bell Labs and Columbia University and return to social activism. Impressed by how she fights for Midge, Sophie Lennon wants Susie as her manager. Singing star Shy Baldwin hires Midge as his opening act for a six-month tour. After being pulled offstage for discussing pregnancy, a dejected Midge encounters Lenny Bruce in a bar. Lenny, equally dejected and nearly broke, has multiple arrest warrants for obscene language in his act. Lenny's \"All Alone\" monologue on <i><span>The Steve Allen Show</span></i> incites Midge's own fears. Afterwards, Midge spends the night with Joel.</td></tr></tbody></table><h4>Season 3 (2019)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#FF9966;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#FF9966;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#FF9966;width:32%\">Title</th><th scope=\"col\" style=\"background:#FF9966;width:19%\">Directed by</th><th scope=\"col\" style=\"background:#FF9966;width:20%\">Written by</th><th scope=\"col\" style=\"background:#FF9966;width:19%\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep19\" style=\"text-align:center\">19</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Strike Up the Band\"</td><td style=\"text-align:center\"><span>Amy Sherman-Palladino</span></td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">December 6, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF9966\">Midge and Susie arrive at an Army base for their first <span>USO</span> show with Shy Baldwin. Moishe gives Joel a promising lead on a club venue in <span>Chinatown</span>. Susie receives an angry call from Sophie Lennon. Rose tells an astonished Abe that her family's trust fund allowance supplements their lifestyle. Midge ends her engagement with Benjamin. Joel is pleased with his new nightclub location until discovering the Chinese landlords operate an illegal gambling den downstairs. Midge and Susie are required to attend a USO dance, discovering they are only there as dance partners for soldiers. Midge is furious that Susie is Sophie's new manager. Abe supports Lenny Bruce's quest for free speech.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep20\" style=\"text-align:center\">20</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"It's the Sixties, Man!\"</td><td style=\"text-align:center\"><span>Dan Attias</span></td><td style=\"text-align:center\"><span>Daniel Palladino</span></td><td style=\"text-align:center\">December 6, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF9966\">Midge fumes over Susie managing Sophie Lennon until best friend Imogene points how little Susie makes with only one client. Midge arrives home to find Abe with his new leftist friends, who make themselves more than comfortable. Rose travels to Providence, Oklahoma seeking an increase to her trust fund allowance. After being denied a place on the wealthy family's board of directors because she is a woman, an angry Rose cuts all financial support. Joel's nightclub landlords communicate with him through translator Mei Lin, a young Chinese-American woman. The landlords fail to bribe Joel into vacating. Susie meets Reggie, Shy Baldwin's no-nonsense manager. Midge accepts Susie managing Sophie.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep21\" style=\"text-align:center\">21</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Panty Pose\"</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">December 6, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF9966\">Susie meets with talent agent Harry Drake and his lawyers regarding Sophie. Harry has a binding contract with Sophie, prompting Susie to find a loophole. Abe and Rose bid goodbye to their long-time home after Abe quits Columbia University, which owns the apartment. Shy and his entourage kick off the tour in Las Vegas. Reggie tightly oversees tour operations and protects Shy. Midge is deflated when her New York-oriented set receives a cool reception from the Vegas audience. Susie then pushes Midge to do an impromptu set in the hotel's bar, which is well received. Mei encounters Joel at a Chinese restaurant and joins him. Abe and Rose move in with the Maisels at their new house in <span>Queens</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep22\" style=\"text-align:center\">22</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Hands!\"</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">December 6, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF9966\">Midge retools her act for different types of audiences. Homeless Abe and Rose settle in with Moishe and Shirley, but the Maisels' quirky domestic routines soon annoy them. Susie sees Shy's business manager about Midge's shorted tour paycheck, but is unnerved by his rough business manner. Joel and Archie work on the new club while Abe focuses on becoming a leftist rebel. Shy organizes an activity in the Nevada desert for the women on the tour. Susie works to make Sophie's dream of performing in a serious Broadway play a reality. Joel visits Midge in Vegas. After a drunken night together, the two wake up and discover they remarried. They quickly agree to divorce.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep23\" style=\"text-align:center\">23</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"It's Comedy or Cabbage\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">December 6, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF9966\">Shy's tour performs at the <span>Fontainebleau Hotel in Miami Beach</span>. Rose thinks Shirley has \"corrupted\" her maid, Zelda, who becomes less subservient. Abe harshly criticizes his rebel group's poorly-produced first leftist newspaper issue, exasperating them. Mei overhears Joel telling Archie about his ongoing difficulty in obtaining a liquor license. Susie returns to New York to support Sophie during her Broadway rehearsals of Strindberg's <i><span>Miss Julie</span></i>. Midge encounters newly-single Lenny Bruce, who is temporarily living in a Miami hotel; their romantic evening ends platonically with Lenny praising Midge's act.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep24\" style=\"text-align:center\">24</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Kind of Bleau\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">December 6, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF9966\">The Weissmans temporarily escape the Maisels to visit Midge in Miami. Midge insists they watch her act, though Rose gets drunk during it. Joel's liquor license predicament is quickly resolved, thanks to Mei, though it stirs an argument. Skeptical investors are impressed with Sophie's acting ability during rehearsals. When the rented theater for Sophie's play cancels on them, Susie's thug friends, Nicky and Frank, use their \"influence\" to obtain another venue with better terms. Midge helps Shy Baldwin after he suffers a nasty scrape, keeping his homosexuality secret and protecting his career. In Miami, Abe visits his old playwright friend, Asher Friedman, who was <span class=\"mw-redirect\">blacklisted</span> in the 1950s and now contentedly running a beachside bait shop. Abe later writes an article about the injustice.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep25\" style=\"text-align:center\">25</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Marvelous Radio\"</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">December 6, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF9966\">Temporarily back in New York during a tour break, Midge does radio gigs ranging from amusing to annoying <span>paleoconservative</span> <span>anti-feminist</span> <span>Phyllis Schlafly</span>, with some having odd payments. Abe is thrilled when <i><span>The New York Times</span></i> publishes his \"Asher Friedman\" article. The Weissmans celebrate the <span class=\"mw-redirect\">bris</span> of Noah and Astrid's baby. Meanwhile, Susie's sports gambling habit worsens. Sophie Lennon's play opens on Broadway, but suffering stage fright mid-performance, she devolves into her corny comic character; amid terrible reviews, the play closes the next day. Susie lambastes Sophie for destroying her opportunity to be recognized as a serious actress.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep26\" style=\"text-align:center\">26</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A Jewish Girl Walks Into the Apollo...\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">December 6, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #FF9966\">Joel's club opening is a success until a technical problem arises. Midge saves the night with an impromptu performance. Moishe sells Midge's old apartment to her, using the Shy Baldwin tour contract as collateral. Susie is secretly paying off gambling debts with Midge's earnings. Susie, with her sister, Tess, burn down their deceased mother's house to collect the insurance and repay Midge. Susie later appoints Joel as Midge's financial custodian. Angry readers splatter Abe with tomatoes, pleasing him that his article affected people. Shortly thereafter, <i><span>The Village Voice</span></i> offers Abe a job as a theater critic. Anxious about performing at the legendary <span>Apollo Theater</span>, Midge win over the tough audience with improvised jokes about the effeminate Shy. As the tour plane is about to depart for Europe, Midge and Susie are left stranded on the tarmac after Reggie fires Midge for nearly outing Shy.</td></tr></tbody></table><h4>Season 4 (2022)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#AC1A3E;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#AC1A3E;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#AC1A3E;width:32%\">Title</th><th scope=\"col\" style=\"background:#AC1A3E;width:19%\">Directed by</th><th scope=\"col\" style=\"background:#AC1A3E;width:20%\">Written by</th><th scope=\"col\" style=\"background:#AC1A3E;width:19%\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep27\" style=\"text-align:center\">27</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Rumble on the Wonder Wheel\"</td><td style=\"text-align:center\"><span>Amy Sherman-Palladino</span></td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">February 17, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #AC1A3E\">After being dropped from Shy Baldwin's tour, Midge vents her anger and humiliation on stage. She is further enraged that her dismissal was pre-planted in the newspapers. Midge presses Susie for her tour money which Susie gambled away. To collect the insurance money and repay Midge, Susie coerces Tess into sleeping with the insurance agent after he becomes suspicious about the house fire. Joel's Chinese landlords are unhappy that his successful club draws unwanted attention to their illegal gambling den; they intend to raise Joel's rent. Susie borrows money from Joel to repay Midge, promising to reimburse him. Midge restarts her comedy career, vowing to only be a headliner and not an opening act.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep28\" style=\"text-align:center\">28</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Billy Jones and the Orgy Lamps\"</td><td style=\"text-align:center\"><span>Daniel Palladino</span></td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">February 17, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #AC1A3E\">Midge moves into her old apartment with Abe and Rose, though they insist Midge say that they bought it. Sophie Lennon, at a mental health facility since her Broadway disaster, refuses to dissolve her and Susie's management contract. Harry Drake advises Susie to have more clients. Shirley tries matchmatching Joel with a widowed pregnant woman. Midge, fed up with less-talented male comics getting the prime performing slots at a club, crashes the stage. After mocking another comic, she gets thrown out, then wrongly arrested for prostitution. Susie bails out Midge and also a stripper who works at Wolford, a Manhattan burlesque club. Midge sees an opportunity at the Wolford. Susie repays Joel with the insurance money and wants him to handle Midge's finances. Abe, happy working at <i>The Village Voice</i>, gives his first meager paycheck to Midge to help pay household expenses.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep29\" style=\"text-align:center\">29</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Everything Is Bellmore\"</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino &amp; Daniel Palladino</td><td style=\"text-align:center\">February 25, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #AC1A3E\">Midge becomes the Wolford's new comic emcee. Susie temporarily stays with Midge when roommate Jackie dies suddenly. Buzz Goldberg, who produced the summer shows at Steiner's Resort, has written a musical opening on Broadway. Abe is assigned to review the show, which is terrible. To deflect his harsh criticism, Abe incorporates himself and relevant social issues into the review. Buzz's friends and supporters are furious over the bad review and disparage Abe during a Bar Mitzvah. When hardly anyone attends Jackie's memorial, Susie crashes another in-progress service and eulogizes him to strangers. Lenny visits Midge at the Wolford and offers helpful advice. Meanwhile, Rose's matchmaking business is growing. Asher Friedman calls Abe regarding his theater review in which he recounted the two young anarchists vandalizing a Federal building in the 1920s. The <span class=\"mw-redirect\">FBI</span> is now investigating.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep30\" style=\"text-align:center\">30</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Interesting People on Christopher Street\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Daniel Palladino &amp; Amy Sherman-Palladino</td><td style=\"text-align:center\">February 25, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #AC1A3E\">Midge pressures Boise, the Wolford manager to improve the club's clumsy production. Mei resists meeting Joel's parents. Lawyer Michael Kessler assures Abe and Asher that there is no Federal case against them, but the FBI wants an interview before closing the matter. During dinner at Midge's apartment, Asher and Abe reminisce about their youthful radicalism. Abe is unpleasantly reminded that Asher and Rose briefly dated. Frank and Nicky find Susie a cheap-to-rent business office/living space. Midge, thinking Susie needs companionship, takes her to a lesbian club, angering Susie. FBI Agent Webber assures Abe and Asher there is no case against them. Abe, still seething over Asher dating Rose, implicates Asher in another anarchist incident, possibly opening a new investigation. Abe and Asher's ensuing argument inspires Asher to write a new play. Sophie Lennon asks Susie to revive her ruined career. Meanwhile, Midge has enhanced the Wolford's overall operations.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep31\" style=\"text-align:center\">31</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"How to Chew Quietly and Influence People\"</td><td style=\"text-align:center\"><span>Scott Ellis</span></td><td style=\"text-align:center\"><span>Kate Fodor</span></td><td style=\"text-align:center\">March 4, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #AC1A3E\">Mei cancels meeting Joel's parents. At Shy Baldwin's wedding reception, Midge causes minor mayhem, then privately confronts Shy. Shy's new management team has fired his old band and replaced Reggie to hide Shy's homosexuality. Midge declines to sign a lucrative non-disclosure agreement regarding Shy. Rose discovers that Midge works at the Wolford and finds numerous newspaper clippings by L. Roy Dunham, a <i><span>New York Daily News</span></i> journalist who disparages Midge's career. After secretly watching Midge's act, worries her growing matchmaking business will be negatively affected by her daughter's profession. Susie gets Sophie booked on the nationally televised <i>The Gordon Ford Show</i>; Sophie wins the audience's sympathy. Sophie sends Susie elaborate gifts to entice her to remain her manager. Susie hires Dinah as her secretary. Late one night, while riding home in a taxi, Midge sees something and jumps out.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep32\" style=\"text-align:center\">32</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Maisel vs. Lennon: The Cut Contest\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Daniel Palladino &amp; Amy Sherman-Palladino</td><td style=\"text-align:center\">March 4, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #AC1A3E\">Lenny Bruce awakens hungover in Midge's apartment after she found him passed-out on the pavement. His abrupt departure angers Midge. Alfie the illusionist is a no-show after Susie books him at Joel's club. Susie negotiates with the Wolford's owners to raise Midge's pay for increasing the club's profits. Abe hires Imogene as a typist for a book he is writing. Four rival matchmakers demand that Rose quit. Mei tells Joel she is pregnant. Hoping for national exposure, Susie tries getting Midge booked on <i>The Gordon Ford Show</i>. Midge wants <i>Daily News</i> journalist L. Roy Dunham to stop her continual printed attacks, but Dunham refuses, claiming Midge is \"good copy\". To further entice Susie back as her manager, Sophie, now hosting a TV game show, hires Midge as the audience warm-up comic. The audience loves Midge, triggering a vitriolic comic showdown between her and a jealous Sophie. Midge walks off the show.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep33\" style=\"text-align:center\">33</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Ethan...Esther...Chaim\"</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">March 11, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #AC1A3E\">Midge meets Sylvio in the park. Their romantic encounter abruptly ends when his wife unexpectedly arrives home. Joel's club revenue is stolen, straining his finances. Rose's matchmaker rivals accost Abe to intimidate her into quitting. Midge performs at a JFK campaign event, but her cheating-husband jokes upset <span class=\"mw-redirect\">Jackie Kennedy</span>. During illusionist Alfie's performance, he <span>hypnotizes</span> Rose on stage and commands she reenact what Midge does. Rose unknowingly mimics Midge's Wolford monologue, humiliating the family and shocking Midge. Susie intends to fire Dinah until she introduces Susie to a promising new comic. Frank and Nicky warn Midge that Mei's family is dangerous. Lenny Bruce is booked to play <span>Carnegie Hall</span>. Joel tells Moishe about him and Mei. Moishe suddenly keels over and falls off the barstool to the floor unconscious.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep34\" style=\"text-align:center\">34</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"How Do You Get to Carnegie Hall?\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">March 11, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #AC1A3E\">After Moishe's heart attack, Abe ponders the man's legacy and writes a premature obituary. Lenny Bruce visits Midge at the Wolford. He apologizes for his earlier behavior and has recommended her to replace him as <span>Tony Bennett</span>'s opening act at the <span>Copacabana</span>. When the police raid Wolford's, Midge and Lenny flee, ending up at his hotel room and having sex. Midge discovers Lenny's drug paraphernalia, though he brushes it off. Moishe recovers and is deeply touched by Abe's obituary. Moishe says Mei must become a Jew before Joel tells Shirley about her. With Abe's support, a defiant Rose informs the other matchmakers she will not quit. Lenny's sold-out Carnegie Hall performance is a success, despite a blizzard hitting New York. Lenny rebukes Midge for declining the Tony Bennett gig, telling her to stop fearing failure. Midge then sets her sights on <i>The Gordon Ford Show</i>.</td></tr></tbody></table><h4>Season 5 (2023)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#B8D2D1;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#B8D2D1;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#B8D2D1;width:32%\">Title</th><th scope=\"col\" style=\"background:#B8D2D1;width:19%\">Directed by</th><th scope=\"col\" style=\"background:#B8D2D1;width:20%\">Written by</th><th scope=\"col\" style=\"background:#B8D2D1;width:19%\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep35\" style=\"text-align:center\">35</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Go Forward\"</td><td style=\"text-align:center\"><span>Amy Sherman-Palladino</span></td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">April 14, 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B8D2D1\"><p>Midge recovers from hypothermia after walking home in a blizzard. She promises Susie to no longer reject opening-act gigs. At Thanksgiving dinner, Moishe announces that he and Shirley are divorcing over his refusal to retire. Joel then shares that he and Mei are engaged and expecting a baby. Later, Mei, no longer pregnant, ends her and Joel's relationship to pursue her medical career, after which Joel creates a drunken scene at his club and the downstairs gambling den, getting himself beaten up. Midge runs into a dejected-looking Lenny Bruce, who is moving to Los Angeles. Abe notices recent odd occurrences, which Rose attributes to the Matchmakers. The Wolford burlesque club reopens; after a shaky start, Midge gives a great performance. TV talk show host Gordon Ford hires Midge as a show writer.</p><hr>Flashforward: In 1981 in <span>Cambridge, Massachusetts</span>, Esther Maisel, now a brilliant scientist, discusses her mother-related issues with a therapist. She claims her grandfather was the only person who understood her.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep36\" style=\"text-align:center\">36</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"It's a Man, Man, Man, Man World\"</td><td style=\"text-align:center\"><span>Daniel Palladino</span></td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">April 14, 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B8D2D1\"><p>Midge finds the male-dominated environment at <i>The Gordon Ford Show</i> challenging. She runs into Sylvio, the married man she once slept with; he clarifies that he and his wife were separated and living apart at the time and are now divorcing. Abe interviews a woman for <i><span>The Village Voice</span></i> but is uncomfortable with her flirting. When a mysterious fire destroys the Tea Room where Rose meets clients, she suspects the other Matchmakers are responsible. Midge continues performing nightly at the Wolford.</p><hr>Flashforward: <span>Mike Wallace</span> on <i><span>60 Minutes</span></i> recounts Midge's journey from the Gaslight Café to comedy star, that she is controversial, has had multiple marriages, and is an <span>Emmy</span> and <span>Grammy</span> winner. Esther Maisel, in an interview, is uncomfortable discussing her mother. Susie is a successful Hollywood manager, though she and Midge are no longer friends. Midge, auctioning her wardrobe for charity, recalls the outfit she wore her first day working at <i>The Gordon Ford Show</i>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep37\" style=\"text-align:center\">37</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Typos and Torsos\"</td><td style=\"text-align:center\"><span>Daisy von Scherler Mayer</span></td><td style=\"text-align:center\">Amy Sherman-Palladino &amp; Daniel Palladino</td><td style=\"text-align:center\">April 14, 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B8D2D1\"><p>One of Midge's jokes is finally used in Gordon Ford's monologue, but she audibly groans when he flubs it on air. Midge's subsequent apology ends in a public argument. Frank and Nicky get involved after Rose seeks Susie's help regarding the Matchmakers. When head Matchmaker Benedetta is arrested for the Tea Room fire, she proposes a truce, saying the other three Matchmakers either died or are hiding. Joel tells his parents about him and Mei; Shirley's grief over losing an unborn grandchild leads her and Moishe to reconcile. Abe is distressed after misspelling <span>Carol Channing</span>'s name in an article, requiring a printed correction, causing him to give young Ethan a frightening pep talk. Ford makes an unsuccessful pass at Midge. A photo in Gordon's office shocks Susie.</p><hr>Flashforward: In 1984 Israel, 29-year-old Ethan Maisel works in a <span>kibbutz</span> and is studying to be a Rabbi. Midge arrives by helicopter just to remind Ethan they are attending a benefit in Tel Aviv. As Midge leaves, Chava, Ethan's dour fiancée, bluntly says she dislikes his mother.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep38\" style=\"text-align:center\">38</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Susan\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">April 21, 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B8D2D1\">Frank and Nicky insist that Midge perform in an <span>industrial musical</span>, implying it will alleviate Susie's obligation to them. Midge rebuffs Gordon Ford's romantic advances. Abe and Rose disagree over a new play's meaning until the playwright validates Rose's opinion, briefly offending Abe. Midge's first performance in the waste-management skit is a hit. When Gordon's scheduled guest star suddenly bails, Midge offers to perform but discovers staff are never allowed on the show. Disappointed, Midge goes off script at her second industrial performance, infuriating Frank and Nicky. They sternly warn Susie that she, and by extension, Midge, are forever indebted to them. Joel, overhearing the conversation, confronts Susie about her mob ties. Sophie Lennon makes a last-minute surprise appearance on Gordon's show. Gordon's wife, Hedy, sees Susie and pursues her to the street, revealing their college relationship ended badly.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep39\" style=\"text-align:center\">39</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Pirate Queen\"</td><td style=\"text-align:center\"><span>Scott Ellis</span></td><td style=\"text-align:center\"><span>Isaac Oliver</span></td><td style=\"text-align:center\">April 28, 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B8D2D1\"><p>Joel and Archie inspect a new club site. Susie confronts film producer David Weston at a gay bathhouse after he ignores calls regarding her client, James Howard. Gordon Ford is embarrassed that \"Diddy Doo\" diaper cream is a new show sponsor. During a \"Diddy Doo\" party cruise, Midge is arrested for supposedly \"assaulting\" an executive. When producer George Toldedano calls an emergency meeting about it, Gordon dismisses the incident. After marrying Janusz, Zelda shocks Midge and the Weissmans by no longer working for them. Joel argues with Midge about Susie's mob connections, reinforcing their mutual feelings. Gordon attends Midge's nightclub act, after which she again declines having an affair.</p><hr>Flashforward: In 1987, Midge visits Joel, who is incarcerated in a minimum-security prison for unknown reasons, though somehow related to protecting her. His release is in four to six months. She brings a photo of their granddaughter Rose, named after Midge's deceased mother. Joel dislikes Midge's successful wig line, saying it takes time away from her performing.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep40\" style=\"text-align:center\">40</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Testi-Roastial\"</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">May 5, 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B8D2D1\">In 1985, Midge mentions a failed partnership during her act. Jumping to 1990, the <span>New York Friars Club</span> <span>roasts</span> Susie Myerson. The attendees publicly and privately recount her career: Susie's success is attributed to a brash personality and inheriting Harry Drake's prominent clients. She got <i>The Gordon Ford Show</i> producer George Toledano fired and talent booker Mike Carr promoted to get Midge on the show. Joel discovered Susie paid thugs Frank and Nicky from Midge's earnings. To free Midge, Joel made a business deal with the mobsters. Susie did major damage control after Midge canceled her lavish wedding to author <span>Philip Roth</span>. Midge fired Susie upon learning her mob ties led to Joel's imprisonment and that she was overbooking Midge at casinos to pay off gambling debts. As the Roast concludes, Midge makes a surprise pre-recorded appearance, praising Susie.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep41\" style=\"text-align:center\">41</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A House Full of Extremely Lame Horses\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">May 12, 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B8D2D1\"><p>Janusz resents Zelda continually helping out the Weissman/Maisel household. Abe is mortified that grandson Ethan is not academically gifted like other first-born Weissman males and instead excels in \"happiness\". Comic Danny Stevens guest stars on <i>The Gordon Ford Show</i>. Impressed with Midge, Stevens offers her a lucrative writing job. Gordon counters by grudgingly raising Midge's salary, making it equivalent to the male staff. When newly-promoted producer Mike Carr refuses to allow Midge on the show, Susie gets her added to <span>Jack Paar</span>'s private comedy showcase. Despite a great performance, Paar's producer declines to book Midge on Paar's national TV show, claiming he could not promote a funny, pretty girl. Frustrated, Midge breaks down at home. Abe is shocked that young granddaughter Esther appears to be the Weissman \"genius\" child rather than the older brother, Ethan.</p><hr>Flashforward: In 1973, Midge funds her mother's money-losing \"romance emporium\", insisting it continues for the brief time Rose has left; Midge then tells Susie to book the Australian tour.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep42\" style=\"text-align:center\">42</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Princess and the Plea\"</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">Daniel Palladino</td><td style=\"text-align:center\">May 19, 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B8D2D1\">Abe causes problems at Ethan's school. While waiting to discuss the matter, Joel and Midge separately reflect on their relationship. Abe assesses Esther's intellectual potential. When Midge and her former <span>Bryn Mawr College</span> classmates visit the campus, they retrieve hidden messages they once wrote to their future selves. Midge's reads, \"Don't!\". Gordon Ford is ecstatic that his wife Hedy's connections get Britain's <span>Princess Margaret</span> on the show. Hedy urges Midge to rightfully take full credit for writing the princess's funny skit. After discovering Susie knows Hedy, Midge insists she ask Hedy to get her on the show. Meanwhile, Abe recognizes Midge's talents and personal strength and regrets supporting her less than Noah during their childhoods. Susie reluctantly asks Hedy to get Midge on the show. Hedy calls in a favor with Gordon, who considers her request. Meanwhile, Midge receives an urgent phone call and rushes out.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep43\" style=\"text-align:center\">43</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Four Minutes\"</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">Amy Sherman-Palladino</td><td style=\"text-align:center\">May 26, 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B8D2D1\">In 1965 San Francisco, drug-addicted Lenny Bruce can barely perform. After countless arrests, the controversial comic is now banned from most clubs. Bruce declines Susie's management offer, while Midge avoids seeing him so diminished. In 1961, Midge bails out Susie, who became combative when police found her sleeping on a park bench. Meanwhile, Moishe and Shirley are retiring to Florida. Gordon Ford, resentful at being coerced to have Midge on the show, turns her appearance into a brief \"human interest\" spot with his \"lady writer\". Midge hijacks the segment and gives a sensational stand-up performance. Gordon is seething, then impressed, and invites Midge to the guest couch. He promises viewers \"the marvelous Mrs. Maisel\" will be on the show again, then leans over and whispers she is fired. In a flashback to six months earlier, Bruce tells Midge she will be famous if she claims the spotlight. In 2005, Midge, in her 70s, lives alone in a palatial <span>Manhattan</span> <span>apartment</span>. Her and Joel's wedding photo is prominently displayed on a desk there. Midge, maintaining a busy career, calls Susie, now retired. They simultaneously watch <i><span>Jeopardy!</span></i> videotapes, joking and reminiscing.</td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>In developing the series, Amy Sherman-Palladino was inspired by childhood memories of her father, a standup comedian based in New York City, and an admiration for early female comics such as Joan Rivers and Totie Fields.</p><p>In June 2016, Amazon gave the production a pilot order, with the pilot episode written and executive produced by Sherman-Palladino. In April 2017, Amazon gave the production a two-season order, to be executive produced by Sherman-Palladino and Daniel Palladino with Dhana Gilbert as a producer. On May 20, 2018, Amazon renewed the series for a third season of eight episodes. One week after season three was released, Amazon renewed the show for a fourth season. On February 17, 2022, Amazon renewed the series for a fifth and final season.</p><h4>Casting</h4><p>On August 5, 2016, Rachel Brosnahan was cast in the pilot's lead role. In September 2016, it was reported that Tony Shalhoub and Michael Zegen had joined the pilot's main cast. On October 6, 2016, Marin Hinkle was cast in one of the pilot's main roles. In May 2017, it was reported that Joel Johnstone, Caroline Aaron, Kevin Pollak, and Bailey De Young were set to appear in recurring roles.</p><p>On May 23, 2018, Zachary Levi was announced to appear in the second season in a recurring capacity. On August 15, 2018, it was reported that Jane Lynch would reprise her role of Sophie Lennon in recurring capacity in season two.</p><p>On April 15, 2019, it was announced that Sterling K. Brown would appear in the third season in an undisclosed role. The October 14, 2019, release of the season's teaser trailer revealed that Liza Weil would also play an undisclosed character.</p><p>On June 21, 2021, Kayli Carter was announced to appear in the fourth season in a recurring capacity. Other season 4 guest stars include Milo Ventimiglia and Kelly Bishop, who both appeared on Gilmore Girls which was created by Amy Sherman-Palladino. Additional season 4 guest stars include Jason Ralph (who is Rachel Brosnahan's real-life husband) and filmmaker John Waters. For the fifth season, Reid Scott, Alfie Fuller, and Jason Ralph, were promoted to series regulars after having recurring roles in the fourth season.</p><h4>Filming</h4><p>Principal photography for the pilot took place from September 27 to October 14, 2016, in Manhattan. Filming for the fourth season began on January 20, 2021 and wrapped in early July 2021. Filming for the fifth season began in late February 2022 in New York City.</p><h4>Locations</h4><p>Exterior shots for the Gaslight Club were filmed in October 2016 outside 96 St. Mark's Place in the Lower East Side, the building featured on the cover of Led Zeppelin's 1975 album Physical Graffiti. The building's residents were reportedly unhappy about the disruption that the production would cause.</p><p>Other New York locations included The Village Vanguard jazz club on Seventh Avenue South, a vintage record store on West 4th Street, and Albanese Meats & Poultry, a butcher shop on Elizabeth Street in Little Italy. Exterior scenes set at the B. Altman department store were filmed at the B. Altman and Company Building at Fifth Avenue, while interiors were shot in a disused bank in Brooklyn.</p><p>Season 2's scenes set at the holiday resort in the Catskills were filmed on location at a holiday resort on the Oquaga Lake near Deposit. Paris scenes were filmed at various real-life locations in the 2nd arrondissement of Paris, and at the Musée Rodin at Hôtel Biron. One of the hotels in season 3 was the Fontainebleau Miami Beach.</p><h4>Oners</h4><p>The show makes frequent use of \"oners\", extended single-shot scenes. \"Going to the Catskills\" offers a two-minute oner depicting Midge and her family getting rambunctiously resettled in their summer home in the Catskills. It included a half-dozen overlapping vignettes. In \"Strike Up the Band\", in a 12-page scene, Midge comes into their apartment to find her parents fighting, with her clothes scattered everywhere. In another, Midge and Susie ride in an open Jeep to an airplane hangar where Midge will later open for Shy. The camera follows them from the Jeep into the hangar, where soldiers manhandle her onto the stage, which she crosses while waving to the nearly 1,000 soldiers facing her before she is lifted back into the Jeep.</p><h4>Design</h4><p>The \"apartment\" where Midge and her husband Joel live was created on the same set as the apartment where Midge's parents live, but with more modern (late-1950s) design, inspired in part by Doris Day movies, according to production designer Bill Groom. The \"retro\" typeface used for the show's logo is Sparkly by Stuart Sandler of Font Diner. The show's distinctive designs and costumes—most notably the women's hats and dresses—led the Paley Center for Media to create an exhibit called \"Making Maisel Marvelous\" in 2019.</p><p>The design of a Cuban dance number in episode 5 of season 3 was inspired by the 1964 film I Am Cuba, which is a favorite film of series cinematographer M. David Mullen.</p><p>In December 2019, two costumes from the series were acquired by the National Museum of American History at the Smithsonian Institution.</p><br/><h3>Release</h3><h4>Marketing</h4><p>On October 10, 2017, the official trailer for the first season was released. On August 9, 2018, a teaser trailer for the second season was released. On October 24, 2018, the official trailer for season two was released. From December 1–8, 2018, Amazon opened up a pop-up restaurant in Manhattan's Nolita neighborhood modeled after Carnegie Deli as it appeared during the 1950s. The restaurant served a menu much more limited than what was actually offered at the original deli with the only two sandwich options being \"The Maisel\" and \"The Susie.\" Other items offered included mini knishes, black and white cookies, cheesecake, and pickles. As the restaurant was purely for promotional purposes, nothing on the menu cost more than 99 cents, and all the proceeds went to support the Lower Eastside Girls Club.</p><p>In August 2019, to promote the show for the upcoming 71st Primetime Emmy Awards, Amazon partnered with various businesses in and around Santa Monica, California, to provide goods and services at 1959 prices. The offer to sell gasoline at $0.30 per gallon led to long queues and traffic jams in front of the gas station that offered the promotion, forcing police to intervene.</p><h4>Premiere</h4><p>The series held its official premiere on November 13, 2017, at the Village East Cinema in New York City. It premiered as a part of Amazon's Spring 2017 pilot season on March 17, 2017. The remainder of the first season was released on November 29, 2017. The second season premiered on December 5, 2018, and the third season premiered December 6, 2019.</p><p>Season 4's release format changed from the all-at-once binge of previous seasons to weekly releases of two episodes each; the season premiered on February 18, 2022. The fifth and final season, which consists of 9 episodes, premiered on April 14, 2023.</p><br/><h3>Reception</h3><p>The series has received broad critical acclaim. On Rotten Tomatoes, it received an overall score of 90% and an overall score of 78 on Metacritic.</p><h4>Season 1</h4><p>On review aggregator Rotten Tomatoes, the first season holds a 94% approval rating, with an average rating of 7.6 out of 10 based on 82 reviews. The website's critical consensus reads, \"The Marvelous Mrs. Maisel is an upbeat addition to Amazon's original offerings, propelled by a playful yet poignant performance by Rachel Brosnahan.\" On Metacritic, the series has an average weighted score of 80 out of 100, based on 27 critics, indicating \"generally favorable reviews\".</p><p>The pilot episode of The Marvelous Mrs. Maisel was one of Amazon Video's most successful ever, achieving an average viewer rating of 4.9 (out of 5). The review of the pilot in The Guardian praised the combination of Sherman-Palladino's \"banging dialogue and the utterly winning charm of Brosnahan\", while The A.V. Club praised the \"outstanding\" production design and said \"this is a series that's as confident as its heroine—and what a heroine she is.\" A critic for Slate called the episode \"a knockout\", stating that the stand-up element \"introduces a welcome streak of discipline, both verbal and thematic, into Sherman-Palladino's charming but manic work.\"</p><p>The Jerusalem Post highlighted the exceptionally well done \"Jewishness\" of the work, calling it a \"comedic delight of a show, combining Sherman-Palladino's knack for witty dialogue with the colorful, rich world of 1950s New York and the intensity of family drama and changing times.\" NPR similarly highlighted the effectiveness of the comedy in the show, calling it \"a heroic fantasy.\"</p><h4>Season 2</h4><p>On Rotten Tomatoes, the second season holds a 92% approval rating, with an average rating of 8.2 out of 10 based on 72 reviews. The website's critical consensus reads, \"Like Midge herself, The Marvelous Mrs. Maisel charges full speed ahead in a second season brimming with warmth, empowerment, and a whole lot of laughs.\" Metacritic assigned the season a score of 85 out of 100 based on 24 critics, indicating \"universal acclaim\". Karen Lehrman Bloch called it \"a timeless, transcendent work of art\".</p><h4>Season 3</h4><p>On Rotten Tomatoes, the third season holds a 79% approval rating, with an average rating of 7.6 out of 10 based on 52 reviews. The website's critical consensus reads, \"As visually spectacular as ever, The Marvelous Mrs. Maisel's banter and pace still fly with comedic fury – but shallow social commentary and wandering storylines highlight the show's increasingly superficial tendencies.\" Metacritic assigned the season a score of 75 out of 100 based on 19 critics, indicating \"generally favorable reviews\". Alan Sepinwall of Rolling Stone wrote that it offered \"a lot of energy and fancy footwork that often makes no sense\".</p><h4>Season 4</h4><p>On Rotten Tomatoes, the fourth season holds a 92% approval rating, with an average rating of 7.7 out of 10 based on 66 reviews. The website's critical consensus reads, \"The Marvelous Mrs. Maisel has seemingly run out of fresh material, but it continues to reward fans with expert delivery and snappy presentation.\" Metacritic assigned the season a score of 65 out of 100 based on 17 critics, indicating \"generally favorable reviews\".</p><h4>Season 5</h4><p>On Rotten Tomatoes, the fifth season holds a 97% approval rating, with an average rating of 7.8 out of 10 based on 38 reviews. The website's critical consensus reads, \"All good comedy sets must arrive at a final punchline, and The Marvelous Mrs. Maisel reliably nails its own with a fifth season that wisely puts Rachel Brosnahan and Alex Borstein's repartee front and center. Metacritic assigned the season a score of 80 out of 100 based on 15 critics, indicating \"generally favorable reviews\".</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" style=\"width:3%;\">Year</th><th scope=\"col\" style=\"width:22%;\">Award</th><th scope=\"col\" style=\"width:35%;\">Category</th><th scope=\"col\" style=\"width:35%;\">Nominee(s)</th><th scope=\"col\" style=\"width:6%;\">Result</th><th scope=\"col\" class=\"unsortable\" style=\"width:1%;\"><abbr title=\"Reference(s)\">Ref.</abbr></th></tr><tr><td rowspan=\"29\" align=\"center\">2018</td><td align=\"center\" rowspan=\"2\"><span>Golden Globe Awards</span></td><td><span>Best Television Series – Musical or Comedy</span></td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" align=\"center\"></td></tr><tr><td><span>Best Actress – Television Series Musical or Comedy</span></td><td><span>Rachel Brosnahan</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\" rowspan=\"3\"><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td><span>Best Comedy Series</span></td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td><span>Best Actress in a Comedy Series</span></td><td>Rachel Brosnahan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress in a Comedy Series</span></td><td><span>Alex Borstein</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span class=\"mw-redirect\">Producers Guild of America Awards</span></td><td><span>Outstanding Producer of Episodic Television – Comedy</span></td><td>Amy Sherman‐Palladino, Daniel Palladino, Dhana Rivera Gilbert &amp; Sheila Lawrence</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement for a Comedy Series</span></td><td><span>Amy Sherman-Palladino</span> <span style=\"font-size:85%;\">(for \"Pilot\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Costume Designers Guild Awards</span></td><td>Excellence in Period Television</td><td><span>Donna Zakowska</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Location Managers Guild Awards</span></td><td>Outstanding Locations in Period Television</td><td>Amanda Foley-Burbank &amp; Jose Guerrero</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Peabody Awards</span></td><td>Entertainment, children's and youth honoree</td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"3\"><span>Television Critics Association Awards</span></td><td><span>Outstanding Achievement in Comedy</span></td><td rowspan=\"2\"><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td><span>Outstanding New Program</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Individual Achievement in Comedy</span></td><td>Rachel Brosnahan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\" rowspan=\"6\"><span>Primetime Emmy Awards</span></td><td><span>Outstanding Comedy Series</span></td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"6\"></td></tr><tr><td><span>Outstanding Lead Actress in a Comedy Series</span></td><td>Rachel Brosnahan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Supporting Actor in a Comedy Series</span></td><td><span>Tony Shalhoub</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Supporting Actress in a Comedy Series</span></td><td>Alex Borstein</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Directing for a Comedy Series</span></td><td rowspan=\"2\">Amy Sherman-Palladino <span style=\"font-size:85%;\">(for \"Pilot\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Writing for a Comedy Series</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\" rowspan=\"8\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Guest Actress in a Comedy Series</span></td><td><span>Jane Lynch</span> <span style=\"font-size:85%;\">(for \"Put That on Your Plate!\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"8\"></td></tr><tr><td><span>Outstanding Casting for a Comedy Series</span></td><td>Meredith Tucker, Jeanie Bacharach &amp; <span>Cindy Tolan</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Cinematography for a Single Camera Series</span></td><td><span>M. David Mullen</span> <span style=\"font-size:85%;\">(for \"Pilot\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Hairstyling for a Single Camera Series</span></td><td>Francesca Paris, Christine Cantrell, Cassie Hurd &amp; Reo Anderson <span style=\"font-size:85%;\">(for \"Pilot\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Music Supervision</span></td><td>Robin Urdang, Amy Sherman-Palladino &amp; <span>Daniel Palladino</span> <span style=\"font-size:85%;\">(for \"Pilot\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Period Costumes</span></td><td>Donna Zakowska, Marina Rei, Ginnie Patton &amp; Sheila Grover <span style=\"font-size:85%;\">(for \"The Disappointment of the Dionne Quintuplets\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Production Design for a Narrative Period or Fantasy Program (One Hour or More)</span></td><td>Bill Groom, Neil Prince &amp; Ellen Christiansen <span style=\"font-size:85%;\">(for \"Ya Shivu v Bolshom Dome Na Kholme\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Single-Camera Picture Editing for a Comedy Series</span></td><td>Brian A. Kates <span style=\"font-size:85%;\">(for \"Pilot\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\"><span>People's Choice Awards</span></td><td>The Bingeworthy Show of 2018</td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FE9; vertical-align: middle; text-align: center;\" class=\"table-no2\">Shortlisted</td><td style=\"text-align:center;\"></td></tr><tr><td align=\"center\"><span class=\"mw-redirect\">American Film Institute Awards</span></td><td>Top 10 TV Programs of the Year</td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"48\">2019</td><td align=\"center\" rowspan=\"3\"><span>Golden Globe Awards</span></td><td><span>Best Television Series – Musical or Comedy</span></td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td><span>Best Actress – Television Series Musical or Comedy</span></td><td>Rachel Brosnahan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress – Series, Miniseries or Television Film</span></td><td>Alex Borstein</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\" rowspan=\"2\"><span>Dorian Awards</span></td><td>TV Comedy of the Year</td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td>TV Performance of the Year – Actress</td><td>Rachel Brosnahan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\" rowspan=\"4\"><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td><span>Best Comedy Series</span></td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"4\"></td></tr><tr><td><span>Best Actress in a Comedy Series</span></td><td>Rachel Brosnahan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor in a Comedy Series</span></td><td>Tony Shalhoub</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress in a Comedy Series</span></td><td>Alex Borstein</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\"><span class=\"mw-redirect\">Producers Guild of America Awards</span></td><td><span>Outstanding Producer of Episodic Television – Comedy</span></td><td>Amy Sherman‐Palladino, Daniel Palladino, Dhana Rivera Gilbert &amp; Sheila Lawrence</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"4\"><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by an Ensemble in a Comedy Series</span></td><td><span>Caroline Aaron</span>, Alex Borstein, Rachel Brosnahan, <span>Marin Hinkle</span>, <span>Zachary Levi</span>, <span>Kevin Pollak</span>, Tony Shalhoub, Brian Tarantina &amp; <span>Michael Zegen</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"4\"></td></tr><tr><td><span>Outstanding Performance by a Male Actor in a Comedy Series</span></td><td>Tony Shalhoub</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Outstanding Performance by a Female Actor in a Comedy Series</span></td><td>Alex Borstein</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Rachel Brosnahan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\"><span>Artios Awards</span></td><td><span>Outstanding Achievement in Casting – Television Pilot &amp; First Season – Comedy</span></td><td>Jeanie Bacharach, Cindy Tolan,<br>Anne Davison (Associate) &amp; Betsy Fippinger (Associate)</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"2\"><span>American Cinema Editors Eddie Awards</span></td><td rowspan=\"2\">Best Edited Comedy Series for Non-Commercial Television</td><td>Kate Sanford <span style=\"font-size:85%;\">(for \"Simone\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td>Tim Streeto <span style=\"font-size:85%;\">(for \"We're Going to the Catskills!\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span class=\"mw-redirect\">Art Directors Guild Awards</span></td><td><span>Excellence in Production Design for a One-Hour Period or Fantasy Single-Camera Series</span></td><td>Bill Groom <span style=\"font-size:85%;\">(for \"Simone\" &amp; \"We're Going to the Catskills!\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"2\"><span>Directors Guild of America Awards</span></td><td rowspan=\"2\"><span>Outstanding Directorial Achievement in Comedy Series</span></td><td>Daniel Palladino <span style=\"font-size:85%;\">(for \"We're Going to the Catskills!\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td>Amy Sherman-Palladino <span style=\"font-size:85%;\">(for \"All Alone\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>American Society of Cinematographers Awards</span></td><td>Outstanding Achievement in Cinematography for a Movie, Miniseries, or Pilot for Television</td><td>M. David Mullen <span style=\"font-size:85%;\">(for \"Pilot\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Cinema Audio Society Awards</span></td><td><span>Outstanding Achievement in Sound Mixing for a Television Series – One Hour</span></td><td>Mathew Price, Ron Bochar, Michael Miller, David Boulton &amp; Steven Visscher <span style=\"font-size:85%;\">(for \"Vote for Kennedy, Vote for Kennedy\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"2\"><span>Make-Up Artists and Hair Stylists Guild Awards</span></td><td>Television Series, Television Mini Series or Television New Media Series – Best Period and/or Character Make-up</td><td>Patricia Regan, Claus Lulla &amp; Joseph A. Campayno</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td>Television Series, Television Mini Series or Television New Media Series – Best Period and/or Character Hair Styling</td><td>Jerry DeCarlo, Jon Jordan &amp; Peg Schierholz</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\"><span>Golden Reel Awards</span></td><td>Broadcast Media Longform Music / Musical</td><td>Annette Kudrak <span style=\"font-size:85%;\">(for \"We're Going to the Catskills\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span class=\"mw-redirect\">Writers Guild of America Awards</span></td><td><span>Television: Comedy Series</span></td><td><span>Kate Fodor</span>, Noah Gardenswartz, <span>Jen Kirkman</span>, Sheila Lawrence, Daniel Palladino &amp; Amy Sherman-Palladino</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Costume Designers Guild Awards</span></td><td>Excellence in Period Television</td><td>Donna Zakowska</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Television Critics Association Awards</span></td><td><span>Outstanding Achievement in Comedy</span></td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"7\"><span>Primetime Emmy Awards</span></td><td>Outstanding Comedy Series</td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"7\"></td></tr><tr><td>Outstanding Lead Actress in a Comedy Series</td><td>Rachel Brosnahan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Supporting Actor in a Comedy Series</td><td>Tony Shalhoub</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\">Outstanding Supporting Actress in a Comedy Series</td><td>Alex Borstein</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Marin Hinkle</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Outstanding Directing for a Comedy Series</td><td>Amy Sherman-Palladino <span style=\"font-size:85%;\">(for \"All Alone\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Daniel Palladino <span style=\"font-size:85%;\">(for \"We're Going to the Catskills!\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\" rowspan=\"13\"><span>Primetime Creative Arts Emmy Awards</span></td><td rowspan=\"2\"><span>Outstanding Guest Actor in a Comedy Series</span></td><td><span>Luke Kirby</span> <span style=\"font-size:85%;\">(for \"All Alone\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"13\"></td></tr><tr><td><span>Rufus Sewell</span> <span style=\"font-size:85%;\">(for \"Look, She Made a Hat\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Guest Actress in a Comedy Series</td><td>Jane Lynch <span style=\"font-size:85%;\">(for \"Vote for Kennedy, Vote for Kennedy\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Casting for a Comedy Series</td><td>Cindy Tolan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Cinematography for a Single-Camera Series (One Hour)</span></td><td>M. David Mullen <span style=\"font-size:85%;\">(for \"Simone\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Hairstyling for a Single Camera Series</td><td>Jerry DeCarlo, Jon Jordan, Peg Schierholz, Christine Cantrell &amp; Sabana Majeed <span style=\"font-size:85%;\">(for \"We're Going to the Catskills!\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Make-up for a Single-Camera Series (Non-Prosthetic)</span></td><td>Patricia Regan, Joseph Campayno &amp; Claus Lulla <span style=\"font-size:85%;\">(for \"We're Going to the Catskills!\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Music Supervision</td><td>Robin Urdang, Amy Sherman-Palladino &amp; Daniel Palladino <span style=\"font-size:85%;\">(for \"We're Going to the Catskills!\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Period Costumes</td><td>Donna Zakowska, Marina Reti &amp; Tim McKelvey <span style=\"font-size:85%;\">(for \"We're Going to the Catskills!\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Production Design for a Narrative Period or Fantasy Program (One Hour or More)</td><td>Bill Groom, Neil Prince &amp; Ellen Christiansen <span style=\"font-size:85%;\">(for \"Simone\" &amp; \"We're Going to the Catskills!\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Outstanding Single-Camera Picture Editing for a Comedy Series</td><td>Kate Sanford <span style=\"font-size:85%;\">(for \"Simone\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Tim Streeto <span style=\"font-size:85%;\">(for \"We're Going to the Catskills!\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Sound Mixing for a Comedy or Drama Series (One Hour)</span></td><td>Ron Bochar, Mathew Price, David Bolton &amp; George A. Lara <span style=\"font-size:85%;\">(for \"Vote for Kennedy, Vote for Kennedy\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\" rowspan=\"39\">2020</td><td align=\"center\" rowspan=\"2\"><span>Golden Globe Awards</span></td><td>Best Television Series – Musical or Comedy</td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td>Best Actress – Television Series Musical or Comedy</td><td>Rachel Brosnahan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\" rowspan=\"3\"><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td>Best Comedy Series</td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td>Best Actress in a Comedy Series</td><td>Rachel Brosnahan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actress in a Comedy Series</td><td>Alex Borstein</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\"><span class=\"mw-redirect\">Producers Guild of America Awards</span></td><td>Outstanding Producer of Episodic Television – Comedy</td><td>Amy Sherman-Palladino, Daniel Palladino, Dhana Gilbert, Daniel Goldfarb, Kate Fodor, Sono Patel &amp; Matthew Shapiro</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"3\"><span>Directors Guild of America Awards</span></td><td rowspan=\"3\"><span>Outstanding Directorial Achievement in Comedy Series</span></td><td><span>Dan Attias</span> <span style=\"font-size:85%;\">(for \"It's the Sixties, Man!\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td>Daniel Palladino <span style=\"font-size:85%;\">(for \"Marvelous Radio\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Amy Sherman-Palladino <span style=\"font-size:85%;\">(for \"It's Comedy or Cabbage\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\" rowspan=\"4\"><span>Screen Actors Guild Awards</span></td><td>Outstanding Performance by an Ensemble in a Comedy Series</td><td>Caroline Aaron, Alex Borstein, Rachel Brosnahan, Marin Hinkle, Stephanie Hsu, Joel Johnstone, Jane Lynch, Leroy McClain, Kevin Pollak, Tony Shalhoub, Matilda Szydagis, Brian Tarantina &amp; Michael Zegen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"4\"></td></tr><tr><td>Outstanding Performance by a Male Actor in a Comedy Series</td><td>Tony Shalhoub</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\">Outstanding Performance by a Female Actor in a Comedy Series</td><td>Alex Borstein</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Rachel Brosnahan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>American Society of Cinematographers Awards</span></td><td>Outstanding Achievement in Cinematography in Regular Series for Non-Commercial Television</td><td><span>M. David Mullen</span> <span style=\"font-size:85%;\">(for \"Simone\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Costume Designers Guild Awards</span></td><td>Excellence in Period Television</td><td>Donna Zakowska <span style=\"font-size:85%;\">(for \"It's Comedy or Cabbage\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Casting Society of America</span></td><td>Television Series – Comedy</td><td>Cindy Tolan, Juliette Ménager &amp; Anne Davison</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span class=\"mw-redirect\">Art Directors Guild Awards</span></td><td>Excellence in Production Design for a One-Hour Period or Fantasy Single-Camera Series</td><td>Bill Groom <span style=\"font-size:85%;\">(for \"Panty Pose\" &amp; \"It's Comedy or Cabbage\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"2\"><span class=\"mw-redirect\">Writers Guild of America Awards</span></td><td>Television: Comedy Series</td><td>Kate Fodor, Noah Gardenswartz, Daniel Goldfarb, Alison Leiby, Daniel Palladino, Sono Patel, Amy Sherman-Palladino &amp; Jordan Temple</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td><span>Television: Episodic Comedy</span></td><td>Amy Sherman-Palladino <span style=\"font-size:85%;\">(for \"It's Comedy or Cabbage\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\" rowspan=\"8\"><span>Primetime Emmy Awards</span></td><td>Outstanding Comedy Series</td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"8\"></td></tr><tr><td>Outstanding Lead Actress in a Comedy Series</td><td>Rachel Brosnahan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Outstanding Supporting Actor in a Comedy Series</td><td>Tony Shalhoub</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Sterling K. Brown</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Outstanding Supporting Actress in a Comedy Series</td><td>Alex Borstein</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Marin Hinkle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Outstanding Directing for a Comedy Series</td><td>Amy Sherman-Palladino <span style=\"font-size:85%;\">(for \"It's Comedy or Cabbage\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Daniel Palladino <span style=\"font-size:85%;\">(for \"Marvelous Radio\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\" rowspan=\"12\"><span>Primetime Creative Arts Emmy Awards</span></td><td>Outstanding Guest Actor in a Comedy Series</td><td><span>Luke Kirby</span> <span style=\"font-size:85%;\">(for \"It's Comedy or Cabbage\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"12\"></td></tr><tr><td>Outstanding Guest Actress in a Comedy Series</td><td><span>Wanda Sykes</span> <span style=\"font-size:85%;\">(for \"A Jewish Girl Walks Into the Apollo...\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Casting for a Comedy Series</td><td>Cindy Tolan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Cinematography for a Single-Camera Series (One Hour)</span></td><td>M. David Mullen <span style=\"font-size:85%;\">(for \"It's Comedy or Cabbage\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Music Supervision</td><td>Robin Urdang, Amy Sherman-Palladino &amp; Daniel Palladino <span style=\"font-size:85%;\">(for \"It's Comedy or Cabbage\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Original Music and Lyrics</span></td><td>Thomas Mizer &amp; Curtis Moore <span style=\"font-size:85%;\">(for \"Strike Up the Band\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Period and/or Character Hairstyling</span></td><td>Kimberley Spiteri, Michael S. Ward &amp; Tijen Osman <span style=\"font-size:85%;\">(for \"A Jewish Girl Walks Into the Apollo...\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Period and/or Character Make-up (Non-Prosthetic)</td><td>Patricia Regan, Claus Lulla, Joseph Campayno, Margot Boccia, Michael Laudati, Tomasina Smith, Roberto Baez &amp; Alberto Machuca <span style=\"font-size:85%;\">(for \"It's Comedy or Cabbage\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Period Costumes</td><td>Donna Zakowska, Marina Reti, Sheila Grover &amp; Ginnie Patton <span style=\"font-size:85%;\">(for \"It's Comedy or Cabbage\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Production Design for a Narrative Period or Fantasy Program (One Hour or More)</td><td>Bill Groom, Neil Prince &amp; Ellen Christiansen <span style=\"font-size:85%;\">(for \"It's Comedy or Cabbage\" &amp; \"A Jewish Girl Walks Into the Apollo...\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Single-Camera Picture Editing for a Comedy Series</td><td>Kate Sanford &amp; Tim Streeto <span style=\"font-size:85%;\">(for \"A Jewish Girl Walks Into the Apollo...\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Sound Mixing for a Comedy or Drama Series (One Hour)</span></td><td>Mathew Price, Ron Bochar, George A. Lara &amp; David Bolton <span style=\"font-size:85%;\">(for \"A Jewish Girl Walks Into the Apollo...\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\" rowspan=\"3\">2021</td><td align=\"center\"><span>Hollywood Music in Media Awards</span></td><td><span>Best Original Song in a TV Show/Limited Series</span></td><td>Thomas Mizer &amp; Curtis Moore <span style=\"font-size:85%;\">(for \"One Less Angel\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>American Society of Cinematographers Awards</span></td><td>Outstanding Achievement in Cinematography in an Episode of a One-Hour Television Series – Non-Commercial</td><td>M. David Mullen <span style=\"font-size:85%;\">(for \"It's Comedy or Cabbage\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Cinema Audio Society Awards</span></td><td>Outstanding Achievement in Sound Mixing for Television Series – One Hour</td><td>Mathew Price, Ron Bochar, Stewart Lerman, David Boulton and George A. Lara <span style=\"font-size:85%;\">(for \"A Jewish Girl Walks Into the Apollo...\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"24\" align=\"center\">2022</td><td align=\"center\"><span>Set Decorators Society of America Awards</span></td><td>Best Achievement in Décor/Design of a One Hour Period Series</td><td>Ellen Christiansen and Bill Groom</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"4\" align=\"center\"><span>Hollywood Critics Association TV Awards</span></td><td>Best Streaming Series, Comedy</td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\" align=\"center\"></td></tr><tr><td>Best Actress in a Streaming Series, Comedy</td><td>Rachel Brosnahan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actor in a Streaming Series, Comedy</td><td>Tony Shalhoub</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actress in a Streaming Series, Comedy</td><td>Alex Bornstein</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\" align=\"center\"><span>Primetime Emmy Awards</span></td><td>Outstanding Comedy Series</td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"11\" align=\"center\"></td></tr><tr><td>Outstanding Lead Actress in a Comedy Series</td><td>Rachel Brosnahan <span style=\"font-size:85%;\">(for \"How Do You Get to Carnegie Hall?\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Supporting Actor in a Comedy Series</td><td>Tony Shalhoub <span style=\"font-size:85%;\">(for \"Everything Is Bellmore\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Supporting Actress in a Comedy Series</td><td>Alex Borstein <span style=\"font-size:85%;\">(for \"Everything Is Bellmore\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"7\" align=\"center\"><span>Primetime Creative Arts Emmy Awards</span></td><td>Outstanding Production Design for a Narrative Period or Fantasy Program (One Hour or More)</td><td>Bill Groom, Neil Prince &amp; Ellen Christiansen <span style=\"font-size:85%;\">(for \"Maisel vs. Lennon: The Cut Contest\" &amp; \"How Do You Get to Carnegie Hall?\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Cinematography for a Single-Camera Series (One Hour)</td><td>M. David Mullen <span style=\"font-size:85%;\">(for \"How Do You Get to Carnegie Hall?\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Period Costumes</td><td>Donna Zakowska, Moria Sine Clinton, Ben Philipp, Ginnie Patton, Dan Hicks &amp; Mikita Thompson <span style=\"font-size:85%;\">(for \"Maisel vs. Lennon: The Cut Contest\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Period and/or Character Hairstyling</td><td><span>Kimberley Spiteri</span>, Barbara Dally &amp; Daniel Koye <span style=\"font-size:85%;\">(for \"How Do You Get to Carnegie Hall?\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Period and/or Character Makeup (Non-Prosthetic)</span></td><td>Patricia Regan, Claus Lulla, Margot Boccia, Tomasina Smith, Michael Laudati, Roberto Baez &amp; Alberto Machuca <span style=\"font-size:85%;\">(for \"How Do You Get to Carnegie Hall?\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Original Music and Lyrics</td><td>Thomas Mizer &amp; Curtis Moore <span style=\"font-size:85%;\">(for \"How to Chew Quietly and Influence People\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Music Supervision</td><td>Robin Urdang <span style=\"font-size:85%;\">(for \"How Do You Get to Carnegie Hall?\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>Artios Awards</span></td><td>Outstanding Achievement in Casting – Television Comedy Series</td><td>Cindy Tolan, Anne Davison</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Art Directors Guild Awards</span></td><td>Excellence in Production Design for a One-Hour Period Single-Camera Series</td><td>Bill Groom <span style=\"font-size:85%;\">(for \"Maisel vs. Lennon: The Cut Contest\"; \"How Do You Get to Carnegie Hall?\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td align=\"center\"><span>Hollywood Music in Media Awards</span></td><td><span class=\"mw-redirect\">Best Original Song – TV Show/Limited Series</span></td><td>Thomas Mizer &amp; Curtis Moore <span style=\"font-size:85%;\">(for \"Maybe Monica\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>AACTA International Awards</span></td><td>Best Comedy Series</td><td><i>The Marvelous Mrs. Maisel</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\" align=\"center\"><span>American Society of Cinematographers Awards</span></td><td rowspan=\"2\">Outstanding Achievement in Cinematography in an Episode of a One-Hour Television Series – Non-Commercial</td><td>M. David Mullen <span style=\"font-size:85%;\">(for \"How Do You Get to Carnegie Hall?\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" align=\"center\"></td></tr><tr><td>Alex Nepomniaschy <span style=\"font-size:85%;\">(for \"Everything is Bellmore\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>Costume Designers Guild Awards</span></td><td><span>Excellence in Period Television</span></td><td>Donna Zakowska <span style=\"font-size:85%;\">(for \"Maisel vs. Lennon: The Cut Contest\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in a Comedy Series</span></td><td>Amy Sherman Palladino <span style=\"font-size:85%;\">(for \"How Do You Get to Carnegie Hall?\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}