{
  "imDbId": "tt3032476",
  "title": "Better Call Saul",
  "fullTitle": "Better Call Saul (TV Series 2015–2022)",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw8779665",
      "warningSpoilers": false,
      "date": "5 January 2023",
      "rate": "10",
      "helpful": "115 out of 122 found this helpful.",
      "title": "Better watch this",
      "content": "Had heard nothing but amazing things about 'Better Call Saul' (with nothing bad), with it being one of the most highly regarded shows in recent years. Am a huge fan of 'Breaking Bad', so was really psyched in seeing its prequel 'Better Call Saul' too. My opinion of Bob Odenkirk is also very high, so there was absolutely no way this was going to be missed. Have binged on many shows in the past seven years or so and was determined for this to be one of them, very like 'Breaking Bad'.'Better Call Saul' was every bit as amazing as reputed. Have seen many shows that started off wonderfully but declined badly in their final seasons, a few with really bad last episodes ('House of Cards', 'Game of Thrones', 'Killing Eve'), but then there are rarities like 'Breaking Bad' where every season was at least positively received and on the most part universally acclaimed. 'Better Call Saul' is another one of the rarities and is the first show seen in a long time to not have a bad episode in it, since 'Breaking Bad'. Seriously compelling and addictive stuff and exceptional in every area.Visually, 'Better Call Saul' is one of those shows that is both stylish and beautiful, with photography and editing that are cinematic quality and put a lot of films today to shame, where there are a lot of visually beautiful ones but also some painfully amateurish looking ones. The music always has the appropriate mood, never too intrusive, never too muted.The writing for 'Better Call Saul' is a fine example to all shows of how to have a lot of style but also to have a lot of substance. The dialogue throughout is thought-provoking and tense, although quite talky, while also have a darkly wicked sense of humour and heart-tugging pathos. The stories are texturally rich, intimate, tense and layered, with the pace of them consistently deliberate but taut. The pull no punches and gritty approach to the subject was often chilling and harrowing to watch. The direction couldn't be better.Likewise with the acting, with Odenkirk on absolutely towering form throughout as one of television's most fascinating and meatiest leading characters, one that one is repulsed by but also one that is not hard to sympathise with in some situations. Rhea Seehorn and Michael McKean are excellent as well, McKean giving one of his best work in years. The character writing is rich and compellingly real.Concluding, truly outstanding show. 10/10."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw8020114",
      "warningSpoilers": false,
      "date": "31 March 2022",
      "rate": "10",
      "helpful": "360 out of 403 found this helpful.",
      "title": "before the events of \"Breaking Bad\", the legal profession was a gritty field in Albuquerque",
      "content": "\"Breaking Bad\" was undeniably one of the greatest shows of the 21st century. If you then hear that one of the characters got a spinoff show, you could be forgiven for doubting the quality. Well, doubt no more. \"Better Call Saul\" is an equally fine piece of work.The protagonist is lawyer Saul Goodman (Bob Odenkirk), who it turns out is actually named Jimmy McGill. He engages in all manner of shady activity, while other characters from the previous show have their own things to deal with. As with the previous show, it's a serial, with episodes ending in cliffhangers. And make no mistake, you'll want to keep watching.Basically, it's the type of series that you have to see to believe. There have been lawyer shows and crime dramas, but never have they gotten combined so splendidly. It's the perfect mix of comedy, tragedy and thriller. Definitely see it."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8769203",
      "warningSpoilers": false,
      "date": "31 December 2022",
      "rate": "10",
      "helpful": "94 out of 101 found this helpful.",
      "title": "Absolutely Amazing!",
      "content": "Better Call Saul is not only considered one of the best shows of the last few years but it's also considered one of the best shows of all-time! The acting & storytelling are so good that it really does becomes addictive to watch. There's a reason why this show is one of the highest rated shows on this site and why it's always nominated for so many awards and that's because it's freaking amazing! People always want to compare it to Breaking Bad because it's a spin-off but don't. Even though it has the same feel and it's not quite as good as Breaking Bad, it's pretty darn close! I, along with everyone else who watched, was worried how they would end the show and hoping they wouldn't mess it up (like so many other great shows tend to do). Well, they didn't! The ending was fantastic and will go down as one of the better finales to a great show. If you are a fan of Breaking Bad then this is an absolute must watch!"
    },
    {
      "username": "BrnzReviews",
      "userUrl": "https://www.imdb.com/user/ur102393358",
      "reviewLink": "https://www.imdb.com/review/rw8840462",
      "warningSpoilers": false,
      "date": "31 January 2023",
      "rate": "10",
      "helpful": "59 out of 63 found this helpful.",
      "title": "Better Call Saul!",
      "content": "What an adventure that was, better call Saul in my eyes is the best spin off I've seen made. Featuring not only original Breaking Bad characters it introduces some really colorful people bringing the epic to an even more intense feeling like its predecessor.I loved Better Call Saul, its really interesting diving into the life of Jimmy Mcgill or as we know him Saul Goodman or even Slippin' Jimmy. I enjoyed learning more about Mike and gus it was really interesting seeing how everything started off, honestly such an experience.Highly recommend Its a great show with just as many twists and turns as breaking bad, hold onto your seats."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8840801",
      "warningSpoilers": false,
      "date": "31 January 2023",
      "rate": "10",
      "helpful": "68 out of 73 found this helpful.",
      "title": "One of the best shows ever created!",
      "content": "Better Call Saul has a 8.9 rating for a reason and that's because it's fantastic! It's absolutely one of the best shows ever created! The acting, writing, storytelling, etc are all as good as anything that's ever been on television. This was Emmy nominated for most outstanding drama every season it was on. The cast, led by Bob Odenkirk, are all amazing and all perfectly cast. There's not a weak link on the entire series. This is one of the rare spinoffs that is as good as the original. I'm blown away how they kept this show feeling so fresh and where every season is incredible. If you haven't seen this show yet then do yourself a favor and go watch it as soon as you can. Just warning you now though to give yourself enough time because you're going to want to binge it as fast as you can!"
    },
    {
      "username": "brenden33",
      "userUrl": "https://www.imdb.com/user/ur13999689",
      "reviewLink": "https://www.imdb.com/review/rw5673328",
      "warningSpoilers": false,
      "date": "25 April 2020",
      "rate": "10",
      "helpful": "774 out of 838 found this helpful.",
      "title": "It just keeps getting better and thats unheard of!!",
      "content": "Someone is responsible for making this such an outstanding show, year after year. The intelligence in dialogue, empathy for characters, twists and expectations are genius. Breaking bad, The X Files are 2 other badges of brilliance. We are privileged to be living in this time as we might have been if living during Shakespeare. This may seem over the top but the scores are on the board, Vince Gilligan. Please correct or remove if I am wrong!"
    },
    {
      "username": "minister_of_silly_walks",
      "userUrl": "https://www.imdb.com/user/ur64212521",
      "reviewLink": "https://www.imdb.com/review/rw8713698",
      "warningSpoilers": false,
      "date": "3 December 2022",
      "rate": "10",
      "helpful": "49 out of 53 found this helpful.",
      "title": "Prequel Done Right",
      "content": "Doing a prequel to one of the best TV shows ever made is no easy feat but Better Call Saul knocks it out of the park! It builds on the Breaking Bad universe further fleshing out and defying some of the recurring characters in the series while also introducing memorable storylines and new characters as well. It does it on a very high level with top notch cinematography, great scripts with a dash of humor, superb editing while further developing one of the most interesting Breaking Bad supporting players. Bob Odenkirk is fantastic as usual as the titular character stealing every scene he is in which is not an easy thing to do given the great all around cast of the series."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw6707082",
      "warningSpoilers": false,
      "date": "18 March 2021",
      "rate": "10",
      "helpful": "119 out of 140 found this helpful.",
      "title": "Everything is great about Better Call Saul",
      "content": "Exceptional cast just as good as Breaking Bad, writing is superb, soundtrack is so good, cinematography shots are very nice, and entertainment value is bomb! I'm surprised Bob Odenkirk hasn't won any of the Emmy nominations he's been up for. I'm a few seasons in when I started the series I wasn't reviewing then, glad I'm watching the show again I forgot how good it is. I love that the same crew from Breaking Bad is involved!"
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3179934",
      "warningSpoilers": false,
      "date": "9 February 2015",
      "rate": "",
      "helpful": "591 out of 716 found this helpful.",
      "title": "As darkly comic and multilayered as Breaking Bad, yet very much its own thing",
      "content": "So here it is at last: one of the most highly anticipated new TV-shows of the year, the spin-off from probably THE most highly praised TV-show in the history of Television. Naturally, expectations were over the roof - and it was a forgone conclusion that meeting those expectations would be next to impossible. Well, here's the good news. Judging from the first couple of episodes, 'Better Call Saul' will be good. Just how good remains to be seen, but as far as promises go, those first episodes made a big one.For those who haven't seen it yet: relax - I won't spoil a thing about the storyline. Instead, I'll concentrate on all other aspects of the show. The first thing you notice (as was the case with Breaking Bad) is the camera. The photography is simply gorgeous. All the visual trademarks I've grown to love so much in BB are there: the playful camera angles; the creative ways to establish even a simple scene with unusual, interesting shots (yet without ever distracting from the storytelling) - it's just beautiful to look at. Then there's the music. From the wonderful introductions (before the opening credits) to the last scene of an episode, music is not just used as background \"noise\": carefully picked songs are there to give clues and are as much an integral part of the story as they help establish the tone of certain scenes. And the original music by Dave Porter feels as organic to 'Better Call Saul' as it did in 'Breaking Bad'.The writing, directing and acting (so far) are on par with BB; anyone afraid this would be a rushed production trying to surf on BB's success can relax; not for a second did I get the feeling this was somehow not well thought through or cheaply constructed by a committee of writers - and although we do of course get some of our favorite characters back, new ones are introduced that promise to be just as original and interesting as the ones that helped turn BB into a cultural phenomenon. And adding high calibre actors such as Michael McKean ('This Is Spinal Tap') to the cast is probably an indication that Vince Gilligan and Peter Gould will not content themselves - or us - by mainly exploring the characters we already know. And then, finally, there's the magnificent Bob Odenkirk. Starting off as a slightly one-dimensional character and comic relief in BB, the character we've come to love as the sleazy, slick Saul Goodman has already shown more layers in the first half of the first season of 'Better Call Saul' than over his entire run on BB. And that's as much thanks to Odenkirk as the fantastic writing: the actor obviously relished the opportunity to show what he's capable of as his character charms, squirms and threatens his way through his scenes, but - somewhat unexpectedly - he also manages to move you during the more quiet moments. To sum up my overall impressions: 'Better Call Saul' is a darkly comic, multilayered story that could end up being just as unusual and exciting as we all dared to hope. The tone may be consistent with 'Breaking Bad', but make no mistake: this is very much its own thing. The writing, directing and acting - as well as the production values - are top notch, and if what we've seen so far is anything to go by, we're in for a great first season of a very promising new show. My (provisional) rating: 9 stars out of 10Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "warriorytx",
      "userUrl": "https://www.imdb.com/user/ur128618288",
      "reviewLink": "https://www.imdb.com/review/rw6669855",
      "warningSpoilers": false,
      "date": "7 March 2021",
      "rate": "10",
      "helpful": "518 out of 557 found this helpful.",
      "title": "Easily one of the greatest shows of all time",
      "content": "People who are fans of Breaking Bad should definitely watch this it expands the Albuquerque criminal underworld to unparalleled heights. It's easily one of the most tragic, beautifully written and directed shows of all time and for me at least is at the top of the list of my favourite shows it's tied with Breaking Bad. I'm not really someone who's into the crime genre but this show as well as Breaking Bad are two all time great crime dramas that I actually LOVE. It's a master class of writing and direction. This show is the fastest show I've binged I finished the first 4 seasons in a matter of 3 days. Season 5 isn't out in Canada on Netflix yet."
    },
    {
      "username": "dszabo-53136",
      "userUrl": "https://www.imdb.com/user/ur142565377",
      "reviewLink": "https://www.imdb.com/review/rw8820275",
      "warningSpoilers": false,
      "date": "23 January 2023",
      "rate": "10",
      "helpful": "39 out of 42 found this helpful.",
      "title": "Very good",
      "content": "I would rate Better Call Saul as a critically acclaimed and must-watch prequel series to Breaking Bad. The show, created by Vince Gilligan and Peter Gould, follows the story of Jimmy McGill, a small-time lawyer, as he transforms into the criminal lawyer Saul Goodman.The series features outstanding performances, particularly from Bob Odenkirk as Jimmy/Saul, who delivers a nuanced and captivating portrayal of the character's evolution. The writing is also exceptional, with well-crafted and complex storylines that keep the audience engaged and invested in the characters. The series also features a strong sense of atmosphere and setting, with each season taking place in different locations, adding to the show's unique tone and feel.The show also explores themes of morality, ethics, and the consequences of one's actions, adding a layer of depth to the story.Overall, I highly recommend Better Call Saul for fans of Breaking Bad and those looking for a series with complex and well-crafted storylines, superb acting, and a strong sense of atmosphere and setting. The show's exploration of themes of morality, ethics, and the consequences of one's actions, adds a layer of depth to the story. It's a great series that stands on its own, not just as a prequel but as a compelling and engaging story."
    },
    {
      "username": "EVON1TY",
      "userUrl": "https://www.imdb.com/user/ur47939660",
      "reviewLink": "https://www.imdb.com/review/rw8926330",
      "warningSpoilers": false,
      "date": "13 March 2023",
      "rate": "10",
      "helpful": "28 out of 30 found this helpful.",
      "title": "The most intense and complicated characters ever written.",
      "content": "Better Call Saul was misunderstood at beginning. Some of the people were saying nonsense things. Some of them expected a TV show that similiar to Breaking Bad. It's definelty not similiar and it can't be.The under-rated first season was quite an openning with its amazing twist. They build the most intense and complicated characters in this TV serie. Vince Gilligan is just brilliant at writing complicated characters. Characters even those who you hate are written perfectly, just like in Breaking Bad.Every season characters evolving even slower. Every season adds a value to all the characters, adds a value and meaning to their purpose of actions. You're realizing even the characters from Breaking Bad wasn't complete. You're realizing, you just learnt characters motivation.Can you imagine a complex character like Walter White, Saul Goodman, Chuck McGill, Gustavo Fring? I bet you can't find many.Screenplay and Acting Performances are just brilliant. But also the technical details are in Better Call Saul is pretty amazing.Cinematography is just perfect, amazingly done, so beautiful shots.Film Editing is also so underrated in this show. Film Editing is so good. They know when to cut the scene, they know how to transfer the scene to the audience.Costume Design is also quite good. Thanks to the costume designer, once again represents the characters motivation at the time.Makeup is also quite good, you can't fix that easily the aging problem. I think they've managed a good job, I don't know if could it be better."
    },
    {
      "username": "brooksrob1",
      "userUrl": "https://www.imdb.com/user/ur33279366",
      "reviewLink": "https://www.imdb.com/review/rw8797458",
      "warningSpoilers": true,
      "date": "13 January 2023",
      "rate": "10",
      "helpful": "40 out of 45 found this helpful.",
      "title": "IN THE TOP 5 SERIES EVER PRODUCED",
      "content": "Just finished the third binge watch, and the finale, with Jimmy leaning against the wall with Rhea sharing a cigarette in the prison Jimmy will be for decades to come, was so poignant, it drove me to give a review.There were some really slow parts to the series, which I wish would have been shortened. The Salamanca's and Lalo were amazing! Gus Fring, whose acting name I can't recall, was as important as Odenkirk in the series. So dark!What made the show so watchable was to keep pondering that this all predates Breaking Bad. Those two don't show up until season 6 near the end...Which was great! It allowed you to become more involved with Saul.Howard Hamlin character was amazing too. His one scene where he's going into the conference room with Rhea for that Banker case and his face changes from almost furious to a big smile...Was dark, it reminded me of The Boys and the homelander character... Anyway. If you haven't seen the series... You're in for a treat...I actually KNOW people that haven't seen one single episode.Just incase, the top five series are The Wire Parks and Recreation Veep Brockmeier Better Call Saul."
    },
    {
      "username": "nagsaptarshi",
      "userUrl": "https://www.imdb.com/user/ur20190389",
      "reviewLink": "https://www.imdb.com/review/rw8873943",
      "warningSpoilers": false,
      "date": "16 February 2023",
      "rate": "9",
      "helpful": "36 out of 40 found this helpful.",
      "title": "Better Call Sau vs Breaking Bad !",
      "content": "After Breaking Bad, I had come to a vague conclusion that no show ever could match its brilliance. So, even though I was very much aware of the fact that Better Call Saul is a well-made spinoff of Breaking Bad which is regarded by many as the best show ever made on earth, I was not to indulge any more in that world of good vs bad, family vs cartel, right choices vs wrong choices. It was my dear old friend who almost forced me to start giving myself a chance. And upon his persistent persuasions, I finally gave in and began my tryst with Better Call Saul, lovingly referred as BCS by us. And the first lesson I learnt within just a few episodes, never come to any conclusion purely on the basis of perception without having the first-hand experience of something. Better Call Saul is an experience of a lifetime, to be savoured and to be shared.Breaking Bad with its cult storyline has many similarities with its successor (or predecessor?). In BB, it was the transformation of a simpleton school teacher to a drug monster. It was the transformation of family loving Walter to money loving Heisenberg. In BCS, its about the transformation of the happy-go-lucky Jimmy McGill to the notorious conman Saul Goodman. But Breaking Bad didn't try to be non-linear for a single moment. Maybe that was the moot point why it had gained such universal approval. BCS takes the tougher path and shines gloriously. It is like a time travel. It is about stories within stories. BB was happy to portray human angst and desperation in time of crisis. It was about how greed turns a man to a monster. But it stayed within the boundary of a thriller. Better Call Saul is more about exploring the intricacies of human relations, changing dynamics of inter-personal complexities, decaying values. It's perplexing, non-linear and sheer experimentation with human emotions where a scene of smear of blood oozing out from a skull is succeeded by Goodman chomping on a piece of meat dipped in red sauce. Marvelous!Breaking Bad was about hellraisers. BCS is about that hell. Breaking Bad had wider scopes to explore every single character as the narrative was straightforward and the number of key characters was less. BCS had the tougher task as it had to show the background of some of the already known characters and it introduced so many new characters. Just think about the character of Nacho Varga. Even though you don't really appreciate his ways or choices, you cannot stop loving or rooting for him in some nail-biting scenes. Chuck is another character built with so much care, so much passion, so much craft and so many complex layers. Same about Howard Hamlin. You tend to forget what is right and what is wrong which I think an aspect of BCS conspicuously absent in the mother show. Comedy in BB was limited to the chemistry of Walter and Jesse. BCS takes comedy seriously! And transformation from a comic scene to gory murder is frequent and flawless. Camera works in both the shows are top-notch but BCS is a bit ahead maybe because of the advanced technology in the time gap between the two shows. Another aspect where BCS overpowers its illustrious predecessor is music. From the Bengali song Henna Henna to the mellifluous adaptation of Nancy Sinatra's Sugar Town, from the classical Laundry Workers to the foot tapping romantic Something Stupid, music of BCS is a revelation. Did I forget to mention that Rhea Seehorn made the show much more exciting than Breaking Bad where the protagonist ladies often played spoilsports.Both the shows in my opinion are unparallel, incomparable and unique in their own style and right. Nothing can ever take the credit from Breaking Bad for what it has done to the TV industry. But Better Call Saul deserves standing ovation in its own right. Personally, I found BCS more enchanting. But that's absolutely a personal choice. Let's celebrate the victory of Vince Gilligan and Peter Gould who have given us such back-to-back masterpieces. Life of a film buff like me would have remained incomplete without these two."
    },
    {
      "username": "dadovnik",
      "userUrl": "https://www.imdb.com/user/ur111795088",
      "reviewLink": "https://www.imdb.com/review/rw8817962",
      "warningSpoilers": false,
      "date": "22 January 2023",
      "rate": "10",
      "helpful": "41 out of 43 found this helpful.",
      "title": "Cannot believe they never won an Emmy",
      "content": "This show is right up there with Breaking Bad. With Bob Odenkirk and Vince Gilligan back in the saddle what an incredible show and what incredible writing. Especially how it ties everything together, and the timeline sort of go back and forth and interweave. Season 6 has a guest appearance with Carol Burnett who does a wonderful job in a dramatic role. So sad this had to end, especially with not one single Emmy win! What a disgrace.Rhea Seehorn is brilliant as well as Giancarlo! Just wow, so sad that it had to end. I don't know what I will watch now. Hey Vince, can you please write another show like this?"
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw5880386",
      "warningSpoilers": false,
      "date": "4 July 2020",
      "rate": "9",
      "helpful": "118 out of 147 found this helpful.",
      "title": "An impressive 'Breaking Bad' Prequel",
      "content": "These comments are based on watching the first five seasons of the show.This series is set before the events shown in the series 'Breaking Bad'. It shows us how Jimmy McGill, conman turned lawyer goes from being a defender of the desperate to knowing players in New Mexico's drug dealing underworld. Jimmy isn't the only 'Breaking Bad' characters to feature; plenty of others show up, some as main characters others as important cameos. There are also plenty of new characters; I won't say which characters belong to which group so as not to spoil anything for those yet to watch 'Breaking Bad'.As the story opens Jimmy is taking on a series minor cases as a public defender. He is also looking after his brother, Chuck. Chuck is a partner at a prestigious law firm but hasn't worked for some time as he believes he is allergic to electronic devices. Other key characters include Jimmy's friend Kim Wexler, a lawyer at Chuck's firm and Mike Ehrmantraut, a former Philadelphia police officer who when we first meet him is working at a parking attendant.Over the course of the series we see Jimmy get into a number of scrapes and dodgy plans as he tries to advance his legal career; these inevitably lead to him meeting some dangerous characters. Meanwhile Mike is looking for other work which leads to him meeting even more dangerous people; most notably Gustavo Fring and various members of the Salamanca crime family.I must admit I was a little unsure about this series; I really enjoyed 'Breaking Bad' and thought Saul Goodman was a great character but was unsure if he'd be able to carry a series... I needn't have been concerned. This series is really good. Importantly it doesn't matter whether you've seen 'Breaking Bad' or not. The characters are great and the story interesting. It might not move as fast as some would like but I'd rather a story takes its time being told than have it feel rushed. The cast is great; most notably Bob Odenkirk, Johnathon Banks and Rhea Seehorn as Jimmy, Mike. The rest of the cast, be they returning from 'Breaking Bad', new recurring characters or just minor roles also impress. Overall I'd definitely recommend this whether you are a fan of 'Breaking Bad' or not... it provides great drama, a good amount of tension and a fair few unforced laughs. I can't wait for season six."
    },
    {
      "username": "grahamvandyke",
      "userUrl": "https://www.imdb.com/user/ur26642588",
      "reviewLink": "https://www.imdb.com/review/rw4504512",
      "warningSpoilers": false,
      "date": "10 December 2018",
      "rate": "9",
      "helpful": "500 out of 612 found this helpful.",
      "title": "Thank god I decided to give this a chance",
      "content": "Let's face facts: Spin-off TV shows tend to fare poorly to the original content. I was furious when I heard about the spin-off to the amazing Break Bad. Nonetheless centering around the buffoonish clown of a character Saul Goodman?! I was livid and heartbroken. I wanted Breaking bad to end on a high note and not let this potential disaster ruin it's legacy.Breaking Bad was an absolute masterpiece of a show, with an amazing story, script, cinematography; you name it, it's there. But the one thing that made Breaking Bad shine, and in my option, be one of the greatest series ever made was it's deep, deep burial into the characters that made us either absolutely love or loath them. It didn't rely on special effects and had no fat to it whatsoever. No other show encapsulated a slow unfurling of characters so well that it was as if we were getting to know them in our real lives.I finally decided to give Better Call Saul a shot after hating it's first episode on release. I figured, maybe I could eventually forget about the fact that it was attached to my favorite TV show, and when everybody who watches it is telling you it's amazing, there must be something there.. right?Boy, were they right. Better Call Saul is just as good as it's predecessor. It maintains it's very high standard to every aspect of the production, and most of all, character development, motivation and relationships are centerfold once more. It is easy to find Better Call Saul even better than Breaking Bad, although I would chalk this up to it being more current and therefore more in the forefront of our minds in the Breaking Bad universe. If you, like me, have hesitated to give this show a shot for the same reasons, stop it. Let yourself feel uncomfortable for the 1st half of the first season, and then let it get it's clutches into you.I'm so, so very happy I finally decided to give Better Call Saul a shot again 4 years later. With no hesitation, 10/10."
    },
    {
      "username": "saadanathan",
      "userUrl": "https://www.imdb.com/user/ur98033888",
      "reviewLink": "https://www.imdb.com/review/rw8696007",
      "warningSpoilers": false,
      "date": "26 November 2022",
      "rate": "9",
      "helpful": "33 out of 38 found this helpful.",
      "title": "After watching this show, I'd rather not have a lawyer 9/10",
      "content": "Better Call Saul is known to many as one of the best shows ever made in TV history, if not the best.I've stated before that in my opinion, there are three major shows that affected TV shows and have been groundbreaking for its establishment: The Sopranos, Breaking Bad and Game of Thrones. Each of these shows have been compelling and fan favorated for many reasons, the brilliant screenplay being the main key feature.Better Call Saul has among the best written screenplays I have ever encounter. Rather it be the sleazy characters, the establishing shots within each episode, the revelations coming at the near end of every episode or the basic metaphors. Better Call Saul may be part of the same universe as Breaking Bad. But that does not mean at all that it rides on the success of the older show. If anything than BCS (Better Call Saul) is its own standalone show that puts itself on the same level as the other three shows mentioned before.The fact is that because this is a show created by Vince Gilligan and Peter Gould - two people who understand writing, structure and story. Then it is assured that the show is promising. So you're sure to not be disappointed while watching.The plot centers around Jimmy McGill (Bob Odenkirk) a slippin crook with a sleazy persona who cons and scams at every opportunity he gets. Until he messes with the wrong people and slowly builds his ultimate character, the one we grew to love from his first appearance in Breaking Bad: Saul Goodman. Throughout the show we are revealed to many ups and downs Jimmy/Saul goes through in his life: his relationship with his friend Kim Wexler (Rhea Seehorn), Mike Ehrmantraut (Jonathan Banks) and his brother Chuck (Michael McKean).Seasons 1 and 2 are a bit slow in regards of story, many episodes that are filler, which I like because it gives you much detail and depth into story. Once season 3 kicks in and Gus Fring (Giancarlo Esposito) appears then the show improves and gets much better. The tensions between him and the Salamancas are an essential part of the overall story, along with Mike and Nacho's (Michael Mando) relationship.Eventually, the pre - Breaking Bad era comes to an end at the fateful encounter with Walter White and Jesse Pinkman. Leading to the plot we know from the previous show up until the black and white scenes where Jimmy's alter ego Gene Tacovick is living in hideout.Among the many elements, features and aspects the series is successful for such as the soundtrack, filming and acting. BCS is gifted with so many elements that make it a remarkable series and one that will be remembered for many years, this is the kind of shows that should be taught in film classes, among other shows such as Breaking Bad. Just look up all the analysis on YouTube surrounding this show to fully understand its influence. Yet there is one thing this show did on a negative aspect: It made me reconsider having a lawyer in my life."
    },
    {
      "username": "philrealdeal",
      "userUrl": "https://www.imdb.com/user/ur67695591",
      "reviewLink": "https://www.imdb.com/review/rw8792400",
      "warningSpoilers": false,
      "date": "11 January 2023",
      "rate": "10",
      "helpful": "27 out of 28 found this helpful.",
      "title": "The pinnacle of television",
      "content": "Full disclosure: there are several shows that reach the top. Each for their own way. This one hits the mark for me and so much more.The acting in particular is unbelievable. The way that each of the leads out so much passion into each episode is so powerful. More than once, I've lost it because of the contagiousness of emotion and how it all felt so real.The way each character is developed over time, the slow burn of it all is exactly what should be shown in film classes everywhere.Also, Gilligan et al. Are masters of cinematography. Their trademark wide shots let the show develop and give a ton of weight the the situation. Love it."
    },
    {
      "username": "ruelshepperd",
      "userUrl": "https://www.imdb.com/user/ur87805425",
      "reviewLink": "https://www.imdb.com/review/rw8670169",
      "warningSpoilers": false,
      "date": "12 November 2022",
      "rate": "10",
      "helpful": "26 out of 28 found this helpful.",
      "title": "Character drama at its finest!!",
      "content": "What can I say that hasn't already been said about this show. The successor/spinoff to Breaking Bad not only expands on the universe, enhancing the experience provided by its top-notch predecessor but can also stand on its own as a fantastic show with some the best writing in any TV show.Better Call Saul is riveting right from the beginning, with slower pacing and character-focused drama. Characters you loved in Breaking Bad re-appear in this show and they are all given more development and expansions to their characters, really adding to their arcs in Breaking Bad. While Walter White may be the best character in this universe, the unique side-characters in BCS are better than the ones in BB. Nacho Varga, Lalo Salamanca, Chuck Mcgill, Kim Wexler and Howard Hamlin are all standout characters all going through thoroughly developed and captivating arcs and all are played by excellent actors. Lalo Salamanca might just be the best villain in all of television, surpassing even the legendary Gus Fring whose character is also expanded upon.It amazes me how the comic relief character in Breaking Bad is now one of the most tragic protagonists in TV history. Bob Odenkirk and the writers inject Jimmy Mcgill with so much emotion and internal conflict. His transformation into Saul Goodman is truly heart-breaking, going from a somewhat compassionate con-man to a uncaring, money-loving criminal lawyer. His relationship with Kim Wexler is one of the best romances ever written.Another element in which BCS beats BB is the cinematography. It all feels intentional and meticulously crafted. At times the show feels truly cinematic, really immersing you into the drama. This show is a masterful example of visual storytelling. The dialogue is excellent, much like BB and the music choices are perfect.If there are any problems with this show, at times the slow pacing can almost be too slow with not a lot of substance happening and some extended montages that go on for too long. If you've watched BB prior to this, some tension is robbed from pivotal scenes yet, the emotional moments towards the end of the show hit harder with the events of BB in mind.Overall, Better Call Saul stand shoulder to shoulder with Breaking Bad as one of the greatest TV shows of all time. It excels at character drama and visual storytelling and while the plot and acting aren't quite as strong as BB, the show more than makes up for it in the character department. Watch this and BB back to back for the best experience possible but BCS still stands on its own as the ultimate example of a spinoff done right."
    },
    {
      "username": "rainerraff-87519",
      "userUrl": "https://www.imdb.com/user/ur64963406",
      "reviewLink": "https://www.imdb.com/review/rw5713383",
      "warningSpoilers": false,
      "date": "6 May 2020",
      "rate": "10",
      "helpful": "329 out of 369 found this helpful.",
      "title": "Saul definitely deserves love too from Breaking Bad fans.",
      "content": "One thing that stopped me from watching this movie is because I knew this show has nothing to do with Walter White, the man that makes Breaking Bad, Breaking Bad. I believe most people also think the same.Personally, after rewatching Breaking Bad few times, I have come to the conclusion that there is nobody in the show that I love from the beginning until the last second. What I like the most is the character development for all the important characters.Then? What does it have to do with Better Call Saul? I believe I love this show as much as Breaking Bad because of the exact reason. I REALLY love how every character behaves and develops in this show. What more fascinating is, this show has everything you like from Breaking Bad. Tension, emotions, atmosphere, character flaws, good antagonists, you name it. One other similarity this show has, this show gets better when it is closer to the end. (I know, it has not ended yet) You really don't want to miss every second of it.I can assure you, all Breaking Bad fans, your love to this show will be AT LEAST as big as your love to Breaking Bad. Easiest 10/10 after Breaking Bad."
    },
    {
      "username": "wessamsayed",
      "userUrl": "https://www.imdb.com/user/ur64709853",
      "reviewLink": "https://www.imdb.com/review/rw8780499",
      "warningSpoilers": false,
      "date": "5 January 2023",
      "rate": "9",
      "helpful": "32 out of 33 found this helpful.",
      "title": "phenomenal!!!",
      "content": "I saw season one last year and i kinda felt bored, I was on the fence whether to continue or not. I gave it another shot this year and i fell in love with every single detail!! This is probably one of the best shows ever made!It's not for everyone! You have to be a breaking bad fan to adore better call saul!I'm so impressed with the colours and metaphors used to illustrate the mood of the scenes or to give you a hint about what's going to happen. I love how everything is created to give a certain meaning!The development of the characters is absolutely fascinating. I can't get over the last 3 or 4 episodes till now!! This is highly recommended and a must watch!"
    },
    {
      "username": "drechseltyler",
      "userUrl": "https://www.imdb.com/user/ur153078192",
      "reviewLink": "https://www.imdb.com/review/rw8762374",
      "warningSpoilers": false,
      "date": "28 December 2022",
      "rate": "10",
      "helpful": "46 out of 46 found this helpful.",
      "title": "A Slow Burn That Is 100% Worth It",
      "content": "Many people say that this show is better than the show that started it all, Breaking Bad. And while I don't agree with that, Better Call Saul puts up a really good fight and ultimately has become my second favorite TV show of all time(the first being Breaking Bad). If you go into this show expecting it to be similar to Breaking Bad, you're not going to enjoy it. Even though they are in the same universe, Breaking Bad and Better Call Saul are pretty different. There are two stories being told in the show. One story is the story of James M. McGill,(Saul Goodman in Breaking Bad) a man who's struggling with his career as a lawyer. And the other story is the story of Mike Ehrmantraut, a man who gets involved with the world of crime. Similar to the film Inglourious Basterds (2009), the show tells two different stories that collide for the ending. Each story builds up, adding more and more details to the plot until they both get to a point where they collaborate in an incredible and jaw-dropping finale. The show is also masterful at making the viewer understand exactly how each of the characters think and act. It makes you feel like your best friends with each of the characters in the sense that you know everything about them. What makes them angry, what makes them happy, what their interests are, etc. The show also has many easter eggs to Breaking Bad and answers some of the questions that were never answered in the show. The cinematography is also phenomenal. From the variety of bright and beautiful colors, to the camera angles, it's gorgeous to look at. Another great thing in the show is one of the many themes portrayed in it. That theme being that the law isn't perfect. Jimmy and other lawyers are able to use many different loopholes in the justice system to get their way. The final episode especially, shows that even though many people think of the law as sacred, it is anything but perfect. The acting is also great with Bob Odenkirk giving a phenomenal performance. Another story that this show tells is the story of Saul Goodman after the events of Breaking Bad, which are filmed in beautiful black and white. This part of the show is especially entertaining to the Breaking Bad fans. All in all, if you liked Breaking Bad, I would highly recommend this show. In my opinion, it was definitely worth my time. 10/10."
    },
    {
      "username": "Her-Excellency",
      "userUrl": "https://www.imdb.com/user/ur67432377",
      "reviewLink": "https://www.imdb.com/review/rw5640008",
      "warningSpoilers": false,
      "date": "14 April 2020",
      "rate": "10",
      "helpful": "91 out of 115 found this helpful.",
      "title": "Kim Wexler: the Perfect Woman and the Antithesis of Skylar White",
      "content": "Not only is Rhea Seehorn, who plays Kim, extremely pretty, but the character is rich and deep in ways every person should aspire to be. In short, Kim Wexler is the polar opposite and the very antithesis of Skylar White.Kim, alone, is enough to not only watch Better Call Saul, but to rate it a 10.The thing is, that BEYOND the 'perfect woman' that is Kim, it isn't only she who makes up the wonderful tapestry of interwoven majesty that is this series. As if her character were not enough to convince you of this series' greatness, on top of it, you have a myriad of characters almost as fabulous and just as engaging. To not list them all would be an insult; and yet to list them all would be an exercise in futility. Not only is every major character written and directed as only the geniuses who brought us Breaking Bad could write and direct them, but they are portrayed fabulously by everyone onscreen. EVEN the extras and lesser-used characters are standouts.Now, Better call Saul moves at a pace that is not for everyone. The story progresses somewhat more slowly than other series/shows. The plus side is that it gives you time to enjoy each moment of this subtle (not slap-you-in-the-face, willy-nilly), but delightfully presented jewel of a look into the time before the monumentally amazing story of Breaking Bad took place.I can't say it enough: watch it. If you watched some and thought it was not for you, watch it again. You'll thank me."
    },
    {
      "username": "george_aten13",
      "userUrl": "https://www.imdb.com/user/ur10571055",
      "reviewLink": "https://www.imdb.com/review/rw8598285",
      "warningSpoilers": true,
      "date": "9 October 2022",
      "rate": "10",
      "helpful": "43 out of 50 found this helpful.",
      "title": "A fairytale gone bad",
      "content": "Better call Saul!...in my opinion as good as BB. BCS has everything. Action, drama....but it's deeper. It's about remorse, regrets and mistakes that we make in life. I thing that everyone can feel Jimmy McGill.The cast is brilliant in every way. The story brilliant too.The last episode is just heartbreaking. Especially the last scene between Jimmy and Kim. They two deserved to be together. But Kims and Jimmys love story, (and they still loves each other), is a fairytale that gone bad. Neither of them are bad people. But some choices with combination of unlucky destiny, made things impossible for them to be together.Watching Kim walking away from the prison...the way Jimmy looks at her and she looks at him...you can see that they still love each other. You can see Jimmys regret for bad choices he made and for those choices he has lost Kim.Just heartbreaking...bad we know that it wouldn't be a good ending, as in BB.Better call Saul is the best show I have ever seen."
    }
  ],
  "errorMessage": ""
}