{
  "imDbId": "tt3032476",
  "title": "Better Call Saul",
  "fullTitle": "Better Call Saul (TV Series 2015–2022)",
  "type": "TVSeries",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "Better Call Saul",
  "url": "https://en.wikipedia.org/wiki/Better_Call_Saul",
  "plotShort": {
    "plainText": "Better Call Saul is an American legal crime drama television series created by Vince Gilligan and Peter Gould for AMC. Part of the Breaking Bad franchise, it is a spin-off from Gilligan's previous series, Breaking Bad (2008–2013), to which it serves as both a prequel and sequel. Better Call Saul premiered on AMC on February 8, 2015, and concluded on August 15, 2022, after six seasons consisting of 63 episodes.\r\nSet primarily in the early 2000s in Albuquerque, New Mexico, several years before Breaking Bad, Better Call Saul examines the moral declines of Jimmy McGill (Bob Odenkirk), an earnest lawyer and former con artist who becomes the egocentric criminal-defense attorney Saul Goodman, and Mike Ehrmantraut (Jonathan Banks), a former corrupt police officer who becomes a fixer and enforcer for drug traffickers. Other main characters include Jimmy's romantic interest and colleague Kim Wexler (Rhea Seehorn), his brother and rival Chuck McGill (Michael McKean), Chuck's law partner Howard Hamlin (Patrick Fabian), the drug dealer Nacho Varga (Michael Mando), the drug lord Gus Fring (Giancarlo Esposito), and the cartel enforcer Lalo Salamanca (Tony Dalton). In addition to the primary storyline, Better Call Saul includes black-and-white flashforwards set in 2010, after the events of Breaking Bad, which explore the consequences of Saul's eventual partnership with the drug lord Walter White (Bryan Cranston).\r\nGilligan, who created and developed Breaking Bad, and Gould, who wrote the Breaking Bad episode \"Better Call Saul\", began considering a Saul Goodman spin-off in 2009. Because Saul's role in Breaking Bad had expanded beyond the writing staff's plans, Gilligan felt he could be explored further. He and Gould considered making a half-hour legal comedy featuring Saul and his various clients, but settled on an hour-long tragedy showing how he develops into the character seen in Breaking Bad. Better Call Saul's development began during the production of Breaking Bad's final season in 2013, with Gilligan and Gould serving as co-showrunners and numerous production staff returning. Odenkirk, Banks, and Esposito reprise their roles from Breaking Bad, as do many others in guest appearances. Gilligan left Better Call Saul early in the third season—making Gould the sole showrunner for the remainder of its run—though he returned to help write the final season.\r\nBetter Call Saul received critical acclaim, with praise for its acting, characters, writing, direction, and cinematography. Many reviewers considered it a worthy successor to Breaking Bad—some deeming it superior to its predecessor—and one of the greatest television series of all time. It has garnered many awards and nominations, including two Peabody Awards, 48 Primetime and Creative Arts Emmy Awards, 19 Writers Guild of America Awards, 20 Critics' Choice Television Awards, nine Screen Actors Guild Awards, and six Golden Globe Awards nominations. At the time of its airing, the series premiere held the record for the highest-rated scripted series premiere in basic cable history.",
    "html": "<p>Better Call Saul is an American legal crime drama television series created by Vince Gilligan and Peter Gould for AMC. Part of the Breaking Bad franchise, it is a spin-off from Gilligan's previous series, Breaking Bad (2008–2013), to which it serves as both a prequel and sequel. Better Call Saul premiered on AMC on February 8, 2015, and concluded on August 15, 2022, after six seasons consisting of 63 episodes.</p><p>Set primarily in the early 2000s in Albuquerque, New Mexico, several years before Breaking Bad, Better Call Saul examines the moral declines of Jimmy McGill (Bob Odenkirk), an earnest lawyer and former con artist who becomes the egocentric criminal-defense attorney Saul Goodman, and Mike Ehrmantraut (Jonathan Banks), a former corrupt police officer who becomes a fixer and enforcer for drug traffickers. Other main characters include Jimmy's romantic interest and colleague Kim Wexler (Rhea Seehorn), his brother and rival Chuck McGill (Michael McKean), Chuck's law partner Howard Hamlin (Patrick Fabian), the drug dealer Nacho Varga (Michael Mando), the drug lord Gus Fring (Giancarlo Esposito), and the cartel enforcer Lalo Salamanca (Tony Dalton). In addition to the primary storyline, Better Call Saul includes black-and-white flashforwards set in 2010, after the events of Breaking Bad, which explore the consequences of Saul's eventual partnership with the drug lord Walter White (Bryan Cranston).</p><p>Gilligan, who created and developed Breaking Bad, and Gould, who wrote the Breaking Bad episode \"Better Call Saul\", began considering a Saul Goodman spin-off in 2009. Because Saul's role in Breaking Bad had expanded beyond the writing staff's plans, Gilligan felt he could be explored further. He and Gould considered making a half-hour legal comedy featuring Saul and his various clients, but settled on an hour-long tragedy showing how he develops into the character seen in Breaking Bad. Better Call Saul's development began during the production of Breaking Bad's final season in 2013, with Gilligan and Gould serving as co-showrunners and numerous production staff returning. Odenkirk, Banks, and Esposito reprise their roles from Breaking Bad, as do many others in guest appearances. Gilligan left Better Call Saul early in the third season—making Gould the sole showrunner for the remainder of its run—though he returned to help write the final season.</p><p>Better Call Saul received critical acclaim, with praise for its acting, characters, writing, direction, and cinematography. Many reviewers considered it a worthy successor to Breaking Bad—some deeming it superior to its predecessor—and one of the greatest television series of all time. It has garnered many awards and nominations, including two Peabody Awards, 48 Primetime and Creative Arts Emmy Awards, 19 Writers Guild of America Awards, 20 Critics' Choice Television Awards, nine Screen Actors Guild Awards, and six Golden Globe Awards nominations. At the time of its airing, the series premiere held the record for the highest-rated scripted series premiere in basic cable history.</p>"
  },
  "plotFull": {
    "plainText": "Better Call Saul is an American legal crime drama television series created by Vince Gilligan and Peter Gould for AMC. Part of the Breaking Bad franchise, it is a spin-off from Gilligan's previous series, Breaking Bad (2008–2013), to which it serves as both a prequel and sequel. Better Call Saul premiered on AMC on February 8, 2015, and concluded on August 15, 2022, after six seasons consisting of 63 episodes.\r\nSet primarily in the early 2000s in Albuquerque, New Mexico, several years before Breaking Bad, Better Call Saul examines the moral declines of Jimmy McGill (Bob Odenkirk), an earnest lawyer and former con artist who becomes the egocentric criminal-defense attorney Saul Goodman, and Mike Ehrmantraut (Jonathan Banks), a former corrupt police officer who becomes a fixer and enforcer for drug traffickers. Other main characters include Jimmy's romantic interest and colleague Kim Wexler (Rhea Seehorn), his brother and rival Chuck McGill (Michael McKean), Chuck's law partner Howard Hamlin (Patrick Fabian), the drug dealer Nacho Varga (Michael Mando), the drug lord Gus Fring (Giancarlo Esposito), and the cartel enforcer Lalo Salamanca (Tony Dalton). In addition to the primary storyline, Better Call Saul includes black-and-white flashforwards set in 2010, after the events of Breaking Bad, which explore the consequences of Saul's eventual partnership with the drug lord Walter White (Bryan Cranston).\r\nGilligan, who created and developed Breaking Bad, and Gould, who wrote the Breaking Bad episode \"Better Call Saul\", began considering a Saul Goodman spin-off in 2009. Because Saul's role in Breaking Bad had expanded beyond the writing staff's plans, Gilligan felt he could be explored further. He and Gould considered making a half-hour legal comedy featuring Saul and his various clients, but settled on an hour-long tragedy showing how he develops into the character seen in Breaking Bad. Better Call Saul's development began during the production of Breaking Bad's final season in 2013, with Gilligan and Gould serving as co-showrunners and numerous production staff returning. Odenkirk, Banks, and Esposito reprise their roles from Breaking Bad, as do many others in guest appearances. Gilligan left Better Call Saul early in the third season—making Gould the sole showrunner for the remainder of its run—though he returned to help write the final season.\r\nBetter Call Saul received critical acclaim, with praise for its acting, characters, writing, direction, and cinematography. Many reviewers considered it a worthy successor to Breaking Bad—some deeming it superior to its predecessor—and one of the greatest television series of all time. It has garnered many awards and nominations, including two Peabody Awards, 48 Primetime and Creative Arts Emmy Awards, 19 Writers Guild of America Awards, 20 Critics' Choice Television Awards, nine Screen Actors Guild Awards, and six Golden Globe Awards nominations. At the time of its airing, the series premiere held the record for the highest-rated scripted series premiere in basic cable history.\r\nPremise\r\nBetter Call Saul follows the transformation of Jimmy McGill, a former con artist who is trying to become a respectable lawyer, into the personality of the flamboyant criminal lawyer Saul Goodman (a play on the phrase \"'s all good, man!\"), over the six-year period prior to the events of Breaking Bad, spanning from approximately 2002 to 2008.\r\nJimmy is inspired by his older brother Chuck to leave his Chicago-area conman past, when he was known as \"Slippin' Jimmy\". He initially works in the mailroom at his brother's Albuquerque law firm, Hamlin, Hamlin & McGill (HHM), where managing partner Howard Hamlin becomes his nemesis. While at HHM Jimmy befriends Kim Wexler, a fellow mailroom employee who completes law school and becomes one of the firm's associates, and their friendship later turns romantic. Jimmy is motivated by Chuck's success to finish college and complete a Juris Doctor degree through a correspondence law school, the fictitious University of American Samoa.\r\nAfter attaining admission to the bar but being denied employment at HHM, Jimmy's pursuits focus on low-paying clients, including working as a public defender. He later begins to build a practice in elder law, which leads to a prolonged lawsuit against a nursing home chain he discovers is defrauding its clients. He and Chuck begin working together on a class-action suit, which Chuck quickly punts to HHM, squeezing Jimmy out. Jimmy begins to unravel due to Chuck's constant belittling, sabotage, and vindictive behavior towards him. Jimmy's life and career begin to intersect with the illegal narcotics trade and feature characters and story arcs that continue into Breaking Bad.\r\nAmong these arcs is the uneasy truce between the Salamanca family that serves the Juárez Cartel drug interest, and Gus Fring, a fried chicken entrepreneur whose restaurant chain is a front for the drug trade. The Salamanca family is led by Hector Salamanca, and later by his nephews Tuco and Lalo. Those caught up in the ensuing turmoil include Ignacio \"Nacho\" Varga, a Salamanca associate who wants to protect his father from harm, and Mike Ehrmantraut, a former Philadelphia police officer who becomes a fixer for Gus. As his interactions with criminals continue, Jimmy takes on the persona of the flamboyant, colorful Saul Goodman, and he starts to draw on his conman past while his work as an attorney goes from questionable to unethical to illegal.\r\nIn addition to selected scenes that take place within the Breaking Bad timeline, the show includes flashforwards, shown in black and white, to events following Breaking Bad. These scenes, taking place in 2010, show Jimmy living as a fugitive under the identity of Gene Takavic, the manager of a Cinnabon store in Omaha, Nebraska. In the final episodes of the series, these flashforwards take up nearly the entirety of the episodes, with the majority of them taking place after or during Breaking Bad.\r\nCast and characters\r\nMain cast\r\nBob Odenkirk as Jimmy McGill / Saul Goodman / Gene Takavic, a lawyer and a former scam artist, who becomes involved with the criminal world.\r\nJonathan Banks as Mike Ehrmantraut, a former Philadelphia police officer working as a parking lot attendant at the Albuquerque courthouse, and later a private investigator, bodyguard and \"cleaner\".\r\nRhea Seehorn as Kim Wexler, a lawyer who became a close friend of Jimmy's as she worked her way through the ranks at the Hamlin, Hamlin & McGill (HHM) law firm. She becomes Jimmy's confidante and later the two develop a romantic relationship and marry.\r\nPatrick Fabian as Howard Hamlin, the managing partner at Hamlin, Hamlin & McGill, who appears to be Jimmy's nemesis until it becomes clear that he was acting under Chuck McGill's orders.\r\nMichael Mando as Nacho Varga, an intelligent, ambitious member of Hector Salamanca's drug ring who also works for his father's upholstery shop.\r\nMichael McKean as Chuck McGill (seasons 1–3; special guest seasons 4 and 6), Jimmy's elder brother and a founding partner of HHM who is confined to his home because of his electromagnetic hypersensitivity and expresses disdain for his brother's legal career.\r\nGiancarlo Esposito as Gus Fring (seasons 3–6), the owner of the fast food restaurant chain Los Pollos Hermanos, which is a front to distribute cocaine for the Mexican cartel, in uneasy cooperation with the Salamanca family. He nurses grudges against cartel boss Don Eladio and Salamanca patriarch Hector Salamanca. Fring wants to switch from cocaine to locally produced methamphetamine so he can end his dependence on the cartel.\r\nTony Dalton as Lalo Salamanca (seasons 5–6; recurring season 4), the charismatic and psychopathic nephew of Hector, who helps run the family drug business after Hector's stroke. He is the cousin of Tuco, Leonel, and Marco.\r\nRecurring cast\r\nIntroduced in season 1\r\nKerry Condon as Stacey Ehrmantraut, Mike's widowed daughter-in-law and the mother of Kaylee Ehrmantraut\r\nFaith Healey (season 1), Abigail Zoe Lewis (seasons 2–4) and Juliet Donenfeld (seasons 5–6) as Kaylee Ehrmantraut, Mike's granddaughter\r\nEileen Fogarty as Mrs. Nguyen, owner of a nail salon which houses Jimmy's law office in its utility room\r\nPeter Diseth as Deputy District Attorney Bill Oakley\r\nJoe DeRosa as Dr. Caldera, a veterinarian with ties to the criminal underworld\r\nDennis Boutsikaris as Rich Schweikart, a partner at Schweikart & Cokely\r\nMark Proksch as Daniel \"Pryce\" Wormald, a drug company employee who begins supplying Nacho and hires Mike as security\r\nBrandon K. Hampton as Ernesto, Chuck's assistant who works at HHM\r\nJosh Fadem as Marshall/Joey Dixon (\"Camera Guy\"), one of the three University of New Mexico (UNM) film students who help Jimmy film various projects\r\nJulian Bonfiglio as Phil (\"Sound Guy\"), one of the three UNM film students Jimmy hires for various film projects\r\nJeremy Shamos and Julie Ann Emery as Craig and Betsy Kettleman, a county treasurer and his wife, accused of embezzlement\r\nSteven Levine and Daniel Spenser Levine as Lars and Cal Lindholm, twin skateboarders and small-time scam artists\r\nMíriam Colón as Abuelita Salamanca, Tuco's grandmother and Hector's mother\r\nBarry Shabaka Henley as Detective Sanders, a Philadelphia cop who was formerly partnered with Mike on the force\r\nMel Rodriguez as Marco Pasternak, Jimmy's best friend and partner-in-crime in Cicero, Illinois\r\nClea DuVall as Dr. Cruz, a doctor who treats Chuck and suspects his electromagnetic hypersensitivity condition is psychosomatic\r\nJean Effron as Irene Landry, an elderly client of Jimmy McGill overcharged by the Sandpiper Crossing elder care home\r\nSteven Ogg as Sobchak, a petty crook for hire\r\nIntroduced in season 2\r\nEd Begley Jr. as Clifford Main, managing partner at Davis & Main where Jimmy worked during season two\r\nOmar Maskati as Omar, Jimmy's assistant at Davis & Main\r\nJessie Ennis as Erin Brill, a lawyer at Davis & Main who is ordered to shadow Jimmy\r\nJuan Carlos Cantu as Manuel Varga, Nacho's father who owns an upholstery shop\r\nVincent Fuentes as Arturo Colon, a criminal associate of Hector Salamanca\r\nRex Linn as Kevin Wachtell, chairman of Mesa Verde Bank and Trust and a client of HHM and Kim\r\nCara Pifko as Paige Novick, senior legal counsel for Mesa Verde Bank and Trust and a friend of Kim\r\nAnn Cusack as Rebecca Bois, Chuck's ex-wife\r\nJulie Pearl as Assistant District Attorney Suzanne Ericsen\r\nManuel Uriza as Ximenez Lecerda, an associate of Hector Salamanca\r\nHayley Holmes as Cheri (\"Make-Up Girl\"/\"Drama Girl\"), one of the three University of New Mexico film students Jimmy hires for various projects\r\nIntroduced in season 3\r\nKimberly Hebert Gregory as Assistant District Attorney Kyra Hay\r\nHarrison Thomas as Lyle, the dedicated assistant manager of Los Pollos Hermanos\r\nTamara Tunie as Anita, a member of Mike and Stacey's support group\r\nBonnie Bartlett as Helen, Irene's friend and member of the affected class in the Sandpiper lawsuit\r\nIntroduced in season 4\r\nDon Harvey (seasons 4–5) and Pat Healy (season 6) as Jeff, a taxi cab driver in the present that recognizes Gene as Saul Goodman\r\nRainer Bock as Werner Ziegler, an engineer hired by Gus to plan and oversee construction of his meth \"superlab\"\r\nBen Bela Böhm as Kai, a rebellious member of the crew Werner Ziegler assembles for the construction of Gus's meth \"superlab\"\r\nStefan Kapičić as Casper, a member of Werner Ziegler's team\r\nPoorna Jagannathan as Maureen Bruckner, a specialist from Johns Hopkins who flew to Albuquerque to treat Hector after Gus arranged for a \"generous grant\"\r\nKeiko Agena as Viola Goto, Kim Wexler's paralegal\r\nIntroduced in season 5\r\nMax Bickelhaup as Buddy, Jeff's friend who later helps Gene with his schemes\r\nSasha Feldman and Morgan Krantz as Sticky and Ron, two petty crooks who are among \"Saul Goodman\"'s first clients\r\nBarry Corbin as Everett Acker, an old man living on leased property belonging to Mesa Verde whom Kim has to evict to make way for the bank's new call center\r\nIntroduced in season 6\r\nLennie Loftin as Genidowski, a con man hired by Jimmy and Kim to pose as Howard's private investigator\r\nSandrine Holt as Cheryl Hamlin, Howard's estranged wife\r\nJohn Posey as Rand Casimiro, a retired judge who is mediating the Sandpiper case\r\nJohn Ennis as Lenny, a grocery store employee hired by Jimmy and Kim to impersonate Casimiro\r\nCarol Burnett as Marion, Jeff's mother who takes a liking to Gene\r\nKevin Sussman as Mr. Lingk, a rich man with cancer who is targeted by Gene\r\nIntroduced in Breaking Bad\r\nRaymond Cruz as Tuco Salamanca, a ruthless, psychopathic drug distributor in the South Valley (seasons 1–2)\r\nCesar García as No-Doze, Tuco's henchman (season 1)\r\nJesús Payán Jr. as Gonzo, Tuco's henchman (season 1)\r\nT.C. Warner as Nurse (season 1)\r\nKyle Bornheimer as Ken, an arrogant, self-absorbed stockbroker (season 2)\r\nStoney Westmoreland as Officer Saxton, an Albuquerque Police Department officer (season 2)\r\nJim Beaver as Lawson, a black market weapons dealer in Albuquerque (season 2)\r\nMaximino Arciniega as Domingo \"Krazy-8\" Molina, one of Tuco's distributors (seasons 2–5)\r\nMark Margolis as Hector Salamanca, Tuco's uncle and high-ranking member of the cartel (seasons 2–6)\r\nDebrianna Mansini as Fran, a waitress at Loyola's Diner (seasons 2 and 4)\r\nDaniel and Luis Moncada as Leonel and Marco Salamanca, Tuco's cousins and Hector's nephews who are hitmen for the cartel (seasons 2, 4–6)\r\nJennifer Hasty as Stephanie Doswell, a real estate agent (season 2)\r\nTina Parker as Francesca Liddy, Jimmy's receptionist (seasons 3–4, 6)\r\nJeremiah Bitsui as Victor, Gus's henchman (seasons 3–6)\r\nRay Campbell as Tyrus Kitt, a henchman on Gus Fring's payroll (seasons 3–6)\r\nJB Blanc as Dr. Barry Goodman, a doctor on Gus Fring's payroll (seasons 3–5)\r\nSteven Bauer as Don Eladio Vuente, the head of the Juárez drug cartel (seasons 3, 5–6)\r\nJavier Grajeda as Juan Bolsa, a high-level member of the Juárez drug cartel (seasons 3–6)\r\nLavell Crawford as Huell Babineaux, a professional pickpocket hired by Jimmy (seasons 3–6)\r\nLaura Fraser as Lydia Rodarte-Quayle, a Madrigal Electromotive executive and associate of Gus Fring (seasons 3–5)\r\nEric Steinig as Nick, a member of Gus's security team, later managed by Mike (seasons 4–6)\r\nFranc Ross as Ira, a burglar Jimmy hires; in Breaking Bad, he is the owner of Vamonos Pest who appears in \"Hazard Pay\" (season 4)\r\nDavid Costabile as Gale Boetticher, a chemist who is consulted by Gus (season 4)\r\nRobert Forster as Ed Galbraith, a vacuum cleaner store owner who relocates people running from the law and gives them new identities (season 5)\r\nDean Norris as Hank Schrader, a DEA agent and Walter White's brother-in-law (season 5)\r\nSteven Michael Quezada as Steven Gomez, Hank's DEA partner and best friend (season 5)\r\nRobert Sanchez as Harry Lipenstein, a DEA agent (season 5)\r\nNigel Gibbs as Tim Roberts, a detective with the Albuquerque Police Department (seasons 5–6)\r\nNorbert Weisser as Peter Schuler, a Madrigal Electromotive executive and associate of Gus Fring (season 5)\r\nJulia Minesci as Wendy, a street prostitute working out of the Crossroads motel (season 6)\r\nDavid Ury as Spooge, a small-time criminal (season 6)\r\nBryan Cranston as Walter White, a middle-aged high school chemistry teacher who, during the events of Breaking Bad, becomes involved with the drug trade and enlists the services of Saul to help launder his money (season 6)\r\nAaron Paul as Jesse Pinkman, a former student of Walter who, during the events of Breaking Bad, helps Walter with cooking meth (season 6)\r\nJohn Koyama as Emilio Koyama, Jesse's friend and sometime partner in the meth business (season 6)\r\nBetsy Brandt as Marie Schrader, Hank's widowed wife (season 6)\r\nTodd Terry as SAC Austin Ramey, head of the southwestern United States DEA offices (season 6)\r\nProduction\r\nConception\r\nVince Gilligan and Peter Gould began considering a television spinoff of Breaking Bad as early as 2009. While filming the Breaking Bad episode \"Full Measure\", Gilligan asked Bob Odenkirk his thoughts on a Saul Goodman spinoff. In July 2012, Gilligan publicly hinted at a Goodman spinoff, stating that he liked \"the idea of a lawyer show in which the main lawyer will do anything it takes to stay out of court\", including settling on the courthouse steps. During his appearance on Talking Bad, Odenkirk noted that Saul was one of the most popular characters on the show, speculating that the audience likes the character because he is \"the program's least hypocritical figure\", and \"is good at his job\".\r\nGilligan noted that over the course of Breaking Bad, there were a lot of \"what ifs” their team considered, such as if the show won a Primetime Emmy Award, or if people would buy \"Los Pollos Hermanos\" T-shirts. The staff did not expect these events to come to fruition, but after they did, they started considering a spin-off featuring Saul as a thought experiment. Furthermore, Saul's character on Breaking Bad became much more developed than the staff had planned, as he was originally slated to appear in only three episodes. With the growth of Saul's character, Gilligan saw ways to explore the character further.\r\nDevelopment\r\nIn April 2013, Better Call Saul was confirmed to be in development by Gilligan and Gould; the latter wrote the Breaking Bad episode that introduced the character. In July 2013, before the second half of Breaking Bad's final season aired, Gilligan said he and Gould were still working out ideas for the spin-off, but a deal had not yet been made. Netflix was one of many interested distributors, but ultimately a deal was made between AMC and the Breaking Bad production company Sony Pictures Television. Gilligan and Gould began as co-showrunners, and Gilligan directed the pilot. Former Breaking Bad writers Thomas Schnauz and Gennifer Hutchison joined the writing staff, with Schnauz serving as co-executive producer and Hutchison as supervising producer. Also joining the initial writing staff were Bradley Paul and former Breaking Bad writer's assistant Gordon Smith.\r\nAs Sony and AMC began to commit to a spinoff, Gilligan and Gould worked on what it would be about. They initially considered making it a half-hour show where Saul would see various clients – celebrities in guest roles – in his strip mall office, a format similar to Dr. Katz, Professional Therapist, but they had no idea how to write for this type of format, and fell back to planning for hour-long episodes. Since they had used this format with Breaking Bad, which Gilligan said was \"25-percent humor, 75-percent drama\", the two considered reversing that for Better Call Saul. While the intent was to add more humor, the show remained heavy with dramatic elements, with Odenkirk calling the first season \"85 percent drama, 15 percent comedy.\"\r\nWhile several of the characters are lawyers in the show, Gilligan and Gould did not want to write a legal show, but instead a crime show, but one that would necessitate some legal elements. To help in these areas, the writers spoke to real lawyers and spent time observing cases at Los Angeles Superior Court, observing that the bulk of the activity in these cases was downtime while waiting for others to complete actions.\r\nGilligan and Gould found that the character of Saul Goodman was insufficient to carry the show by himself, with Gilligan calling the character of Saul \"great flavoring\" for a show but not the substance. They came to realize that Saul, in the Breaking Bad timeframe, was a man who had come to accept himself, and recognized the potential of telling the story of how Saul got to be that person. Gilligan and Gould had already committed to the Better Call Saul title, so that in following this route, they believed they had to quickly get from Jimmy McGill to Saul Goodman, or they would otherwise disappoint their audience. However, as they wrote the show, they realized \"we don't want to get to Saul Goodman … and that's the tragedy\".\r\nGilligan and Gould had learned several lessons related to foreshadowing without writing the foresight for it from Breaking Bad, and so with Better Call Saul, gave themselves more flexibility in how the show's plot would develop over its run, and had no firm idea where it would end up outside the connection to Breaking Bad. For example, Rhea Seehorn's performance as Kim Wexler during the first season significantly altered how the writers used her character in later seasons as well as slowing down the pacing of the transition of Jimmy into Saul, as they gave more focus to the Jimmy–Kim relationship. Gilligan compared this to the impact Aaron Paul's acting had on Breaking Bad's ultimate pacing.\r\nIn writing for Better Call Saul, Gilligan and Gould recognized they were including overlaps with Breaking Bad, and had ideas of characters they would include, such as Gus Fring, though on no set timetable within the show's development. Gilligan described the writing approach as if developing two separate shows, one that centers on Jimmy/Saul, Kim, Chuck, and Howard, and a second on the more familiar Breaking Bad characters like Mike and Gus with some overlap, as if they were giving the audience two shows for one. Where possible, they had written in minor Breaking Bad characters in smaller parts or as Easter eggs to fans, but Gilligan preferred only to include such major Breaking Bad characters as Walter or Jesse if this seemed unconstrained and satisfactory to both the production team and the audiences.\r\nBecause of the closeness to the Breaking Bad storyline, one of the writers was tasked at the start of each season to rewatch all 62 episodes of the show and verify that the scripts for the Better Call Saul season introduced no conflicts. As the show continued, the show's \"brain trust\" consisting of script coordinators Ariel Levine and Kathleen Williams-Foshee reviewed each script to help maintain the continuity with Breaking Bad, including tracking minor character traits and assuring small details from the previous show were kept correct if brought up again.\r\nGilligan's departure from the writing staff and return\r\nGilligan left the Better Call Saul writing staff early in the third season to focus on other projects, resulting in Gould becoming sole showrunner. This transition had been planned since the show's debut. Upon his departure, Gilligan expressed his hopes to return to the writers room during the show's final season. He remained involved in the fourth and fifth seasons, but said he had very little to do with developing the show's contents during this period. Instead, Gilligan reduced his role to being a \"director for hire\" for the episodes \"Wiedersehen\" and \"Bagman\", and stated these were the only scripts he read when he was not on the writing staff. Gilligan went on to credit Gould for maintaining the series' high quality. Gould would bring Gilligan back to the writers room for the sixth and final season, calling it \"wonderful to have him there, so we can finish this show that we started together.\"\r\nCasting\r\nBob Odenkirk confirmed he would reprise Saul Goodman in the starring role when the series was first announced, but his character would be introduced as lawyer Jimmy McGill. In January 2014, it was announced that Jonathan Banks would reprise his Breaking Bad role as Mike Ehrmantraut and be a series regular.\r\nNew cast members included Michael McKean as McGill's elder brother Chuck. McKean previously guest-starred in an episode of Odenkirk's Mr. Show and Gilligan's X-Files episode \"Dreamland\". Rhea Seehorn auditioned and got the role of Kimberly \"Kim\" Wexler in April 2014, her character being described as \"prestigious attorney ... whose hard life is complicated by her romantic entanglements with somebody else at the firm\". In May 2014, Patrick Fabian was cast on the show as Howard Hamlin, a \"Kennedy-esque lawyer who's winning at life\". After impressing Gilligan and Gould with his audition tape and screen test, Michael Mando was cast as the \"smart and calculating criminal\" Ignacio \"Nacho\" Varga. Mando's character had been previously mentioned but not seen in the Breaking Bad episode \"Better Call Saul\".\r\nGoing into the third season, Giancarlo Esposito was added to the main cast as Gus Fring, a drug kingpin who previously served as one of Breaking Bad's main antagonists. Esposito was previously a starring cast member in Breaking Bad for the same role. McKean would leave the series at season's end due to his character being written out, but would make appearances in the next season and the series finale. Tony Dalton made his first appearance as Lalo Salamanca in the fourth season, and would be promoted to the main cast for the fifth. Similar to Nacho, Lalo had been a character mentioned only by name in the same Breaking Bad episode \"Better Call Saul\".\r\nGuest appearances from Breaking Bad characters\r\nBefore the second season, Gilligan confirmed that more of the prominent characters from Breaking Bad would be making guest appearances on the spin-off, but remained vague on which characters were likely to be seen. By the next season, Gilligan said that the show had been on long enough that any reuse of Breaking Bad characters would require more than \"just a cameo or an Alfred Hitchcock walkthrough\", and that their appearances would need to be essential to the story.\r\nThroughout Better Call Saul's run, both Breaking Bad lead actors Bryan Cranston and Aaron Paul regularly said they would be open to reprising their respective roles as Walter White and Jesse Pinkman on the spin-off. However, both maintained that they would only appear if Gilligan found a sufficiently good reason to bring them on the show. Paul previously mentioned the possibility of a cameo during the first season but this fell through. The two would eventually appear together in the sixth-season episode \"Breaking Bad\", which was named after the original series. Paul made a separate cameo in the next episode; Cranston appeared again in the series finale.\r\nDean Norris, who was also a starring cast member on Breaking Bad, stated he could not be part of the earlier seasons, partly due to his involvement in the CBS series Under the Dome. However, he was announced as a guest star in the fifth season, where he reprised his role as Hank Schrader in the episodes \"The Guy for This\" and \"Namaste\". Plans were initially made for Betsy Brandt, another Breaking Bad starring cast member, to reprise her role as Hank's wife Marie Schrader in a cameo on the second-season finale \"Klick\". However, the writer's room objected, considering the idea to be distracting for audiences. Brandt would eventually appear in the series finale.\r\nOther Breaking Bad cast members spoke of the potential of being on Better Call Saul. Before the series began, Anna Gunn mentioned a \"talk\" with Gilligan over possible guest appearances as Skyler White. Bill Burr was set to return as Patrick Kuby in the fifth-season episode \"Dedicado a Max\", but scheduling fell through due to him needing to attend to a personal matter. After the series ended, Gould mentioned his desire to bring back Gunn, Norris, Esposito and RJ Mitte for the finale, but he and the writing staff could not find a proper way to have them fit into the story.\r\nFilming\r\nPrincipal photography for Better Call Saul's six seasons took place from June 2, 2014, to February 9, 2022. Like its predecessor, Better Call Saul is set in and around Albuquerque, New Mexico, with filming primarily taking place at Albuquerque Studios. Additional filming was done in March 2022, after principal photography for the series ended, for the opening teaser of the season six episode \"Point and Shoot\". With several crew members but no cast members on hand, the scene was filmed in Leo Carrillo State Beach, California. This was the only time the series was filmed outside of New Mexico.: 1:00:01–1:01:29\r\nNotable exterior locations include the Twisters restaurant used previously in Breaking Bad for Gus's Los Pollos Hermanos, a parking lot kiosk at the Albuquerque Convention Center for where Mike worked in the first few seasons, the Old Bernalillo County Courthouse as the local courthouse, and two nearby office buildings in the North Valley, including Northrop Grumman's, that collectively are used for the HHM office spaces.\r\nJimmy's back office is located in an actual nail salon, which the producers accommodated by working with the owners. The Salamanca's restaurant is a real business in the South Valley that production modified a bit for the show, but which otherwise remained open. The scenes set in Omaha are filmed at Cottonwood Mall in Albuquerque; production worked with Cinnabon to bring in the period-specific equipment and service items for the segments, and the extras in the store during these scenes are Cinnabon employees. The New Mexico Film Office reported that the first four seasons of Better Call Saul brought over US$120 million into the state, and they have hired 1,600 crew for each season and a total of 11,300 extras.\r\nBetter Call Saul employs Breaking Bad's signature time jumps. Notably, most seasons' opening episode has started with a black and white flash-forward to a period in the years after the finale of Breaking Bad where Saul has been relocated to Omaha, Nebraska, as \"Gene\", a manager of a Cinnabon store, remaining paranoid about anyone discovering his past identity. This was foreshadowed in the penultimate episode of Breaking Bad, \"Granite State\", in which Saul tells Walter: \"If I'm lucky, a month from now, best-case scenario, I'm managing a Cinnabon in Omaha.\"\r\nThe show's director of photography was Arthur Albert for the first two seasons, and Marshall Adams starting with season 3. Additionally, Paul Donachie served as a cinematographer on episodes \"Namaste\" (2020), \"Carrot and Stick\" (2022) and \"Hit and Run\" (2022). Seasons 1 and 2 was filmed mainly on RED Dragon cameras. Starting with season 3, Panasonic VariCam Pure were incorporated due to their extra low-light sensitivity. This allowed the crew to shoot extra wide exterior shots at night as well as during the day, and to shoot on sets in near total darkness, such as nighttime in Chuck's unelectrified house. For scenes requiring to film from cramped spaces, a Panasonic Lumix GH4 camera was used. In season 4, three RED and two VariCam Pure cameras were used. For seasons 5 and 6, mostly Arri ALEXA LF was used.\r\nEpisode title sequences\r\nEach episode's title sequence features a different low-quality image that recalls Saul Goodman's days on Breaking Bad. This includes the inflatable Statue of Liberty balloon that sat atop Saul's office, a drawer of burner phones kept in his desk, and a bus stop bench that advertised his business. Gould and Gilligan were inspired by the poor quality of early VHS tapes and the notoriously low production values of 1980s public-access television, and from the fact that Saul Goodman's ads on Breaking Bad were done in a similar style. They intended for the title sequences to appear \"purposefully shitty\" in order to stand out from those of its contemporaries, which generally had increased visual quality and production standards. Some of the title sequences were put together from unused footage from Breaking Bad, but others were filmed specifically to create new ones. The title sequences were put together by assistant editor Curtis Thurber, and scored by Little Barrie guitarist Barrie Cadogan. When Cadogan was putting the music together, he was told the producers wanted a piece of music that would be cut abruptly at 15 seconds.\r\nAs every season except for the last has ten episodes each, the title credits for every season's corresponding episode number would reuse the same image. However, beginning with the second season, each of the episode's title sequences would continue to decline in picture quality by intermittently flashing black and white, and continue to lose color with each passing season. This caused many to theorize that this symbolized Jimmy McGill's storyline gradually transitioning to that of his post-Breaking Bad alter-ego Gene Takavic, whose scenes were entirely in black and white.\r\nWith the final season featuring thirteen episodes instead of the usual ten, the title sequences would take a new format. During \"Nippy\", the title sequence features Saul Goodman's \"World's Greatest Lawyer\" mug falling off his desk and shattering on the floor, as was typical during a season's tenth episode. However, the title image and music prematurely stops and is replaced by a blue screen, recreating the effects of a home video recording on a VCR, and then displayed the show's title and creator credits. This is also the first episode to take place entirely after the events of Breaking Bad. The remaining three title sequences retain the blue background, but briefly flash to an image previously unseen in the intro, with a distorted version of the theme song playing underneath. They then revert to the blue background again and display the title and creator credits. Before the show resumes, they again briefly flash to another new image that will be seen later on in the episodes.\r\nEpisodes\r\nThe complete series was issued on Blu-ray and DVD in region 1 on December 6, 2022. The set spanned 19 discs and included 70 hours of bonus features.\r\nBetter Call Saul's episodes are split between two main timelines. The primary timeline begins in 2002, six years before the first episode of Breaking Bad. During this period, where a majority of the series takes place, Saul Goodman practices as a lawyer in Albuquerque, New Mexico under his birthname Jimmy McGill.\r\nThe secondary timeline takes place in 2010, following events of Breaking Bad's finale, where Saul has fled Albuquerque and hides in Omaha, Nebraska under the alias Gene Takavic. This later timeline would only be shown in the cold open in the first five season premieres, but would be fully explored in the last four episodes of the series.\r\nSeason 1 (2015)\r\nThe first teaser trailer debuted on AMC on August 10, 2014, and confirmed its premiere date of February 2015. On November 20, 2014, AMC announced the series would have a two-night premiere; the first episode aired on Sunday, February 8, 2015, at 10:00 pm (ET), and then moved into its regular time slot the following night, airing Mondays at 10:00 pm. It was released on Blu-ray and DVD in region 1 on November 10, 2015; bonus features include audio commentaries for every episode, uncensored episodes, deleted scenes, gag reel, and several behind-the-scenes featurettes. A limited edition Blu-ray set was also released with 3D packaging and a postcard vinyl of the Better Call Saul theme song by Junior Brown.\r\nIn 2002, Jimmy schemes to represent Craig Kettleman, accused of embezzlement, leading to encounters with psychotic drug lord Tuco Salamanca and his lieutenant Nacho. Jimmy also cares for his brother Chuck, who is housebound with electromagnetic hypersensitivity. While pursuing elder law, Jimmy learns of seniors being defrauded by the Sandpiper retirement community. As the class action lawsuit against Sandpiper grows, Chuck suggests giving it to his law firm, Hamlin, Hamlin & McGill. Jimmy receives a small of counsel fee and a share of any future settlement, but is blocked from participation. Jimmy learns Chuck sabotaged his legal career out of resentment. After the death of an old friend, Jimmy finds success when Davis & Main, another firm HHM brought in to assist with the Sandpiper case, offers to hire him.\r\nIn 2010, Gene manages a Cinnabon by day, but in the evening reminisces about his life as Saul by watching a VHS tape of his old television advertisements.\r\nSeason 2 (2016)\r\nPrior to the series' launch, on June 19, 2014, AMC renewed the series for a second season of 13 episodes to premiere in early 2016, which was later reduced to 10 episodes. It premiered on February 15, 2016, and released on Blu-ray and DVD in region 1 on November 15, 2016; bonus features include audio commentaries for every episode and several behind-the-scenes featurettes.\r\nIn 2002, Jimmy works as an associate at D&M, but quits after his ostentatious legal style doesn't mesh with the firm's corporate demeanor. Kim is demoted by Chuck's partner, Howard Hamlin, because of Jimmy's actions. She secures banking firm Mesa Verde as an HHM client, although Howard denies her credit. Kim quits HHM and opens a shared private practice with Jimmy. Jimmy sabotages Chuck's work for Mesa Verde, which drops HHM and hires Kim, but Chuck discovers this and tricks Jimmy into confessing. Nacho hires Mike Ehrmantraut to remove Tuco, but Mike instead machinates his imprisonment. Cartel elder and uncle of Tuco, Hector Salamanca, confronts Mike. Mike attempts to assassinate Hector, but is mysteriously interrupted.\r\nIn 2010, Gene accidentally locks himself in the dumpster room when closing out the Cinnabon for the night. Instead of alerting police, he spends the night waiting for the janitor to open the door.\r\nSeason 3 (2017)\r\nAMC announced on March 15, 2016 that Better Call Saul was renewed for a 10-episode third season, which premiered April 10, 2017. It was released on Blu-ray and DVD in region 1 on January 16, 2018; bonus features include audio commentaries for every episode and several behind-the-scenes featurettes.\r\nIn 2003, the results of the disciplinary hearing have Jimmy's law license suspended and Chuck's hypersensitivity condition is revealed to be psychosomatic. After Jimmy sabotages Chuck's insurance, Howard urges him to retire, but Chuck sues HHM in spite. Howard buys him out of the firm, leading Chuck to commit suicide. Gus prevents Hector's assassination, and Mike attacks Hector's trucks to steal $250,000 on Gus's orders. To launder the money, Gus arranges for Mike's hire as a contracted security consultant at Madrigal. Hector plans to take over the business of Nacho's father, so his son attempts to kill Hector by sabotaging his angina medication. As the cartel prefers Gus's drug distribution over Hector's, he suffers a stroke during the confrontation rendering Hector comatose.\r\nIn 2010, Gene (Jimmy) points mall security guards towards a shoplifter during his lunch break. Later, a stressed Gene suddenly collapses during his work.\r\nSeason 4 (2018)\r\nFollowing the third season's end on June 27, 2017, AMC renewed the series for a 10-episode fourth season, which premiered on August 6, 2018. It was released on Blu-ray and DVD in region 1 on May 7, 2019; bonus features include audio commentary for every episode and several behind-the-scenes featurettes.\r\nIn 2003, Jimmy regains his outgoing demeanor after Howard shoulders the blame for Chuck's death. Jimmy manages a cell phone store but earns more by reselling prepaid phones to criminals. A year later, his law license reinstatement is denied over lack of remorse for Chuck. After faking mourning, he successfully appeals and practices as the \"Saul Goodman\" trade name. Gus learns Nacho attempted to kill Hector and blackmails him into undermining the Salamancas. Mike escorts engineers who evaluate Gus's industrial laundry site as a potential underground meth lab. Gus hires Werner Ziegler to oversee construction, but Mike is ordered to kill Werner when he tries to escape. Hector recovers from his stroke, but is mute and can only move his right index finger. His nephew, Lalo Salamanca, arrives to run Hector's business, learning of the construction project.\r\nIn 2010, Gene is hospitalized after his collapse and later discharged. He becomes uneasy when a taxi driver with an Albuquerque Isotopes air freshener seems to recognize him.\r\nSeason 5 (2020)\r\nThe series was renewed for a fifth season on July 28, 2018, just prior to the airing of the fourth season. The fifth season was not expected to air until 2020; according to AMC's Sarah Barnett, the delay was \"driven by talent needs\". The 10-episode fifth season would start airing with a special Sunday broadcast on February 23, 2020, with following episodes to air on Mondays. It was released on Blu-ray and DVD in region 1 on November 24, 2020; bonus features include cast and crew audio commentaries on every episode, deleted scenes, and various behind-the-scenes featurettes.\r\nIn 2004, Jimmy's law practice as Saul Goodman draws him into Albuquerque's drug trade and he is conflicted when Howard offers him a position at HHM. Kim balances her Mesa Verde and pro bono work with her own feelings for Jimmy, and finds herself employing similar conman-style tactics. Jimmy and Kim later devise a plan to ruin Howard to settle the Sandpiper case. Lalo's presence in Albuquerque forces Gus to suspend construction of his meth lab. Nacho and Mike become pawns in the ongoing feud between the Salamancas and Gus. After Lalo is arrested for murder, he hires Jimmy to represent him and arrange bail, which almost kills Jimmy. After an unsuccessful attempt on Lalo's life by Gus's hired assassins after his release, Lalo deduces that Nacho has betrayed him.\r\nIn 2010, during another lunch break, Gene is approached by the taxi driver, Jeff, and his friend Buddy. Jeff reveals he recognized Gene as Saul Goodman from when he previously lived in Albuquerque. Gene admits he is living with a secret identity.\r\nSeason 6 (2022)\r\nAMC renewed the series for a sixth season on January 16, 2020, with a scheduled premiere in 2021. Showrunner Peter Gould confirmed it would be the show's final season and consist of 13 episodes rather than the usual 10. Production experienced long delays due to COVID-19 and star Bob Odenkirk needing several weeks to fully recover from a heart attack he experienced on set. The sixth and final season was split into two halves; the first half premiered on April 18, 2022, while the last half premiered on July 11, 2022. The complete season was released on Blu-ray and DVD in region 1 on December 6, 2022; bonus features include cast and crew audio commentaries on every episode, deleted scenes, outtakes, and various behind-the-scenes featurettes.\r\nIn 2004, Nacho attempts to flee from the Salamancas after the attempt on Lalo's life, but after Gus falsely implicates him, Nacho sacrifices himself in exchange for his father's safety. Jimmy and Kim smear Howard's reputation, thereby forcing a settlement of the Sandpiper case. Howard confronts them, but is murdered by Lalo. After forcing Kim to act as a diversion, Lalo ambushes Gus to access the meth lab under construction. Gus kills Lalo with a hidden gun. Mike makes Howard's death appear as a suicide, and oversees the burial of Howard and Lalo beneath the lab. A traumatized Kim quits the law and divorces Jimmy. Several years later, Jimmy has fully transformed into Saul Goodman.\r\nIn 2010, Gene approaches Jeff and Buddy with an offer to rob a department store. After reaching out to Kim, who now lives in Florida, Gene devises a scheme to obtain financial identification of rich single men at bars he can sell for profit. When the scheme goes wrong, Buddy quits the operation, Jeff is arrested, and Gene is eventually caught. He is extradited to Albuquerque for the trial and feigns testimony implicating Kim so she can be summoned to court. He confesses to Kim and those at the trial about his crimes during the events of Breaking Bad and Better Call Saul, getting an 86-year sentence. Jimmy is recognized as Saul in prison and gains popularity with the inmates. Kim visits him and they share a cigarette before parting again.\r\nBroadcast\r\nBetter Call Saul would air on cable network AMC. The series premiere drew in 4.4 million and 4 million in the 18–49 and 25–54 demographics, respectively, and received an overall viewership of 6.9 million. This was the record for the highest-rated scripted series premiere in basic cable history, until it was surpassed later the same year by another AMC series, Fear the Walking Dead.\r\nIn December 2013, Netflix announced that the entire first season would be available for streaming in the U.S. after the airing of the first-season finale, and in Latin America and Europe each episode would be available a few days after the episode airs in the U.S. However, the first season was not released on Netflix in the U.S. until February 1, 2016. Internationally, episodes of the second season became available the day after they aired in the U.S.\r\nNetflix would be the exclusive video-on-demand provider for the series and made the content available in all its territories, except for Australia and New Zealand. In Australia, Better Call Saul premiered on the streaming service Stan on February 9, 2015, acting as the service's flagship program. In New Zealand, the show was exclusive to the video-on-demand service Lightbox before moving to Neon in 2020 when both services were merged. The episodes were available for viewing within three days of broadcast in the U.S.\r\nIn the United Kingdom and Ireland, the series was acquired by Netflix on December 16, 2013, and the first episode premiered on February 9, 2015, with the second episode released the following day. Every subsequent episode was released each week thereafter. In Ireland, the series began airing on Irish TV network TG4 on October 18, 2022. In India, the series was broadcast on Colors Infinity within 24 hours of the U.S. broadcast.\r\nDuring the final season's run in 2022, each episode would be available to stream the day they premiered on AMC+, AMC's streaming service which first launched in June 2020. The sixth season premiere resulted in the biggest day of new subscriber sign-ups for AMC+, and by the mid-season finale episodic viewership on the streaming service rose by 61%. Upon the release of the series finale, the app experienced an outage, causing many users to be logged out. AMC later reported that first-day viewing numbers for the finale on AMC+ was four times as big as the season premiere, and called the series' final season the highest acquisition driver in the history of the streaming service.\r\nReception\r\nCritical response\r\nBetter Call Saul received critical acclaim and is considered to be an outstanding example of how to successfully produce a prequel and spinoff work that defies expectations. Many critics have called Better Call Saul a worthy successor to Breaking Bad and some have even deemed it superior to its predecessor. In September 2019, The Guardian ranked the show at No. 48 on its list of the 100 best TV shows of the 21st century, describing it as \"A supremely measured character piece that has steadily improved as its central tragedy has materialised.\" In 2021, Empire ranked Better Call Saul at No. 27 on their list of The 100 Greatest TV Shows of All Time. Also in 2021, it was voted the 23rd-best TV series of the 21st century by the BBC, as picked by 206 TV experts from around the world. In September 2022, Rolling Stone listed Better Call Saul as the 32nd greatest TV show of all time, in its updated list from 2016.\r\nThe first season has a 97% approval rating on the review aggregator website Rotten Tomatoes, with an average rating of 8.1/10 based on 291 reviews. The website's critical consensus reads, \"Better Call Saul is a quirky, dark character study that manages to stand on its own without being overshadowed by the series that spawned it.\" Metacritic, which uses a weighted average, assigned a \"generally favorable\" score of 78 based on 43 reviews.\r\nThe second season has a 97% approval rating on Rotten Tomatoes, with an average score of 8.7/10 based on 182 reviews. The website's critical consensus reads, \"Better Call Saul continues to tighten its hold on viewers with a batch of episodes that inject a surge of dramatic energy while showcasing the charms of its talented lead.\" On Metacritic, it has a score of 85 out of 100, based on 18 critics, indicating \"universal acclaim\".\r\nThe third season has a 98% approval rating on Rotten Tomatoes, with an average score of 8.75/10 based on 175 reviews. The website's critical consensus is, \"Better Call Saul shows no signs of slipping in season 3, as the introduction of more familiar faces causes the inevitable transformation of its lead to pick up exciting speed.\" On Metacritic, it has a score of 87 out of 100, based on 18 critics, indicating \"universal acclaim\".\r\nThe fourth season has a 99% approval rating on Rotten Tomatoes, with an average score of 8.9/10 based on 185 reviews. The website's critical consensus states, \"Well-crafted and compelling as ever, Better Call Saul deftly balances the show it was and the one it will inevitably become.\" On Metacritic, it has a score of 87 out of 100, based on 16 reviews, indicating \"universal acclaim\".\r\nThe fifth season has a 99% approval rating on Rotten Tomatoes, with an average score of 8.9/10 based on 184 reviews. The website's critical consensus is, \"Grounded by Bob Odenkirk's endlessly nuanced, lived-in performance, Better Call Saul's fifth season is a darkly funny, vividly realized master class in tragedy.\" On Metacritic, it has a score of 92 out of 100 based on 16 critics, indicating \"universal acclaim\".\r\nThe sixth season has a 99% approval rating on Rotten Tomatoes, with an average score of 9.4/10 based on 174 reviews. The website's critical consensus is, \"Better Call Saul remains as masterfully in control as Jimmy McGill keeps insisting he is in this final season, where years of simmering storytelling come to a scintillating boil.\" On Metacritic, the season has a score of 94 out of 100 based on 20 critics for Part 1, and 95 out of 100 based on 8 critics for Part 2, indicating \"universal acclaim\".\r\nAfter the airing of the series finale, Stuart Jeffries of The Guardian said that the series had surprisingly surpassed its predecessor in quality, saying: \"Over six series, Better Call Saul evolved into a more profound and beautiful drama about human corruption than its predecessor. It mutated into something visually more sumptuous than Breaking Bad, while never, for a moment, losing its verbal dexterity and moral compass\". Craig Elvy of Screen Rant also opined that the series was better than its predecessor, saying: \"Jimmy McGill's spinoff leaves a very familiar legacy - sustained and enthusiastic praise from audiences and critics, capped by an ending that satisfies across the board.\" He went on to say: \"When Better Call Saul began, many would've hoped the spinoff could either escape Breaking Bad's shadow, or somehow enhance Walt and Jesse's story with illuminating new details. Few dared dream Better Call Saul would achieve both, and the sheer ambition to create a spinoff that wholly embraces its predecessor whilst also existing in a totally different realm exemplifies why Better Call Saul has an ever-so-slight edge over Breaking Bad.\" Jeremy Urquhart of Collider made a comparison between the quality of both series’, saying: \"Breaking Bad succeeds as a crime-thriller tragedy with a fast-paced plot, and Better Call Saul works as a slower-paced, character-focused drama (with some dark comedy)\". He said the list \"doesn't aim to argue that one is better than the other. It's a matter of personal preference, but it's hard to deny that there are certain things Better Call Saul does better, but also some areas where it isn't quite as great as its parent show.\"\r\nRatings\r\nAccolades\r\nBetter Call Saul has received 46 Emmy Award nominations. It has received six nominations for Outstanding Drama Series. Bob Odenkirk has received five nominations for Outstanding Lead Actor in a Drama Series. Jonathan Banks and Giancarlo Esposito have each been nominated for Outstanding Supporting Actor in a Drama Series; four times for Banks and twice for Esposito. Rhea Seehorn has received a nomination for Outstanding Supporting Actress in a Drama Series. The series has also received six nominations for Outstanding Writing for a Drama Series and one nomination for Outstanding Directing for a Drama Series.\r\nFranchise\r\nBetter Call Saul has its own set of official multimedia spin-offs and related media within the Breaking Bad franchise. This includes a talk show, several web series and digital shorts, comic books, and an insider podcast.",
    "html": "<p>Better Call Saul is an American legal crime drama television series created by Vince Gilligan and Peter Gould for AMC. Part of the Breaking Bad franchise, it is a spin-off from Gilligan's previous series, Breaking Bad (2008–2013), to which it serves as both a prequel and sequel. Better Call Saul premiered on AMC on February 8, 2015, and concluded on August 15, 2022, after six seasons consisting of 63 episodes.</p><p>Set primarily in the early 2000s in Albuquerque, New Mexico, several years before Breaking Bad, Better Call Saul examines the moral declines of Jimmy McGill (Bob Odenkirk), an earnest lawyer and former con artist who becomes the egocentric criminal-defense attorney Saul Goodman, and Mike Ehrmantraut (Jonathan Banks), a former corrupt police officer who becomes a fixer and enforcer for drug traffickers. Other main characters include Jimmy's romantic interest and colleague Kim Wexler (Rhea Seehorn), his brother and rival Chuck McGill (Michael McKean), Chuck's law partner Howard Hamlin (Patrick Fabian), the drug dealer Nacho Varga (Michael Mando), the drug lord Gus Fring (Giancarlo Esposito), and the cartel enforcer Lalo Salamanca (Tony Dalton). In addition to the primary storyline, Better Call Saul includes black-and-white flashforwards set in 2010, after the events of Breaking Bad, which explore the consequences of Saul's eventual partnership with the drug lord Walter White (Bryan Cranston).</p><p>Gilligan, who created and developed Breaking Bad, and Gould, who wrote the Breaking Bad episode \"Better Call Saul\", began considering a Saul Goodman spin-off in 2009. Because Saul's role in Breaking Bad had expanded beyond the writing staff's plans, Gilligan felt he could be explored further. He and Gould considered making a half-hour legal comedy featuring Saul and his various clients, but settled on an hour-long tragedy showing how he develops into the character seen in Breaking Bad. Better Call Saul's development began during the production of Breaking Bad's final season in 2013, with Gilligan and Gould serving as co-showrunners and numerous production staff returning. Odenkirk, Banks, and Esposito reprise their roles from Breaking Bad, as do many others in guest appearances. Gilligan left Better Call Saul early in the third season—making Gould the sole showrunner for the remainder of its run—though he returned to help write the final season.</p><p>Better Call Saul received critical acclaim, with praise for its acting, characters, writing, direction, and cinematography. Many reviewers considered it a worthy successor to Breaking Bad—some deeming it superior to its predecessor—and one of the greatest television series of all time. It has garnered many awards and nominations, including two Peabody Awards, 48 Primetime and Creative Arts Emmy Awards, 19 Writers Guild of America Awards, 20 Critics' Choice Television Awards, nine Screen Actors Guild Awards, and six Golden Globe Awards nominations. At the time of its airing, the series premiere held the record for the highest-rated scripted series premiere in basic cable history.</p><br/><h3>Premise</h3><p>Better Call Saul follows the transformation of Jimmy McGill, a former con artist who is trying to become a respectable lawyer, into the personality of the flamboyant criminal lawyer Saul Goodman (a play on the phrase \"'s all good, man!\"), over the six-year period prior to the events of Breaking Bad, spanning from approximately 2002 to 2008.</p><p>Jimmy is inspired by his older brother Chuck to leave his Chicago-area conman past, when he was known as \"Slippin' Jimmy\". He initially works in the mailroom at his brother's Albuquerque law firm, Hamlin, Hamlin & McGill (HHM), where managing partner Howard Hamlin becomes his nemesis. While at HHM Jimmy befriends Kim Wexler, a fellow mailroom employee who completes law school and becomes one of the firm's associates, and their friendship later turns romantic. Jimmy is motivated by Chuck's success to finish college and complete a Juris Doctor degree through a correspondence law school, the fictitious University of American Samoa.</p><p>After attaining admission to the bar but being denied employment at HHM, Jimmy's pursuits focus on low-paying clients, including working as a public defender. He later begins to build a practice in elder law, which leads to a prolonged lawsuit against a nursing home chain he discovers is defrauding its clients. He and Chuck begin working together on a class-action suit, which Chuck quickly punts to HHM, squeezing Jimmy out. Jimmy begins to unravel due to Chuck's constant belittling, sabotage, and vindictive behavior towards him. Jimmy's life and career begin to intersect with the illegal narcotics trade and feature characters and story arcs that continue into Breaking Bad.</p><p>Among these arcs is the uneasy truce between the Salamanca family that serves the Juárez Cartel drug interest, and Gus Fring, a fried chicken entrepreneur whose restaurant chain is a front for the drug trade. The Salamanca family is led by Hector Salamanca, and later by his nephews Tuco and Lalo. Those caught up in the ensuing turmoil include Ignacio \"Nacho\" Varga, a Salamanca associate who wants to protect his father from harm, and Mike Ehrmantraut, a former Philadelphia police officer who becomes a fixer for Gus. As his interactions with criminals continue, Jimmy takes on the persona of the flamboyant, colorful Saul Goodman, and he starts to draw on his conman past while his work as an attorney goes from questionable to unethical to illegal.</p><p>In addition to selected scenes that take place within the Breaking Bad timeline, the show includes flashforwards, shown in black and white, to events following Breaking Bad. These scenes, taking place in 2010, show Jimmy living as a fugitive under the identity of Gene Takavic, the manager of a Cinnabon store in Omaha, Nebraska. In the final episodes of the series, these flashforwards take up nearly the entirety of the episodes, with the majority of them taking place after or during Breaking Bad.</p><br/><h3>Cast and characters</h3><h4>Main cast</h4><ul><li>Bob Odenkirk as Jimmy McGill / Saul Goodman / Gene Takavic, a lawyer and a former scam artist, who becomes involved with the criminal world.</li><li>Jonathan Banks as Mike Ehrmantraut, a former Philadelphia police officer working as a parking lot attendant at the Albuquerque courthouse, and later a private investigator, bodyguard and \"cleaner\".</li><li>Rhea Seehorn as Kim Wexler, a lawyer who became a close friend of Jimmy's as she worked her way through the ranks at the Hamlin, Hamlin & McGill (HHM) law firm. She becomes Jimmy's confidante and later the two develop a romantic relationship and marry.</li><li>Patrick Fabian as Howard Hamlin, the managing partner at Hamlin, Hamlin & McGill, who appears to be Jimmy's nemesis until it becomes clear that he was acting under Chuck McGill's orders.</li><li>Michael Mando as Nacho Varga, an intelligent, ambitious member of Hector Salamanca's drug ring who also works for his father's upholstery shop.</li><li>Michael McKean as Chuck McGill (seasons 1–3; special guest seasons 4 and 6), Jimmy's elder brother and a founding partner of HHM who is confined to his home because of his electromagnetic hypersensitivity and expresses disdain for his brother's legal career.</li><li>Giancarlo Esposito as Gus Fring (seasons 3–6), the owner of the fast food restaurant chain Los Pollos Hermanos, which is a front to distribute cocaine for the Mexican cartel, in uneasy cooperation with the Salamanca family. He nurses grudges against cartel boss Don Eladio and Salamanca patriarch Hector Salamanca. Fring wants to switch from cocaine to locally produced methamphetamine so he can end his dependence on the cartel.</li><li>Tony Dalton as Lalo Salamanca (seasons 5–6; recurring season 4), the charismatic and psychopathic nephew of Hector, who helps run the family drug business after Hector's stroke. He is the cousin of Tuco, Leonel, and Marco.</li></ul><h4>Recurring cast</h4><h4>Introduced in season 1</h4><ul><li>Kerry Condon as Stacey Ehrmantraut, Mike's widowed daughter-in-law and the mother of Kaylee Ehrmantraut</li><li>Faith Healey (season 1), Abigail Zoe Lewis (seasons 2–4) and Juliet Donenfeld (seasons 5–6) as Kaylee Ehrmantraut, Mike's granddaughter</li><li>Eileen Fogarty as Mrs. Nguyen, owner of a nail salon which houses Jimmy's law office in its utility room</li><li>Peter Diseth as Deputy District Attorney Bill Oakley</li><li>Joe DeRosa as Dr. Caldera, a veterinarian with ties to the criminal underworld</li><li>Dennis Boutsikaris as Rich Schweikart, a partner at Schweikart & Cokely</li><li>Mark Proksch as Daniel \"Pryce\" Wormald, a drug company employee who begins supplying Nacho and hires Mike as security</li><li>Brandon K. Hampton as Ernesto, Chuck's assistant who works at HHM</li><li>Josh Fadem as Marshall/Joey Dixon (\"Camera Guy\"), one of the three University of New Mexico (UNM) film students who help Jimmy film various projects</li><li>Julian Bonfiglio as Phil (\"Sound Guy\"), one of the three UNM film students Jimmy hires for various film projects</li><li>Jeremy Shamos and Julie Ann Emery as Craig and Betsy Kettleman, a county treasurer and his wife, accused of embezzlement</li><li>Steven Levine and Daniel Spenser Levine as Lars and Cal Lindholm, twin skateboarders and small-time scam artists</li><li>Míriam Colón as Abuelita Salamanca, Tuco's grandmother and Hector's mother</li><li>Barry Shabaka Henley as Detective Sanders, a Philadelphia cop who was formerly partnered with Mike on the force</li><li>Mel Rodriguez as Marco Pasternak, Jimmy's best friend and partner-in-crime in Cicero, Illinois</li><li>Clea DuVall as Dr. Cruz, a doctor who treats Chuck and suspects his electromagnetic hypersensitivity condition is psychosomatic</li><li>Jean Effron as Irene Landry, an elderly client of Jimmy McGill overcharged by the Sandpiper Crossing elder care home</li><li>Steven Ogg as Sobchak, a petty crook for hire</li></ul><h4>Introduced in season 2</h4><ul><li>Ed Begley Jr. as Clifford Main, managing partner at Davis & Main where Jimmy worked during season two</li><li>Omar Maskati as Omar, Jimmy's assistant at Davis & Main</li><li>Jessie Ennis as Erin Brill, a lawyer at Davis & Main who is ordered to shadow Jimmy</li><li>Juan Carlos Cantu as Manuel Varga, Nacho's father who owns an upholstery shop</li><li>Vincent Fuentes as Arturo Colon, a criminal associate of Hector Salamanca</li><li>Rex Linn as Kevin Wachtell, chairman of Mesa Verde Bank and Trust and a client of HHM and Kim</li><li>Cara Pifko as Paige Novick, senior legal counsel for Mesa Verde Bank and Trust and a friend of Kim</li><li>Ann Cusack as Rebecca Bois, Chuck's ex-wife</li><li>Julie Pearl as Assistant District Attorney Suzanne Ericsen</li><li>Manuel Uriza as Ximenez Lecerda, an associate of Hector Salamanca</li><li>Hayley Holmes as Cheri (\"Make-Up Girl\"/\"Drama Girl\"), one of the three University of New Mexico film students Jimmy hires for various projects</li></ul><h4>Introduced in season 3</h4><ul><li>Kimberly Hebert Gregory as Assistant District Attorney Kyra Hay</li><li>Harrison Thomas as Lyle, the dedicated assistant manager of Los Pollos Hermanos</li><li>Tamara Tunie as Anita, a member of Mike and Stacey's support group</li><li>Bonnie Bartlett as Helen, Irene's friend and member of the affected class in the Sandpiper lawsuit</li></ul><h4>Introduced in season 4</h4><ul><li>Don Harvey (seasons 4–5) and Pat Healy (season 6) as Jeff, a taxi cab driver in the present that recognizes Gene as Saul Goodman</li><li>Rainer Bock as Werner Ziegler, an engineer hired by Gus to plan and oversee construction of his meth \"superlab\"</li><li>Ben Bela Böhm as Kai, a rebellious member of the crew Werner Ziegler assembles for the construction of Gus's meth \"superlab\"</li><li>Stefan Kapičić as Casper, a member of Werner Ziegler's team</li><li>Poorna Jagannathan as Maureen Bruckner, a specialist from Johns Hopkins who flew to Albuquerque to treat Hector after Gus arranged for a \"generous grant\"</li><li>Keiko Agena as Viola Goto, Kim Wexler's paralegal</li></ul><h4>Introduced in season 5</h4><ul><li>Max Bickelhaup as Buddy, Jeff's friend who later helps Gene with his schemes</li><li>Sasha Feldman and Morgan Krantz as Sticky and Ron, two petty crooks who are among \"Saul Goodman\"'s first clients</li><li>Barry Corbin as Everett Acker, an old man living on leased property belonging to Mesa Verde whom Kim has to evict to make way for the bank's new call center</li></ul><h4>Introduced in season 6</h4><ul><li>Lennie Loftin as Genidowski, a con man hired by Jimmy and Kim to pose as Howard's private investigator</li><li>Sandrine Holt as Cheryl Hamlin, Howard's estranged wife</li><li>John Posey as Rand Casimiro, a retired judge who is mediating the Sandpiper case</li><li>John Ennis as Lenny, a grocery store employee hired by Jimmy and Kim to impersonate Casimiro</li><li>Carol Burnett as Marion, Jeff's mother who takes a liking to Gene</li><li>Kevin Sussman as Mr. Lingk, a rich man with cancer who is targeted by Gene</li></ul><h4>Introduced in Breaking Bad</h4><ul><li>Raymond Cruz as Tuco Salamanca, a ruthless, psychopathic drug distributor in the South Valley (seasons 1–2)</li><li>Cesar García as No-Doze, Tuco's henchman (season 1)</li><li>Jesús Payán Jr. as Gonzo, Tuco's henchman (season 1)</li><li>T.C. Warner as Nurse (season 1)</li><li>Kyle Bornheimer as Ken, an arrogant, self-absorbed stockbroker (season 2)</li><li>Stoney Westmoreland as Officer Saxton, an Albuquerque Police Department officer (season 2)</li><li>Jim Beaver as Lawson, a black market weapons dealer in Albuquerque (season 2)</li><li>Maximino Arciniega as Domingo \"Krazy-8\" Molina, one of Tuco's distributors (seasons 2–5)</li><li>Mark Margolis as Hector Salamanca, Tuco's uncle and high-ranking member of the cartel (seasons 2–6)</li><li>Debrianna Mansini as Fran, a waitress at Loyola's Diner (seasons 2 and 4)</li><li>Daniel and Luis Moncada as Leonel and Marco Salamanca, Tuco's cousins and Hector's nephews who are hitmen for the cartel (seasons 2, 4–6)</li><li>Jennifer Hasty as Stephanie Doswell, a real estate agent (season 2)</li><li>Tina Parker as Francesca Liddy, Jimmy's receptionist (seasons 3–4, 6)</li><li>Jeremiah Bitsui as Victor, Gus's henchman (seasons 3–6)</li><li>Ray Campbell as Tyrus Kitt, a henchman on Gus Fring's payroll (seasons 3–6)</li><li>JB Blanc as Dr. Barry Goodman, a doctor on Gus Fring's payroll (seasons 3–5)</li><li>Steven Bauer as Don Eladio Vuente, the head of the Juárez drug cartel (seasons 3, 5–6)</li><li>Javier Grajeda as Juan Bolsa, a high-level member of the Juárez drug cartel (seasons 3–6)</li><li>Lavell Crawford as Huell Babineaux, a professional pickpocket hired by Jimmy (seasons 3–6)</li><li>Laura Fraser as Lydia Rodarte-Quayle, a Madrigal Electromotive executive and associate of Gus Fring (seasons 3–5)</li><li>Eric Steinig as Nick, a member of Gus's security team, later managed by Mike (seasons 4–6)</li><li>Franc Ross as Ira, a burglar Jimmy hires; in Breaking Bad, he is the owner of Vamonos Pest who appears in \"Hazard Pay\" (season 4)</li><li>David Costabile as Gale Boetticher, a chemist who is consulted by Gus (season 4)</li><li>Robert Forster as Ed Galbraith, a vacuum cleaner store owner who relocates people running from the law and gives them new identities (season 5)</li><li>Dean Norris as Hank Schrader, a DEA agent and Walter White's brother-in-law (season 5)</li><li>Steven Michael Quezada as Steven Gomez, Hank's DEA partner and best friend (season 5)</li><li>Robert Sanchez as Harry Lipenstein, a DEA agent (season 5)</li><li>Nigel Gibbs as Tim Roberts, a detective with the Albuquerque Police Department (seasons 5–6)</li><li>Norbert Weisser as Peter Schuler, a Madrigal Electromotive executive and associate of Gus Fring (season 5)</li><li>Julia Minesci as Wendy, a street prostitute working out of the Crossroads motel (season 6)</li><li>David Ury as Spooge, a small-time criminal (season 6)</li><li>Bryan Cranston as Walter White, a middle-aged high school chemistry teacher who, during the events of Breaking Bad, becomes involved with the drug trade and enlists the services of Saul to help launder his money (season 6)</li><li>Aaron Paul as Jesse Pinkman, a former student of Walter who, during the events of Breaking Bad, helps Walter with cooking meth (season 6)</li><li>John Koyama as Emilio Koyama, Jesse's friend and sometime partner in the meth business (season 6)</li><li>Betsy Brandt as Marie Schrader, Hank's widowed wife (season 6)</li><li>Todd Terry as SAC Austin Ramey, head of the southwestern United States DEA offices (season 6)</li></ul><br/><h3>Production</h3><h4>Conception</h4><p>Vince Gilligan and Peter Gould began considering a television spinoff of Breaking Bad as early as 2009. While filming the Breaking Bad episode \"Full Measure\", Gilligan asked Bob Odenkirk his thoughts on a Saul Goodman spinoff. In July 2012, Gilligan publicly hinted at a Goodman spinoff, stating that he liked \"the idea of a lawyer show in which the main lawyer will do anything it takes to stay out of court\", including settling on the courthouse steps. During his appearance on Talking Bad, Odenkirk noted that Saul was one of the most popular characters on the show, speculating that the audience likes the character because he is \"the program's least hypocritical figure\", and \"is good at his job\".</p><p>Gilligan noted that over the course of Breaking Bad, there were a lot of \"what ifs” their team considered, such as if the show won a Primetime Emmy Award, or if people would buy \"Los Pollos Hermanos\" T-shirts. The staff did not expect these events to come to fruition, but after they did, they started considering a spin-off featuring Saul as a thought experiment. Furthermore, Saul's character on Breaking Bad became much more developed than the staff had planned, as he was originally slated to appear in only three episodes. With the growth of Saul's character, Gilligan saw ways to explore the character further.</p><h4>Development</h4><p>In April 2013, Better Call Saul was confirmed to be in development by Gilligan and Gould; the latter wrote the Breaking Bad episode that introduced the character. In July 2013, before the second half of Breaking Bad's final season aired, Gilligan said he and Gould were still working out ideas for the spin-off, but a deal had not yet been made. Netflix was one of many interested distributors, but ultimately a deal was made between AMC and the Breaking Bad production company Sony Pictures Television. Gilligan and Gould began as co-showrunners, and Gilligan directed the pilot. Former Breaking Bad writers Thomas Schnauz and Gennifer Hutchison joined the writing staff, with Schnauz serving as co-executive producer and Hutchison as supervising producer. Also joining the initial writing staff were Bradley Paul and former Breaking Bad writer's assistant Gordon Smith.</p><p>As Sony and AMC began to commit to a spinoff, Gilligan and Gould worked on what it would be about. They initially considered making it a half-hour show where Saul would see various clients – celebrities in guest roles – in his strip mall office, a format similar to Dr. Katz, Professional Therapist, but they had no idea how to write for this type of format, and fell back to planning for hour-long episodes. Since they had used this format with Breaking Bad, which Gilligan said was \"25-percent humor, 75-percent drama\", the two considered reversing that for Better Call Saul. While the intent was to add more humor, the show remained heavy with dramatic elements, with Odenkirk calling the first season \"85 percent drama, 15 percent comedy.\"</p><p>While several of the characters are lawyers in the show, Gilligan and Gould did not want to write a legal show, but instead a crime show, but one that would necessitate some legal elements. To help in these areas, the writers spoke to real lawyers and spent time observing cases at Los Angeles Superior Court, observing that the bulk of the activity in these cases was downtime while waiting for others to complete actions.</p><p>Gilligan and Gould found that the character of Saul Goodman was insufficient to carry the show by himself, with Gilligan calling the character of Saul \"great flavoring\" for a show but not the substance. They came to realize that Saul, in the Breaking Bad timeframe, was a man who had come to accept himself, and recognized the potential of telling the story of how Saul got to be that person. Gilligan and Gould had already committed to the Better Call Saul title, so that in following this route, they believed they had to quickly get from Jimmy McGill to Saul Goodman, or they would otherwise disappoint their audience. However, as they wrote the show, they realized \"we don't want to get to Saul Goodman … and that's the tragedy\".</p><p>Gilligan and Gould had learned several lessons related to foreshadowing without writing the foresight for it from Breaking Bad, and so with Better Call Saul, gave themselves more flexibility in how the show's plot would develop over its run, and had no firm idea where it would end up outside the connection to Breaking Bad. For example, Rhea Seehorn's performance as Kim Wexler during the first season significantly altered how the writers used her character in later seasons as well as slowing down the pacing of the transition of Jimmy into Saul, as they gave more focus to the Jimmy–Kim relationship. Gilligan compared this to the impact Aaron Paul's acting had on Breaking Bad's ultimate pacing.</p><p>In writing for Better Call Saul, Gilligan and Gould recognized they were including overlaps with Breaking Bad, and had ideas of characters they would include, such as Gus Fring, though on no set timetable within the show's development. Gilligan described the writing approach as if developing two separate shows, one that centers on Jimmy/Saul, Kim, Chuck, and Howard, and a second on the more familiar Breaking Bad characters like Mike and Gus with some overlap, as if they were giving the audience two shows for one. Where possible, they had written in minor Breaking Bad characters in smaller parts or as Easter eggs to fans, but Gilligan preferred only to include such major Breaking Bad characters as Walter or Jesse if this seemed unconstrained and satisfactory to both the production team and the audiences.</p><p>Because of the closeness to the Breaking Bad storyline, one of the writers was tasked at the start of each season to rewatch all 62 episodes of the show and verify that the scripts for the Better Call Saul season introduced no conflicts. As the show continued, the show's \"brain trust\" consisting of script coordinators Ariel Levine and Kathleen Williams-Foshee reviewed each script to help maintain the continuity with Breaking Bad, including tracking minor character traits and assuring small details from the previous show were kept correct if brought up again.</p><h4>Gilligan's departure from the writing staff and return</h4><p>Gilligan left the Better Call Saul writing staff early in the third season to focus on other projects, resulting in Gould becoming sole showrunner. This transition had been planned since the show's debut. Upon his departure, Gilligan expressed his hopes to return to the writers room during the show's final season. He remained involved in the fourth and fifth seasons, but said he had very little to do with developing the show's contents during this period. Instead, Gilligan reduced his role to being a \"director for hire\" for the episodes \"Wiedersehen\" and \"Bagman\", and stated these were the only scripts he read when he was not on the writing staff. Gilligan went on to credit Gould for maintaining the series' high quality. Gould would bring Gilligan back to the writers room for the sixth and final season, calling it \"wonderful to have him there, so we can finish this show that we started together.\"</p><h4>Casting</h4><p>Bob Odenkirk confirmed he would reprise Saul Goodman in the starring role when the series was first announced, but his character would be introduced as lawyer Jimmy McGill. In January 2014, it was announced that Jonathan Banks would reprise his Breaking Bad role as Mike Ehrmantraut and be a series regular.</p><p>New cast members included Michael McKean as McGill's elder brother Chuck. McKean previously guest-starred in an episode of Odenkirk's Mr. Show and Gilligan's X-Files episode \"Dreamland\". Rhea Seehorn auditioned and got the role of Kimberly \"Kim\" Wexler in April 2014, her character being described as \"prestigious attorney ... whose hard life is complicated by her romantic entanglements with somebody else at the firm\". In May 2014, Patrick Fabian was cast on the show as Howard Hamlin, a \"Kennedy-esque lawyer who's winning at life\". After impressing Gilligan and Gould with his audition tape and screen test, Michael Mando was cast as the \"smart and calculating criminal\" Ignacio \"Nacho\" Varga. Mando's character had been previously mentioned but not seen in the Breaking Bad episode \"Better Call Saul\".</p><p>Going into the third season, Giancarlo Esposito was added to the main cast as Gus Fring, a drug kingpin who previously served as one of Breaking Bad's main antagonists. Esposito was previously a starring cast member in Breaking Bad for the same role. McKean would leave the series at season's end due to his character being written out, but would make appearances in the next season and the series finale. Tony Dalton made his first appearance as Lalo Salamanca in the fourth season, and would be promoted to the main cast for the fifth. Similar to Nacho, Lalo had been a character mentioned only by name in the same Breaking Bad episode \"Better Call Saul\".</p><h4>Guest appearances from Breaking Bad characters</h4><p>Before the second season, Gilligan confirmed that more of the prominent characters from Breaking Bad would be making guest appearances on the spin-off, but remained vague on which characters were likely to be seen. By the next season, Gilligan said that the show had been on long enough that any reuse of Breaking Bad characters would require more than \"just a cameo or an Alfred Hitchcock walkthrough\", and that their appearances would need to be essential to the story.</p><p>Throughout Better Call Saul's run, both Breaking Bad lead actors Bryan Cranston and Aaron Paul regularly said they would be open to reprising their respective roles as Walter White and Jesse Pinkman on the spin-off. However, both maintained that they would only appear if Gilligan found a sufficiently good reason to bring them on the show. Paul previously mentioned the possibility of a cameo during the first season but this fell through. The two would eventually appear together in the sixth-season episode \"Breaking Bad\", which was named after the original series. Paul made a separate cameo in the next episode; Cranston appeared again in the series finale.</p><p>Dean Norris, who was also a starring cast member on Breaking Bad, stated he could not be part of the earlier seasons, partly due to his involvement in the CBS series Under the Dome. However, he was announced as a guest star in the fifth season, where he reprised his role as Hank Schrader in the episodes \"The Guy for This\" and \"Namaste\". Plans were initially made for Betsy Brandt, another Breaking Bad starring cast member, to reprise her role as Hank's wife Marie Schrader in a cameo on the second-season finale \"Klick\". However, the writer's room objected, considering the idea to be distracting for audiences. Brandt would eventually appear in the series finale.</p><p>Other Breaking Bad cast members spoke of the potential of being on Better Call Saul. Before the series began, Anna Gunn mentioned a \"talk\" with Gilligan over possible guest appearances as Skyler White. Bill Burr was set to return as Patrick Kuby in the fifth-season episode \"Dedicado a Max\", but scheduling fell through due to him needing to attend to a personal matter. After the series ended, Gould mentioned his desire to bring back Gunn, Norris, Esposito and RJ Mitte for the finale, but he and the writing staff could not find a proper way to have them fit into the story.</p><h4>Filming</h4><p>Principal photography for Better Call Saul's six seasons took place from June 2, 2014, to February 9, 2022. Like its predecessor, Better Call Saul is set in and around Albuquerque, New Mexico, with filming primarily taking place at Albuquerque Studios. Additional filming was done in March 2022, after principal photography for the series ended, for the opening teaser of the season six episode \"Point and Shoot\". With several crew members but no cast members on hand, the scene was filmed in Leo Carrillo State Beach, California. This was the only time the series was filmed outside of New Mexico.: 1:00:01–1:01:29</p><p>Notable exterior locations include the Twisters restaurant used previously in Breaking Bad for Gus's Los Pollos Hermanos, a parking lot kiosk at the Albuquerque Convention Center for where Mike worked in the first few seasons, the Old Bernalillo County Courthouse as the local courthouse, and two nearby office buildings in the North Valley, including Northrop Grumman's, that collectively are used for the HHM office spaces.</p><p>Jimmy's back office is located in an actual nail salon, which the producers accommodated by working with the owners. The Salamanca's restaurant is a real business in the South Valley that production modified a bit for the show, but which otherwise remained open. The scenes set in Omaha are filmed at Cottonwood Mall in Albuquerque; production worked with Cinnabon to bring in the period-specific equipment and service items for the segments, and the extras in the store during these scenes are Cinnabon employees. The New Mexico Film Office reported that the first four seasons of Better Call Saul brought over US$120 million into the state, and they have hired 1,600 crew for each season and a total of 11,300 extras.</p><p>Better Call Saul employs Breaking Bad's signature time jumps. Notably, most seasons' opening episode has started with a black and white flash-forward to a period in the years after the finale of Breaking Bad where Saul has been relocated to Omaha, Nebraska, as \"Gene\", a manager of a Cinnabon store, remaining paranoid about anyone discovering his past identity. This was foreshadowed in the penultimate episode of Breaking Bad, \"Granite State\", in which Saul tells Walter: \"If I'm lucky, a month from now, best-case scenario, I'm managing a Cinnabon in Omaha.\"</p><p>The show's director of photography was Arthur Albert for the first two seasons, and Marshall Adams starting with season 3. Additionally, Paul Donachie served as a cinematographer on episodes \"Namaste\" (2020), \"Carrot and Stick\" (2022) and \"Hit and Run\" (2022). Seasons 1 and 2 was filmed mainly on RED Dragon cameras. Starting with season 3, Panasonic VariCam Pure were incorporated due to their extra low-light sensitivity. This allowed the crew to shoot extra wide exterior shots at night as well as during the day, and to shoot on sets in near total darkness, such as nighttime in Chuck's unelectrified house. For scenes requiring to film from cramped spaces, a Panasonic Lumix GH4 camera was used. In season 4, three RED and two VariCam Pure cameras were used. For seasons 5 and 6, mostly Arri ALEXA LF was used.</p><h4>Episode title sequences</h4><p>Each episode's title sequence features a different low-quality image that recalls Saul Goodman's days on Breaking Bad. This includes the inflatable Statue of Liberty balloon that sat atop Saul's office, a drawer of burner phones kept in his desk, and a bus stop bench that advertised his business. Gould and Gilligan were inspired by the poor quality of early VHS tapes and the notoriously low production values of 1980s public-access television, and from the fact that Saul Goodman's ads on Breaking Bad were done in a similar style. They intended for the title sequences to appear \"purposefully shitty\" in order to stand out from those of its contemporaries, which generally had increased visual quality and production standards. Some of the title sequences were put together from unused footage from Breaking Bad, but others were filmed specifically to create new ones. The title sequences were put together by assistant editor Curtis Thurber, and scored by Little Barrie guitarist Barrie Cadogan. When Cadogan was putting the music together, he was told the producers wanted a piece of music that would be cut abruptly at 15 seconds.</p><p>As every season except for the last has ten episodes each, the title credits for every season's corresponding episode number would reuse the same image. However, beginning with the second season, each of the episode's title sequences would continue to decline in picture quality by intermittently flashing black and white, and continue to lose color with each passing season. This caused many to theorize that this symbolized Jimmy McGill's storyline gradually transitioning to that of his post-Breaking Bad alter-ego Gene Takavic, whose scenes were entirely in black and white.</p><p>With the final season featuring thirteen episodes instead of the usual ten, the title sequences would take a new format. During \"Nippy\", the title sequence features Saul Goodman's \"World's Greatest Lawyer\" mug falling off his desk and shattering on the floor, as was typical during a season's tenth episode. However, the title image and music prematurely stops and is replaced by a blue screen, recreating the effects of a home video recording on a VCR, and then displayed the show's title and creator credits. This is also the first episode to take place entirely after the events of Breaking Bad. The remaining three title sequences retain the blue background, but briefly flash to an image previously unseen in the intro, with a distorted version of the theme song playing underneath. They then revert to the blue background again and display the title and creator credits. Before the show resumes, they again briefly flash to another new image that will be seen later on in the episodes.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><style data-mw-deduplicate=\"TemplateStyles:r1152813436\">.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);clip-path:polygon(0px 0px,0px 0px,0px 0px);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px;white-space:nowrap}</style><span class=\"sr-only\">Series overview for <i>Better Call Saul</i></span></caption><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 8, 2015</td><td style=\"padding:0 8px\">April 6, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 15, 2016</td><td style=\"padding:0 8px\">April 18, 2016</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 10, 2017</td><td style=\"padding:0 8px\">June 19, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">August 6, 2018</td><td style=\"padding:0 8px\">October 8, 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 23, 2020</td><td style=\"padding:0 8px\">April 20, 2020</td></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"1\" rowspan=\"2\">13</td><td colspan=\"1\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 18, 2022</td><td style=\"padding:0 8px\">May 23, 2022</td></tr><tr style=\"height:100%\"><td colspan=\"1\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 11, 2022</td><td style=\"padding:0 8px\">August 15, 2022</td></tr></tbody></table><p>The complete series was issued on Blu-ray and DVD in region 1 on December 6, 2022. The set spanned 19 discs and included 70 hours of bonus features.</p><p>Better Call Saul's episodes are split between two main timelines. The primary timeline begins in 2002, six years before the first episode of Breaking Bad. During this period, where a majority of the series takes place, Saul Goodman practices as a lawyer in Albuquerque, New Mexico under his birthname Jimmy McGill.</p><p>The secondary timeline takes place in 2010, following events of Breaking Bad's finale, where Saul has fled Albuquerque and hides in Omaha, Nebraska under the alias Gene Takavic. This later timeline would only be shown in the cold open in the first five season premieres, but would be fully explored in the last four episodes of the series.</p><h4>Season 1 (2015)</h4><p>The first teaser trailer debuted on AMC on August 10, 2014, and confirmed its premiere date of February 2015. On November 20, 2014, AMC announced the series would have a two-night premiere; the first episode aired on Sunday, February 8, 2015, at 10:00 pm (ET), and then moved into its regular time slot the following night, airing Mondays at 10:00 pm. It was released on Blu-ray and DVD in region 1 on November 10, 2015; bonus features include audio commentaries for every episode, uncensored episodes, deleted scenes, gag reel, and several behind-the-scenes featurettes. A limited edition Blu-ray set was also released with 3D packaging and a postcard vinyl of the Better Call Saul theme song by Junior Brown.</p><p>In 2002, Jimmy schemes to represent Craig Kettleman, accused of embezzlement, leading to encounters with psychotic drug lord Tuco Salamanca and his lieutenant Nacho. Jimmy also cares for his brother Chuck, who is housebound with electromagnetic hypersensitivity. While pursuing elder law, Jimmy learns of seniors being defrauded by the Sandpiper retirement community. As the class action lawsuit against Sandpiper grows, Chuck suggests giving it to his law firm, Hamlin, Hamlin & McGill. Jimmy receives a small of counsel fee and a share of any future settlement, but is blocked from participation. Jimmy learns Chuck sabotaged his legal career out of resentment. After the death of an old friend, Jimmy finds success when Davis & Main, another firm HHM brought in to assist with the Sandpiper case, offers to hire him.</p><p>In 2010, Gene manages a Cinnabon by day, but in the evening reminisces about his life as Saul by watching a VHS tape of his old television advertisements.</p><h4>Season 2 (2016)</h4><p>Prior to the series' launch, on June 19, 2014, AMC renewed the series for a second season of 13 episodes to premiere in early 2016, which was later reduced to 10 episodes. It premiered on February 15, 2016, and released on Blu-ray and DVD in region 1 on November 15, 2016; bonus features include audio commentaries for every episode and several behind-the-scenes featurettes.</p><p>In 2002, Jimmy works as an associate at D&M, but quits after his ostentatious legal style doesn't mesh with the firm's corporate demeanor. Kim is demoted by Chuck's partner, Howard Hamlin, because of Jimmy's actions. She secures banking firm Mesa Verde as an HHM client, although Howard denies her credit. Kim quits HHM and opens a shared private practice with Jimmy. Jimmy sabotages Chuck's work for Mesa Verde, which drops HHM and hires Kim, but Chuck discovers this and tricks Jimmy into confessing. Nacho hires Mike Ehrmantraut to remove Tuco, but Mike instead machinates his imprisonment. Cartel elder and uncle of Tuco, Hector Salamanca, confronts Mike. Mike attempts to assassinate Hector, but is mysteriously interrupted.</p><p>In 2010, Gene accidentally locks himself in the dumpster room when closing out the Cinnabon for the night. Instead of alerting police, he spends the night waiting for the janitor to open the door.</p><h4>Season 3 (2017)</h4><p>AMC announced on March 15, 2016 that Better Call Saul was renewed for a 10-episode third season, which premiered April 10, 2017. It was released on Blu-ray and DVD in region 1 on January 16, 2018; bonus features include audio commentaries for every episode and several behind-the-scenes featurettes.</p><p>In 2003, the results of the disciplinary hearing have Jimmy's law license suspended and Chuck's hypersensitivity condition is revealed to be psychosomatic. After Jimmy sabotages Chuck's insurance, Howard urges him to retire, but Chuck sues HHM in spite. Howard buys him out of the firm, leading Chuck to commit suicide. Gus prevents Hector's assassination, and Mike attacks Hector's trucks to steal $250,000 on Gus's orders. To launder the money, Gus arranges for Mike's hire as a contracted security consultant at Madrigal. Hector plans to take over the business of Nacho's father, so his son attempts to kill Hector by sabotaging his angina medication. As the cartel prefers Gus's drug distribution over Hector's, he suffers a stroke during the confrontation rendering Hector comatose.</p><p>In 2010, Gene (Jimmy) points mall security guards towards a shoplifter during his lunch break. Later, a stressed Gene suddenly collapses during his work.</p><h4>Season 4 (2018)</h4><p>Following the third season's end on June 27, 2017, AMC renewed the series for a 10-episode fourth season, which premiered on August 6, 2018. It was released on Blu-ray and DVD in region 1 on May 7, 2019; bonus features include audio commentary for every episode and several behind-the-scenes featurettes.</p><p>In 2003, Jimmy regains his outgoing demeanor after Howard shoulders the blame for Chuck's death. Jimmy manages a cell phone store but earns more by reselling prepaid phones to criminals. A year later, his law license reinstatement is denied over lack of remorse for Chuck. After faking mourning, he successfully appeals and practices as the \"Saul Goodman\" trade name. Gus learns Nacho attempted to kill Hector and blackmails him into undermining the Salamancas. Mike escorts engineers who evaluate Gus's industrial laundry site as a potential underground meth lab. Gus hires Werner Ziegler to oversee construction, but Mike is ordered to kill Werner when he tries to escape. Hector recovers from his stroke, but is mute and can only move his right index finger. His nephew, Lalo Salamanca, arrives to run Hector's business, learning of the construction project.</p><p>In 2010, Gene is hospitalized after his collapse and later discharged. He becomes uneasy when a taxi driver with an Albuquerque Isotopes air freshener seems to recognize him.</p><h4>Season 5 (2020)</h4><p>The series was renewed for a fifth season on July 28, 2018, just prior to the airing of the fourth season. The fifth season was not expected to air until 2020; according to AMC's Sarah Barnett, the delay was \"driven by talent needs\". The 10-episode fifth season would start airing with a special Sunday broadcast on February 23, 2020, with following episodes to air on Mondays. It was released on Blu-ray and DVD in region 1 on November 24, 2020; bonus features include cast and crew audio commentaries on every episode, deleted scenes, and various behind-the-scenes featurettes.</p><p>In 2004, Jimmy's law practice as Saul Goodman draws him into Albuquerque's drug trade and he is conflicted when Howard offers him a position at HHM. Kim balances her Mesa Verde and pro bono work with her own feelings for Jimmy, and finds herself employing similar conman-style tactics. Jimmy and Kim later devise a plan to ruin Howard to settle the Sandpiper case. Lalo's presence in Albuquerque forces Gus to suspend construction of his meth lab. Nacho and Mike become pawns in the ongoing feud between the Salamancas and Gus. After Lalo is arrested for murder, he hires Jimmy to represent him and arrange bail, which almost kills Jimmy. After an unsuccessful attempt on Lalo's life by Gus's hired assassins after his release, Lalo deduces that Nacho has betrayed him.</p><p>In 2010, during another lunch break, Gene is approached by the taxi driver, Jeff, and his friend Buddy. Jeff reveals he recognized Gene as Saul Goodman from when he previously lived in Albuquerque. Gene admits he is living with a secret identity.</p><h4>Season 6 (2022)</h4><p>AMC renewed the series for a sixth season on January 16, 2020, with a scheduled premiere in 2021. Showrunner Peter Gould confirmed it would be the show's final season and consist of 13 episodes rather than the usual 10. Production experienced long delays due to COVID-19 and star Bob Odenkirk needing several weeks to fully recover from a heart attack he experienced on set. The sixth and final season was split into two halves; the first half premiered on April 18, 2022, while the last half premiered on July 11, 2022. The complete season was released on Blu-ray and DVD in region 1 on December 6, 2022; bonus features include cast and crew audio commentaries on every episode, deleted scenes, outtakes, and various behind-the-scenes featurettes.</p><p>In 2004, Nacho attempts to flee from the Salamancas after the attempt on Lalo's life, but after Gus falsely implicates him, Nacho sacrifices himself in exchange for his father's safety. Jimmy and Kim smear Howard's reputation, thereby forcing a settlement of the Sandpiper case. Howard confronts them, but is murdered by Lalo. After forcing Kim to act as a diversion, Lalo ambushes Gus to access the meth lab under construction. Gus kills Lalo with a hidden gun. Mike makes Howard's death appear as a suicide, and oversees the burial of Howard and Lalo beneath the lab. A traumatized Kim quits the law and divorces Jimmy. Several years later, Jimmy has fully transformed into Saul Goodman.</p><p>In 2010, Gene approaches Jeff and Buddy with an offer to rob a department store. After reaching out to Kim, who now lives in Florida, Gene devises a scheme to obtain financial identification of rich single men at bars he can sell for profit. When the scheme goes wrong, Buddy quits the operation, Jeff is arrested, and Gene is eventually caught. He is extradited to Albuquerque for the trial and feigns testimony implicating Kim so she can be summoned to court. He confesses to Kim and those at the trial about his crimes during the events of Breaking Bad and Better Call Saul, getting an 86-year sentence. Jimmy is recognized as Saul in prison and gains popularity with the inmates. Kim visits him and they share a cigarette before parting again.</p><br/><h3>Broadcast</h3><p>Better Call Saul would air on cable network AMC. The series premiere drew in 4.4 million and 4 million in the 18–49 and 25–54 demographics, respectively, and received an overall viewership of 6.9 million. This was the record for the highest-rated scripted series premiere in basic cable history, until it was surpassed later the same year by another AMC series, Fear the Walking Dead.</p><p>In December 2013, Netflix announced that the entire first season would be available for streaming in the U.S. after the airing of the first-season finale, and in Latin America and Europe each episode would be available a few days after the episode airs in the U.S. However, the first season was not released on Netflix in the U.S. until February 1, 2016. Internationally, episodes of the second season became available the day after they aired in the U.S.</p><p>Netflix would be the exclusive video-on-demand provider for the series and made the content available in all its territories, except for Australia and New Zealand. In Australia, Better Call Saul premiered on the streaming service Stan on February 9, 2015, acting as the service's flagship program. In New Zealand, the show was exclusive to the video-on-demand service Lightbox before moving to Neon in 2020 when both services were merged. The episodes were available for viewing within three days of broadcast in the U.S.</p><p>In the United Kingdom and Ireland, the series was acquired by Netflix on December 16, 2013, and the first episode premiered on February 9, 2015, with the second episode released the following day. Every subsequent episode was released each week thereafter. In Ireland, the series began airing on Irish TV network TG4 on October 18, 2022. In India, the series was broadcast on Colors Infinity within 24 hours of the U.S. broadcast.</p><p>During the final season's run in 2022, each episode would be available to stream the day they premiered on AMC+, AMC's streaming service which first launched in June 2020. The sixth season premiere resulted in the biggest day of new subscriber sign-ups for AMC+, and by the mid-season finale episodic viewership on the streaming service rose by 61%. Upon the release of the series finale, the app experienced an outage, causing many users to be logged out. AMC later reported that first-day viewing numbers for the finale on AMC+ was four times as big as the season premiere, and called the series' final season the highest acquisition driver in the history of the streaming service.</p><br/><h3>Reception</h3><h4>Critical response</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><span style=\"color:green\">Metacritic</span> and <span style=\"color:orange\">Rotten Tomatoes</span> scores per season</caption><tbody><tr><td><style data-mw-deduplicate=\"TemplateStyles:r1097763485\">.mw-parser-output .ambox{border:1px solid #a2a9b1;border-left:10px solid #36c;background-color:#fbfbfb;box-sizing:border-box}.mw-parser-output .ambox+link+.ambox,.mw-parser-output .ambox+link+style+.ambox,.mw-parser-output .ambox+link+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+style+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+link+.ambox{margin-top:-1px}html body.mediawiki .mw-parser-output .ambox.mbox-small-left{margin:4px 1em 4px 0;overflow:hidden;width:238px;border-collapse:collapse;font-size:88%;line-height:1.25em}.mw-parser-output .ambox-speedy{border-left:10px solid #b32424;background-color:#fee7e6}.mw-parser-output .ambox-delete{border-left:10px solid #b32424}.mw-parser-output .ambox-content{border-left:10px solid #f28500}.mw-parser-output .ambox-style{border-left:10px solid #fc3}.mw-parser-output .ambox-move{border-left:10px solid #9932cc}.mw-parser-output .ambox-protection{border-left:10px solid #a2a9b1}.mw-parser-output .ambox .mbox-text{border:none;padding:0.25em 0.5em;width:100%}.mw-parser-output .ambox .mbox-image{border:none;padding:2px 0 2px 0.5em;text-align:center}.mw-parser-output .ambox .mbox-imageright{border:none;padding:2px 0.5em 2px 0;text-align:center}.mw-parser-output .ambox .mbox-empty-cell{border:none;padding:0;width:1px}.mw-parser-output .ambox .mbox-image-div{width:52px}html.client-js body.skin-minerva .mw-parser-output .mbox-text-span{margin-left:23px!important}@media(min-width:720px){.mw-parser-output .ambox{margin:0 10%}}</style><table class=\"box-Notice plainlinks metadata ambox ambox-notice\" role=\"presentation\" style=\"width:100%;margin:0;\"><tbody><tr><td class=\"mbox-text\" style=\"text-align: left;\"><div class=\"mbox-text-span\">Graphs are temporarily unavailable due to technical issues.</div></td></tr></tbody></table></td></tr></tbody></table><p>Better Call Saul received critical acclaim and is considered to be an outstanding example of how to successfully produce a prequel and spinoff work that defies expectations. Many critics have called Better Call Saul a worthy successor to Breaking Bad and some have even deemed it superior to its predecessor. In September 2019, The Guardian ranked the show at No. 48 on its list of the 100 best TV shows of the 21st century, describing it as \"A supremely measured character piece that has steadily improved as its central tragedy has materialised.\" In 2021, Empire ranked Better Call Saul at No. 27 on their list of The 100 Greatest TV Shows of All Time. Also in 2021, it was voted the 23rd-best TV series of the 21st century by the BBC, as picked by 206 TV experts from around the world. In September 2022, Rolling Stone listed Better Call Saul as the 32nd greatest TV show of all time, in its updated list from 2016.</p><p>The first season has a 97% approval rating on the review aggregator website Rotten Tomatoes, with an average rating of 8.1/10 based on 291 reviews. The website's critical consensus reads, \"Better Call Saul is a quirky, dark character study that manages to stand on its own without being overshadowed by the series that spawned it.\" Metacritic, which uses a weighted average, assigned a \"generally favorable\" score of 78 based on 43 reviews.</p><p>The second season has a 97% approval rating on Rotten Tomatoes, with an average score of 8.7/10 based on 182 reviews. The website's critical consensus reads, \"Better Call Saul continues to tighten its hold on viewers with a batch of episodes that inject a surge of dramatic energy while showcasing the charms of its talented lead.\" On Metacritic, it has a score of 85 out of 100, based on 18 critics, indicating \"universal acclaim\".</p><p>The third season has a 98% approval rating on Rotten Tomatoes, with an average score of 8.75/10 based on 175 reviews. The website's critical consensus is, \"Better Call Saul shows no signs of slipping in season 3, as the introduction of more familiar faces causes the inevitable transformation of its lead to pick up exciting speed.\" On Metacritic, it has a score of 87 out of 100, based on 18 critics, indicating \"universal acclaim\".</p><p>The fourth season has a 99% approval rating on Rotten Tomatoes, with an average score of 8.9/10 based on 185 reviews. The website's critical consensus states, \"Well-crafted and compelling as ever, Better Call Saul deftly balances the show it was and the one it will inevitably become.\" On Metacritic, it has a score of 87 out of 100, based on 16 reviews, indicating \"universal acclaim\".</p><p>The fifth season has a 99% approval rating on Rotten Tomatoes, with an average score of 8.9/10 based on 184 reviews. The website's critical consensus is, \"Grounded by Bob Odenkirk's endlessly nuanced, lived-in performance, Better Call Saul's fifth season is a darkly funny, vividly realized master class in tragedy.\" On Metacritic, it has a score of 92 out of 100 based on 16 critics, indicating \"universal acclaim\".</p><p>The sixth season has a 99% approval rating on Rotten Tomatoes, with an average score of 9.4/10 based on 174 reviews. The website's critical consensus is, \"Better Call Saul remains as masterfully in control as Jimmy McGill keeps insisting he is in this final season, where years of simmering storytelling come to a scintillating boil.\" On Metacritic, the season has a score of 94 out of 100 based on 20 critics for Part 1, and 95 out of 100 based on 8 critics for Part 2, indicating \"universal acclaim\".</p><p>After the airing of the series finale, Stuart Jeffries of The Guardian said that the series had surprisingly surpassed its predecessor in quality, saying: \"Over six series, Better Call Saul evolved into a more profound and beautiful drama about human corruption than its predecessor. It mutated into something visually more sumptuous than Breaking Bad, while never, for a moment, losing its verbal dexterity and moral compass\". Craig Elvy of Screen Rant also opined that the series was better than its predecessor, saying: \"Jimmy McGill's spinoff leaves a very familiar legacy - sustained and enthusiastic praise from audiences and critics, capped by an ending that satisfies across the board.\" He went on to say: \"When Better Call Saul began, many would've hoped the spinoff could either escape Breaking Bad's shadow, or somehow enhance Walt and Jesse's story with illuminating new details. Few dared dream Better Call Saul would achieve both, and the sheer ambition to create a spinoff that wholly embraces its predecessor whilst also existing in a totally different realm exemplifies why Better Call Saul has an ever-so-slight edge over Breaking Bad.\" Jeremy Urquhart of Collider made a comparison between the quality of both series’, saying: \"Breaking Bad succeeds as a crime-thriller tragedy with a fast-paced plot, and Better Call Saul works as a slower-paced, character-focused drama (with some dark comedy)\". He said the list \"doesn't aim to argue that one is better than the other. It's a matter of personal preference, but it's hard to deny that there are certain things Better Call Saul does better, but also some areas where it isn't quite as great as its parent show.\"</p><h4>Ratings</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per season of <i>Better Call Saul</i></span></caption><tbody><tr><th scope=\"col\" rowspan=\"2\">Season</th><th scope=\"col\" rowspan=\"2\">Timeslot (<span>ET</span>)</th><th scope=\"col\" rowspan=\"2\">Episodes</th><th scope=\"col\" colspan=\"2\">First aired</th><th scope=\"col\" colspan=\"2\">Last aired</th><th scope=\"col\" rowspan=\"2\"><abbr title=\"Average\">Avg.</abbr> viewers<br>(millions)</th></tr><tr><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(millions)</th><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>1</span></th><td rowspan=\"1\">Sunday 10:00 pm <span style=\"font-size:85%;\">(premiere)</span><br>Monday 10:00 pm</td><td>10</td><td>February 8, 2015</td><td>6.88</td><td>April 6, 2015</td><td>2.53</td><td rowspan=\"1\">3.21</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>2</span></th><td rowspan=\"2\">Monday 10:00 pm</td><td>10</td><td>February 15, 2016</td><td>2.57</td><td>April 18, 2016</td><td>2.26</td><td rowspan=\"1\">2.16</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>3</span></th><td>10</td><td>April 10, 2017</td><td>1.81</td><td>June 19, 2017</td><td>1.85</td><td rowspan=\"1\">1.64</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>4</span></th><td rowspan=\"1\">Monday 9:00 pm</td><td>10</td><td>August 6, 2018</td><td>1.77</td><td>October 8, 2018</td><td>1.53</td><td rowspan=\"1\">1.49</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>5</span></th><td rowspan=\"1\">Sunday 10:00 pm <span style=\"font-size:85%;\">(premiere)</span><br>Monday 9:00 pm</td><td>10</td><td>February 23, 2020</td><td>1.60</td><td>April 20, 2020</td><td>1.59</td><td rowspan=\"1\">1.37</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>6A</span></th><td rowspan=\"2\">Monday 9:00 pm</td><td>7</td><td>April 18, 2022</td><td>1.42</td><td>May 23, 2022</td><td>1.19</td><td rowspan=\"2\">1.27</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>6B</span></th><td>6</td><td>July 11, 2022</td><td>1.16</td><td>August 15, 2022</td><td>1.80</td></tr></tbody></table><h4>Accolades</h4><p>Better Call Saul has received 46 Emmy Award nominations. It has received six nominations for Outstanding Drama Series. Bob Odenkirk has received five nominations for Outstanding Lead Actor in a Drama Series. Jonathan Banks and Giancarlo Esposito have each been nominated for Outstanding Supporting Actor in a Drama Series; four times for Banks and twice for Esposito. Rhea Seehorn has received a nomination for Outstanding Supporting Actress in a Drama Series. The series has also received six nominations for Outstanding Writing for a Drama Series and one nomination for Outstanding Directing for a Drama Series.</p><br/><h3>Franchise</h3><p>Better Call Saul has its own set of official multimedia spin-offs and related media within the Breaking Bad franchise. This includes a talk show, several web series and digital shorts, comic books, and an insider podcast.</p><br/>"
  },
  "errorMessage": ""
}