{
  "imDbId": "tt2802850",
  "title": "Fargo",
  "fullTitle": "Fargo (TV Series 2014–2023)",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw4807732",
      "warningSpoilers": false,
      "date": "27 April 2019",
      "rate": "8",
      "helpful": "81 out of 87 found this helpful.",
      "title": "Mind-blowingly brilliant...for two seasons",
      "content": "(Rating and review updated after Season 4).Stories generally set in Minnesota, often involving a minor incident that leads to something huge, and multiple-homicidal. In Season 1 an insurance salesman accidentally hires a hitman to kill the man who has been bullying him all his life. In Season 2 a covered-up hit-and-run has major repercussions. In Season 3 a family feud over a stamp leads to a case of mistaken identity and several murders. In Season 4 two crime gangs feud over territory.Brilliant...for the first two seasons. I was initially sceptical of this series, thinking it was just a serialised version of the Coen Brothers' superb film of the same name. Turns out it's not, but it does have a lot in common with the movie, and this is a good thing.Creator Noah Hawley manages to capture the atmosphere and central concept of the movie without copying the movie. The plots are different to the movie but have the same pattern: a minor incident/decision that, through misunderstanding and bad luck, escalates into something massive, involving multiple murders. There's the white, cold visual aspect to the movie (being set in Minnesota in winter) which leads to a brooding, desolate feel to the series. Plus, there's the dark Coenesque humour. All this, without the Coens having any creative input into the series: they're executive producers, and nothing more.This was especially true in Season 1. The season was so true to the feel of the movie I was sure the Coen brothers had a major hand in it (they didn't). Add in a superb performance by Billy Bob Thornton as the psychopathic Lorne Malvo and Season 1 was off-the-charts brilliant.Season 2 was less intriguing than Season 1 and had a less-tight plot, but had more action. It builds up to this action though and the pacing is superb, building like an avalanche. The last few episodes are absolutely frenetic and riveting. While largely an independent season, the links to characters in Season 1 make this even more interesting. Only downside: the UFOs. They seemed rather gimmicky, added nothing to the story and didn't help the tightness of the plot.Season 3 marked the down-turn of the series. It has some good passages of play, some interesting characters and a wonderful tie-in with Season 1 but is definitely not in the same league as the first two seasons. The plot is far-fetched, truly testing the series' \"This is a true story\" line. Quite clumsy and disjointed at times, with sub-plots that add nothing except to take up time, a cartoonish villain (and one of the most dentally-unhygienic characters of all time) and plot developments that don't always make sense.It also feels a bit unoriginal: the \"police officer who sees the full picture but is hindered by the incompetence of their boss\" angle was covered in Season 1.Throw in some David Lynch-like sequences (often involving Ray Wise, who starred in Twin Peaks) and the season has a style-over-substance feel to it.Overall, Season 3 is watchable but is a major disappointment after Seasons 1 and 2.Season 4 is even worse. It started well enough, with an interesting and intriguing setup, but the writers clearly didn't know where to take everything. There's far too many characters and sub-plots and the pace is pedestrian, resulting in an unfocused, meandering, seemingly interminable season.The writers' keenness to draw things out and lack of ideas is no more demonstrated in Episode 9, an episode that closes off one sub-plot but takes an entire episode to do it when the actual substance of the episode would have taken at most 10 minutes. Plus they throw in heaps of Coenisms to appear reverential and arty and appeal to fans of the original Fargo when all they are doing is padding out the episode. It's also quite ironic, as Season 4 feels nothing like the original film, the remainder of the series or a Coen Brothers production. It's not even set in Minnesota!Season 4 is also not helped by Chris Rock being cast in the lead role. He's a decent comedic actor but here lacked the gravitas for the role.Season ratings: Season 1 10/10 (can I go full Spinal Tap and give this an 11/10? It deserves such a score), Season 2 10/10, Season 3 7/10, Season 4 5/10."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8574732",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "9",
      "helpful": "38 out of 39 found this helpful.",
      "title": "Outstanding!",
      "content": "What can I say about Fargo that hasn't already been said? It's just an incredible series! Everyone has their own favorite season for some reason because they're all amazing. The weak link is easily season four but even that one is still pretty good, as long as you don't compare it to the first three seasons. This is an anthology series that was inspired by the 1996 film where each season follows a new murder story in some Midwest town with a different cast every season. It has the same feel, style, dark humor, unpredictability, etc as the film did. It has the feel of the Coen brothers but creator Noah Hawley definitely puts his own stamp on it. They're making Season 5 now so I'm definitely looking forward to watching that one too."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3009470",
      "warningSpoilers": false,
      "date": "4 May 2014",
      "rate": "9",
      "helpful": "275 out of 325 found this helpful.",
      "title": "Pitch black comedy with great characters and a decent amount of blood",
      "content": "You don't have to have seen the original Coen film to enjoy this series, nor does it spoil anything for you if you have seen it: the new TV-show 'Fargo' is entirely its own beast. So far, the only thing the series and the film do have in common is the title and the (fake) premise that both are - allegedly - based on true events that happened somewhere in Minnesota.The writers (and the actors!) do a great job in creating new characters that are as strange and somewhat over the top as most of the iconic Coen creations we've come to love over the years - and Billy Bob Thornton's 'Lorne Malvo' (from season 01) has the potential to reach cult status. Watching bad situations get worse as bad decisions lead to even worse ones and the lives of ordinary people spiral violently out of control is - I shamefully admit - a lot of fun to watch, and it's told here with such a wicked sense of humor that I've so far enjoyed every minute of it. The cast so far has been outstanding (this is an anthology series, so each new season will have its own cast and a new storyline) and the production values - especially the cinematography - are fantastic. Now whether 'Fargo' will appeal to a larger audience despite its quirky characters and non-mainstream look the way a show like 'Breaking Bad' did remains to be seen, but I would strongly recommend this to anyone who enjoys black comedies in general as well as pretty much anything the Coens ever did. Great, pitch black entertainment - 9 out of 10 from me.Favorite Films: http://www.imdb.com/list/ls054200841/Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw6272916",
      "warningSpoilers": false,
      "date": "15 November 2020",
      "rate": "9",
      "helpful": "91 out of 110 found this helpful.",
      "title": "Great!",
      "content": "Fargo is one of the top rated series on just about every website & magazine there is (including this one, Rotten Tomatoes, Metacritic, etc.) for a reason and that's because this show is amazing. At least the first 3 seasons were. While I don't hate Season 4 and think it's worth watching, it's just not as good as the other seasons which is too bad bro was really looking forward to this season."
    },
    {
      "username": "Mcduff3601",
      "userUrl": "https://www.imdb.com/user/ur64018658",
      "reviewLink": "https://www.imdb.com/review/rw4438916",
      "warningSpoilers": false,
      "date": "5 November 2018",
      "rate": "9",
      "helpful": "85 out of 105 found this helpful.",
      "title": "Season 3 review",
      "content": "Wow, I remember when this show first came out I was very skeptical they could make an interesting show many seasons long based on the movie. It has the same vibe as the movie, takes place in or around Minnesota has similar characters but is it's own thing apart from the movie.I just finished watching Season 3 and wow it was a doozy. I love this show, it is rare for me to get into a show where I don't notice the episodes flying by. There is some really strong writing with this show. I won't get into the details but will say you end up really caring about the characters, good or bad you want to see what happens to them. In some cases you are rooting for them to win and in others you are rooting for their demise. A lot of times neither plays out.I don't normally go for religious undertones in shows/movies mostly because it is kind of cliche the ol good vs evil thing. This season does it a bit but does it well. I really enjoy this show and can't recommend it enough!"
    },
    {
      "username": "0w0",
      "userUrl": "https://www.imdb.com/user/ur54176053",
      "reviewLink": "https://www.imdb.com/review/rw6263222",
      "warningSpoilers": false,
      "date": "12 November 2020",
      "rate": "8",
      "helpful": "83 out of 106 found this helpful.",
      "title": "Great series, except for season 4 which sucks...",
      "content": "Season 1, 2 and 3 are all 8/10 seasons, but season for brings the whole series down and is only a 5/10 season at best... season 4 has multiple plot holes in multiple episodes and is honestly a disappointment. The only solice is that season 4 isn't connect to the other seasons at all in the story, and so you can just skip season 4 entirely and only watch the other seasons of the series and you'd be much better off that way."
    },
    {
      "username": "thejdrage",
      "userUrl": "https://www.imdb.com/user/ur131092653",
      "reviewLink": "https://www.imdb.com/review/rw8357029",
      "warningSpoilers": false,
      "date": "22 July 2022",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Fargo - FARGO!!",
      "content": "This is one of the few series that I wait for the next season like a kid waits for Christmas. I get giddy when a new one is about to drop.All the seasons own their own piece of the franchise and they are all totally different from one another, as well as incredibly unique.They are all off the wall a bit. Quite a bit. And that's why I like them. The only other series I can think that was like that is Penny Dreadful. Also a 10 in my book.If you're squeamish, it's worth it! That is the one very few silk threads that follow through each season."
    },
    {
      "username": "the_real_smile",
      "userUrl": "https://www.imdb.com/user/ur3845724",
      "reviewLink": "https://www.imdb.com/review/rw6293365",
      "warningSpoilers": false,
      "date": "21 November 2020",
      "rate": "10",
      "helpful": "50 out of 62 found this helpful.",
      "title": "Time of death: season 4",
      "content": "Fargo must be the most brilliant series ever made. The stories, the characters, all make it a special adventure to watch is. Season 4 is nog worth the media it's shot on, uninteresting story, luckily with a couple of good characters in it, that make it watchable. Oh boy, how could they drop in quality so bad."
    },
    {
      "username": "cjonesas",
      "userUrl": "https://www.imdb.com/user/ur79683341",
      "reviewLink": "https://www.imdb.com/review/rw6693956",
      "warningSpoilers": false,
      "date": "14 March 2021",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "[9.5] Fargo is Fargo. No comparison.",
      "content": "Fargo, a unique anthology Crime, Drama series about true events happened in harsh winters frozen towns, mostly in Minnesota, North Dakota and Missouri. The events are masterfully depicted with ghastly developed precision coupled with an ultra dark atmosphere to it. The misery and helplessness of main characters, disgusted with their own depressed and repetitive life are superbly shown and acted.IMO, The first 3 seasons of Fargo (rated 10) were compact, awesomely suspenseful (especially the tremendous season 1) with lots of black humor and fine channeled acting. The vibe was sulfurously dark, depressing and most importantly, the story and screenplay were so enthralling and engaging that they were impossible not to follow avidly.Season 4 (rated 9), unfortunately lost the compact and tight storyline so unique to the show and a trademark of Fargo. It was still full of quality in all its structure and acting, but it was too wide-set in terms of screenplay and story, depicting three clans in parallel and the interactions of mostly two with each other in a period of several months, with filler characters and events linking the whole, with a not so bright and satisfying ending. The too numerous characters, part of that true set of events, weakened a little the spirit and soul for which Fargo the series is renowned for; Compact events happening to a tight group of people.Nevertheless, Fargo is a tremendous anthology series for patient people, prepared to immerse themselves in its true story and not afraid to patiently wait for it to unfold and show its ugly face and shocking twists.Recommended to every lover of top-quality Crime Dramas. You will be rewarded with satisfaction and highly impressed after watching all its seasons.Awaiting with anticipation its possible season 5 in around 2-3 years, if it is green-lit."
    },
    {
      "username": "tackinu",
      "userUrl": "https://www.imdb.com/user/ur56703940",
      "reviewLink": "https://www.imdb.com/review/rw8412001",
      "warningSpoilers": false,
      "date": "7 August 2022",
      "rate": "10",
      "helpful": "18 out of 19 found this helpful.",
      "title": "Everything is beautiful",
      "content": "Sometimes the stories are serious, sometimes a tad silly, but they're always beautifully told. You never know what's going to happen because they don't rely on tropes. Everything is just.. so damn good.Imagine a series with interconnecting seasons where every episode has excellent acting, a unique story, and well written characters. I couldn't recommend this harder."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw6662369",
      "warningSpoilers": false,
      "date": "5 March 2021",
      "rate": "10",
      "helpful": "55 out of 74 found this helpful.",
      "title": "Amazing....but be forewarned",
      "content": "The \"Fargo\" television series is one of the best written and interesting shows I have ever seen. It's characters are very unusual as is the dialog. And, it's very, very intelligently made. But I have a caveat....it's one of the most violent shows ever made. The deaths, and there are MANY each season, are often very vivid and bloody and awful to watch. I mention this because when the show says it's 'TV-MA'...they REALLY mean it. Kids and sensitive folks definitely should not watch it and I'd be a bit apprehensive to even allow teens to watch the show...it's THAT bloody. So, while I love the show, it's clearly not for everyone due to the gore level...which is more extreme than even many Tarantino movies! You have been warned."
    },
    {
      "username": "fleck05IMDB",
      "userUrl": "https://www.imdb.com/user/ur36590018",
      "reviewLink": "https://www.imdb.com/review/rw6133009",
      "warningSpoilers": false,
      "date": "28 September 2020",
      "rate": "3",
      "helpful": "93 out of 128 found this helpful.",
      "title": "This Show Rides on the Reviews from the First Season",
      "content": "The first season with Billy Bob Thornton was amazing... the season with Jesse Plemons was great. Now we get \"actor\" Chris Rock? He is one of the best stand ups alive - but he is, and always has been, a terrible actor. He's stiff and doesn't react off other actors - he just says his lines. This series has had such great actors... Thornton, Plemons, Martin Freeman, Timothy Olyphant, Nick Offerman, etc... great actors have the ability to draw you into their character and make you care so you have to see what becomes of them. Chris Rock can get on stage and make me laugh - he cannot become a different character I subconsciously emotionally invest in and want to know more about. He's always Chris Rock saying lines somebody wrote for him to say. This isn't the movie Grown Ups, or Good Hair, this is a serious show with heavy drama, Midwest racial history and a delivered at slow pace - you need real actors to suck the audience in so we care so much about the characters we're anxious to see what happens to them next. I gave it two episodes, but near the end of the second episode I felt like I was enduring the show, not enjoying it. So I'm out - hopefully Season 5 gets back to using great character actors."
    },
    {
      "username": "dogonlion",
      "userUrl": "https://www.imdb.com/user/ur67314647",
      "reviewLink": "https://www.imdb.com/review/rw6152082",
      "warningSpoilers": false,
      "date": "6 October 2020",
      "rate": "4",
      "helpful": "85 out of 116 found this helpful.",
      "title": "Bad 4th season",
      "content": "Everything Fargo was great until the new 4th season. I gave it 4 stars for the excellent 3 previous seasons. You will not find many recent reviews that give the new season a good rating. They destroyed it finally. They tried to make the story way too complex and overthought the whole thing. Sometimes it's even stupid, thinking that making one of the characters fart and throw up is going to inject some humor. Is this humor written by a 5 year old? Even my son finds fart jokes ridiculous. The acting is bad. Chris Rock is like a zombie and the big Italian actor who plays Gaetano over acts every scene with his ridiculous eye rolls. It's impossible to connect to any of the characters, they're just too many of them and no time to do a character introduction and build up. I am 3 episodes into the 4th season and that's it for me. i have waited impatiently for years for the 4th season but I am so disappointed to see the end of a good show."
    },
    {
      "username": "Sudherson-V",
      "userUrl": "https://www.imdb.com/user/ur13396139",
      "reviewLink": "https://www.imdb.com/review/rw6311254",
      "warningSpoilers": false,
      "date": "26 November 2020",
      "rate": "9",
      "helpful": "127 out of 158 found this helpful.",
      "title": "Non stop entertainment baring 4th season",
      "content": "1st season - Good Fargo 2nd season - Best Fargo 3rd season - Good Fargo 4th season - Not Fargo, still watching, but waiting for it to end. Bad screenplay."
    },
    {
      "username": "quockquock",
      "userUrl": "https://www.imdb.com/user/ur66223803",
      "reviewLink": "https://www.imdb.com/review/rw6312995",
      "warningSpoilers": false,
      "date": "27 November 2020",
      "rate": "1",
      "helpful": "68 out of 93 found this helpful.",
      "title": "Okay, I'll play....",
      "content": "Loved seasons 1 through 3. Would and will watch them again. I'm not sure I'm going to bother even finishing season 4. It's absolutely horrible. Someone seems to be trying something cute, or artsy etc... but it didn't work with season 4. Seriously go and watch the first 3 seasons and then try to stomach a bit of season 4. It's total garbage. Very poorly written and directed!"
    },
    {
      "username": "troy-daniel-bush",
      "userUrl": "https://www.imdb.com/user/ur46292404",
      "reviewLink": "https://www.imdb.com/review/rw5281466",
      "warningSpoilers": false,
      "date": "26 November 2019",
      "rate": "9",
      "helpful": "21 out of 26 found this helpful.",
      "title": "You've done the film justice three times over!",
      "content": "1 Fargo is my fourth favorite movie of all time, so naturally my expectations were really high. I'm happy to say that the first season met them. 9/102 Since the first season was so good, the second season takes place in the seventies, the cast is unbelievable, the story revolves around two warring mafias, and some of the characters are younger versions of ones that appeared in the first season, my expectations were, again, really high. They were met and surpassed! I'd even say it's better than the film. The only problem I had was when Kirsten Dunst stabs Jeffrey Donovan in the foot, there's an obvious cut. It's nothing more than a nitpick. 10/103 High expectations again. They were met, but not surpassed. It was as good as the first season, but to be fair it's pretty hard to top the second season. And it's got Ewan McGregor playing two different characters, and he always does a good job! And in my opinion both Mary-Elizabeth Winstead and Carrie Coon give career-best performances in this! 9/10"
    },
    {
      "username": "MadamWarden",
      "userUrl": "https://www.imdb.com/user/ur34187486",
      "reviewLink": "https://www.imdb.com/review/rw6320257",
      "warningSpoilers": false,
      "date": "29 November 2020",
      "rate": "3",
      "helpful": "38 out of 52 found this helpful.",
      "title": "EASILY FARGOTTEN - TRY HARD - SERIES 4",
      "content": "The movie and the first 3 series are icons! Sadly, this series, whilst mildly entertaining, is really disappointing. So much time is spent in setting up each \"great\" character, that they forgot to develop a plot. There is no main protagonist. No character of interest. Except maybe the murderous nurse. She is great.Oh, and Chris Rock is completely miscast. 🙄"
    },
    {
      "username": "chrisdmeads",
      "userUrl": "https://www.imdb.com/user/ur29388934",
      "reviewLink": "https://www.imdb.com/review/rw5805566",
      "warningSpoilers": false,
      "date": "7 June 2020",
      "rate": "9",
      "helpful": "41 out of 47 found this helpful.",
      "title": "Amazing Anthology...",
      "content": "Season 1: 10/10 Season 2: 10/10 Season 3: 8/10 Season 4: 7/10 Overall: 9/10"
    },
    {
      "username": "knezmikula",
      "userUrl": "https://www.imdb.com/user/ur55148301",
      "reviewLink": "https://www.imdb.com/review/rw6333820",
      "warningSpoilers": false,
      "date": "3 December 2020",
      "rate": "10",
      "helpful": "39 out of 48 found this helpful.",
      "title": "I loved season 1 and 2. 3 was just okay. Season 4 sucks.",
      "content": "My title says it all. First 2 seasons I rate with a 10, the third with a 6.5, the last season I rate 5, and I'm being generous. Honestly I knew it's going to suck after 5 minutes of watching the first episode of season 4., but I thought \"it's Fargo bro, it must get better at some point... I managed to get to ep. 4 because I was bored. I'm leaving it there. Fargo is officially dead. R.I.P I will re-watch season 1 these days to wash away the sad."
    },
    {
      "username": "worksmart-58506",
      "userUrl": "https://www.imdb.com/user/ur65225680",
      "reviewLink": "https://www.imdb.com/review/rw8301417",
      "warningSpoilers": true,
      "date": "5 July 2022",
      "rate": "10",
      "helpful": "22 out of 27 found this helpful.",
      "title": "S4 review for regular people",
      "content": "If you're able to get over yourself and simply watch a program as it's meant to be presented, season 4 is definitely for you. Is S4 different than the other 3? Sure...i guess.However even deaths in this show are generally humorous and ironic in some fashion....even the heartwrenching way Rock's character dies. All the Coen bros humor is present...all the subtlety, irony, social commentary and masterful performances by talented actors are present. It's an entertaining and clever ride and oh yeah....it deals with racism and inequality...a lot. It's 1950 Kansas, USA. The usual racist trash will complain the show was too woke, or pushing some BS agenda to rally everyone against white people...and they'd be tragically wrong...as usual.Season 4 told a brillliant story. It was rife with fantastic acting and I couldn't wait to watch the next episode...binged watched over 2 days in fact. I enjoyed it for what it was. You can too."
    },
    {
      "username": "Slim4Shady2",
      "userUrl": "https://www.imdb.com/user/ur33407026",
      "reviewLink": "https://www.imdb.com/review/rw3372036",
      "warningSpoilers": false,
      "date": "15 December 2015",
      "rate": "8",
      "helpful": "128 out of 161 found this helpful.",
      "title": "Outstanding! Must watch. (Update: Not till the end)",
      "content": "Six months ago I finished watching Breaking Bad and I really think that's the best thing I've ever watched and I always felt it is nonpareil in terms of excitement. From then on I couldn't forget it, I missed it. I started watching several shows later, but nothing came close to BB. I went on a search for such exciting crime dramas and then I saw few people on reddit talk about Narcos and Fargo (most of them) to experience something similar. At first, I googled them and decided to watch Narcos as Google knowledge graph mentions Fargo as a comedy series. So, yeah Narcos was enthralling, but didn't really feel 10/10 especially with too much Spanish. Then I decided to give a try on Fargo and boy oh boy! It's simply sensational.Season 1: The first episode itself left me exuberant. This Martin Freeman guy, right from the day I saw him as Bilbao Baggins, everything he does impresses me and in Fargo there's nothing less. And the others were excellent too, especially Billy Bob Throtton, that man is really one hell of an actor. He is an assassin, every scene of him is jaw dropping with some chills. All in all, Season 1 of Fargo was really the one I was waiting for these whole 6 months and I didn't want to end this beautiful experience, so I immediately decided to watch Season 2.Season 2: Everyone who watched season 1 will have some idea about how season 2 will go on. It opened off very well and the first episode here too ends dramatically. The next 2 episodes were slow-paced and I thought this might turn out like True Detective Season 2 as it couldn't really recreate the magic of the first season (just my opinion). So, right when I thought it's sinking, it just gets better and better from episode 4. There won't be a moment you could take your eyes off till the last minute of the season finale. I'm glad they renewed it for the next season and I really can't wait for that.The music utilized over the two seasons is absolutely mind blowing, the way it relates to each and every scenario is just spectacular. Along with this awesome music, the outstanding piece of poetry depicts the ongoing lives of the people in Fargo. The direction part is really masterful and you can clearly see that in the second season\". It has few flaws but if you're just looking for some real piece of art then Fargo is a must watch.Update: Ok, it's sad to say that this amazing show went downhill later. Season 3 for me was 7/10 but at least very Fargoish but Season 4 is pathetic and should be ignored."
    },
    {
      "username": "dingodad",
      "userUrl": "https://www.imdb.com/user/ur56324994",
      "reviewLink": "https://www.imdb.com/review/rw6325651",
      "warningSpoilers": false,
      "date": "30 November 2020",
      "rate": "8",
      "helpful": "68 out of 86 found this helpful.",
      "title": "Excellent BUT...",
      "content": "You have to stop at season 3. Season 4 Fargone. Gone is the quirkiness. Gone is the storytelling. Gone is the dark humor. I'm going to rewatch the movie to cleanse my memory of this ordeal."
    },
    {
      "username": "davismfg-75480",
      "userUrl": "https://www.imdb.com/user/ur89337457",
      "reviewLink": "https://www.imdb.com/review/rw6336664",
      "warningSpoilers": false,
      "date": "4 December 2020",
      "rate": "7",
      "helpful": "87 out of 112 found this helpful.",
      "title": "Avoid Season 4. Yeah, I'm one of those guys",
      "content": "Like others here, I recommend you skip season 4.Season 1 was excellent.Season 2 was good.Season 3 was okay.Season 4 took a dump in its own bed and we had to watch it."
    },
    {
      "username": "chrissso",
      "userUrl": "https://www.imdb.com/user/ur50334912",
      "reviewLink": "https://www.imdb.com/review/rw6304079",
      "warningSpoilers": false,
      "date": "24 November 2020",
      "rate": "8",
      "helpful": "38 out of 52 found this helpful.",
      "title": "What where They Thinking???",
      "content": "There is no longer a need to discuss whether there will be a S5 ... as the miserable S4 has clearly sunk the franchise. I mean it's hard to even think of this series as Fargo when it takes place in Kansas City ... with Italian and African American mobsters. WTFIT???Such a shame ... S1 - S3 were 9.0's ... S4 is a 5.0. Somebody needs to get fired!!!"
    },
    {
      "username": "mysti007",
      "userUrl": "https://www.imdb.com/user/ur22270998",
      "reviewLink": "https://www.imdb.com/review/rw8396758",
      "warningSpoilers": false,
      "date": "3 August 2022",
      "rate": "9",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Love every season - even season 4 ;-)",
      "content": "Every seasons has its own ups and downs but still they are worth watching them all. The characters, the plot, camera, music are unique. I really love the second seasons and had problems at the beginning of season four. But after some episodes it really got me. Even season 4 is brilliant. You have everything what Fargo needs. Awaiting for a exciting fifth season."
    }
  ],
  "errorMessage": ""
}