{
  "imDbId": "tt2802850",
  "title": "Fargo",
  "fullTitle": "Fargo (TV Series 2014–2023)",
  "type": "TVSeries",
  "year": "2014",
  "language": "en",
  "titleInLanguage": "Fargo (TV series)",
  "url": "https://en.wikipedia.org/wiki/Fargo_(TV_series)",
  "plotShort": {
    "plainText": "Fargo is an American black comedy crime drama television series created and primarily written by Noah Hawley. The show is inspired by the 1996 film of the same name, which was written and directed by the Coen brothers, and takes place within the same fictional universe. The Coens were impressed by Hawley's script and agreed to be named as executive producers. The series premiered on April 15, 2014, on FX, and follows an anthology format, with each season set in a different era and location, with a different story and mostly new characters and cast, although there is minor overlap. Each season is heavily influenced by various Coen brothers films, with each containing numerous references to them.\r\nThe first season, set primarily in Minnesota and North Dakota from January 2006 to February 2007 and starring Billy Bob Thornton, Allison Tolman, Colin Hanks, and Martin Freeman, received wide acclaim from critics. It won the Primetime Emmy Awards for Outstanding Miniseries, Outstanding Directing, and Outstanding Casting, and received 15 additional nominations including Outstanding Writing, another Outstanding Directing nomination, and acting nominations for all four leads. It also won the Golden Globe Awards for Best Miniseries or Television Film and Best Actor – Miniseries or Television Film for Thornton.\r\nThe second season, set in Minnesota, North Dakota, and South Dakota in March 1979 and starring Kirsten Dunst, Patrick Wilson, Jesse Plemons, Jean Smart, and Ted Danson, received widespread critical acclaim. It received three Golden Globe nominations, along with several Emmy nominations including Outstanding Miniseries, and acting nominations for Dunst, Plemons, Smart, and Bokeem Woodbine.\r\nThe third season, set primarily in Minnesota from 2010 to 2011 and starring Ewan McGregor, Carrie Coon, Mary Elizabeth Winstead, Goran Bogdan, and David Thewlis, premiered on April 19, 2017. Like previous seasons, it was met with acclaim from critics, and received Emmy nominations including Outstanding Miniseries, and acting nominations for McGregor, Coon, and Thewlis. It received three Golden Globe nominations, for Outstanding Limited Series, and McGregor and Thewlis for acting, with McGregor winning in his category.\r\nThe fourth season, set primarily in Kansas City, Missouri from 1950 to 1951 and starring Chris Rock, Jessie Buckley, Jason Schwartzman, Ben Whishaw, and Jack Huston, premiered on September 27, 2020, and received generally positive reviews, though was not as highly acclaimed as previous seasons.\r\nIn February 2022, the series was renewed for a fifth season, which will be set in 2019, and will star Juno Temple, Jon Hamm, Jennifer Jason Leigh, Joe Keery, Lamorne Morris, Richa Moorjani, and Dave Foley. The season is set to premiere in 2023.",
    "html": "<p>Fargo is an American black comedy crime drama television series created and primarily written by Noah Hawley. The show is inspired by the 1996 film of the same name, which was written and directed by the Coen brothers, and takes place within the same fictional universe. The Coens were impressed by Hawley's script and agreed to be named as executive producers. The series premiered on April 15, 2014, on FX, and follows an anthology format, with each season set in a different era and location, with a different story and mostly new characters and cast, although there is minor overlap. Each season is heavily influenced by various Coen brothers films, with each containing numerous references to them.</p><p>The first season, set primarily in Minnesota and North Dakota from January 2006 to February 2007 and starring Billy Bob Thornton, Allison Tolman, Colin Hanks, and Martin Freeman, received wide acclaim from critics. It won the Primetime Emmy Awards for Outstanding Miniseries, Outstanding Directing, and Outstanding Casting, and received 15 additional nominations including Outstanding Writing, another Outstanding Directing nomination, and acting nominations for all four leads. It also won the Golden Globe Awards for Best Miniseries or Television Film and Best Actor – Miniseries or Television Film for Thornton.</p><p>The second season, set in Minnesota, North Dakota, and South Dakota in March 1979 and starring Kirsten Dunst, Patrick Wilson, Jesse Plemons, Jean Smart, and Ted Danson, received widespread critical acclaim. It received three Golden Globe nominations, along with several Emmy nominations including Outstanding Miniseries, and acting nominations for Dunst, Plemons, Smart, and Bokeem Woodbine.</p><p>The third season, set primarily in Minnesota from 2010 to 2011 and starring Ewan McGregor, Carrie Coon, Mary Elizabeth Winstead, Goran Bogdan, and David Thewlis, premiered on April 19, 2017. Like previous seasons, it was met with acclaim from critics, and received Emmy nominations including Outstanding Miniseries, and acting nominations for McGregor, Coon, and Thewlis. It received three Golden Globe nominations, for Outstanding Limited Series, and McGregor and Thewlis for acting, with McGregor winning in his category.</p><p>The fourth season, set primarily in Kansas City, Missouri from 1950 to 1951 and starring Chris Rock, Jessie Buckley, Jason Schwartzman, Ben Whishaw, and Jack Huston, premiered on September 27, 2020, and received generally positive reviews, though was not as highly acclaimed as previous seasons.</p><p>In February 2022, the series was renewed for a fifth season, which will be set in 2019, and will star Juno Temple, Jon Hamm, Jennifer Jason Leigh, Joe Keery, Lamorne Morris, Richa Moorjani, and Dave Foley. The season is set to premiere in 2023.</p>"
  },
  "plotFull": {
    "plainText": "Fargo is an American black comedy crime drama television series created and primarily written by Noah Hawley. The show is inspired by the 1996 film of the same name, which was written and directed by the Coen brothers, and takes place within the same fictional universe. The Coens were impressed by Hawley's script and agreed to be named as executive producers. The series premiered on April 15, 2014, on FX, and follows an anthology format, with each season set in a different era and location, with a different story and mostly new characters and cast, although there is minor overlap. Each season is heavily influenced by various Coen brothers films, with each containing numerous references to them.\r\nThe first season, set primarily in Minnesota and North Dakota from January 2006 to February 2007 and starring Billy Bob Thornton, Allison Tolman, Colin Hanks, and Martin Freeman, received wide acclaim from critics. It won the Primetime Emmy Awards for Outstanding Miniseries, Outstanding Directing, and Outstanding Casting, and received 15 additional nominations including Outstanding Writing, another Outstanding Directing nomination, and acting nominations for all four leads. It also won the Golden Globe Awards for Best Miniseries or Television Film and Best Actor – Miniseries or Television Film for Thornton.\r\nThe second season, set in Minnesota, North Dakota, and South Dakota in March 1979 and starring Kirsten Dunst, Patrick Wilson, Jesse Plemons, Jean Smart, and Ted Danson, received widespread critical acclaim. It received three Golden Globe nominations, along with several Emmy nominations including Outstanding Miniseries, and acting nominations for Dunst, Plemons, Smart, and Bokeem Woodbine.\r\nThe third season, set primarily in Minnesota from 2010 to 2011 and starring Ewan McGregor, Carrie Coon, Mary Elizabeth Winstead, Goran Bogdan, and David Thewlis, premiered on April 19, 2017. Like previous seasons, it was met with acclaim from critics, and received Emmy nominations including Outstanding Miniseries, and acting nominations for McGregor, Coon, and Thewlis. It received three Golden Globe nominations, for Outstanding Limited Series, and McGregor and Thewlis for acting, with McGregor winning in his category.\r\nThe fourth season, set primarily in Kansas City, Missouri from 1950 to 1951 and starring Chris Rock, Jessie Buckley, Jason Schwartzman, Ben Whishaw, and Jack Huston, premiered on September 27, 2020, and received generally positive reviews, though was not as highly acclaimed as previous seasons.\r\nIn February 2022, the series was renewed for a fifth season, which will be set in 2019, and will star Juno Temple, Jon Hamm, Jennifer Jason Leigh, Joe Keery, Lamorne Morris, Richa Moorjani, and Dave Foley. The season is set to premiere in 2023.\r\nSeries overview\r\nSeason 1 (2014)\r\nIn 2006, Lorne Malvo (Billy Bob Thornton) passes through Bemidji, Minnesota, and influences the community – including put-upon insurance salesman Lester Nygaard (Martin Freeman) – with his malice, violence, and deception. Meanwhile, Deputy Molly Solverson (Allison Tolman) and Duluth police officer Gus Grimly (Colin Hanks) team up to solve a series of murders they believe may be linked to Malvo and Nygaard.\r\nSeason 2 (2015)\r\nIn 1979, beautician Peggy Blumquist (Kirsten Dunst) and her husband, butcher Ed Blumquist (Jesse Plemons) of Luverne, Minnesota, cover up her hit-and-run and vehicular homicide of Rye Gerhardt (Kieran Culkin), son of Floyd Gerhardt (Jean Smart), matriarch of the Gerhardt crime family in Fargo, North Dakota. Meanwhile, State Trooper Lou Solverson (Patrick Wilson) and his father-in-law, Sheriff Hank Larsson (Ted Danson), investigate a triple homicide at a local diner connected to Rye.\r\nSeason 3 (2017)\r\nIn 2010, St. Cloud probation officer Ray Stussy (Ewan McGregor) and his parolee girlfriend Nikki Swango (Mary Elizabeth Winstead) dream of a better, wealthier life. To achieve this, they attempt to steal a valuable vintage stamp from Ray's more successful older brother, Emmit (also played by McGregor), the self-proclaimed \"Parking Lot King of Minnesota\". However, their plans backfire, and the couple soon have to hide their involvement in two deaths, including the stepfather of former Eden Valley police chief Gloria Burgle (Carrie Coon). Meanwhile, Emmit wishes to pay back a shady organization he borrowed money from two years ago, but the company Narwhal and its employees, led by V. M. Varga (David Thewlis), have other plans.\r\nSeason 4 (2020)\r\nIn 1950, the Cannon Limited, led by Loy Cannon (Chris Rock), threaten to usurp the Fadda Family, led by Josto Fadda (Jason Schwartzman), as the ruling crime organization in Kansas City, Missouri. In an effort to maintain peace, the groups agree to honor a tradition of trading the youngest sons between the two households. However, the alliance is jeopardized by the arrival of Josto's brash brother Gaetano (Salvatore Esposito), as well as the unorthodox actions taken by a nurse named Oraetta Mayflower (Jessie Buckley). Meanwhile, Oraetta's teenaged neighbor Ethelrida Pearl Smutny (E'myri Crutchfield) discovers her parents are in debt to the Cannon Limited, which gets her entangled in the criminal activities of Kansas City.\r\nSeason 5\r\nSet in the upper Midwest in 2019, the plot of the show's fifth season has been teased with the following questions: \"When is a kidnapping not a kidnapping, and what if your wife isn't yours?\" Jon Hamm, Juno Temple, and Jennifer Jason Leigh have been cast as lead characters Roy Tillman, Dorothy \"Dot\" Lyon, and Lorraine Lyon, respectively. Additional cast members include Joe Keery as Gator Tillman, Lamorne Morris as Witt Farr, Richa Moorjani as Indira Olmstead, and Dave Foley as Danish Graves.\r\nCast and characters\r\nOverview\r\nSeason 1 cast\r\nBilly Bob Thornton as Lorne Malvo\r\nAllison Tolman as Deputy Molly Solverson\r\nColin Hanks as Officer Gus Grimly\r\nMartin Freeman as Lester Nygaard\r\nSeason 2 cast\r\nKirsten Dunst as Peggy Blumquist\r\nPatrick Wilson as State Trooper Lou Solverson\r\nJesse Plemons as Ed Blumquist\r\nJean Smart as Floyd Gerhardt\r\nTed Danson as Sheriff Hank Larsson\r\nSeason 3 cast\r\nEwan McGregor as Emmit and Ray Stussy\r\nCarrie Coon as Gloria Burgle\r\nMary Elizabeth Winstead as Nikki Swango\r\nGoran Bogdan as Yuri Gurka\r\nDavid Thewlis as V. M. Varga\r\nSeason 4 cast\r\nChris Rock as Loy Cannon\r\nJessie Buckley as Oraetta Mayflower\r\nJason Schwartzman as Josto Fadda\r\nBen Whishaw as Rabbi Milligan\r\nJack Huston as Odis Weff\r\nSalvatore Esposito as Gaetano Fadda\r\nE'myri Crutchfield as Ethelrida Pearl Smutny\r\nAndrew Bird as Thurman Smutny\r\nAnji White as Dibrell Smutny\r\nJeremie Harris as Leon Bittle\r\nMatthew Elam as Lemuel Cannon\r\nCorey Hendrix as Omie Sparkman\r\nJames Vincent Meredith as Opal Rackley\r\nFrancesco Acquaroli as Ebal Violante\r\nGaetano Bruno as Constant Calamita\r\nStephen Spencer as Dr. David Harvard\r\nKaren Aldridge as Zelmare Roulette\r\nSeason 5 cast\r\nJuno Temple as Dorothy \"Dot\" Lyon\r\nJon Hamm as Sheriff Roy Tillman\r\nJennifer Jason Leigh as Lorraine Lyon\r\nJoe Keery as Gator Tillman\r\nLamorne Morris as Witt Farr\r\nRicha Moorjani as Indira Olmstead\r\nDave Foley as Danish Graves\r\nLukas Gage as Lars Olmstead\r\nProduction\r\nIn 1997, a pilot was filmed for an intended television series based on the film. Set in Brainerd shortly after the events of the film, it starred Edie Falco as Marge Gunderson and Bruce Bohne reprising his role as Officer Lou. It was directed by Kathy Bates and featured no involvement from the Coen brothers. The episode aired in 2003, during Trio's Brilliant But Cancelled series of failed TV shows.\r\nIn 2012, it was announced that FX, with the Coen brothers as executive producers, was developing a new television series based on the film. It was later announced that adaptation would be a ten-episode limited series. On August 2, 2013, it was announced that Billy Bob Thornton had signed on to star in the series. On September 27, 2013, Martin Freeman also signed on to star. On October 3, 2013, it was announced that Colin Hanks was cast in the role of Duluth police officer Gus Grimly. Production began in late 2013, with filming taking place in and around Calgary, Alberta.\r\nThe series is set in the same fictional universe as the film, in which events took place in 1987 between Minneapolis and Brainerd, Minnesota. The first season features the buried ransom money from the film in a minor subplot. Additionally, a number of references are made connecting the series to the film.\r\nFollowing the series renewal in July 2014, creator Noah Hawley revealed that the second season would take place in 1979 and focus on Sioux Falls, South Dakota, as referred to by Lou Solverson and others in the first season. The ten episodes are set in Luverne, Minnesota; Fargo, North Dakota; and Sioux Falls. Hawley agreed that this takes place before the events of the film, but he believes all the stories connect: \"I like the idea that somewhere out there is a big, leather-bound book that's the history of true crime in the Midwest, and the movie was Chapter 4; Season 1 was Chapter 9; and is Chapter 2,\" he said. \"You can turn the pages of this book, and you just find this collection of stories. ... But I like the idea that these things are connected somehow, whether it's linearly or literally or thematically. That's what we play around with.\" This book was realized in season 2, episode 9, \"The Castle\". Production on the second season began in Calgary on January 19, 2015, and completed on May 20, 2015.\r\nProduction on the third season began in January 2017 in Calgary, Alberta. Production on the fourth season was shut down in March 2020 due to the COVID-19 pandemic. The season was originally scheduled to premiere on April 19, 2020, before the shutdown. Filming resumed on the fourth season in late August 2020.\r\nIn February 2022, FX renewed the series for a fifth season. Production for the fifth season began as early as October 2022 in Calgary, Alberta. Filming was reported in High River in December 2022, January 2023, and February 2023. Filming reportedly took place at a Didsbury hospital in February, and filming moved to Beiseker on February 27.\r\n\"This is a true story\"\r\nAs with the original film, each episode begins with the superimposed text:\r\nThis is a true story. The events depicted took place in in. At the request of the survivors, the names have been changed. Out of respect for the dead, the rest has been told exactly as it occurred.\r\nAs with the film, this claim is untrue. Showrunner Noah Hawley continued to use the Coens' device, saying it allowed him to \"tell a story in a new way\". Hawley has played with the realism of the story further; responding to queries about Charlie Gerhardt, a character from season 2, he stated \"If he’s out there, I’d like to get a letter from him someday, telling me how he turned out.\"\r\nAt the 2017 ATX Television Festival in Austin, Texas, Hawley further discussed the \"true story\" series tag: \"So what does that even mean—the words 'true story'?\" he said. \"I really wanted to deconstruct that this year.\" He recalled one of the lines spoken by Sy Feltz, Michael Stuhlbarg's character: \"'The world is wrong—it looks like my world but everything is different.' That's what we're exploring this year.\"\r\nRelease\r\nOn April 15, 2014, the series made its debut on FX and FXX in Canada; the remaining episodes were shown on FXX. The next day, it premiered in the UK on Channel 4. On May 1, 2014, it premiered on SBS One in Australia, and on SoHo in New Zealand.\r\nNetflix streamed seasons 1–3 in 20 regions between 2015 and 2022.\r\nReception\r\nCritical response\r\nCritical response to season 1\r\nThe first season was critically acclaimed; it received a Metacritic score of 85 out of 100 based on 40 reviews, signifying \"universal acclaim\". The review aggregation website Rotten Tomatoes reported that 97% of 140 critics gave the season a positive review, with an average rating of 8.45/10. The website consensus reads: \"Based on the film of the same name in atmosphere, style, and location only, Fargo presents more quirky characters and a new storyline that is expertly executed with dark humor and odd twists.\" IGN reviewer Roth Cornet gave the first season a 9.7 out of 10 score, praising the casting, its thematic ties to the movie, and the writing. The A.V. Club named it the sixth best TV series of 2014.\r\nCritical response to season 2\r\nThe second season was also met with critical acclaim. It received a Metacritic score of 96 based on 33 reviews, which indicates \"universal acclaim\". 100% of 233 reviews are positive on Rotten Tomatoes, with an average rating of 9.1/10. The site's consensus states: \"Season two of Fargo retains all the elements that made the series an award-winning hit, successfully delivering another stellar saga powered by fascinating characters, cheeky cynicism, and just a touch of the absurd.\"\r\nCritical response to season 3\r\nThe third season received acclaim similar to the first two seasons. Metacritic assigned it a score of 89 out of 100 based on 32 reviews, indicating \"universal acclaim\". On Rotten Tomatoes, it has a 93% rating with an average score of 8.5/10 based on 224 reviews. The site's critical consensus is: \"Thanks in part to a memorable dual performance from Ewan McGregor, Fargo mostly maintains the sly wit and off-kilter sensibility it displayed in its first two seasons.\"\r\nCritical response to season 4\r\nThe fourth season received generally positive reviews from critics, though less acclaimed than its previous seasons. Rotten Tomatoes collected 57 reviews and identified 84% of them as positive, with an average rating of 7.3/10. The critics consensus for the season is, \"Though Fargo's ambitious fourth season struggles to maintain momentum, fine performances and a change of scenery make for an engaging—if uneven—departure from the series' norm.\" At Metacritic, the season got a score of 68/100, based on reviews from 37 critics, indicating \"generally favorable reviews.\"\r\nAccolades\r\nFargo has won 51 of its 226 award nominations. The first season garnered 8 Primetime Emmy Award nominations, with the show itself winning the Outstanding Miniseries and director Colin Bucksey winning the Outstanding Directing for a Miniseries, Movie or a Dramatic Special. It received an additional 10 Creative Arts Emmy Award nominations, winning for Outstanding Casting for a Miniseries, Movie, or Special. It has received eight Golden Globe Award nominations, with the show winning for Best Miniseries or Television Film, and Billy Bob Thornton winning for Best Actor in a Miniseries or Television Film. The series has also received one Screen Actors Guild Award nomination to Billy Bob Thornton for Outstanding Performance by a Male Actor in a Miniseries or Television Movie.\r\nAdditional accolades include: the American Film Institute Award for Top Ten Television Program in 2014 and 2015, the Artios Award for Excellence in Casting, a Peabody Award, seven Critics' Choice Television Awards in which the show won twice for Best Miniseries and five times in acting for Billy Bob Thornton, Allison Tolman, Kirsten Dunst, Jesse Plemons and Jean Smart, the Dorian Awards for TV Drama of the Year, the Golden Reel Award for Best Music Score, two Producers Guild of America Award for Outstanding Producer of Long-Form Television and a Writers Guild of America Awards for Long Form – Adapted.",
    "html": "<p>Fargo is an American black comedy crime drama television series created and primarily written by Noah Hawley. The show is inspired by the 1996 film of the same name, which was written and directed by the Coen brothers, and takes place within the same fictional universe. The Coens were impressed by Hawley's script and agreed to be named as executive producers. The series premiered on April 15, 2014, on FX, and follows an anthology format, with each season set in a different era and location, with a different story and mostly new characters and cast, although there is minor overlap. Each season is heavily influenced by various Coen brothers films, with each containing numerous references to them.</p><p>The first season, set primarily in Minnesota and North Dakota from January 2006 to February 2007 and starring Billy Bob Thornton, Allison Tolman, Colin Hanks, and Martin Freeman, received wide acclaim from critics. It won the Primetime Emmy Awards for Outstanding Miniseries, Outstanding Directing, and Outstanding Casting, and received 15 additional nominations including Outstanding Writing, another Outstanding Directing nomination, and acting nominations for all four leads. It also won the Golden Globe Awards for Best Miniseries or Television Film and Best Actor – Miniseries or Television Film for Thornton.</p><p>The second season, set in Minnesota, North Dakota, and South Dakota in March 1979 and starring Kirsten Dunst, Patrick Wilson, Jesse Plemons, Jean Smart, and Ted Danson, received widespread critical acclaim. It received three Golden Globe nominations, along with several Emmy nominations including Outstanding Miniseries, and acting nominations for Dunst, Plemons, Smart, and Bokeem Woodbine.</p><p>The third season, set primarily in Minnesota from 2010 to 2011 and starring Ewan McGregor, Carrie Coon, Mary Elizabeth Winstead, Goran Bogdan, and David Thewlis, premiered on April 19, 2017. Like previous seasons, it was met with acclaim from critics, and received Emmy nominations including Outstanding Miniseries, and acting nominations for McGregor, Coon, and Thewlis. It received three Golden Globe nominations, for Outstanding Limited Series, and McGregor and Thewlis for acting, with McGregor winning in his category.</p><p>The fourth season, set primarily in Kansas City, Missouri from 1950 to 1951 and starring Chris Rock, Jessie Buckley, Jason Schwartzman, Ben Whishaw, and Jack Huston, premiered on September 27, 2020, and received generally positive reviews, though was not as highly acclaimed as previous seasons.</p><p>In February 2022, the series was renewed for a fifth season, which will be set in 2019, and will star Juno Temple, Jon Hamm, Jennifer Jason Leigh, Joe Keery, Lamorne Morris, Richa Moorjani, and Dave Foley. The season is set to premiere in 2023.</p><br/><h3>Series overview</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 15, 2014</td><td style=\"padding:0 8px\">June 17, 2014</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 12, 2015</td><td style=\"padding:0 8px\">December 14, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 19, 2017</td><td style=\"padding:0 8px\">June 21, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">11</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 27, 2020</td><td style=\"padding:0 8px\">November 29, 2020</td></tr></tbody></table><h4>Season 1 (2014)</h4><p>In 2006, Lorne Malvo (Billy Bob Thornton) passes through Bemidji, Minnesota, and influences the community – including put-upon insurance salesman Lester Nygaard (Martin Freeman) – with his malice, violence, and deception. Meanwhile, Deputy Molly Solverson (Allison Tolman) and Duluth police officer Gus Grimly (Colin Hanks) team up to solve a series of murders they believe may be linked to Malvo and Nygaard.</p><h4>Season 2 (2015)</h4><p>In 1979, beautician Peggy Blumquist (Kirsten Dunst) and her husband, butcher Ed Blumquist (Jesse Plemons) of Luverne, Minnesota, cover up her hit-and-run and vehicular homicide of Rye Gerhardt (Kieran Culkin), son of Floyd Gerhardt (Jean Smart), matriarch of the Gerhardt crime family in Fargo, North Dakota. Meanwhile, State Trooper Lou Solverson (Patrick Wilson) and his father-in-law, Sheriff Hank Larsson (Ted Danson), investigate a triple homicide at a local diner connected to Rye.</p><h4>Season 3 (2017)</h4><p>In 2010, St. Cloud probation officer Ray Stussy (Ewan McGregor) and his parolee girlfriend Nikki Swango (Mary Elizabeth Winstead) dream of a better, wealthier life. To achieve this, they attempt to steal a valuable vintage stamp from Ray's more successful older brother, Emmit (also played by McGregor), the self-proclaimed \"Parking Lot King of Minnesota\". However, their plans backfire, and the couple soon have to hide their involvement in two deaths, including the stepfather of former Eden Valley police chief Gloria Burgle (Carrie Coon). Meanwhile, Emmit wishes to pay back a shady organization he borrowed money from two years ago, but the company Narwhal and its employees, led by V. M. Varga (David Thewlis), have other plans.</p><h4>Season 4 (2020)</h4><p>In 1950, the Cannon Limited, led by Loy Cannon (Chris Rock), threaten to usurp the Fadda Family, led by Josto Fadda (Jason Schwartzman), as the ruling crime organization in Kansas City, Missouri. In an effort to maintain peace, the groups agree to honor a tradition of trading the youngest sons between the two households. However, the alliance is jeopardized by the arrival of Josto's brash brother Gaetano (Salvatore Esposito), as well as the unorthodox actions taken by a nurse named Oraetta Mayflower (Jessie Buckley). Meanwhile, Oraetta's teenaged neighbor Ethelrida Pearl Smutny (E'myri Crutchfield) discovers her parents are in debt to the Cannon Limited, which gets her entangled in the criminal activities of Kansas City.</p><h4>Season 5</h4><p>Set in the upper Midwest in 2019, the plot of the show's fifth season has been teased with the following questions: \"When is a kidnapping not a kidnapping, and what if your wife isn't yours?\" Jon Hamm, Juno Temple, and Jennifer Jason Leigh have been cast as lead characters Roy Tillman, Dorothy \"Dot\" Lyon, and Lorraine Lyon, respectively. Additional cast members include Joe Keery as Gator Tillman, Lamorne Morris as Witt Farr, Richa Moorjani as Indira Olmstead, and Dave Foley as Danish Graves.</p><br/><h3>Cast and characters</h3><h4>Overview</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Casts of seasons of <i>Fargo</i></caption><tbody><tr><th scope=\"col\" rowspan=\"2\">Character</th><th scope=\"col\" colspan=\"4\" align=\"center\">Seasons</th></tr><tr><th scope=\"col\" align=\"center\"><span>Season 1</span></th><th scope=\"col\" align=\"center\"><span>Season 2</span></th><th scope=\"col\" align=\"center\"><span>Season 3</span></th><th scope=\"col\" align=\"center\"><span>Season 4</span></th></tr><tr><th scope=\"row\"><span>Mr. Wes Wrench</span></th><td><span>Russell Harvard</span><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_recurring\"><span>R</span></sup></td><td>Corwin Gruter-Andrew<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_young\"><span>Y</span></sup></td><td>Russell Harvard<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_recurring\"><span>R</span></sup></td><td style=\"background:lightgrey;\"></td></tr><tr><th scope=\"row\"><span>Lou Solverson</span></th><td><span>Keith Carradine</span><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_recurring\"><span>R</span></sup></td><td><span class=\"mw-redirect\">Patrick Wilson</span><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_main\"><span>M</span></sup><hr><span style=\"font-size:85%;\">Keith Carradine<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup></span></td><td colspan=\"2\" style=\"background:lightgrey;\"></td></tr><tr><th scope=\"row\"><span>Molly Solverson</span></th><td><span>Allison Tolman</span><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_main\"><span>M</span></sup></td><td>Raven Stewart<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_recurring\"><span>R</span></sup><hr><span style=\"font-size:85%;\">Allison Tolman<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_old\"><span>O</span></sup><hr>Laura Geluch<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_old\"><span>O</span></sup><hr>Libby Seltzer<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_old\"><span>O</span></sup></span></td><td colspan=\"2\" style=\"background:lightgrey;\"></td></tr><tr><th scope=\"row\"><span>Gus Grimly</span></th><td><span>Colin Hanks</span><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_main\"><span>M</span></sup></td><td>Colin Hanks<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup></td><td colspan=\"2\" style=\"background:lightgrey;\"></td></tr><tr><th scope=\"row\"><span>Lester Nygaard</span></th><td><span>Martin Freeman</span><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_main\"><span>M</span></sup></td><td>Martin Freeman<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_voice\"><span>V</span></sup></td><td colspan=\"2\" style=\"background:lightgrey;\"></td></tr><tr><th scope=\"row\"><span>Ohanzee \"Hanzee\" Dent<br><span style=\"font-size:85%;\">Moses Tripoli</span></span></th><td><span>Mark Acheson</span><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup></td><td><span>Zahn McClarnon</span><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_main\"><span>M</span></sup></td><td colspan=\"2\" style=\"background:lightgrey;\"></td></tr><tr><th scope=\"row\"><span>Mr. Grady Numbers</span></th><td><span>Adam Goldberg</span><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_recurring\"><span>R</span></sup></td><td>Artem Fomitchev<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_young\"><span>Y</span></sup></td><td colspan=\"2\" style=\"background:lightgrey;\"></td></tr><tr><th scope=\"row\"><span>Lorne Malvo</span></th><td><span>Billy Bob Thornton</span></td><td style=\"background:lightgrey;\"></td><td>Billy Bob Thornton<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_voice\"><span>V</span></sup></td><td style=\"background:lightgrey;\"></td></tr><tr><th scope=\"row\">Mike Milligan<br><span style=\"font-size:85%;\">Michael \"Satchel\" Cannon</span></th><td style=\"background:lightgrey;\"></td><td><span>Bokeem Woodbine</span><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_recurring\"><span>R</span></sup></td><td style=\"background:lightgrey;\"></td><td>Rodney L. Jones III<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_recurring\"><span>R</span></sup><hr><span style=\"font-size:85%;\">Bokeem Woodbine<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_old\"><span>O</span></sup></span></td></tr><tr><th scope=\"row\">Joe Bulo</th><td style=\"background:lightgrey;\"></td><td><span>Brad Garrett</span><sup class=\"reference plainlinks nourlexpansion\" id=\"ref_recurring\"><span>R</span></sup></td><td style=\"background:lightgrey;\"></td><td>Evan Mulrooney<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_recurring\"><span>R</span></sup></td></tr><tr><th scope=\"row\">Gale Kitchen</th><td style=\"background:lightgrey;\"></td><td>Brad Mann<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_recurring\"><span>R</span></sup></td><td style=\"background:lightgrey;\"></td><td>Brad Mann<sup class=\"reference plainlinks nourlexpansion\" id=\"ref_guest\"><span>G</span></sup></td></tr></tbody></table><h4>Season 1 cast</h4><ul><li>Billy Bob Thornton as Lorne Malvo</li><li>Allison Tolman as Deputy Molly Solverson</li><li>Colin Hanks as Officer Gus Grimly</li><li>Martin Freeman as Lester Nygaard</li></ul><h4>Season 2 cast</h4><ul><li>Kirsten Dunst as Peggy Blumquist</li><li>Patrick Wilson as State Trooper Lou Solverson</li><li>Jesse Plemons as Ed Blumquist</li><li>Jean Smart as Floyd Gerhardt</li><li>Ted Danson as Sheriff Hank Larsson</li></ul><h4>Season 3 cast</h4><ul><li>Ewan McGregor as Emmit and Ray Stussy</li><li>Carrie Coon as Gloria Burgle</li><li>Mary Elizabeth Winstead as Nikki Swango</li><li>Goran Bogdan as Yuri Gurka</li><li>David Thewlis as V. M. Varga</li></ul><h4>Season 4 cast</h4><ul><li>Chris Rock as Loy Cannon</li><li>Jessie Buckley as Oraetta Mayflower</li><li>Jason Schwartzman as Josto Fadda</li><li>Ben Whishaw as Rabbi Milligan</li><li>Jack Huston as Odis Weff</li><li>Salvatore Esposito as Gaetano Fadda</li><li>E'myri Crutchfield as Ethelrida Pearl Smutny</li><li>Andrew Bird as Thurman Smutny</li><li>Anji White as Dibrell Smutny</li><li>Jeremie Harris as Leon Bittle</li><li>Matthew Elam as Lemuel Cannon</li><li>Corey Hendrix as Omie Sparkman</li><li>James Vincent Meredith as Opal Rackley</li><li>Francesco Acquaroli as Ebal Violante</li><li>Gaetano Bruno as Constant Calamita</li><li>Stephen Spencer as Dr. David Harvard</li><li>Karen Aldridge as Zelmare Roulette</li></ul><h4>Season 5 cast</h4><ul><li>Juno Temple as Dorothy \"Dot\" Lyon</li><li>Jon Hamm as Sheriff Roy Tillman</li><li>Jennifer Jason Leigh as Lorraine Lyon</li><li>Joe Keery as Gator Tillman</li><li>Lamorne Morris as Witt Farr</li><li>Richa Moorjani as Indira Olmstead</li><li>Dave Foley as Danish Graves</li><li>Lukas Gage as Lars Olmstead</li></ul><br/><h3>Production</h3><p>In 1997, a pilot was filmed for an intended television series based on the film. Set in Brainerd shortly after the events of the film, it starred Edie Falco as Marge Gunderson and Bruce Bohne reprising his role as Officer Lou. It was directed by Kathy Bates and featured no involvement from the Coen brothers. The episode aired in 2003, during Trio's Brilliant But Cancelled series of failed TV shows.</p><p>In 2012, it was announced that FX, with the Coen brothers as executive producers, was developing a new television series based on the film. It was later announced that adaptation would be a ten-episode limited series. On August 2, 2013, it was announced that Billy Bob Thornton had signed on to star in the series. On September 27, 2013, Martin Freeman also signed on to star. On October 3, 2013, it was announced that Colin Hanks was cast in the role of Duluth police officer Gus Grimly. Production began in late 2013, with filming taking place in and around Calgary, Alberta.</p><p>The series is set in the same fictional universe as the film, in which events took place in 1987 between Minneapolis and Brainerd, Minnesota. The first season features the buried ransom money from the film in a minor subplot. Additionally, a number of references are made connecting the series to the film.</p><p>Following the series renewal in July 2014, creator Noah Hawley revealed that the second season would take place in 1979 and focus on Sioux Falls, South Dakota, as referred to by Lou Solverson and others in the first season. The ten episodes are set in Luverne, Minnesota; Fargo, North Dakota; and Sioux Falls. Hawley agreed that this takes place before the events of the film, but he believes all the stories connect: \"I like the idea that somewhere out there is a big, leather-bound book that's the history of true crime in the Midwest, and the movie was Chapter 4; Season 1 was Chapter 9; and is Chapter 2,\" he said. \"You can turn the pages of this book, and you just find this collection of stories. ... But I like the idea that these things are connected somehow, whether it's linearly or literally or thematically. That's what we play around with.\" This book was realized in season 2, episode 9, \"The Castle\". Production on the second season began in Calgary on January 19, 2015, and completed on May 20, 2015.</p><p>Production on the third season began in January 2017 in Calgary, Alberta. Production on the fourth season was shut down in March 2020 due to the COVID-19 pandemic. The season was originally scheduled to premiere on April 19, 2020, before the shutdown. Filming resumed on the fourth season in late August 2020.</p><p>In February 2022, FX renewed the series for a fifth season. Production for the fifth season began as early as October 2022 in Calgary, Alberta. Filming was reported in High River in December 2022, January 2023, and February 2023. Filming reportedly took place at a Didsbury hospital in February, and filming moved to Beiseker on February 27.</p><br/><h3>\"This is a true story\"</h3><p>As with the original film, each episode begins with the superimposed text:</p><blockquote>This is a true story. The events depicted took place in in. At the request of the survivors, the names have been changed. Out of respect for the dead, the rest has been told exactly as it occurred.</blockquote><p>As with the film, this claim is untrue. Showrunner Noah Hawley continued to use the Coens' device, saying it allowed him to \"tell a story in a new way\". Hawley has played with the realism of the story further; responding to queries about Charlie Gerhardt, a character from season 2, he stated \"If he’s out there, I’d like to get a letter from him someday, telling me how he turned out.\"</p><p>At the 2017 ATX Television Festival in Austin, Texas, Hawley further discussed the \"true story\" series tag: \"So what does that even mean—the words 'true story'?\" he said. \"I really wanted to deconstruct that this year.\" He recalled one of the lines spoken by Sy Feltz, Michael Stuhlbarg's character: \"'The world is wrong—it looks like my world but everything is different.' That's what we're exploring this year.\"</p><br/><h3>Release</h3><p>On April 15, 2014, the series made its debut on FX and FXX in Canada; the remaining episodes were shown on FXX. The next day, it premiered in the UK on Channel 4. On May 1, 2014, it premiered on SBS One in Australia, and on SoHo in New Zealand.</p><p>Netflix streamed seasons 1–3 in 20 regions between 2015 and 2022.</p><br/><h3>Reception</h3><h4>Critical response</h4><h4>Critical response to season 1</h4><p>The first season was critically acclaimed; it received a Metacritic score of 85 out of 100 based on 40 reviews, signifying \"universal acclaim\". The review aggregation website Rotten Tomatoes reported that 97% of 140 critics gave the season a positive review, with an average rating of 8.45/10. The website consensus reads: \"Based on the film of the same name in atmosphere, style, and location only, Fargo presents more quirky characters and a new storyline that is expertly executed with dark humor and odd twists.\" IGN reviewer Roth Cornet gave the first season a 9.7 out of 10 score, praising the casting, its thematic ties to the movie, and the writing. The A.V. Club named it the sixth best TV series of 2014.</p><h4>Critical response to season 2</h4><p>The second season was also met with critical acclaim. It received a Metacritic score of 96 based on 33 reviews, which indicates \"universal acclaim\". 100% of 233 reviews are positive on Rotten Tomatoes, with an average rating of 9.1/10. The site's consensus states: \"Season two of Fargo retains all the elements that made the series an award-winning hit, successfully delivering another stellar saga powered by fascinating characters, cheeky cynicism, and just a touch of the absurd.\"</p><h4>Critical response to season 3</h4><p>The third season received acclaim similar to the first two seasons. Metacritic assigned it a score of 89 out of 100 based on 32 reviews, indicating \"universal acclaim\". On Rotten Tomatoes, it has a 93% rating with an average score of 8.5/10 based on 224 reviews. The site's critical consensus is: \"Thanks in part to a memorable dual performance from Ewan McGregor, Fargo mostly maintains the sly wit and off-kilter sensibility it displayed in its first two seasons.\"</p><h4>Critical response to season 4</h4><p>The fourth season received generally positive reviews from critics, though less acclaimed than its previous seasons. Rotten Tomatoes collected 57 reviews and identified 84% of them as positive, with an average rating of 7.3/10. The critics consensus for the season is, \"Though Fargo's ambitious fourth season struggles to maintain momentum, fine performances and a change of scenery make for an engaging—if uneven—departure from the series' norm.\" At Metacritic, the season got a score of 68/100, based on reviews from 37 critics, indicating \"generally favorable reviews.\"</p><h4>Accolades</h4><p>Fargo has won 51 of its 226 award nominations. The first season garnered 8 Primetime Emmy Award nominations, with the show itself winning the Outstanding Miniseries and director Colin Bucksey winning the Outstanding Directing for a Miniseries, Movie or a Dramatic Special. It received an additional 10 Creative Arts Emmy Award nominations, winning for Outstanding Casting for a Miniseries, Movie, or Special. It has received eight Golden Globe Award nominations, with the show winning for Best Miniseries or Television Film, and Billy Bob Thornton winning for Best Actor in a Miniseries or Television Film. The series has also received one Screen Actors Guild Award nomination to Billy Bob Thornton for Outstanding Performance by a Male Actor in a Miniseries or Television Movie.</p><p>Additional accolades include: the American Film Institute Award for Top Ten Television Program in 2014 and 2015, the Artios Award for Excellence in Casting, a Peabody Award, seven Critics' Choice Television Awards in which the show won twice for Best Miniseries and five times in acting for Billy Bob Thornton, Allison Tolman, Kirsten Dunst, Jesse Plemons and Jean Smart, the Dorian Awards for TV Drama of the Year, the Golden Reel Award for Best Music Score, two Producers Guild of America Award for Outstanding Producer of Long-Form Television and a Writers Guild of America Awards for Long Form – Adapted.</p><br/>"
  },
  "errorMessage": ""
}