{
  "imDbId": "tt5712554",
  "title": "The Grand Tour",
  "fullTitle": "The Grand Tour (TV Series 2016– )",
  "type": "TVSeries",
  "year": "2016",
  "items": [
    {
      "username": "DJ1984",
      "userUrl": "https://www.imdb.com/user/ur100376647",
      "reviewLink": "https://www.imdb.com/review/rw4720609",
      "warningSpoilers": false,
      "date": "13 March 2019",
      "rate": "7",
      "helpful": "66 out of 76 found this helpful.",
      "title": "Getting better with time!",
      "content": "After a steady start with Seasons 1 & 2, the 3rd has really excelled in my opinion.The features and specials are great, the humour is more natural and most of all it's great fun to watch!! The chemistry and banter between the 3 of them is much more evident in this latest instalment too.It's worth noting that I did very much enjoy the first 2 seasons but I felt the show was still finding it's feet in terms of the format and what felt like over scripting at times.Overall I love the show. I watched Top Gear with the 3 of them religiously and I love that The Grand Tour is here to fill the void!"
    },
    {
      "username": "areatw",
      "userUrl": "https://www.imdb.com/user/ur66517869",
      "reviewLink": "https://www.imdb.com/review/rw3582123",
      "warningSpoilers": false,
      "date": "18 November 2016",
      "rate": "",
      "helpful": "112 out of 166 found this helpful.",
      "title": "The boys are back!",
      "content": "At last - Clarkson, Hammond and May are back on our screens, and they're better than ever. Considering Amazon's budget dwarfs that of the BBC, you can imagine just how impressive their new show is.If the first episode is anything to go by, they have successfully managed to retain everything that was good about the old Top Gear in 'The Grand Tour', especially the humour and the chemistry between the three which made the old show the success it was. My biggest fear was that the new show would lose this and become too 'Americanised', but fortunately this hasn't happened.The camera work is phenomenal and the opening sequence was like something out of a movie. I also think the idea to take the show on the road is a nice touch. An incredible start - I already can't wait for next week's episode."
    },
    {
      "username": "borislav-us",
      "userUrl": "https://www.imdb.com/user/ur24303362",
      "reviewLink": "https://www.imdb.com/review/rw3581908",
      "warningSpoilers": false,
      "date": "17 November 2016",
      "rate": "10",
      "helpful": "184 out of 258 found this helpful.",
      "title": "Classic",
      "content": "The brand was not so much the name of the previous show... The brand is this lot here making the best motoring show ever. Well done for Amazon who quickly managed to get them on board. Without any spoilers: It is exciting, it feels familiar - yet new. Thrilling might be right word, but again - even if you sit these three around a table and let them talk about cats for an hour - they'll surely deliver. I think what most viewers would be hoping for is a fair dose of craziness, but also exploring new heights. I am not being objective, but yet again, who is? If you loved TG then you'll love GT....Looking forward to seeing the trio do excitingly new challenges!"
    },
    {
      "username": "Mr_Piggles",
      "userUrl": "https://www.imdb.com/user/ur11616966",
      "reviewLink": "https://www.imdb.com/review/rw3582056",
      "warningSpoilers": false,
      "date": "18 November 2016",
      "rate": "10",
      "helpful": "215 out of 289 found this helpful.",
      "title": "It's like MEGA BUDGET Top Gear.",
      "content": "Imagine what would happen if the famous three were told by Amazon to do what they want and spend as much as you like - because clearly that's what happened here and the end result is AWESOME!Everything is Hollywood in scale and execution. From the writing to the action set pieces, it almost has a slight Michael Bay feel to it.All three presenters are on top form but Clarkson is clearly still the star.'So is it basically just like Top Gear?'I hear you say. And the answer is 'yes', but imagine Top Gear better than it's ever been. The only negative is no Stig. There is Stig-like replacement but it's just not the same.Otherwise, this show is off to an AMAZING start. Highly recommended."
    },
    {
      "username": "Wentloog",
      "userUrl": "https://www.imdb.com/user/ur0362356",
      "reviewLink": "https://www.imdb.com/review/rw3581978",
      "warningSpoilers": false,
      "date": "18 November 2016",
      "rate": "8",
      "helpful": "156 out of 225 found this helpful.",
      "title": "Grand Tour has delivered the goods!",
      "content": "So there was nothing to worry about after all! After the kerfuffle surrounding the end of the three presenting TG at the Beeb, I honestly thought that wherever they went nothing would be the same again in the motor show universe. Well I am happy to report here that I was wrong, sorry let me write that again properly. I was WRONG! Yep it needed the capitals.Amazon threw a lot of money at GT, probably 10 times the budget that TG enjoyed and today there must be some very happy execs in that organisation. The show is at once familiar and different, Richard Hammond's boyish charm (my wife is happy), James May's nerdy appeal and Jezza's sardonic take on everything - all is as it was, but there is also an excitement to GT that TG lacked, a production value that exceeds anything that has gone before as far as a magazine show is concerned. I'm not going to go into any details, no spoilers here, but the whole show is spectacular, great cars, great music, great scenery and most importantly of all - great presenters. If you liked TG you are going to love GT!"
    },
    {
      "username": "evimchine",
      "userUrl": "https://www.imdb.com/user/ur32757371",
      "reviewLink": "https://www.imdb.com/review/rw3585911",
      "warningSpoilers": false,
      "date": "25 November 2016",
      "rate": "4",
      "helpful": "220 out of 357 found this helpful.",
      "title": "(If you really are open to other views ) The chemistry has been forced to death.",
      "content": "If you really are open to other views: I watched Top Gear since the 2002 reboot, and the two most fun elements were the specials and the chemistry between the believable characters.But when they realized this, they gradually tried to force it, resulting in it becoming more and more over the top. And in the end it just stopped being believable. Which means it stopped being fun.In The Grand Tour, they desperately tried to re-ignite that chemistry. (Jeremy says so himself.) But by now it has completely stopped being natural and believable, and is more like someone badly copying a caricature of a nostalgic memory. And all that's left is them looking like they're trying too hard. That's just not fun anymore. And that makes me disappointed and sad.The other problem that I have is that, given their apparently much bigger budget, having each episode be a special and then some would have been possible. But they just went on doing basically the old format. Which is rather wasteful, financially.Well, at least their mini-specials each episodes give a bit of joy. I still have hope. I'm just rather disappointed."
    },
    {
      "username": "srmarshall-204-112469",
      "userUrl": "https://www.imdb.com/user/ur28993200",
      "reviewLink": "https://www.imdb.com/review/rw4769447",
      "warningSpoilers": false,
      "date": "8 April 2019",
      "rate": "10",
      "helpful": "35 out of 40 found this helpful.",
      "title": "Season 3 Special Episode is the funniest show I have seen in years...",
      "content": "Their connection with each other as they travelled across Mongolia was wonderful to watch. Hammond's attempts at driving were always great and perfectly timed. I have not laughed out loud during a TV show this much in a LONG time!P.S. Where can I get a \"John\"?"
    },
    {
      "username": "digdog-785-717538",
      "userUrl": "https://www.imdb.com/user/ur23501644",
      "reviewLink": "https://www.imdb.com/review/rw3582651",
      "warningSpoilers": false,
      "date": "19 November 2016",
      "rate": "9",
      "helpful": "40 out of 64 found this helpful.",
      "title": "Like Top Gear, but fun",
      "content": "Watching The Gran Tour, i see the same quality in the motoring sections as Top Gear had in their very best episodes; the visuals, editing, audio, are as good as if not better than before. The parts in between - comedy parts where the three leads chat and entertain the audience - are funnier than they used to be. The clear culprit here is the change of scenery for Hammond, Clarkson and May, who look refreshed and happy to be doing what they do. The fun is infectious and i feel like i'm having fun with them.I would actually say this is better, in everything, than Top Gear. \"Old\" Top Gear, not the new clone TV show that the BBC is trying to keep afloat.Would i recommend The Grand Tour? Heck yeah. Amazon prime is not free, and unless you use Amazon, you might have not much use for it, and it could be money badly spent on only one TV show.But if you do have Prime, or if one of your friends has it and you can go over and watch it there, then The Grand Tour is unmissable, one of the best TV shows worldwide.9/10 - possibly the best TV show without a story script."
    },
    {
      "username": "BigZ_7337",
      "userUrl": "https://www.imdb.com/user/ur63219567",
      "reviewLink": "https://www.imdb.com/review/rw3582938",
      "warningSpoilers": false,
      "date": "19 November 2016",
      "rate": "10",
      "helpful": "76 out of 125 found this helpful.",
      "title": "They're Back!",
      "content": "It's amazing how well the trio slips right back into top form in the first episode of the Grand Tour. I loved the first episode, and I wish I could watch the rest of the season right now. This show is funnier than most of the comedies on TV, and it has to be one of the most gorgeous shows on TV, as they really spared no expense on the production values. They even have some excellent CGI showing how each hybrid engine works.The only things missing from Top Gear are the Stig, and the celebrity interviews. While this eliminates some of the excellent Stig jokes, they've replaced him with a named racer to perform time trials on their crazy new track. For the celebrities, they had a funny series of jokes about it, but honestly there's not much to miss.So overall, I'd recommend this show to everyone, but especially fans of humor, cars, and travel. I think I might have a new favorite TV show with The Grand Tour, and I can't wait to see the rest of the season."
    },
    {
      "username": "matias-reinikainen",
      "userUrl": "https://www.imdb.com/user/ur54436786",
      "reviewLink": "https://www.imdb.com/review/rw4057665",
      "warningSpoilers": false,
      "date": "9 February 2018",
      "rate": "9",
      "helpful": "25 out of 31 found this helpful.",
      "title": "Second season saves!",
      "content": "Yeah, first season left me a bit dissapointed. The first episode in general was really good and there where signs of hope along the tour of season 1 but in the end it just felt too scripted. And it seems they heard it, just look at the episode unscripted, it seems they really took the criticsm to heart.Second season is full of all the stuff that i loved in Top Gear. Its fun, fast, slightly ridiculous, some times scary but really really just great entertainement. Love it, keep it up!"
    },
    {
      "username": "iquine",
      "userUrl": "https://www.imdb.com/user/ur25312605",
      "reviewLink": "https://www.imdb.com/review/rw3847348",
      "warningSpoilers": true,
      "date": "1 November 2017",
      "rate": "9",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Feels Forced, Lacks Magic, Still Enjoyable",
      "content": "(Flash Review)Top Gear was the most humorous, exciting and unexpected car show I've ever seen. (With a strong tip of the cap to Fifth Gear) Clarkson, Hammond and May have amazing chemistry and still do on Grand Tour. However, most of the verbal interplay, adventurous mishaps and random fun felt planned or forced. Where on Top Gear, those mostly felt unscripted and off the cuff. That is a big difference in eliciting my genuine laughter. While the Stig is irreplaceable, the dopey American test driver was not funny and I did not believe he was extracting maximum performance of each vehicle for the lap times. Season 1 lacked the Top Gear magic but I would hardly call it bad by any means."
    },
    {
      "username": "gianmarcoronconi",
      "userUrl": "https://www.imdb.com/user/ur134783880",
      "reviewLink": "https://www.imdb.com/review/rw7590484",
      "warningSpoilers": false,
      "date": "27 November 2021",
      "rate": "10",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Wonderful",
      "content": "Spiritual sequel to the BBC series, truly wonderful and hilarious. Here the three conductors are even freer and give the best of themselves in everything they do, giving us a pearl of rare beauty."
    },
    {
      "username": "somersetboy",
      "userUrl": "https://www.imdb.com/user/ur23505865",
      "reviewLink": "https://www.imdb.com/review/rw3582805",
      "warningSpoilers": false,
      "date": "19 November 2016",
      "rate": "10",
      "helpful": "66 out of 122 found this helpful.",
      "title": "Wow! Sublime! Perfect! Provocative!",
      "content": "I just watched an impressive, thoughtful, provocative, memorable, perfect first episode of the first season. I was not sure what to expect with the trio's new take on what they love to do the most. Actually it was imaginative and provocative enough to show that these three can come come up with the most watchable car programme on earth.The cinematography was better than anything I have seen before. Even better than the show they left behind at the 'Baa Baa See'! :) The picture quality was astounding. Whatever cameras and jigs they have used to film the show are probably the best equipment available. The overall visuals look spectacular and 'grand'. Smooth Amazon Prime streaming in proper HD gets credit for that too. Vibrant colours, smooth camera work and not the shaky vibrating car mounted cameras of yore. - Even in this department, it appears as though BBC has been beaten! Even the sound recording felt better. Now, sound recording is something BBC (Baa Baa See) used to excel in. Now, with an iPlayer that does not appear to play full HD and with a sound that feels compressed, Baa Baa See has unwittingly given these three guys an edge over their own sorry show. The audio playback was really superlative in Amazon Prime for what I was expecting for a streaming playback. Something dreary like a motoring show becomes so exciting with these three. I was completely expecting a few laugh out loud moments. What was actually there exceeded all expectations. I would expect more fun and more laugh out loud moments. I am totally spoilt. Would imagine that eventually, there will be scenes and episodes that sets new heights and standards. Is this a stunt show? Is this a motoring show? Is this a sitcom? Who knows. It is superlative fun: - That is what it is . I cannot wait to watch the rest of the season, as it looks like each episode may have its own unique flavour, because of the changing locations. Wow! Brilliant!****Just this one show alone makes my Amazon Prime membership worth it****I have watched more episodes since this review and wanted to report back. Yes, this show is definitely mega fun and it looks like it has been a game changer for Amazon. I would now expect Amazon to throw even more money at not just Grand Tour, but to other potential programming. One the whole I am extremely pleased with Amazon streaming quality. After this, BBC's old version of Top Gear is probably dead. I still like BBC drama as they are more quintessentially British compared to current content on Amazon. I also think that Amazon should try stuff like Jools Holland doing takes on Songs, as an example. I do hope Amazon makes more strong stuff like this! :) Thanks for reading."
    },
    {
      "username": "jonsefcik",
      "userUrl": "https://www.imdb.com/user/ur69575104",
      "reviewLink": "https://www.imdb.com/review/rw5861992",
      "warningSpoilers": false,
      "date": "28 June 2020",
      "rate": "10",
      "helpful": "8 out of 11 found this helpful.",
      "title": "On par with golden age Top Gear, except for two annoyances...",
      "content": "Not long ago on a television network not far away called the BBC, Top Gear was revamped from its old informative editorial format into a weird comedy/talk show/reality/documentary. By season 2 the show settled on their starring lineup: Jeremy Clarkson, James May, and Richard Hammond, three very British and somewhat incompetent automotive journalists who reviewed the latest models, revisited classics, discussed automotive news, and interviewed celebrities in their own unique way, Most amusing of all were their challenges, road trips, and hair-brained schemes to apply their automotive knowledge and passion to make life easier and the world a better place (often with disastrous results).Top Gear worked so well in this format because of the chemistry between the three presenters. They were genuinely organic and funny, contrasted with the cringe-inducing subsequent hosts. When Jeremy was fired in 2015, James and Richard stuck to their guns and resigned as well, knowing all three of them are what contributed to the show's success. We will never see Top Gear in this format again, but The Grand Tour is just about the best replacement we could've realistically asked for.It follows the same general format as the old show: reviews, interviews, discussions, challenges, and adventures. It's the same 3 presenters, but this time (for the first 3 seasons anyway) each episode is filmed at a different location in the world. My first annoyance with this, is that because they're following the old format so closely, and they can't use the same titles and lingo from Top Gear, the replacements are so transparent. Instead of The Stig they had The American who was soon replaced with Abby. The Stig was a huge part of Top Gear's identity. Granted he was more of a prop than a character, but his anonymity and socially removed behavior allowed for some great gags. Jeremy now says \"terrible disappointment\" and \"back to the tent\" instead of \"bombshell\" and \"back to the studio\". Conversation street is clearly just the news, but at least Richard gives a unique intro every time and the animated shorts are hilarious.My second, bigger gripe with the Grand Tour is how some parts are a lot more obviously staged than in Top Gear. TG had many staged scenes, but the show somehow managed to make all the dialogue, actions, and body language feel natural. It's hard to explain without spoiling many scenes in GT, but the dialogue feels noticeably more scripted and the events more convoluted.Many fans are sad that the show (for the time being) will not be continuing in its old format with the tent. I however look forward to season 4 since it will be entirely adventures, which were always the high point of any season of TG or GT. The Grand Tour is not really about the cars anyway. Everything Top Gear has done season 23 and on is proof of that. Jeremy, Hamster, and Captain Slow are the heart of GT, specifically their humor, unbreakable optimism, and sense of adventure. Though there are minor annoyances with the shows presentation, I love how the spirit of Top Gear was still successfully carried over."
    },
    {
      "username": "mkools",
      "userUrl": "https://www.imdb.com/user/ur1995542",
      "reviewLink": "https://www.imdb.com/review/rw3584826",
      "warningSpoilers": false,
      "date": "23 November 2016",
      "rate": "7",
      "helpful": "119 out of 223 found this helpful.",
      "title": "Painfully awful...",
      "content": "I already started to dislike the last BBC Top Gear episodes because of the increasing amount of scripted jokes but Amazon took it to a whole new level. This show is now 100% scripted, there is not one improvised joke. The dialog between the crew feels forced and uncomfortable. Not only that but the jokes are not funny at all, the car scenes take on for much too long to keep me interested, even the audience was super annoying, over the top American.This shows that making a good auto show takes more than a lot of money + Jeremy Clarkson & co. The BBC had an entire crew behind it which is what most people seem to forget.This show is now just another over the top American TV show about cars, just like all the other shows that are already out there."
    },
    {
      "username": "matthijsalexander",
      "userUrl": "https://www.imdb.com/user/ur64604296",
      "reviewLink": "https://www.imdb.com/review/rw3622175",
      "warningSpoilers": true,
      "date": "18 January 2017",
      "rate": "5",
      "helpful": "29 out of 53 found this helpful.",
      "title": "The GRAND Rubbish",
      "content": "I used to be a fan, I used to love this show and surely elements of it I still love. But, this show has been beat up, rolled through the mud and punched in the groin by Hollywood.This show is forcefully funny. The guys are scripted too much, or simply have lost their touch. Hollywood has poisoned the Top Gear spirit. Explosions and exaggerations, scripted bits that are remotely funny. You can actually see the guys are like monkeys in cages, I really wonder if they are happy with the end-result.What makes no sense, the obvious points: 1) The American is not funny at all. That dude has no added value. Better for him to drive and 'hush. His repetitive nagging is seldom funny nor does it have added value. Very predictable, very stupid.2) Conversation street is useless and not funny at all. Forced and scripted conversation that barely produces laughs, nor is the subject matter interesting.3) The tent makes no sense. Why go anywhere and everywhere if 70% to 80%of the show is about, and filmed, somewhere else? Why not cover the actual place they are? In Stuttgart the whole episode is about driving in Scotland or in 'wherever' it is about some stupid project in the Caribbean. The latter a dreadful episode which wasn't informative or funny at all.4) Celebrity Crash, or whatever. Each show the same stupid gimmick. Here he is, oh no now he's dead. Once this was funny, twice this was slightly funny but doing the same thing every week.... didn't somebody figure this would be predictable? Perhaps, free advise, it would be nicer if a celebrity actually makes it, a week later one dies.Despite the horrendous torture by simplicity, I will continue to watch as, fair is fair, the car-bits are still interesting and from time to time it is funny. The battle-ship bit was genius.Above all....PLEASE PLEASE bring back the specials!!! Travel the world, keep it simple. Nature, Cars and British humor! Cut out the Hollywood element! Please!"
    },
    {
      "username": "n-middleton-117",
      "userUrl": "https://www.imdb.com/user/ur43568759",
      "reviewLink": "https://www.imdb.com/review/rw3588821",
      "warningSpoilers": false,
      "date": "29 November 2016",
      "rate": "5",
      "helpful": "44 out of 82 found this helpful.",
      "title": "Lost the plot",
      "content": "Barely scraping through for a passing grade, the new series of The Grand Tour has not lived up to the hype. It seems to be running almost entirely on the popularity of the hosts and the blind following of the fans the accrued over at Top Gear.The series appears to be trying too hard to mimic what the new producers must feel made the old Top Gear successful. There's very little in the way of originality, and yet sadly the copies, just like a fake Rolex from Thailand, aren't of the same quality. The track is half rate and may as well have been a car park with cones. The new American test driver is a cringe worthy and unnecessary addition, who will no doubt run out of one-line stereotypes. The celebrity segment so far has been a pitiful excuse to just do some slapstick humour. Most importantly though, the car segments are no longer even about the cars.The show can hardly even be considered a car show, when the majority of the time is consumed by little skits that have nothing to do with cars, and even when cars are involved, we're told virtually nothing about them.It's no longer a show for petrol heads, and rather is now more like a talk show, where the entertainment comes exclusively from the hosts and the scripted skits, rather than from the cars, the challenges, and any kind of genuine chemistry."
    },
    {
      "username": "saxbytim",
      "userUrl": "https://www.imdb.com/user/ur51780721",
      "reviewLink": "https://www.imdb.com/review/rw3582115",
      "warningSpoilers": false,
      "date": "18 November 2016",
      "rate": "10",
      "helpful": "83 out of 141 found this helpful.",
      "title": "The Grand Tour Is More Than What You Wanted!",
      "content": "From the first trailer we knew this was going to be something worth watching. And it sure was. Clarkson, Hammond and May come back with this refreshing look and take on a car show. The backdrops to each episode look stunning and the guys are on a better form then they ever have been. I'm glad they left the BBC because it gave them time to create something new that was not going to dry out and become dull and also gave us time to get ready for something that will change the way TV is made. Thank you Grand Tour.Is this the same as Top Gear? No and yes. The shows format is altered but their is still a track and a racing driver, The American, who takes over from The Stig and The News is now Conversation Street. If you are hesitant about buying Amazon, you won't be disappointed."
    },
    {
      "username": "mumia-1",
      "userUrl": "https://www.imdb.com/user/ur9703998",
      "reviewLink": "https://www.imdb.com/review/rw3587324",
      "warningSpoilers": false,
      "date": "27 November 2016",
      "rate": "2",
      "helpful": "53 out of 99 found this helpful.",
      "title": "TG is dead and this can't fill the void",
      "content": "I didn't want to write off the grand tour after the first episode, so I waited until the second one dropped at least. Unfortunately it changed nothing. The shows looks like as if the producers gave completely free reign to the three clowns. And we get a barely legal ripoff of Top Gear.Don't get me wrong I loved them in Top Gear, almost every episode was brilliant.But this one is completely off the rails, and not in a good way. I felt embarrassed for the bad jokes and awkward punchlines while watching it. The chemistry between the three can't lift this show off the ground. It seems that they couldn't turn the humongous budget into a consumable show. Like the mobile studio which adds no value whatsoever. The viewer just sees the same interior all the time. And the guest car builder stood out like a sore thumb from the show's structure. And they only really had a few awkward words with him either way. The cheesiest part of the show is definitely the \"American\" they're throwing out age old clichés that don't seem even remotely funny. It's bad even as self irony. As far as the format goes it's too much like Top Gear, but it's nothing like Top Gear at the same time. In it's current state the show is not working. It seems that they're having a lot of fun while filming, but the end result is disastrous even after what seems extensive time in the editing room."
    },
    {
      "username": "bannedguybe",
      "userUrl": "https://www.imdb.com/user/ur70000585",
      "reviewLink": "https://www.imdb.com/review/rw3590337",
      "warningSpoilers": false,
      "date": "2 December 2016",
      "rate": "1",
      "helpful": "51 out of 93 found this helpful.",
      "title": "Simply irritating",
      "content": "I wont waste much time reviewing this crap... To start i loved Top Gear back in the days, i was looking forward to seeing the TGT, but it came out stupid, childish & irritating as hell!Watched 3 episodes by now, every episode hoping for it to get better, it does NOT!To Start, That American aka the stig is utterly stupid, second : the humor is even lower than that of an 11 year old kid, And ALWAYS 1 of them must do something very annoying trough the entire episode, for example the muscle car Richard used in episode 3.conversation street is stupid as well.. that 'test track' or as i call it an old potato field is stupid and its not a real test track, i don't expect an air field but rather something decent \"The star\" in every episode dies, how funny... NOT! its the most stupid idea.And many other things i can talk about but like i said, ill keep it shortAlso i don't understand the 9.6/10 rating on here.. its maybe worth a 6/10 in total.my score is 1/10 because it irritates me. I wont pay to see another season of this!(Sorry for my badly written English, I'm a dutch guy :p)"
    },
    {
      "username": "anirog",
      "userUrl": "https://www.imdb.com/user/ur4771217",
      "reviewLink": "https://www.imdb.com/review/rw3589064",
      "warningSpoilers": false,
      "date": "30 November 2016",
      "rate": "1",
      "helpful": "58 out of 111 found this helpful.",
      "title": "Embarrassingly awful",
      "content": "As a huge fan of the Clarkson, May and Hammond top gear, I was like many of us really looking forward to The Grand Tour, I'm afraid to say I am totally disappointed with this reincarnation. One of things I most enjoyed about TG was the specials the challenges and the guests, why didn't they spend the huge budget Amazon provided them with on producing these? instead we are untreated to overly long segments of what can only be described as filler television, in episode 2 they spend about 15 minutes basically just repeating the same not very funny joke in which James May gets killed trying to reach a get away car, it was like being in groundhog day, I actually felt embarrassed watching it. Terrible television."
    },
    {
      "username": "Deux_Vega",
      "userUrl": "https://www.imdb.com/user/ur1983572",
      "reviewLink": "https://www.imdb.com/review/rw3590726",
      "warningSpoilers": false,
      "date": "3 December 2016",
      "rate": "6",
      "helpful": "13 out of 23 found this helpful.",
      "title": "Still not like the old Top Gear",
      "content": "With much anticipation i was looking forward to this \"new Top Gear\". Especially when the BBC decided to completely ruin the name Top Gear with their new cast.But even before their exit of Top Gear it was going downhill in my opinion. Where the first seasons felt much more like improv of guys just having stupid fun, it became much more scripted and honestly, too predictable and quite boring.So, would the Grand Tour be the reboot to freshen things up?The Grand Tour starts off very well. It's \"grand\", it's epic. They definitely want to show off their huge budget, have a subtle middle finger to BBC and the production looks top notch.But, after 1 episode i was disappointing somewhat. Yes, the guys are back. Yes, they are still very good at what they do, but it's not like the old Top Gear's anymore. It's all too scripted again, too predictable and frankly a little boring. After 3 episodes it didn't change my opinion. Even though it's still easy entertainment with beautiful shots and now and then a good joke, it's the poor acting on a set script that is letting it down. I would have loved to see them playing things out with a scenario without a completely worked out script. That would make it much more fun, like the older Top Gear's. Missed chance in my book ... It's not bad, but it's not great either."
    },
    {
      "username": "weir-15727",
      "userUrl": "https://www.imdb.com/user/ur79044253",
      "reviewLink": "https://www.imdb.com/review/rw7651841",
      "warningSpoilers": false,
      "date": "17 December 2021",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "And on that bombshell",
      "content": "Loved top gear and liked the grand tour but the last 2 (lochdown and carnage a trois)are just shocking think it's time for the boys to call it a day, GOODNIGHT!!!!"
    },
    {
      "username": "bengtsson71",
      "userUrl": "https://www.imdb.com/user/ur39659049",
      "reviewLink": "https://www.imdb.com/review/rw3586511",
      "warningSpoilers": false,
      "date": "26 November 2016",
      "rate": "6",
      "helpful": "15 out of 21 found this helpful.",
      "title": "Not as good as Top Gear was",
      "content": "As a big fan of the trio and the work they did on Top Gear I have been looking forward to this show for quite some time now. Matter of fact is Top Gear has always been my all time favorite TV show all categories, and my expectations for The Grand Tour was high.What they did so well in Top Gear however seems to have been lost along the way. The unscripted feel of Top Gear was in my opinion its greatest feet. In TGT however the script is ever so present and the banter among the trio which made Top Gear so good is gone. I can't nothing but hope they will find their way back to the things that made Top Gear so very good. With that said it is still a very entertaining show, just not as good as Top Gear was. That it has (when I'm writing this) 9,6 on IMDb in its current form is beyond me. I attribute it to the many fans of Jeremy, Hammon and May."
    },
    {
      "username": "jochemunlimited",
      "userUrl": "https://www.imdb.com/user/ur87919913",
      "reviewLink": "https://www.imdb.com/review/rw7154939",
      "warningSpoilers": false,
      "date": "23 July 2021",
      "rate": "6",
      "helpful": "6 out of 9 found this helpful.",
      "title": "Entertaining... mostly...",
      "content": "Meh... Too much budget, too much destroying things for no reason, too much throwing money around, feels too much scripted, that is making everything feel a bit lame.I like most of the humour, the scenes are very nice. They go to beautiful places that make nice shots. So that makes that my score will be a good one. But I must not think about how much budget, energy, people, stuff etc is wasted for this. Is all this really worth this show? Seeing 3 old man doing weird things without a goal?"
    }
  ],
  "errorMessage": ""
}