{
  "imDbId": "tt5712554",
  "title": "The Grand Tour",
  "fullTitle": "The Grand Tour (TV Series 2016– )",
  "type": "TVSeries",
  "year": "2016",
  "episodes": [
    {
      "id": "tt5715192",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "The Holy Trinity",
      "image": "https://m.media-amazon.com/images/M/MV5BMzY2MzcxMDE3NF5BMl5BanBnXkFtZTgwNzg2MzM2MDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "18 Nov. 2016",
      "plot": "The Grand Tour kicks off in California, USA, when Jeremy Clarkson, Richard Hammond and James May take their famous studio tent to Dry Rabbit Lake. Hundreds of fans from across the U.S. traveled to the desert, near Lucerne Valley, outside of Los Angeles, California to be part of the first ever episode of Jeremy, Richard and James new show for Amazon Prime.",
      "imDbRating": "8.9",
      "imDbRatingCount": "5397"
    },
    {
      "id": "tt6068824",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Operation Desert Stumble",
      "image": "https://m.media-amazon.com/images/M/MV5BMTI1OTM0NGItOTk3MC00Mjk3LTliMGMtNjc5ZWM5ZDQ3YWZlL2ltYWdlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "25 Nov. 2016",
      "plot": "Jeremy Clarkson, Richard Hammond and James May bring the traveling Grand Tour tent to The Cradle of Humankind near Johannesburg in South Africa. In this show, the three hosts are forced to become special forces soldiers with an all action challenge at a top secret training base, deep within Jordan. Also in this episode, Jeremy introduces the 800 horsepower Aston Martin Vulcan to the Grand Tour test track, and James is sent to investigate an unusual form of motorsport called spinning.",
      "imDbRating": "6.8",
      "imDbRatingCount": "4642"
    },
    {
      "id": "tt6068828",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "Opera, Arts and Donuts",
      "image": "https://m.media-amazon.com/images/M/MV5BMjFkODQ3ZjktMDVlYy00YjdiLTg2OTktOWExZGRjYTEwNDEwL2ltYWdlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "2 Dec. 2016",
      "plot": "The travelling tent lands on the quayside in Whitby, England where Jeremy, Richard and James introduce a modern take on the traditional Italian grand tour featuring an Aston Martin DB11, a Rolls-Royce Dawn and an uninvited guest.",
      "imDbRating": "8.2",
      "imDbRatingCount": "3046"
    },
    {
      "id": "tt6068832",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Enviro-mental",
      "image": "https://m.media-amazon.com/images/M/MV5BOTQ5NzkxMTM1Nl5BMl5BanBnXkFtZTgwNDI5NjA4MDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "9 Dec. 2016",
      "plot": "The Grand Tour studio tent is back in Whitby, England for various complicated reasons, some of which are James's fault. In this show, Jeremy Clarkson tests the Porsche 911 GT3 RS, desperately trying to remain impartial despite knowing that Richard Hammond owns one, and then compares it to the track-focused BMW M4 GTS. Also in this programme, the hosts become unusually ecological as they attempt to create cars made of truly sustainable materials before taking part in what's billed as a green motorsport event. Meanwhile, back at the tent, comedian Jimmy Carr is the ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "2717"
    },
    {
      "id": "tt6068834",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "Morroccan Roll",
      "image": "https://m.media-amazon.com/images/M/MV5BMTgxNzcxMzE0Ml5BMl5BanBnXkFtZTgwOTE2MTg4MDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "16 Dec. 2016",
      "plot": "The Grand Tour travelling tent is in the port of Rotterdam, Holland from where Richard Hammond and James May introduce a twin test between two lightweight sports cars, the civilised Mazda MX5 and the stripped-out Zenos E10, against the stunning backdrop of Morocco. Unfortunately, the pair's North African adventure is ruined by the arrival of the horribly dressed Jeremy Clarkson in the horribly expensive Alfa Romeo 4C Spider. Also in this show, Hammond and May attempt to reinvent a traditional board game by playing it with cars, and legendary Dutch band Golden Earring ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "2255"
    },
    {
      "id": "tt6068836",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "Happy Finnish Christmas",
      "image": "https://m.media-amazon.com/images/M/MV5BOTEyOTQ4OTI5N15BMl5BanBnXkFtZTgwNTUzNzM5MDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "23 Dec. 2016",
      "plot": "The Grand Tour pitches its travelling studio in Kakslauttanen, Finland, deep within the Arctic Circle. In this show, Richard Hammond is very excited by the UK arrival of the very first Ford Mustang to be made in right-hand-drive and then very annoyed when Jeremy Clarkson turns up with a Ford Focus RS loudly claiming that it's better. Meanwhile, James May recounts the epic battle between Ford and Ferrari for supremacy in the Le Mans endurance race of the 1960s. Plus, the presenters have some Christmas gift suggestions for the car enthusiast.",
      "imDbRating": "8.5",
      "imDbRatingCount": "2186"
    },
    {
      "id": "tt6068840",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "The Beach (Buggy) Boys - Part 1",
      "image": "https://m.media-amazon.com/images/M/MV5BMjQzMzk5NDkxOV5BMl5BanBnXkFtZTgwOTY1NDc5MDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "30 Dec. 2016",
      "plot": "In the first of two special shows, The Grand Tour abandons its usual travelling tent for a road trip across Namibia as Jeremy Clarkson, Richard Hammond and James May attempt to demonstrate the brilliance of that great '60s throwback, the beach buggy. Grand Tour boss man Mr Wilman has declared that beach buggies are terrible, and its up to the hosts to prove him wrong as they saddle up three examples built to their own specifications and set off on an epic journey across the deserts of south west Africa.",
      "imDbRating": "8.7",
      "imDbRatingCount": "2351"
    },
    {
      "id": "tt6068844",
      "seasonNumber": "1",
      "episodeNumber": "8",
      "title": "The Beach (Buggy) Boys - Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BZGRjYjcwY2EtMDU2MS00M2NkLThhNTAtNWEwMTg1ZGM0YzY2L2ltYWdlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "31 Dec. 2016",
      "plot": "In the second show of a two-part special, Jeremy Clarkson, Richard Hammond and James May continue in their epic trip across Namibia as they attempt to prove that beach buggies are brilliant. Having escaped the challenging desert at last, the trio must now face the rough roads of the Namibian bush and the constant malfunction of Clarkson's V8-powered buggy. As their arduous journey nears its conclusion, the hosts camp out in style and embark on their own version of rhino conservation before coming up with an unusual and potentially perilous way to reach their finish ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "2164"
    },
    {
      "id": "tt6068846",
      "seasonNumber": "1",
      "episodeNumber": "9",
      "title": "Berks to the Future",
      "image": "https://m.media-amazon.com/images/M/MV5BM2VkMzNiZmYtMTA0Mi00Mjk3LTljZDYtYmIzNDA0NmQ4ZWQzL2ltYWdlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2017",
      "released": "6 Jan. 2017",
      "plot": "The Grand Tour travelling tent arrives Stuttgart, Germany, the home of Porsche and Mercedes-Benz. In this show, James May takes the new Honda NSX supercar to the Eboladrome to push its cutting-edge hybrid technology to the limit and Richard Hammond immerses himself in the world of doomsday preppers as he constructs a 'bugout' vehicle that will allow him to survive a bleak future of nuclear winters, alien invasions and massed herds of zombies. Meanwhile, in a less realistic attempt at engineering, Jeremy Clarkson invents a new kind of fashionable SUV. Also in this show...",
      "imDbRating": "8.1",
      "imDbRatingCount": "1808"
    },
    {
      "id": "tt6068850",
      "seasonNumber": "1",
      "episodeNumber": "10",
      "title": "Dumb Fight at the O.K. Coral",
      "image": "https://m.media-amazon.com/images/M/MV5BODNjZGMyZDctOTkwZC00M2Y2LWFiYmYtMmEzZTkxN2QxMzU1L2ltYWdlXkEyXkFqcGdeQXVyNzAwNjk4NTg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2017",
      "released": "13 Jan. 2017",
      "plot": "The Grand Tour travelling tent arrives in Nashville, Tennessee from where Jeremy Clarkson, Richard Hammond and James May introduce their attempt to save the world's coral reefs using only a selection of car body shells and some extremely inept boat driving. Also in this show, Jeremy finally indulges his series-long Alfa Romeo obsession with a test of the new, 500 horsepower Giulia Quadrifoglio and AC/DC singer Brian Johnson comes to the tent to try his hand at Celebrity Brain Crash.",
      "imDbRating": "7.8",
      "imDbRatingCount": "1666"
    },
    {
      "id": "tt6068852",
      "seasonNumber": "1",
      "episodeNumber": "11",
      "title": "Italian Lessons",
      "image": "https://m.media-amazon.com/images/M/MV5BNThlYWZmN2ItOWIwMC00NDM3LTk4MDUtOGZjYzdjZTVhNzQ4L2ltYWdlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2017",
      "released": "20 Jan. 2017",
      "plot": "This week the Grand Tour tent is on the shores of Loch Ness in Scotland, from where Jeremy Clarkson, Richard Hammond and James May introduce their experiences of buying used Maseratis with their own money and then using them to tour the drizzle flecked landscapes of the North of France. Along the way, they encounter worrying noises, unusual electronics, a small engine fire, and the cruel delight of watching James trying to drive with a broken arm. Also in this programme, Richard is at the Eboladrome track trying out the Abarth 124 Spider as he discovers if it's a real...",
      "imDbRating": "7.9",
      "imDbRatingCount": "1470"
    },
    {
      "id": "tt6068854",
      "seasonNumber": "1",
      "episodeNumber": "12",
      "title": "[censored] to [censored]",
      "image": "https://m.media-amazon.com/images/M/MV5BNzJkODNkZWMtYjY2ZS00Y2Q3LTg5Y2QtZWQzOTI2NWYyNDQzL2ltYWdlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2017",
      "released": "27 Jan. 2017",
      "plot": "The tent is once again in Loch Ness, This time Jeremy, Richard and James test the Jaguar F-Pace, the Bentley Bentayga and the Range Rover Autobiography with a road trip around central Europe.",
      "imDbRating": "8.5",
      "imDbRatingCount": "1508"
    },
    {
      "id": "tt6371376",
      "seasonNumber": "1",
      "episodeNumber": "13",
      "title": "Past v Future",
      "image": "https://m.media-amazon.com/images/M/MV5BMGRmYTk5MTgtOGIxMS00M2Y5LWI0NTctMjFmZTYwYjA5YTg2L2ltYWdlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2017",
      "released": "3 Feb. 2017",
      "plot": "For the final show of the season, the Grand Tour tent arrives in Dubai from where Jeremy Clarkson and James May introduce a battle between their own, personal cars. Jeremy champions the past with his Volkswagen Golf GTI while James makes a case for the future with his electrically powered BMW i3. Meanwhile, Richard Hammond is in France learning how to drift a car like a pro, and James is sent to a damp part of England to take part, against his will, in a strange sport called winching. Plus, the recently deceased Bugatti Veyron takes part in a drag race against the ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "1407"
    }
  ],
  "errorMessage": ""
}