{
  "imDbId": "tt7678620",
  "title": "Bluey",
  "fullTitle": "Bluey (TV Series 2018– )",
  "type": "TVSeries",
  "year": "2018",
  "items": [
    {
      "username": "maximovlE",
      "userUrl": "https://www.imdb.com/user/ur13421676",
      "reviewLink": "https://www.imdb.com/review/rw7203744",
      "warningSpoilers": false,
      "date": "7 August 2021",
      "rate": "10",
      "helpful": "151 out of 163 found this helpful.",
      "title": "Impossible to explain how good!",
      "content": "Simply impossible to explain this show. Nothing I write will do it justice. I've been around since The Magic Roundabout, The Flumps, Captain Pugwash, Tom and Jerry, Scooby Doo... Nothing from that era, or today's attempts like Peppa Pig, or anything in-between, come anywhere near to the standards of Bluey.I sit with my young daughter (not that you need a young one to watch this,) and I'm laughing hard one minute, and fighting off the tears the next.The creators, in fact the whole team from the story writer, to the animators, to the sound and music team, and especially to the actors... And every single other person involved... Are purely fantastic human beings.If you listen from a distance it doesn't sound scripted half the time, it just sounds like an amazing family having fun. Most of the stories hit home, hard. Every character has amazing depth and are so loveable. Every single episode has something unique and amazing in it.What did I learn from this? These kids are awesome."
    },
    {
      "username": "BoxwoodExpress",
      "userUrl": "https://www.imdb.com/user/ur71356826",
      "reviewLink": "https://www.imdb.com/review/rw5116548",
      "warningSpoilers": false,
      "date": "12 September 2019",
      "rate": "10",
      "helpful": "104 out of 118 found this helpful.",
      "title": "Disney Junior is Back In Business",
      "content": "I'm one of the few Americans in this review section, since this particular cartoon, which originates from Australia, didn't premiere in the USA until 9 September 2019 on the Disney Junior. I've been hearing rave reviews for the series, so I was excited for it to premiere. It went way beyond my expectations.The series is the perfect show about families. There are no stereotypes or cliches; for example, Bandit (Blue's father) isn't a bumbling buffoon, Chili (Blue's mother) isn't a subservient weakling, Bingo (Bluey's sister) isn't a bratty half-pint, and Bluey isn't a girly-girl, for once. THANK GOD. We need more tomboy characters in mainstream preschool shows.The family is realistic. They aren't an abusive, dysfunctional family, or an overly perfect family, but they reflect real families. Sometimes they don't get along, but they always love each other.My most favorite thing about the series is that it depicts play in a positive light. Young kids should go outside, play and just let their imaginations run wild instead of staying inside and watching crappy Elsagate channels on YouTube. Almost every episode emphasizes playtime in a grand manner. For example, a game of keeping the balloon in the air later becomes a matter of life and death. It's really fun and exciting. It reminds me of shows like Recess, Codename: Kids Next Door, Hey Arnold, Craig of the Creek and Clarence.Since Elena of Avalor and The Lion Guard are sadly both ending after season 3 (check the MooseZeeOnNickJr Facebook page), this show and TOTS are the current best Disney Junior shows, even though this show is an acquired property and not a Disney original. The show already has a wide Australian fanbase, and hopefully this will become a huge hit in the United States of America, hopefully it will beat out Peppa Pig and dethrone that wicked tyrant once and for all."
    },
    {
      "username": "coasterdude44",
      "userUrl": "https://www.imdb.com/user/ur35965350",
      "reviewLink": "https://www.imdb.com/review/rw5852143",
      "warningSpoilers": false,
      "date": "25 June 2020",
      "rate": "10",
      "helpful": "37 out of 41 found this helpful.",
      "title": "Perfect Australian Kids Cartoon, can't get enough of this beautiful program",
      "content": "Finally, Australia gets itself an animated show that is warranted of all the praise it's currently getting. The animation is beautiful looking and charming with great character such as Bluey, Bingo as well as her Mum and Dad. It's a very relatable family which any Australian can identify with as well as many more around the world.This show has been getting quite a bit of international publicity as of late with American and European audiences loving Bluey and wanting more. You can't blame them. Bluey doesn't just succeed as a great kids show emphasizing the importance of imaginative play and understanding how a child's mind and imagination works, especially when it comes to playing and interacting with others, it also has quite a bit to say about adult audiences, giving tidbits of advice of how to better connect with your child's imagination if you do happen to be a parent. The show is also unapologetically Australian, though at the same time doesn't go overboard with it as well, which is probably for the best. It nails modern Australian life very well without trying to hard to embarrass Australian audiences with over indulged stereotypes.The show nails the child-parent relationship beautifully in Bluey, and is also very original in the ideas and topics it communicates in the themes that I discussed earlier. Anyway well done Ludo Studio and I wish you all the best with your success with this new cartoon and franchise. My only complaint is that I wish the episodes were longer :)"
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw6383931",
      "warningSpoilers": false,
      "date": "20 December 2020",
      "rate": "",
      "helpful": "33 out of 37 found this helpful.",
      "title": "charming",
      "content": "It seems an animated serie first for adults. For the many provocative stories, for the fresh and refreshing perspective about family and, especially, for the relations between parents and kids, for humor - the fine irony is a great virtue. Short, just charming in its mixture of chaos and not ordinary forms of wisdom"
    },
    {
      "username": "stabbybob",
      "userUrl": "https://www.imdb.com/user/ur100480614",
      "reviewLink": "https://www.imdb.com/review/rw4725533",
      "warningSpoilers": false,
      "date": "16 March 2019",
      "rate": "10",
      "helpful": "256 out of 263 found this helpful.",
      "title": "Profoundly Good",
      "content": "It is rare that any program, let alone a kids tv show, makes you want to be a better parent, and then shows you how. But this family of dogs does just that. Mum works and Dad does everything he can to be a loving carer who fosters imagination and play. The lessons are subtle, cased in layers of imagination and humour and end up hitting you right in the heart. I consider myself a pretty good parent, but Bluey shows me how to be a better one. And dare I say it, it has fostered a closer relationship to my daughter as a result. Yep. It is that good."
    },
    {
      "username": "safenoe",
      "userUrl": "https://www.imdb.com/user/ur34307814",
      "reviewLink": "https://www.imdb.com/review/rw7308297",
      "warningSpoilers": true,
      "date": "4 September 2021",
      "rate": "10",
      "helpful": "34 out of 39 found this helpful.",
      "title": "Mom...Dad...Bingo...Bluey!!",
      "content": "I discovered Bluey recently, and it's quite sublime with quite the reveal at the end, e.g. Handstand. It's more than a kid's show, and it's more than a series for the parents. It's one for everyone to enjoy. I remember the moment I discovered The Simpsons all those years ago. Now it's Bluey."
    },
    {
      "username": "caravanpark",
      "userUrl": "https://www.imdb.com/user/ur100718609",
      "reviewLink": "https://www.imdb.com/review/rw4736555",
      "warningSpoilers": false,
      "date": "22 March 2019",
      "rate": "10",
      "helpful": "186 out of 195 found this helpful.",
      "title": "The best thing ever",
      "content": "I created an IMDB account just so I could say how fabulous this show is."
    },
    {
      "username": "alexkzapf",
      "userUrl": "https://www.imdb.com/user/ur106402531",
      "reviewLink": "https://www.imdb.com/review/rw6633952",
      "warningSpoilers": false,
      "date": "25 February 2021",
      "rate": "10",
      "helpful": "24 out of 27 found this helpful.",
      "title": "Best kids show.",
      "content": "This show manages to tackle parenthood and what it is to bring kids up the way no other show can manage. It's funny. It's serious when needed and teaches important lesson. And it does it in a way that your kids can watch it. It also is fun to watch for adults."
    },
    {
      "username": "LTPHarry",
      "userUrl": "https://www.imdb.com/user/ur60843171",
      "reviewLink": "https://www.imdb.com/review/rw5394506",
      "warningSpoilers": false,
      "date": "9 January 2020",
      "rate": "9",
      "helpful": "47 out of 56 found this helpful.",
      "title": "Not just for children, it's for everyone",
      "content": "Back in 2004, a british animated show called Peppa Pig premiered. Forward to 2018, and we have this Australian series, which is called Bluey.Peppa Pig however, suffers from poorly-written episodes, bland animation and unlikable and whiny characters. Worst of all, it actually effects the behaviour on children because they love it so much, like they would cry like George Pig over the simpliest things.Bluey however, is nothing like that. The animation is really great for a flash series and is nicely detailed without being too bland. The characters are very loveable and fun, and best of all? It's not annoying and what the characters do is actually fun to watch. In fact, it doesn't appeal to kids, it appeals to adults, too. I'm 19 years old and I enjoy seeing what Bluey and her family do. Yep, I said that right, Bluey is female, so it's neat having a role-model who is likeable, unlike Peppa.The plots are your usual slice-of-life type material with morals, from having Bandit (the Dad) pretending to be a robot, to Bluey and Bingo running a pretend hospital, to even Bluey pretending to be a grown-up at the Supermarket.Both Peppa and Bluey do share one thing, good voice acting, except this show does it a whole lot better. The Australian accents are nice to hear, and it's great that BBC Studios kept them in when the series started to air internationally.The only bad thing (at least in the UK) is that it airs on Disney Junior, which is typically on the highest packs on TV providers like Sky and Virgin Media, so many kids won't be able to see how amazing this show really is. If BBC Studios put it on CBeebies, then it would be able to reach a wider audience and it could rival shows like Bing Bunny or Hey Duggee in terms of popularity, but since this show will be on Disney+ as well, I see no sign of that happening.Overall, this show is great. If you like family shows and have young kids, this is well worth watching."
    },
    {
      "username": "bulgerpaul",
      "userUrl": "https://www.imdb.com/user/ur89021587",
      "reviewLink": "https://www.imdb.com/review/rw7610000",
      "warningSpoilers": false,
      "date": "3 December 2021",
      "rate": "10",
      "helpful": "29 out of 34 found this helpful.",
      "title": "Nothing else in this age group compares",
      "content": "There is literally nothing in all off children's media targeting the age group of 2-5 years old that even remotely compares to just how adorable, hilarious, imaginative, original, and emotionally mature as Bluey is."
    },
    {
      "username": "alex-46296-72481",
      "userUrl": "https://www.imdb.com/user/ur107503626",
      "reviewLink": "https://www.imdb.com/review/rw5107550",
      "warningSpoilers": false,
      "date": "8 September 2019",
      "rate": "10",
      "helpful": "142 out of 153 found this helpful.",
      "title": "The best TV show since The Sopranos",
      "content": "Simply perfect. Everything about Bluey is fantastic.It's modern Australia without ever dipping into cork hat cliche. It's family life without anyone having to look like an idiots. There's jokes galore for the parents but without feeling forced or inappropriate. It teaches us all stuff without ever preaching. The lessons aren't just for the kids either - there's not a parent that has watched Bluey that hasn't learned something. In fact, if there is ever a hint of boredom or wanting a game to play, pop on an episode of Bluey and by the end of the 7 minutes you'll have a new game to play.Even when there was a question mark over whether Chilli was left on the fringes being forced to play the straight man, with Bandit getting all the parental glory, the writers sorted it and she got her punchlines.The comparisons to other pre-school shows are inevitable and let's hope they continue as Bluey should finally mean we see the last for the damn pig. That pig is rude without consequence, treats her dad like an idiot, dumps on her friends, never says please or thank you and bullies her brother, Bluey and her family are the polar opposite.If there is a downside to Bluey, it's that Bandit sets an impossibly high dad standard for us to all live up to."
    },
    {
      "username": "maymckay",
      "userUrl": "https://www.imdb.com/user/ur71395261",
      "reviewLink": "https://www.imdb.com/review/rw6716783",
      "warningSpoilers": false,
      "date": "19 March 2021",
      "rate": "9",
      "helpful": "32 out of 38 found this helpful.",
      "title": "Is there a more realistic show on parenting?",
      "content": "It was a casual listen, I happened to catch a two minute snippet of conversation of two Austrailian dogs, talking to their puppies. And I laughed out loud. I took two steps back and before I knew it, I'd watched four episodes. Granted each episode is only 7 minutes long, but it is more fun then I've had with any Disney cartoon show in ages. It took me back to the days of Chip & Dale Rescue Rangers, Talespin, and suddenly I was anxious to watch this show (with my child of course... cough cough) again and again. Great writing, phenomenal voice acting. It ranks with some of my favorite shows I've seen. Excited for Season two to go on Disney+!"
    },
    {
      "username": "cmwhite28",
      "userUrl": "https://www.imdb.com/user/ur38110677",
      "reviewLink": "https://www.imdb.com/review/rw7554830",
      "warningSpoilers": false,
      "date": "17 November 2021",
      "rate": "10",
      "helpful": "25 out of 26 found this helpful.",
      "title": "This show makes me a better parent",
      "content": "Funny, relatable, and so enjoyable for the whole family. Our kids love it, but we the adults love it as well. It shows the magic of childhood but also shows what engaged parenting looks like. This show makes my husband and I want to be better parents and also showcases the universal themes of parenthood. This is hands down the best kids show. The hype is worth it."
    },
    {
      "username": "bevo-13678",
      "userUrl": "https://www.imdb.com/user/ur76062573",
      "reviewLink": "https://www.imdb.com/review/rw5591024",
      "warningSpoilers": false,
      "date": "30 March 2020",
      "rate": "10",
      "helpful": "23 out of 29 found this helpful.",
      "title": "Top show",
      "content": "Great kids show. Very entertaining for the kids and the adults too"
    },
    {
      "username": "linear-descent",
      "userUrl": "https://www.imdb.com/user/ur37484002",
      "reviewLink": "https://www.imdb.com/review/rw6813798",
      "warningSpoilers": false,
      "date": "14 April 2021",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "We even listen to the soundtrack on the way to school",
      "content": "I don't ever remember sitting and watching a kids show by myself after the kids go to sleep, but here I am. My youngest was watching this show one day and I happened to just walk in the playroom and sit down and watch the \"Sleepytime\" episode with her and everything the parents were going through in that episode regarding when one of your kids crawl in bed with you were exactly what my wife and I have experienced with our own kids. I found myself laughing and identifying with the parents, and then stayed and watched the remaining few episodes for the half hour on Disney Jr.And now here I am trying to catch up on the missed episodes on Disney+ while my kids are asleep, cracking up and genuinely enjoying myself watching a kids show. The show is very well written and truly represents the typical family. The small details is what gets me: the random peeling stickers and goldfish bits on the back seat of their car, the messy rooms, the occasional groaning by the dad as he deals with his kids... you can tell that the writers are all parents.All the reviews on here are correct. This is a great show and deserves all of my 10 stars. The soundtrack is great as well, and has a lot of different styles of music including country, rock, ska, spacey trippy music, and of course the great and happy theme music. My kids like to listen to it during the car drive to school, and I find myself continuing to listening to it while I drive to work after I drop them off. Hooray for Bluey!"
    },
    {
      "username": "arielle-bennett",
      "userUrl": "https://www.imdb.com/user/ur32728743",
      "reviewLink": "https://www.imdb.com/review/rw4425204",
      "warningSpoilers": false,
      "date": "28 October 2018",
      "rate": "10",
      "helpful": "31 out of 36 found this helpful.",
      "title": "Best kids show yet",
      "content": "I watch this with my 2 year old everyday and it's our new favorite. It's such a great show. We love it!"
    },
    {
      "username": "yoshbuck",
      "userUrl": "https://www.imdb.com/user/ur153521567",
      "reviewLink": "https://www.imdb.com/review/rw8792711",
      "warningSpoilers": true,
      "date": "11 January 2023",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "10/10",
      "content": "Indeed the GOAT of all kids' shows where not only kids as young as four could watch it, but anyone the age above that could enjoy the show. That is because Bluey is grounded chiefly in reality, where many episodes can be relatable to many audiences. People may be hesitant to watch the show, with its bright art style and the characters being anthropomorphic dogs. But trust me when I say this show is far more immersive than most shows excellent streaming services are providing. And if you plan to watch this, I highly recommend watching the original/Australian version instead of Disney Plus cause the platform censored a lot of great moments from the show.What makes Bluey this immersive and relatable show everyone is gawking about? Well, Bluey follows the Heller family. Bandit is the father; Chili is the mother; Bingo is the younger daughter; and Bluey is the main character and older daughter. The movie sees their everyday daily escapades, and that's it. Bluey implements its morals to children through face-value presentation of daily life activities. Usually, shows will create a unique situation that fits the mold of the valuable lesson. Bluey takes a completely simplified route.Take an example, the first episode titled Magic Xylophone. Where it's Bingo, Bluey, and Bandit playing a freeze-and-unfreeze game but with a xylophone. But the lesson is learning to share, especially in turns of who will control the xylophone. And instead of telling us right in our faces like it's a kindergarten classroom. It tells us by the characters we know Bingo is upset that Bluey is hogging the xylophone not because we are directly told, but because we see Bingo trying to get a turn and gets visibly upset when Bluey refuses. Usually, the lessons are said to us by an adult without any future action. But in Bluey, there is a concept moral, and the animators execute how it will be applied. The show dealt with heavy, serious topics a few times, which I won't mention. But how they portray it is either in a subliminal way, scenes that seem out of context, or implemented well to the plot so people can easily digest it.Of course, not every episode has to teach morals. Some are just plain fun. In the episode, Grannies is just Bluey and Bingo dressed up as older women and starts terrorizing their home. No profound lesson, but what makes up for it is the level of belief that this is how people act. Not only the children who are sometimes annoying and sometimes a bit spoiled but adults as well. We see them trying their best to care for their children, even though they are visibly exhausted. And when they are making mistakes, they try to make amends. The dialogue is perfect. Usually, a show like this would do toddler talk, but most of the dialogue is just ordinary people speaking. (Although it's hard to believe none of the Australians are swearing, their \"swear\" word is basically \"biscuits\")The animation is perfect. Of course, there are animation mishaps. But those are entirely insignificant to the show's level of detail and movement. The details from character designs are unique. They completely match the voice actors and actresses (which are top-tier since they use actual children to voice children). The room designs and backdrops are second to none. They feel like they are alive. These rooms and environments are real, and if you see one of the backdrops at first, you may think it's from a dumb show. It may be heavily saturated, but it ultimately catches your eye, giving you a blissful experience. And you wouldn't mind the animation liberties they take in the show since the story and character completely entrances you. It not only merges but compliments the animation.The only nitpick is that they sometimes make the children a bit too smart; basically, they need to act more like Muffin, one of the show's most genuine characters. But even though this would happen, it wouldn't improve the show at an exceptional rate. The show is already at a very high bar where whatever decision they make will bring them up. And there is still a lot to unpack in this show, from the style of parenting of Bandit, the comedy, the emotional highlights, and even the musical score of the show. Let me summarize all those. They are perfect.That said, Bluey is the greatest kid's show of all time. Nobody even comes close. You may say this is due to its target audience being four. It wouldn't receive much praise if targeted at a much older audience. And I beg to differ. If it were targeted to an older audience, many people would still love it and see it as suitable for their little ones. Bluey is the best thing that has come out from Australia since Steve Irwin. Overall, a perfect show."
    },
    {
      "username": "natasha-r-mcgrath",
      "userUrl": "https://www.imdb.com/user/ur22395244",
      "reviewLink": "https://www.imdb.com/review/rw4772455",
      "warningSpoilers": false,
      "date": "10 April 2019",
      "rate": "10",
      "helpful": "16 out of 20 found this helpful.",
      "title": "I trusted the great reviews and they were right!!",
      "content": "This is a great little show to watch! I don't even have any kids, well human kids anyway...I do have a Cattle Dog haha. Lately I have just heard people raving about it and it also got a great write up on the ABC so I thought I'd see what all the fuss was about and before I knew it, I was hooked!! My boyfriend and I have found ourselves chuckling at the jokes and find it very relatable to growing up as a kid in Australia! Bring on more Bluey!!!"
    },
    {
      "username": "charliebungle",
      "userUrl": "https://www.imdb.com/user/ur94575811",
      "reviewLink": "https://www.imdb.com/review/rw4429882",
      "warningSpoilers": false,
      "date": "31 October 2018",
      "rate": "10",
      "helpful": "107 out of 114 found this helpful.",
      "title": "About time, Australia...",
      "content": "Massive kudos to the makers and cast. Who needs kids as an excuse to watch this? Brilliant stuff and long overdue for this country to be producing something of this calibre. Whoever voices Bluey and Bingo deserve individual recognition too. Clever, entertaining and hugely amusing. If this doesn't rank up there with Peppa Pig and the plethora of other great British kids' shows, there really is no justice."
    },
    {
      "username": "MrCaveat",
      "userUrl": "https://www.imdb.com/user/ur12767264",
      "reviewLink": "https://www.imdb.com/review/rw4512489",
      "warningSpoilers": false,
      "date": "15 December 2018",
      "rate": "10",
      "helpful": "31 out of 36 found this helpful.",
      "title": "Layers!",
      "content": "Perfect authenticity, both of place and of family interactions. Endless charm!What brings it up to a 10 for me though, is the layers. There is almost always a b-story, allegory, and\\or message behind whatever is happening up front with Bluey & Bingo.'BBQ' for example, has something to say about how we assign and value gender roles in everyday life; while 'The Claw' manages to squeeze in both a message about how effort makes a reward more valuable, and how an unjust economic system should be overthrown!All in 7 minutes.Plus, the opening credits just make me smile every time."
    },
    {
      "username": "mszeedee",
      "userUrl": "https://www.imdb.com/user/ur70125028",
      "reviewLink": "https://www.imdb.com/review/rw4418489",
      "warningSpoilers": false,
      "date": "25 October 2018",
      "rate": "10",
      "helpful": "76 out of 84 found this helpful.",
      "title": "Great Aussie cartoon.",
      "content": "\"Bluey's Dad, Bandit, is an Archaeologist (who loves to dig for bones) and is voiced by award-winning musician and song writer, Dave McCormack (frontman of rock band Custard). Bluey's Mum, Chilli (who works part-time in airport security), is voiced by actress Melanie Zanetti (Tidelands, The Bureau of Magical Things, The Family Law). Bluey, Bingo and some of their friends are voiced by children of the production crew, making this series truly a family affair, on and off the screen.\"This is such a great show, right up there with Charlie and Lola and Peppa Pig. Except it's Aussie! My 4 year old loves it and so do I. Keep it coming!"
    },
    {
      "username": "takeatoke",
      "userUrl": "https://www.imdb.com/user/ur91120177",
      "reviewLink": "https://www.imdb.com/review/rw6013565",
      "warningSpoilers": false,
      "date": "21 August 2020",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A good laugh for kids and parents alike",
      "content": "So glad to have stumbled upon this show - my 3 year old loves it and we as parents get quite a kick out of it too.There's everything from encouraging imagination to moral lessons as well - the best part is it isn't nonsense for the parents as well. There's a number of \"inside\" jokes for the parents that only they would pick up on.A real treat every day it comes on the TV 😁"
    },
    {
      "username": "Tak005",
      "userUrl": "https://www.imdb.com/user/ur42843161",
      "reviewLink": "https://www.imdb.com/review/rw7396333",
      "warningSpoilers": false,
      "date": "1 October 2021",
      "rate": "8",
      "helpful": "12 out of 17 found this helpful.",
      "title": "A great kids show with an Australian flavour.",
      "content": "The is a fantastic kids show. Each episode contains a moral combined with humour. The children love it. Also Australia has been devoid of children's shows with a local flavour. The majority are made overseas. This show addresses that problem. It also contains snippets of humour which adults will enjoy."
    },
    {
      "username": "Esme-67004",
      "userUrl": "https://www.imdb.com/user/ur153090714",
      "reviewLink": "https://www.imdb.com/review/rw8178061",
      "warningSpoilers": false,
      "date": "27 May 2022",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "hands down. the greatest show (Not just for Kids)",
      "content": "I have to admit, I am childless - and yet Bluey has become my favorite show to put on when I'm just looking for something to watch. It's joyful and clever and funny! The rest of Australian television can learn something from bluey - especially how, even in the most subtlest of ways, it's not afraid to take risks."
    },
    {
      "username": "bmeers-883-50483",
      "userUrl": "https://www.imdb.com/user/ur49330598",
      "reviewLink": "https://www.imdb.com/review/rw4414337",
      "warningSpoilers": false,
      "date": "22 October 2018",
      "rate": "10",
      "helpful": "56 out of 64 found this helpful.",
      "title": "Move over Peppa Pig",
      "content": "Endlessly creative, clever, heart warming, topical, this is one of the best shows for little ones on TV. The animation is gorgeous, the writing is brilliant. I find myself watching episodes even when the kids aren't there. The voice acting is incredible with special mention going to the actors who do Bluey and the dad (someone needs to update their IMDB page). The relationship between the dad and his kids is inspiring. The games the kids play together and with their parents are so clever. I now re-enact them with my own kids. This show could be huge, both here and overseas. I feel strangely proud that it's made by Australia. Well done, bravo, keep up the good work. Fav. eps: Takeaway, Shadowlands, The Magic Xylophone, The HospitalAlso, the theme music and music throughout is fantastic."
    }
  ],
  "errorMessage": ""
}