{
  "imDbId": "tt7678620",
  "title": "Bluey",
  "fullTitle": "Bluey (TV Series 2018– )",
  "type": "TVSeries",
  "year": "2018",
  "language": "en",
  "titleInLanguage": "Bluey (2018 TV series)",
  "url": "https://en.wikipedia.org/wiki/Bluey_(2018_TV_series)",
  "plotShort": {
    "plainText": "Bluey is an Australian preschool animated television series that premiered on ABC Kids on 1 October 2018. The program was created by Joe Brumm and is produced by Queensland-based company Ludo Studio. It was commissioned by the Australian Broadcasting Corporation and the British Broadcasting Corporation, with BBC Studios holding global distribution and merchandising rights. The series made its premiere on Disney Junior in the United States and is released internationally on Disney+.\r\nThe show follows Bluey, an anthropomorphic six-year-old Blue Heeler puppy who is characterised by her abundance of energy, imagination and curiosity of the world. The young dog lives with her father, Bandit; mother, Chilli; and younger sister, Bingo, who regularly joins Bluey on adventures as the pair embark on imaginative play together. Other characters featured each represent a different dog breed. Overarching themes include the focus on family, growing up and Australian culture. The program was created and is produced in Queensland; its capital city Brisbane inspires the show's setting.\r\nBluey has received consistently high viewership in Australia on both broadcast television and video on demand services. It has influenced the development of merchandise and a stage show featuring its characters. The program has won two Logie Awards for Most Outstanding Children's Program as well as an International Emmy Kids Award in 2019. It has been praised by television critics for depicting a modern everyday family life, constructive parenting messages, and the role of Bandit as a positive father figure.",
    "html": "<p>Bluey is an Australian preschool animated television series that premiered on ABC Kids on 1 October 2018. The program was created by Joe Brumm and is produced by Queensland-based company Ludo Studio. It was commissioned by the Australian Broadcasting Corporation and the British Broadcasting Corporation, with BBC Studios holding global distribution and merchandising rights. The series made its premiere on Disney Junior in the United States and is released internationally on Disney+.</p><p>The show follows Bluey, an anthropomorphic six-year-old Blue Heeler puppy who is characterised by her abundance of energy, imagination and curiosity of the world. The young dog lives with her father, Bandit; mother, Chilli; and younger sister, Bingo, who regularly joins Bluey on adventures as the pair embark on imaginative play together. Other characters featured each represent a different dog breed. Overarching themes include the focus on family, growing up and Australian culture. The program was created and is produced in Queensland; its capital city Brisbane inspires the show's setting.</p><p>Bluey has received consistently high viewership in Australia on both broadcast television and video on demand services. It has influenced the development of merchandise and a stage show featuring its characters. The program has won two Logie Awards for Most Outstanding Children's Program as well as an International Emmy Kids Award in 2019. It has been praised by television critics for depicting a modern everyday family life, constructive parenting messages, and the role of Bandit as a positive father figure.</p>"
  },
  "plotFull": {
    "plainText": "Bluey is an Australian preschool animated television series that premiered on ABC Kids on 1 October 2018. The program was created by Joe Brumm and is produced by Queensland-based company Ludo Studio. It was commissioned by the Australian Broadcasting Corporation and the British Broadcasting Corporation, with BBC Studios holding global distribution and merchandising rights. The series made its premiere on Disney Junior in the United States and is released internationally on Disney+.\r\nThe show follows Bluey, an anthropomorphic six-year-old Blue Heeler puppy who is characterised by her abundance of energy, imagination and curiosity of the world. The young dog lives with her father, Bandit; mother, Chilli; and younger sister, Bingo, who regularly joins Bluey on adventures as the pair embark on imaginative play together. Other characters featured each represent a different dog breed. Overarching themes include the focus on family, growing up and Australian culture. The program was created and is produced in Queensland; its capital city Brisbane inspires the show's setting.\r\nBluey has received consistently high viewership in Australia on both broadcast television and video on demand services. It has influenced the development of merchandise and a stage show featuring its characters. The program has won two Logie Awards for Most Outstanding Children's Program as well as an International Emmy Kids Award in 2019. It has been praised by television critics for depicting a modern everyday family life, constructive parenting messages, and the role of Bandit as a positive father figure.\r\nCharacters\r\nThe child characters of Bluey are voiced by children of the program's production crew and are not credited as voice performers.\r\nMain\r\nBluey Heeler, a six-year-old (later seven-year-old) Blue Heeler puppy. She is curious and energetic.\r\nBingo Heeler, Bluey's four-year-old (later five-year-old) younger sister, a Red Heeler puppy.\r\nBandit Heeler / Dad (voiced by David McCormack), the Blue Heeler father of Bluey and Bingo who is an archaeologist.\r\nChilli Heeler / Mum (voiced by Melanie Zanetti), the Red Heeler mother of Bluey and Bingo who works part-time in airport security.\r\nRecurring\r\nMuffin Heeler, Bluey and Bingo's three-year-old White Heeler cousin.\r\nSocks Heeler, Bluey and Bingo's one-year-old cousin and Muffin's sister, who is still learning to walk on two legs and talk.\r\nChloe, a kind and gentle Dalmatian who is Bluey's best friend.\r\nLucky, an energetic golden Labrador who is Bluey's next-door neighbour. He loves sports and playing with his father.\r\nHoney, a thoughtful beagle who is Bluey's friend. She is sometimes shy and requires encouragement to fully participate.\r\nMackenzie, an adventurous Border Collie who is Bluey's friend from school, and originally from New Zealand.\r\nCoco, a pink poodle who is Bluey's friend. She is sometimes impatient when playing games.\r\nSnickers, a dachshund who is Bluey's friend. He has an interest in science.\r\nRusty, a Red Kelpie from the bush, whose father is in the army.\r\nIndy, an imaginative and free-spoken Afghan Hound.\r\nWinton, an English Bulldog who is Bluey's friend from school.\r\nBuddy, a Fawn Pug who is in Bingo's kindergarten class.\r\nJudo, a Chow Chow who lives next door to the Heelers, and is domineering over Bluey and Bingo during gameplay.\r\nThe Terriers, triplet Miniature Schnauzer brothers.\r\nJack Russell, a lively Jack Russell Terrier with attention deficit issues.\r\nLila, a kind-hearted young Maltese who becomes Bingo's best friend at kindergarten.\r\nPom Pom, a timid Pomeranian who is Bluey and Bingo's friend. She is small but hardy, and often looked down upon due to her small size.\r\nUncle Stripe Heeler (voiced by Dan Brumm), Bandit's younger brother and the father of Muffin and Socks.\r\nAunt Trixie Heeler (voiced by Myf Warhurst), Uncle Stripe's wife and the mother of Muffin and Socks. Warhurst also voices Indy's Mum, an Afghan Hound who sells organic baked goods at the market.\r\nWarhurst also voices Indy's Mum, an Afghan Hound who sells organic baked goods at the market.\r\nMrs. Retriever (voiced by Ann Kerr), a Golden Retriever and Bingo's kindergarten teacher.\r\nCalypso (voiced by Megan Washington), a Blue Merle Australian Shepherd and Bluey's school teacher.\r\nPat / Lucky's Dad (voiced by Brad Elliot), a Labrador Retriever and Lucky's father, who lives next door to the Heelers, and often involves himself in their gameplay.\r\nChris Heeler / Nana (voiced by Chris Brumm), Bandit and Stripe's mother, and grandmother to their children.\r\nBob Heeler (voiced by Ian McFadyen), Bandit and Stripe's father, and grandfather to their children.\r\nUncle Radley \"Rad\" Heeler (voiced by Patrick Brammall), Bandit and Stripe's brother, a cross between a Red and Blue Heeler, who works away on an oil rig.\r\nFrisky (voiced by Claudia O'Doherty), Bluey's godmother, who develops a relationship with Uncle Rad.\r\nMort / Grandad (voiced by Laurie Newman), Chilli's father, and Bluey and Bingo's grandfather, who served in the army when he was younger.\r\nWendy (voiced by Beth Durack, series 1–2; Emily Taheny, series 3) a Chow Chow and Judo's mother, who lives next door to the Heelers, and is often disrupted by or inadvertently involved with their gameplay.\r\nDoreen (voiced by Kelly Butler), an elderly Great Pyrenees who lives down the street from the Heelers.\r\nNotable guests\r\nSurfer (voiced by Layne Beachley), a Shetland Sheepdog with a passion for surfing.\r\nPostie (voiced by Anthony Field), a Catahoula Leopard Dog who works as a post office employee.Field also voices Rusty's Dad, a Red Kelpie who is in the army.\r\nField also voices Rusty's Dad, a Red Kelpie who is in the army.\r\nJack's Mum and Dad (voiced by Zoë Foster Blake and Hamish Blake), a pair of Jack Russell Terriers.\r\nAlfie (voiced by Robert Irwin), a dingo who works as a customer service assistant at the toy store.\r\nBella / Coco's Mum (voiced by Leigh Sales), a pink poodle and Coco's mother, who is friends with Chilli.\r\nMajor Tom (voiced by Lin-Manuel Miranda), a horse next to Bluey's school which is given a voice within Calypso's retelling of events.\r\nBrandy (voiced by Rose Byrne), Chilli's older sister, a Red Heeler, who has been absent from the Heeler family for four years.\r\nDevelopment\r\nConception\r\nIn July 2017, the Australian Broadcasting Corporation (ABC) and the British Broadcasting Corporation (BBC) co-commissioned Bluey as an animated series for preschool children to be developed by Queensland production company Ludo Studio. The production received funding from Screen Australia and Screen Queensland, with the setting of the series drawing upon the unique semi-tropical Queensland climate. Created by Joe Brumm, the series was inspired by his experience in raising two daughters. Brumm wanted to portray the importance of children participating in imaginative play, creating the title character Bluey as a Cattle Dog to give the series an Australian voice. Brumm had previously worked on children's programs in the United Kingdom as a freelance animator and decided to create Bluey as a replica of the program Peppa Pig for an Australian audience. He conceived the idea independently in 2016, and produced a one-minute pilot through his company Studio Joho, with a small team in their spare time. Brumm approached Ludo Studio to develop the series; co-founders Charlie Aspinwall and Daley Pearson pitched the pilot at conferences such as MIPCOM in France. Brumm stated that the first pilot contained some \"dangerous\" character behaviours which drew the attention of studio executives; this included Bandit pushing Bluey and Bingo on a swing in an unsafe way. Pearson expressed that it was difficult to pitch the series as it was not high-concept; but rather \"just a show about family and games\".\r\nThe studio developed a five-minute animation sample that was pitched at the Asian Animation Summit in Brisbane in 2016, and was thereby noticed by ABC and BBC executives. Michael Carrington of the ABC viewed the presentation and secured $20,000 of funding for the studio to produce a refined, seven-minute pilot. The new pilot was presented at the Asian Animation Summit in 2017. The two networks officially ordered 52 seven-minute episodes of Bluey, with the BBC investing 30 percent of the funding and acquiring the global rights for distribution and merchandising. The series was produced entirely in Australia by a local team, many of whom were first-time animators from Brisbane. The program was announced to premiere in Australia on ABC Kids, followed by CBeebies.\r\nProduction\r\nWriting\r\n\"There's no counting in Bluey, there's no learning this or that ... just show 'em playing. It's to show parents that the kids aren't just mucking around. They're learning to play, learning to share ... and generally you can just put your feet up and let 'em do it.\"\r\n—Joe Brumm, 2019\r\nThe stories featured in Bluey depict Bluey and Bingo engaging in imaginative play. Brumm wanted to show that self-directed and unstructured play is natural in shaping children and allowing them to develop. He consulted research based on socio-dramatic play, reading the works of Sara Smilansky and Vivian Paley, who both had backgrounds in early childhood education. The episodes show the parents as guides for their children, who allow them to explore their immediate surroundings independently, giving them opportunities to practise adult roles. Brumm drew inspiration for scripts from his own experiences in watching his daughters play, which he described was \"as natural to them as breathing\". The program's scripts show how children can use gameplay to learn lessons and integrate the world of adults into their own; Brumm noticed how his children would recreate interactions such as visits to the doctor, through roleplay. Pearson stated that gameplay represents children's first experiences of collaboration, cooperation, responsibility and emotions such as jealousy. Brumm discovered the importance of play-based learning after his daughter struggled with formal education, which led him to exclude elements of literacy and numeracy in Bluey and focus on the depiction of life skills. Brumm stated that he wanted the series to depict his experience as a parent rather than aim for children to be explicitly taught something. His creative aims were to make children laugh, and show parents what children can learn while engaged in play.\r\nThe characters of Bluey each represent a particular dog breed, some of which are drawn from Brumm's personal life. Brumm had a Blue Heeler named Bluey throughout his childhood, in addition to a Dalmatian named Chloe. Bandit is based on a Blue Heeler belonging to his father's friend. Bandit's career as an archaeologist was inspired by Brumm's older sibling Adam.\r\nBrumm writes the majority of episode scripts, with Aspinwall labelling the series as an \"observational\" show, depicting Brumm's family life, and producer Sam Moor describing it as \" life on screen\"; when producing the pilot, Brumm's daughters were aged between four and six, like Bluey and Bingo. Brumm's process for writing sometimes begins with making notes about his family's experiences; including games his children play and the conflict that arises between them. For this reason, Brumm has described the process as a challenge for other writers on the series. Moor stated that there are few writers besides Brumm, mostly animators already working on the series. The program was designed to be a co-viewing experience for parents and their children to enjoy together. Brumm described the process of writing each episode as \"a chance to make a short film\". The conflict and humour in the episodes stems from Bandit's relationship with his daughters. Bluey has been described as \"rough and tumble\" by Pearson, with both her and Bingo being seen to subvert the stereotypes of female characters, but rather have the characteristics of real puppies. This has led to uninformed viewers questioning if the characters are boys or girls. Pearson has credited the decision of Bluey and Bingo being girls to resemble the real families of Brumm, Aspinwall and McCormack. In relation to the humour of the series, Brumm has stated there is a lot of physical activity and \"craziness\".\r\nStoryboarding and animation\r\nBluey is animated in-house at Ludo Studio in Brisbane, in Fortitude Valley, where approximately 50 people work on the program. Costa Kassab serves as one of the art directors of the series, who has been credited with drawing the locations of the series which are based on real places in Brisbane, including parks and shopping centres. Locations featured in the series have included Queen Street Mall and South Bank, as well as landmarks such as The Big Pelican on the Noosa River. Brumm determines the specific locations which are to be included. Post-production of the series takes place externally in South Brisbane.\r\nApproximately fifteen episodes of the series are developed by the studio at any one time across a range of production stages. After story ideas are conceived, the script-writing process takes place for up to two months. The episodes are then storyboarded by artists, who produce 500 to 800 drawings over three weeks while consulting the writer's script. After the storyboard is finished, a black and white animatic is produced, to which the dialogue recorded independently by voice artists is added. The episodes are then worked on for four weeks by animators, background artists, designers, and layout teams. The entire production team views a near-completed episode of Bluey on a Friday. Pearson stated that over time, the viewings developed into test screenings where members of production would bring their family, friends and children to watch the episode. The complete production process for an episode takes three to four months. Moor described the program's colour palette as \"a vibrant pastel\".\r\nDuring the lockdown period of the COVID-19 pandemic, the production staff of 50 were required to work on the episodes remotely from home. A skeleton crew of three remained working on the series at the studio. After restrictions eased in May, this number increased to ten and later 20. Production on the third series concluded in April 2022.\r\nCasting\r\nThe series features David McCormack, from the band Custard, as the voice of Bluey's father, Bandit. He was initially approached to read what he assumed would only be \"a couple of lines\", but ended up voicing Bandit for the entire pilot. McCormack performs his voice work for the series remotely in Sydney, which is then sent to the production company in Brisbane. He stated that he does not hear any other voice actors or view footage while recording, and that he does not alter his own voice to produce Bandit's dialogue. Melanie Zanetti provides the voice of Bluey's mother, Chilli; she became interested in the series after reading the script for the pilot.\r\nBrumm's mother, Chris Brumm, voices Nana Heeler, while his younger brother, Dan Brumm, voices Uncle Stripe, as well as working as a sound designer on the series. The child characters of the series, including Bluey and Bingo, are voiced by some of the children of the program's production crew.\r\nMusic\r\nJoff Bush serves as the primary composer of Bluey, writing half of the soundtrack himself and leading a group of additional composers, including David Barber. Bush graduated from the Queensland Conservatorium, where he met Pearson, and before Bluey worked on series such as The Family Law and Australian Survivor. Bush has stated that each episode has its own unique musical style, and he likes to become involved in the episodes as they are scripted. Live instruments are regularly played for the recordings. Every episode of Bluey is individually scored, a decision made by Brumm, who was inspired by the original compositions for Charlie and Lola while working on the series in the United Kingdom. Classical music is regularly used throughout the underscore, with pieces such as Beethoven's \"Ode to Joy\" and Mozart's \"Rondo Alla Turca (from Sonata No. 11)\" being interpreted by composers. A movement from The Planets by Gustav Holst is prominently featured in the episode \"Sleepytime\".\r\nBush composed the theme song for Bluey, and he has been nominated for several APRA Screen Music Awards, in 2019 for the soundtrack of the episode \"Teasing\" and in 2020 for \"Flat Pack\". He was nominated for the APRA Award for Most Performed Screen Composer – Overseas in 2022, and the show's score won Best Music for Children's Programming in 2021. The music for Bluey is licensed by Universal Music Publishing on behalf of BBC Worldwide Music Publishing. The first soundtrack for the series by Bush, Bluey: The Album, was released on 22 January 2021. It debuted at number one on the ARIA Albums Chart, and became the first children's album to reach the top of the charts in Australia. It won Best Children's Album at the 2021 ARIA Music Awards, and won the 2021 APRA Award for Best Soundtrack Album. A second soundtrack, Dance Mode!, was released on 21 April 2023.\r\nThemes\r\nA central theme of the series is the influence of a supportive family; this is reflected in the relationships between Bluey, Bingo, Bandit and Chilli. The Heeler family are presented as a nuclear family. Brumm was eager to reflect contemporary parenting practices, with both adults shown to be working parents; Bandit as an archaeologist and Chilli working part-time in airport security. Bethany Hiatt of The West Australian explains that the series depicts the realities of modern-day fatherhood, with Bandit seen regularly doing housework and engaging in imaginative play with his children. Chilli's role as a mother is explored as she balances both work and family life. Her struggles with newborn motherhood and encounters of competitiveness in a parenting group are depicted through flashbacks of Bluey experiencing significant developmental milestones. Both parents are shown to acknowledge and validate the emotions of their children, such as Bluey's distress after the death of a bird. Bluey and Bingo are shown to navigate their sibling relationship throughout the episodes, learning how to work together, compromise, and resolve conflicts. Episodes detail the family's contemporary domestic lifestyle, with Philippa Chandler of The Guardian describing the series as \"social realism\".\r\nThe series also depicts Australian contemporary culture, and is set in semi-tropical Queensland. The animation of Australian architecture in the series is designed to reflect the typical Queenslander residential designs of Brisbane; high-set suburban dwellings with characteristic verandas, against representations of Brisbane skylines. The characters speak with Australian accents in local and international airings. The series has a focus on the Australian sense of humour with dry wit frequently expressed through the dialogue. Several episodes detail the exploration of Australia's climate and nature, with characters encountering Australian wildlife such as fruit bats, wallabies, kookaburras and ibises. Flora of Australia are also depicted in the series, including Poinciana trees and Jacaranda trees. The series explores Australian sport through the inclusion of rugby league; the Maroons and the Blues are featured in a depiction of the State of Origin series. However, Brumm has expressed that he did not want to exaggerate the stereotypes of Australia.\r\nThe series advocates the importance of play throughout childhood. Bluey and Bingo are the vehicle used to display this theme; the episode \"Trampoline\" features Bandit imploring Bluey to continue creating new games to play. The siblings engage in imaginative play during \"mundane\" activities such as visiting the doctor or going to the supermarket. The parents are shown to engage in the play with their children. Bluey and Bingo also engage in imaginative play with their friends; learning lessons such as the importance of following the rules. The characters also learn lessons such as the influence of technology, the economy and personal finance through their gameplay. Pearson has stated that the characters experience emotions such as jealousy and regret through their gameplay. He commented that, while there is no antagonist in the series, these emotions form the central conflicts of the program.\r\nThe character of Jack is shown to have attention deficit issues; he states that he \"can't sit still or remember anything\". Upon the online character announcement, parents praised the representation of children with attention deficit issues. Dougie was introduced as a profoundly deaf character who uses Auslan to communicate with his mother in the episode \"Turtleboy\"; the character is shown signing but it is not the focus of the episode's story. Consultants were involved to authentically animate the Auslan signs, and viewers praised the representation. The episode \"Onesies\" alludes to the fact that Chilli's sister Brandy cannot have children, addressing the topic of fertility without specifically labelling the reason why. It was also reported that \"The Show\" subtly approaches pregnancy loss.\r\nEpisodes\r\nThe first series premiered in Australia on ABC Kids on 1 October 2018, with 26 episodes airing daily throughout October. The following 25 episodes of the series began airing on 1 April 2019. The final episode of the first series, a Christmas special, aired on 12 December 2019. It was reported in March 2019 that production had begun on a second series of 52 episodes; the order was officially announced in May. The second series premiered on 17 March 2020, with the first 26 episodes airing daily, through April. The remaining episodes began airing on 25 October 2020, and were followed by a Christmas special which aired on 1 December 2020, and an Easter special airing on 4 April 2021. Preliminary discussions for the third series had begun by April 2020; the series order was made official in October. The third series began airing on 5 September 2021 with a Father's Day-themed special, followed by further episode blocks from 22 November 2021, and 13 June 2022. The series was moved to weekly episodes beginning 9 April 2023; episodes aired Sundays through June.\r\nRelease\r\nBroadcast\r\nIn June 2019, the international broadcasting rights to Bluey were acquired by The Walt Disney Company, with plans to premiere on the Disney Junior television network and be distributed on the Disney+ streaming service in all territories (excluding Australia, New Zealand and China) from late 2019. The series premiered on Disney Junior in the United States on 9 September 2019 and was later distributed on Disney+ on 22 January 2020 and in the United Kingdom on 1 October 2020. The series notably features the original voice actors while airing overseas, after producers were initially asked to replace the Australian accents of the characters. The second series debuted on Disney Channel in the United States on 10 July 2020. The distribution deal with Disney originally encompassed the first two series of the program; the third series was acquired in May 2021. The first half of the third series debuted on Disney+ in the United States, the United Kingdom, and other licensed territories on 10 August 2022, and was followed on Disney's television networks at a later date.\r\nIn October 2019, Bluey debuted in New Zealand, airing on TVNZ 2 and streaming on TVNZ OnDemand. The first series made its Australian pay-TV premiere on CBeebies on 4 May 2020. It made its free-to-air television debut on CBeebies in April 2021 in the United Kingdom, Singapore and Malaysia.\r\nHome media releases\r\nThe series was first distributed on DVD in Australia by Universal Sony Pictures Home Entertainment and BBC Studios, with the first two volumes, entitled Magic Xylophone and Other Stories and Horsey Ride and Other Stories released on 30 October 2019. They were followed by further volumes at later dates. In the United States, the first season was released on DVD in two volumes in early 2020. In the United Kingdom, the first volume was released on DVD in October 2021.\r\nReception\r\nCritical reception\r\nBluey has enjoyed a positive critical reception. The series received a seal of approval from Common Sense Media, with reviewer Emily Ashby commending its positive family and social themes. Bluey was praised by Philippa Chandler of The Guardian for its \"sharp script\" and depiction of everyday family life, while commenting that its Queensland background set it apart from other cartoons on television. Readers of The New York Times's parenting blog submitted Bluey as their favourite children's show, describing it as charming, smart and \"very real\". The series was called \"laugh-out-loud funny\" by Stephanie Convery of The Guardian, who credited its humour to the \"quirky behaviour\" of the child characters. In 2019, TV Week listed Bluey at number 98 in its list of the 101 greatest Australian television shows of all time. Despite only being on air since 2018, the magazine wrote that Bluey \"stole Australia's hearts faster than any other cartoon character\" in what it described as a \"cute, funny and modern\" series. The series was listed at number 14 in Junkee's list of 50 television programs that defined the decade, in which it was described as \"an absolute delight\". In a list published by Rolling Stone of the top 100 sitcoms of all time, Bluey was listed at number 96, the only Australian series to be featured. The episode \"Sleepytime\" has been well received, with director Richard Jeffery winning an Australian Directors' Guild Award in 2021, and the episode winning the 2022 Prix Jeunesse International Award in the category of TV – Up to 6 Years Fiction (Children's).\r\nThe series received praise for its constructive parenting messages and depiction of Bandit Heeler as a positive father figure. The character was commended for his patient nature, willingness to do housework and play with his children. Jennifer McClellan of USA Today described Bandit as \"sarcastic, sympathetic and silly\". He has been received as \"more emotionally intelligent\" than the father from Peppa Pig. Reporters for The Guardian wrote that the show's messages about parenting align with published literature on parental wellbeing, noting how the show depicts the importance of play and learning social skills in child development. McClellan acknowledged the family dynamic of the characters; she described Chilli as the \"voice of reason\" and noted how Bluey and Bingo learn to navigate their sibling relationship. Convery commented that the sisters are accurate depictions of children, and that the roles of the parents are not presented as stereotypical of their respective genders. The series has also received online praise for its representation of attention deficit issues through the character of Jack, and the inclusion of Auslan through Dougie, a profoundly deaf character.\r\nThe website of the series was criticised for, in the character description of Chilli, suggesting that her return to part-time work prevents her from being as involved a parent as other mothers; the description was later altered. A separate incident saw an apology issued by the ABC in August 2020 in relation to the usage of the term \"ooga booga\" in the episodes \"Teasing\" and \"Flat Pack\", which was described as a term with \"racial connotations and a problematic history for Indigenous Australians\" through a viewer complaint. The ABC claimed that the term had only been intended as \"irreverent rhyming slang made up by children\", and maintained their commitment to addressing discrimination. The two episodes were temporarily removed from rotations before being edited to remove the term, which prompted mixed reactions from viewers. Additionally, the episode \"Exercise\" was criticised on social media due to viewers perceiving a scene as fat-shaming, and the episode was later edited to remove the scene.\r\nViewership\r\nBluey has received consistently high viewership on ABC Kids in Australia, becoming the most watched children's program across all channels on broadcast television in 2018 and 2019. The highest-rating live broadcast of the program, the final episode of the second series, \"Easter\", premiered on 4 April 2021 to 607,000 viewers. It was the most-watched broadcast across all free-to-air multichannels, and the third most-watched broadcast overall. In 2019, the series was the most-watched program through time shifting.\r\nIn March 2019, it was reported that Bluey had become the most downloaded program in the history of ABC's video on demand and catch up TV service ABC iview, with 21.3 million total episode plays. Within one year of the show's premiere, this figure had risen to 152 million, and by May 2020, there had been 261 million plays of episodes from the first series. It was also reported that the second series had totalled 43 million episode plays by May. By May 2021, episodes from both series had generated over 480 million plays.\r\nAwards and nominations\r\nOther media\r\nBooks\r\nIn April 2019, BBC Studios entered a partnership with Penguin Random House Australia with a deal to publish three Bluey books before the end of 2019. \"The Beach\", \"Fruit Bat\", and a sticker activity book entitled \"Time to Play\", were released on 5 November 2019. All three books were recognised as the highest-selling releases in the weekly Australian book charts of November 2019, and had sold a combined total of 350,000 copies by January 2020. The combined sales of the first nine books reached 1 million in June 2020; and the figure for all books had reached 5 million by October 2022. In September 2020, the partnership with Penguin Random House was expanded to include global distribution rights, allowing the books to be released in the United States and the United Kingdom.\r\nMerchandise\r\nMoose Toys was named as the global toy partner for Bluey in June 2019; the company announced that toys would be released in Australia by the end of 2019, and later in the United States. Plush character toys of Bluey and Bingo were released in November, and a character figurine set was released in December. The plush Bluey topped the Toys \"R\" Us release chart of Christmas 2019, while the demand for the plush Bingo exceeded the number of toys being supplied to stores. By December, over 100,000 plush character toys had been sold in Australia. The toy line was launched in the United States in June 2020.\r\nIn January 2020, Bluey partnered with Bonds to release a clothing range for children, including pyjamas and socks featuring character designs. A more comprehensive clothing range was made available at Australian retailers in March, including clothing, sleepwear and underwear. A range of adult pyjamas were released in May 2020 through Peter Alexander stores, which became the fastest selling collection in the retailer's history. Commemorative birth certificates featuring Bluey artwork were made available to Queensland residents from March. Bauer Media Group released the first issue of a monthly Bluey magazine in May. A lifestyle range of children's furniture was released in June 2020.\r\nStage show\r\nIt was announced that a stage show based on Bluey was being developed in November 2019. The live stage show, titled Bluey's Big Play, toured in fifty theatres around Australia and featured the characters from the series. The tour was initially scheduled to begin in May 2020, but was delayed due to restrictions relating to the COVID-19 pandemic. After eased restrictions, two preview performances were held at the Canberra Theatre Centre in January 2021 before further shows across the country. Bluey's Big Play also toured the United States, debuting at the Hulu Theater at Madison Square Garden in November 2022.\r\nOther\r\nA balloon of the Bluey character appeared at Macy's Thanksgiving Day Parade in November 2022. A companion podcast produced by the ABC entitled Behind Bluey was first released on 10 April 2023, in which Brumm and other creatives discuss the production of the series and its latest episodes.",
    "html": "<p>Bluey is an Australian preschool animated television series that premiered on ABC Kids on 1 October 2018. The program was created by Joe Brumm and is produced by Queensland-based company Ludo Studio. It was commissioned by the Australian Broadcasting Corporation and the British Broadcasting Corporation, with BBC Studios holding global distribution and merchandising rights. The series made its premiere on Disney Junior in the United States and is released internationally on Disney+.</p><p>The show follows Bluey, an anthropomorphic six-year-old Blue Heeler puppy who is characterised by her abundance of energy, imagination and curiosity of the world. The young dog lives with her father, Bandit; mother, Chilli; and younger sister, Bingo, who regularly joins Bluey on adventures as the pair embark on imaginative play together. Other characters featured each represent a different dog breed. Overarching themes include the focus on family, growing up and Australian culture. The program was created and is produced in Queensland; its capital city Brisbane inspires the show's setting.</p><p>Bluey has received consistently high viewership in Australia on both broadcast television and video on demand services. It has influenced the development of merchandise and a stage show featuring its characters. The program has won two Logie Awards for Most Outstanding Children's Program as well as an International Emmy Kids Award in 2019. It has been praised by television critics for depicting a modern everyday family life, constructive parenting messages, and the role of Bandit as a positive father figure.</p><br/><h3>Characters</h3><p>The child characters of Bluey are voiced by children of the program's production crew and are not credited as voice performers.</p><h4>Main</h4><ul><li>Bluey Heeler, a six-year-old (later seven-year-old) Blue Heeler puppy. She is curious and energetic.</li><li>Bingo Heeler, Bluey's four-year-old (later five-year-old) younger sister, a Red Heeler puppy.</li><li>Bandit Heeler / Dad (voiced by David McCormack), the Blue Heeler father of Bluey and Bingo who is an archaeologist.</li><li>Chilli Heeler / Mum (voiced by Melanie Zanetti), the Red Heeler mother of Bluey and Bingo who works part-time in airport security.</li></ul><h4>Recurring</h4><ul><li>Muffin Heeler, Bluey and Bingo's three-year-old White Heeler cousin.</li><li>Socks Heeler, Bluey and Bingo's one-year-old cousin and Muffin's sister, who is still learning to walk on two legs and talk.</li><li>Chloe, a kind and gentle Dalmatian who is Bluey's best friend.</li><li>Lucky, an energetic golden Labrador who is Bluey's next-door neighbour. He loves sports and playing with his father.</li><li>Honey, a thoughtful beagle who is Bluey's friend. She is sometimes shy and requires encouragement to fully participate.</li><li>Mackenzie, an adventurous Border Collie who is Bluey's friend from school, and originally from New Zealand.</li><li>Coco, a pink poodle who is Bluey's friend. She is sometimes impatient when playing games.</li><li>Snickers, a dachshund who is Bluey's friend. He has an interest in science.</li><li>Rusty, a Red Kelpie from the bush, whose father is in the army.</li><li>Indy, an imaginative and free-spoken Afghan Hound.</li><li>Winton, an English Bulldog who is Bluey's friend from school.</li><li>Buddy, a Fawn Pug who is in Bingo's kindergarten class.</li><li>Judo, a Chow Chow who lives next door to the Heelers, and is domineering over Bluey and Bingo during gameplay.</li><li>The Terriers, triplet Miniature Schnauzer brothers.</li><li>Jack Russell, a lively Jack Russell Terrier with attention deficit issues.</li><li>Lila, a kind-hearted young Maltese who becomes Bingo's best friend at kindergarten.</li><li>Pom Pom, a timid Pomeranian who is Bluey and Bingo's friend. She is small but hardy, and often looked down upon due to her small size.</li><li>Uncle Stripe Heeler (voiced by Dan Brumm), Bandit's younger brother and the father of Muffin and Socks.</li><li>Aunt Trixie Heeler (voiced by Myf Warhurst), Uncle Stripe's wife and the mother of Muffin and Socks. Warhurst also voices Indy's Mum, an Afghan Hound who sells organic baked goods at the market.</li><li>Warhurst also voices Indy's Mum, an Afghan Hound who sells organic baked goods at the market.</li><li>Mrs. Retriever (voiced by Ann Kerr), a Golden Retriever and Bingo's kindergarten teacher.</li><li>Calypso (voiced by Megan Washington), a Blue Merle Australian Shepherd and Bluey's school teacher.</li><li>Pat / Lucky's Dad (voiced by Brad Elliot), a Labrador Retriever and Lucky's father, who lives next door to the Heelers, and often involves himself in their gameplay.</li><li>Chris Heeler / Nana (voiced by Chris Brumm), Bandit and Stripe's mother, and grandmother to their children.</li><li>Bob Heeler (voiced by Ian McFadyen), Bandit and Stripe's father, and grandfather to their children.</li></ul><ul><li>Uncle Radley \"Rad\" Heeler (voiced by Patrick Brammall), Bandit and Stripe's brother, a cross between a Red and Blue Heeler, who works away on an oil rig.</li><li>Frisky (voiced by Claudia O'Doherty), Bluey's godmother, who develops a relationship with Uncle Rad.</li><li>Mort / Grandad (voiced by Laurie Newman), Chilli's father, and Bluey and Bingo's grandfather, who served in the army when he was younger.</li><li>Wendy (voiced by Beth Durack, series 1–2; Emily Taheny, series 3) a Chow Chow and Judo's mother, who lives next door to the Heelers, and is often disrupted by or inadvertently involved with their gameplay.</li><li>Doreen (voiced by Kelly Butler), an elderly Great Pyrenees who lives down the street from the Heelers.</li></ul><h4>Notable guests</h4><ul><li>Surfer (voiced by Layne Beachley), a Shetland Sheepdog with a passion for surfing.</li><li>Postie (voiced by Anthony Field), a Catahoula Leopard Dog who works as a post office employee.Field also voices Rusty's Dad, a Red Kelpie who is in the army.</li><li>Field also voices Rusty's Dad, a Red Kelpie who is in the army.</li><li>Jack's Mum and Dad (voiced by Zoë Foster Blake and Hamish Blake), a pair of Jack Russell Terriers.</li><li>Alfie (voiced by Robert Irwin), a dingo who works as a customer service assistant at the toy store.</li><li>Bella / Coco's Mum (voiced by Leigh Sales), a pink poodle and Coco's mother, who is friends with Chilli.</li><li>Major Tom (voiced by Lin-Manuel Miranda), a horse next to Bluey's school which is given a voice within Calypso's retelling of events.</li><li>Brandy (voiced by Rose Byrne), Chilli's older sister, a Red Heeler, who has been absent from the Heeler family for four years.</li></ul><br/><h3>Development</h3><h4>Conception</h4><p>In July 2017, the Australian Broadcasting Corporation (ABC) and the British Broadcasting Corporation (BBC) co-commissioned Bluey as an animated series for preschool children to be developed by Queensland production company Ludo Studio. The production received funding from Screen Australia and Screen Queensland, with the setting of the series drawing upon the unique semi-tropical Queensland climate. Created by Joe Brumm, the series was inspired by his experience in raising two daughters. Brumm wanted to portray the importance of children participating in imaginative play, creating the title character Bluey as a Cattle Dog to give the series an Australian voice. Brumm had previously worked on children's programs in the United Kingdom as a freelance animator and decided to create Bluey as a replica of the program Peppa Pig for an Australian audience. He conceived the idea independently in 2016, and produced a one-minute pilot through his company Studio Joho, with a small team in their spare time. Brumm approached Ludo Studio to develop the series; co-founders Charlie Aspinwall and Daley Pearson pitched the pilot at conferences such as MIPCOM in France. Brumm stated that the first pilot contained some \"dangerous\" character behaviours which drew the attention of studio executives; this included Bandit pushing Bluey and Bingo on a swing in an unsafe way. Pearson expressed that it was difficult to pitch the series as it was not high-concept; but rather \"just a show about family and games\".</p><p>The studio developed a five-minute animation sample that was pitched at the Asian Animation Summit in Brisbane in 2016, and was thereby noticed by ABC and BBC executives. Michael Carrington of the ABC viewed the presentation and secured $20,000 of funding for the studio to produce a refined, seven-minute pilot. The new pilot was presented at the Asian Animation Summit in 2017. The two networks officially ordered 52 seven-minute episodes of Bluey, with the BBC investing 30 percent of the funding and acquiring the global rights for distribution and merchandising. The series was produced entirely in Australia by a local team, many of whom were first-time animators from Brisbane. The program was announced to premiere in Australia on ABC Kids, followed by CBeebies.</p><h4>Production</h4><h4>Writing</h4><blockquote>\"There's no counting in Bluey, there's no learning this or that ... just show 'em playing. It's to show parents that the kids aren't just mucking around. They're learning to play, learning to share ... and generally you can just put your feet up and let 'em do it.\"</blockquote><p>—Joe Brumm, 2019</p><p>The stories featured in Bluey depict Bluey and Bingo engaging in imaginative play. Brumm wanted to show that self-directed and unstructured play is natural in shaping children and allowing them to develop. He consulted research based on socio-dramatic play, reading the works of Sara Smilansky and Vivian Paley, who both had backgrounds in early childhood education. The episodes show the parents as guides for their children, who allow them to explore their immediate surroundings independently, giving them opportunities to practise adult roles. Brumm drew inspiration for scripts from his own experiences in watching his daughters play, which he described was \"as natural to them as breathing\". The program's scripts show how children can use gameplay to learn lessons and integrate the world of adults into their own; Brumm noticed how his children would recreate interactions such as visits to the doctor, through roleplay. Pearson stated that gameplay represents children's first experiences of collaboration, cooperation, responsibility and emotions such as jealousy. Brumm discovered the importance of play-based learning after his daughter struggled with formal education, which led him to exclude elements of literacy and numeracy in Bluey and focus on the depiction of life skills. Brumm stated that he wanted the series to depict his experience as a parent rather than aim for children to be explicitly taught something. His creative aims were to make children laugh, and show parents what children can learn while engaged in play.</p><p>The characters of Bluey each represent a particular dog breed, some of which are drawn from Brumm's personal life. Brumm had a Blue Heeler named Bluey throughout his childhood, in addition to a Dalmatian named Chloe. Bandit is based on a Blue Heeler belonging to his father's friend. Bandit's career as an archaeologist was inspired by Brumm's older sibling Adam.</p><p>Brumm writes the majority of episode scripts, with Aspinwall labelling the series as an \"observational\" show, depicting Brumm's family life, and producer Sam Moor describing it as \" life on screen\"; when producing the pilot, Brumm's daughters were aged between four and six, like Bluey and Bingo. Brumm's process for writing sometimes begins with making notes about his family's experiences; including games his children play and the conflict that arises between them. For this reason, Brumm has described the process as a challenge for other writers on the series. Moor stated that there are few writers besides Brumm, mostly animators already working on the series. The program was designed to be a co-viewing experience for parents and their children to enjoy together. Brumm described the process of writing each episode as \"a chance to make a short film\". The conflict and humour in the episodes stems from Bandit's relationship with his daughters. Bluey has been described as \"rough and tumble\" by Pearson, with both her and Bingo being seen to subvert the stereotypes of female characters, but rather have the characteristics of real puppies. This has led to uninformed viewers questioning if the characters are boys or girls. Pearson has credited the decision of Bluey and Bingo being girls to resemble the real families of Brumm, Aspinwall and McCormack. In relation to the humour of the series, Brumm has stated there is a lot of physical activity and \"craziness\".</p><h4>Storyboarding and animation</h4><p>Bluey is animated in-house at Ludo Studio in Brisbane, in Fortitude Valley, where approximately 50 people work on the program. Costa Kassab serves as one of the art directors of the series, who has been credited with drawing the locations of the series which are based on real places in Brisbane, including parks and shopping centres. Locations featured in the series have included Queen Street Mall and South Bank, as well as landmarks such as The Big Pelican on the Noosa River. Brumm determines the specific locations which are to be included. Post-production of the series takes place externally in South Brisbane.</p><p>Approximately fifteen episodes of the series are developed by the studio at any one time across a range of production stages. After story ideas are conceived, the script-writing process takes place for up to two months. The episodes are then storyboarded by artists, who produce 500 to 800 drawings over three weeks while consulting the writer's script. After the storyboard is finished, a black and white animatic is produced, to which the dialogue recorded independently by voice artists is added. The episodes are then worked on for four weeks by animators, background artists, designers, and layout teams. The entire production team views a near-completed episode of Bluey on a Friday. Pearson stated that over time, the viewings developed into test screenings where members of production would bring their family, friends and children to watch the episode. The complete production process for an episode takes three to four months. Moor described the program's colour palette as \"a vibrant pastel\".</p><p>During the lockdown period of the COVID-19 pandemic, the production staff of 50 were required to work on the episodes remotely from home. A skeleton crew of three remained working on the series at the studio. After restrictions eased in May, this number increased to ten and later 20. Production on the third series concluded in April 2022.</p><h4>Casting</h4><p>The series features David McCormack, from the band Custard, as the voice of Bluey's father, Bandit. He was initially approached to read what he assumed would only be \"a couple of lines\", but ended up voicing Bandit for the entire pilot. McCormack performs his voice work for the series remotely in Sydney, which is then sent to the production company in Brisbane. He stated that he does not hear any other voice actors or view footage while recording, and that he does not alter his own voice to produce Bandit's dialogue. Melanie Zanetti provides the voice of Bluey's mother, Chilli; she became interested in the series after reading the script for the pilot.</p><p>Brumm's mother, Chris Brumm, voices Nana Heeler, while his younger brother, Dan Brumm, voices Uncle Stripe, as well as working as a sound designer on the series. The child characters of the series, including Bluey and Bingo, are voiced by some of the children of the program's production crew.</p><h4>Music</h4><p>Joff Bush serves as the primary composer of Bluey, writing half of the soundtrack himself and leading a group of additional composers, including David Barber. Bush graduated from the Queensland Conservatorium, where he met Pearson, and before Bluey worked on series such as The Family Law and Australian Survivor. Bush has stated that each episode has its own unique musical style, and he likes to become involved in the episodes as they are scripted. Live instruments are regularly played for the recordings. Every episode of Bluey is individually scored, a decision made by Brumm, who was inspired by the original compositions for Charlie and Lola while working on the series in the United Kingdom. Classical music is regularly used throughout the underscore, with pieces such as Beethoven's \"Ode to Joy\" and Mozart's \"Rondo Alla Turca (from Sonata No. 11)\" being interpreted by composers. A movement from The Planets by Gustav Holst is prominently featured in the episode \"Sleepytime\".</p><p>Bush composed the theme song for Bluey, and he has been nominated for several APRA Screen Music Awards, in 2019 for the soundtrack of the episode \"Teasing\" and in 2020 for \"Flat Pack\". He was nominated for the APRA Award for Most Performed Screen Composer – Overseas in 2022, and the show's score won Best Music for Children's Programming in 2021. The music for Bluey is licensed by Universal Music Publishing on behalf of BBC Worldwide Music Publishing. The first soundtrack for the series by Bush, Bluey: The Album, was released on 22 January 2021. It debuted at number one on the ARIA Albums Chart, and became the first children's album to reach the top of the charts in Australia. It won Best Children's Album at the 2021 ARIA Music Awards, and won the 2021 APRA Award for Best Soundtrack Album. A second soundtrack, Dance Mode!, was released on 21 April 2023.</p><br/><h3>Themes</h3><p>A central theme of the series is the influence of a supportive family; this is reflected in the relationships between Bluey, Bingo, Bandit and Chilli. The Heeler family are presented as a nuclear family. Brumm was eager to reflect contemporary parenting practices, with both adults shown to be working parents; Bandit as an archaeologist and Chilli working part-time in airport security. Bethany Hiatt of The West Australian explains that the series depicts the realities of modern-day fatherhood, with Bandit seen regularly doing housework and engaging in imaginative play with his children. Chilli's role as a mother is explored as she balances both work and family life. Her struggles with newborn motherhood and encounters of competitiveness in a parenting group are depicted through flashbacks of Bluey experiencing significant developmental milestones. Both parents are shown to acknowledge and validate the emotions of their children, such as Bluey's distress after the death of a bird. Bluey and Bingo are shown to navigate their sibling relationship throughout the episodes, learning how to work together, compromise, and resolve conflicts. Episodes detail the family's contemporary domestic lifestyle, with Philippa Chandler of The Guardian describing the series as \"social realism\".</p><p>The series also depicts Australian contemporary culture, and is set in semi-tropical Queensland. The animation of Australian architecture in the series is designed to reflect the typical Queenslander residential designs of Brisbane; high-set suburban dwellings with characteristic verandas, against representations of Brisbane skylines. The characters speak with Australian accents in local and international airings. The series has a focus on the Australian sense of humour with dry wit frequently expressed through the dialogue. Several episodes detail the exploration of Australia's climate and nature, with characters encountering Australian wildlife such as fruit bats, wallabies, kookaburras and ibises. Flora of Australia are also depicted in the series, including Poinciana trees and Jacaranda trees. The series explores Australian sport through the inclusion of rugby league; the Maroons and the Blues are featured in a depiction of the State of Origin series. However, Brumm has expressed that he did not want to exaggerate the stereotypes of Australia.</p><p>The series advocates the importance of play throughout childhood. Bluey and Bingo are the vehicle used to display this theme; the episode \"Trampoline\" features Bandit imploring Bluey to continue creating new games to play. The siblings engage in imaginative play during \"mundane\" activities such as visiting the doctor or going to the supermarket. The parents are shown to engage in the play with their children. Bluey and Bingo also engage in imaginative play with their friends; learning lessons such as the importance of following the rules. The characters also learn lessons such as the influence of technology, the economy and personal finance through their gameplay. Pearson has stated that the characters experience emotions such as jealousy and regret through their gameplay. He commented that, while there is no antagonist in the series, these emotions form the central conflicts of the program.</p><p>The character of Jack is shown to have attention deficit issues; he states that he \"can't sit still or remember anything\". Upon the online character announcement, parents praised the representation of children with attention deficit issues. Dougie was introduced as a profoundly deaf character who uses Auslan to communicate with his mother in the episode \"Turtleboy\"; the character is shown signing but it is not the focus of the episode's story. Consultants were involved to authentically animate the Auslan signs, and viewers praised the representation. The episode \"Onesies\" alludes to the fact that Chilli's sister Brandy cannot have children, addressing the topic of fertility without specifically labelling the reason why. It was also reported that \"The Show\" subtly approaches pregnancy loss.</p><br/><h3>Episodes</h3><p>The first series premiered in Australia on ABC Kids on 1 October 2018, with 26 episodes airing daily throughout October. The following 25 episodes of the series began airing on 1 April 2019. The final episode of the first series, a Christmas special, aired on 12 December 2019. It was reported in March 2019 that production had begun on a second series of 52 episodes; the order was officially announced in May. The second series premiered on 17 March 2020, with the first 26 episodes airing daily, through April. The remaining episodes began airing on 25 October 2020, and were followed by a Christmas special which aired on 1 December 2020, and an Easter special airing on 4 April 2021. Preliminary discussions for the third series had begun by April 2020; the series order was made official in October. The third series began airing on 5 September 2021 with a Father's Day-themed special, followed by further episode blocks from 22 November 2021, and 13 June 2022. The series was moved to weekly episodes beginning 9 April 2023; episodes aired Sundays through June.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Series</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"1\" rowspan=\"2\">52</td><td colspan=\"1\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">1 October 2018</td><td style=\"padding:0 8px\">26 October 2018</td></tr><tr style=\"height:100%\"><td colspan=\"1\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">1 April 2019</td><td style=\"padding:0 8px\">12 December 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"1\" rowspan=\"2\">52</td><td colspan=\"1\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">17 March 2020</td><td style=\"padding:0 8px\">11 April 2020</td></tr><tr style=\"height:100%\"><td colspan=\"1\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">25 October 2020</td><td style=\"padding:0 8px\">4 April 2021</td></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"4\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"1\" rowspan=\"4\">50</td><td colspan=\"1\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">5 September 2021</td><td style=\"padding:0 8px\">16 December 2021</td></tr><tr style=\"height:100%\"><td colspan=\"1\">11</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">13 June 2022</td><td style=\"padding:0 8px\">23 June 2022</td></tr><tr style=\"height:100%\"><td colspan=\"1\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">9 April 2023</td><td style=\"padding:0 8px\">11 June 2023</td></tr><tr style=\"height:100%\"><td colspan=\"1\">3</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">TBA</td><td style=\"padding:0 8px\">TBA</td></tr></tbody></table><br/><h3>Release</h3><h4>Broadcast</h4><p>In June 2019, the international broadcasting rights to Bluey were acquired by The Walt Disney Company, with plans to premiere on the Disney Junior television network and be distributed on the Disney+ streaming service in all territories (excluding Australia, New Zealand and China) from late 2019. The series premiered on Disney Junior in the United States on 9 September 2019 and was later distributed on Disney+ on 22 January 2020 and in the United Kingdom on 1 October 2020. The series notably features the original voice actors while airing overseas, after producers were initially asked to replace the Australian accents of the characters. The second series debuted on Disney Channel in the United States on 10 July 2020. The distribution deal with Disney originally encompassed the first two series of the program; the third series was acquired in May 2021. The first half of the third series debuted on Disney+ in the United States, the United Kingdom, and other licensed territories on 10 August 2022, and was followed on Disney's television networks at a later date.</p><p>In October 2019, Bluey debuted in New Zealand, airing on TVNZ 2 and streaming on TVNZ OnDemand. The first series made its Australian pay-TV premiere on CBeebies on 4 May 2020. It made its free-to-air television debut on CBeebies in April 2021 in the United Kingdom, Singapore and Malaysia.</p><h4>Home media releases</h4><p>The series was first distributed on DVD in Australia by Universal Sony Pictures Home Entertainment and BBC Studios, with the first two volumes, entitled Magic Xylophone and Other Stories and Horsey Ride and Other Stories released on 30 October 2019. They were followed by further volumes at later dates. In the United States, the first season was released on DVD in two volumes in early 2020. In the United Kingdom, the first volume was released on DVD in October 2021.</p><br/><h3>Reception</h3><h4>Critical reception</h4><p>Bluey has enjoyed a positive critical reception. The series received a seal of approval from Common Sense Media, with reviewer Emily Ashby commending its positive family and social themes. Bluey was praised by Philippa Chandler of The Guardian for its \"sharp script\" and depiction of everyday family life, while commenting that its Queensland background set it apart from other cartoons on television. Readers of The New York Times's parenting blog submitted Bluey as their favourite children's show, describing it as charming, smart and \"very real\". The series was called \"laugh-out-loud funny\" by Stephanie Convery of The Guardian, who credited its humour to the \"quirky behaviour\" of the child characters. In 2019, TV Week listed Bluey at number 98 in its list of the 101 greatest Australian television shows of all time. Despite only being on air since 2018, the magazine wrote that Bluey \"stole Australia's hearts faster than any other cartoon character\" in what it described as a \"cute, funny and modern\" series. The series was listed at number 14 in Junkee's list of 50 television programs that defined the decade, in which it was described as \"an absolute delight\". In a list published by Rolling Stone of the top 100 sitcoms of all time, Bluey was listed at number 96, the only Australian series to be featured. The episode \"Sleepytime\" has been well received, with director Richard Jeffery winning an Australian Directors' Guild Award in 2021, and the episode winning the 2022 Prix Jeunesse International Award in the category of TV – Up to 6 Years Fiction (Children's).</p><p>The series received praise for its constructive parenting messages and depiction of Bandit Heeler as a positive father figure. The character was commended for his patient nature, willingness to do housework and play with his children. Jennifer McClellan of USA Today described Bandit as \"sarcastic, sympathetic and silly\". He has been received as \"more emotionally intelligent\" than the father from Peppa Pig. Reporters for The Guardian wrote that the show's messages about parenting align with published literature on parental wellbeing, noting how the show depicts the importance of play and learning social skills in child development. McClellan acknowledged the family dynamic of the characters; she described Chilli as the \"voice of reason\" and noted how Bluey and Bingo learn to navigate their sibling relationship. Convery commented that the sisters are accurate depictions of children, and that the roles of the parents are not presented as stereotypical of their respective genders. The series has also received online praise for its representation of attention deficit issues through the character of Jack, and the inclusion of Auslan through Dougie, a profoundly deaf character.</p><p>The website of the series was criticised for, in the character description of Chilli, suggesting that her return to part-time work prevents her from being as involved a parent as other mothers; the description was later altered. A separate incident saw an apology issued by the ABC in August 2020 in relation to the usage of the term \"ooga booga\" in the episodes \"Teasing\" and \"Flat Pack\", which was described as a term with \"racial connotations and a problematic history for Indigenous Australians\" through a viewer complaint. The ABC claimed that the term had only been intended as \"irreverent rhyming slang made up by children\", and maintained their commitment to addressing discrimination. The two episodes were temporarily removed from rotations before being edited to remove the term, which prompted mixed reactions from viewers. Additionally, the episode \"Exercise\" was criticised on social media due to viewers perceiving a scene as fat-shaming, and the episode was later edited to remove the scene.</p><h4>Viewership</h4><p>Bluey has received consistently high viewership on ABC Kids in Australia, becoming the most watched children's program across all channels on broadcast television in 2018 and 2019. The highest-rating live broadcast of the program, the final episode of the second series, \"Easter\", premiered on 4 April 2021 to 607,000 viewers. It was the most-watched broadcast across all free-to-air multichannels, and the third most-watched broadcast overall. In 2019, the series was the most-watched program through time shifting.</p><p>In March 2019, it was reported that Bluey had become the most downloaded program in the history of ABC's video on demand and catch up TV service ABC iview, with 21.3 million total episode plays. Within one year of the show's premiere, this figure had risen to 152 million, and by May 2020, there had been 261 million plays of episodes from the first series. It was also reported that the second series had totalled 43 million episode plays by May. By May 2021, episodes from both series had generated over 480 million plays.</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>List of awards and nominations received by <i>Bluey</i></caption><tbody><tr style=\"background:#CCCCCC; text-align:center;\"><th scope=\"col\">Award</th><th scope=\"col\">Year</th><th scope=\"col\">Recipient(s) and nominee(s)</th><th scope=\"col\">Category</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference(s)\">Ref.</abbr></th></tr><tr><th scope=\"row\" rowspan=\"4\"><span>AACTA Awards</span></th><td><span>2019</span></td><td data-sort-value=\"Bluey\" rowspan=\"4\"><i>Bluey</i></td><td rowspan=\"4\"><span>Best Children's Program</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>2020</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>2021</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>2022</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" rowspan=\"5\"><span>APRA Screen Music Awards</span></th><td><span>2019</span></td><td data-sort-value=\"Bush, Joff (for\">Joff Bush (for \"Teasing\")</td><td rowspan=\"2\">Best Music for Children's Television</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>2020</span></td><td data-sort-value=\"Bush, Joff (for\">Joff Bush (for \"Flat Pack\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\"><span>2021</span></td><td data-sort-value=\"Bush, Joff\">Joff Bush</td><td>Best Music for Children's Programming</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\" rowspan=\"2\"></td></tr><tr><td data-sort-value=\"Bluey: The Album\"><i>Bluey: The Album</i></td><td>Best Soundtrack Album</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>2022</span></td><td data-sort-value=\"Bush, Joff\">Joff Bush</td><td>Most Performed Screen Composer – Overseas</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\"><span>ARIA Music Awards</span></th><td><span>2021</span></td><td data-sort-value=\"Bluey: The Album\"><i>Bluey: The Album</i></td><td><span>Best Children's Album</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" rowspan=\"2\">Asian Academy Creative Awards</th><td>2020</td><td data-sort-value=\"Bluey\"><i>Bluey</i></td><td rowspan=\"2\">Best Preschool Programme</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td>2022</td><td data-sort-value=\"Bluey (for\"><i>Bluey</i> (for \"Rain\" and \"Fairytale\")</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" rowspan=\"3\"><span>Australian Book Industry Awards</span></th><td rowspan=\"2\">2020</td><td data-sort-value=\"Bluey (for\" rowspan=\"2\"><i>Bluey</i> (for \"The Beach\", Penguin)</td><td>Children's Picture Book of the Year (Ages 0–6)</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td>Book of the Year</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>2021</td><td data-sort-value=\"Bluey (for\"><i>Bluey</i> (for \"The Creek\", Penguin)</td><td>Children's Picture Book of the Year (Ages 0–6)</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\"><span>Australian Directors' Guild</span> Awards</th><td>2021</td><td data-sort-value=\"Jeffery, Richard (for\">Richard Jeffery (for \"Sleepytime\")</td><td>Best Direction in a Children's TV or SVOD Drama Program Episode</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\">Australian Toy Association</th><td>2020</td><td data-sort-value=\"Bluey\"><i>Bluey</i> (Moose Toys)</td><td>Preschool License of the Year</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\"><span>BAFTA Children &amp; Young People Awards</span></th><td><span>2022</span></td><td data-sort-value=\"Bluey\"><i>Bluey</i></td><td><span>International</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\"><span>Banff World Media Festival</span> Rockie Awards</th><td>2021</td><td data-sort-value=\"Bluey\"><i>Bluey</i></td><td>Animation: Preschool (0–4)</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" rowspan=\"2\"><span>Critics' Choice Television Awards</span></th><td><span>2022</span></td><td data-sort-value=\"Bluey\"><i>Bluey</i></td><td rowspan=\"2\"><span>Best Animated Series</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>2023</span></td><td data-sort-value=\"Bluey\"><i>Bluey</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\"><span>International Emmy Kids Awards</span></th><td>2019</td><td data-sort-value=\"Bluey\"><i>Bluey</i></td><td><span>Kids: Preschool</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" rowspan=\"5\">Kidscreen Awards</th><td rowspan=\"4\">2021</td><td data-sort-value=\"Bluey\" rowspan=\"4\"><i>Bluey</i></td><td>Preschool Programming – Best Animated Series</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\" rowspan=\"4\"></td></tr><tr><td>Creative Talent – Best Directing</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Creative Talent – Best Writing</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Creative Talent – Best Music</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>2023</td><td data-sort-value=\"Bluey (for Series 3)\"><i>Bluey</i> (for Series 3)</td><td>Preschool  Programming – Best Animated Series</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" rowspan=\"2\"><span>Logie Awards</span></th><td><span>2019</span></td><td data-sort-value=\"Bluey\" rowspan=\"2\"><i>Bluey</i></td><td rowspan=\"2\"><span>Most Outstanding Children's Program</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>2022</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" rowspan=\"2\">Prix Jeunesse International Awards</th><td>2020</td><td data-sort-value=\"Bluey\"><i>Bluey</i></td><td rowspan=\"2\">TV – Up to 6 Years Fiction (Children's)</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>2022</td><td data-sort-value=\"Bluey (for\"><i>Bluey</i> (for \"Sleepytime\")</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" rowspan=\"3\"><span>Screen Producers Australia</span> Awards</th><td rowspan=\"2\">2019</td><td data-sort-value=\"Bluey\" rowspan=\"2\"><i>Bluey</i></td><td>Animated Series Production of the Year</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td>Screen Business Export of the Year</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won (Tied)</td></tr><tr><td>2022</td><td data-sort-value=\"Bluey (for Series 2)\"><i>Bluey</i> (for Series 2)</td><td>Children's Series Production of the Year</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\">TV Blackbox Awards</th><td>2021</td><td data-sort-value=\"Bluey\"><i>Bluey</i></td><td>Most Popular Children's Show</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" rowspan=\"4\"><span>TV Tonight</span> Awards</th><td>2019</td><td data-sort-value=\"Bluey\" rowspan=\"4\"><i>Bluey</i></td><td rowspan=\"4\">Best Kid's Show</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td>2020</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td>2021</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td>2022</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr></tbody></table><br/><h3>Other media</h3><h4>Books</h4><p>In April 2019, BBC Studios entered a partnership with Penguin Random House Australia with a deal to publish three Bluey books before the end of 2019. \"The Beach\", \"Fruit Bat\", and a sticker activity book entitled \"Time to Play\", were released on 5 November 2019. All three books were recognised as the highest-selling releases in the weekly Australian book charts of November 2019, and had sold a combined total of 350,000 copies by January 2020. The combined sales of the first nine books reached 1 million in June 2020; and the figure for all books had reached 5 million by October 2022. In September 2020, the partnership with Penguin Random House was expanded to include global distribution rights, allowing the books to be released in the United States and the United Kingdom.</p><h4>Merchandise</h4><p>Moose Toys was named as the global toy partner for Bluey in June 2019; the company announced that toys would be released in Australia by the end of 2019, and later in the United States. Plush character toys of Bluey and Bingo were released in November, and a character figurine set was released in December. The plush Bluey topped the Toys \"R\" Us release chart of Christmas 2019, while the demand for the plush Bingo exceeded the number of toys being supplied to stores. By December, over 100,000 plush character toys had been sold in Australia. The toy line was launched in the United States in June 2020.</p><p>In January 2020, Bluey partnered with Bonds to release a clothing range for children, including pyjamas and socks featuring character designs. A more comprehensive clothing range was made available at Australian retailers in March, including clothing, sleepwear and underwear. A range of adult pyjamas were released in May 2020 through Peter Alexander stores, which became the fastest selling collection in the retailer's history. Commemorative birth certificates featuring Bluey artwork were made available to Queensland residents from March. Bauer Media Group released the first issue of a monthly Bluey magazine in May. A lifestyle range of children's furniture was released in June 2020.</p><h4>Stage show</h4><p>It was announced that a stage show based on Bluey was being developed in November 2019. The live stage show, titled Bluey's Big Play, toured in fifty theatres around Australia and featured the characters from the series. The tour was initially scheduled to begin in May 2020, but was delayed due to restrictions relating to the COVID-19 pandemic. After eased restrictions, two preview performances were held at the Canberra Theatre Centre in January 2021 before further shows across the country. Bluey's Big Play also toured the United States, debuting at the Hulu Theater at Madison Square Garden in November 2022.</p><h4>Other</h4><p>A balloon of the Bluey character appeared at Macy's Thanksgiving Day Parade in November 2022. A companion podcast produced by the ABC entitled Behind Bluey was first released on 10 April 2023, in which Brumm and other creatives discuss the production of the series and its latest episodes.</p><br/>"
  },
  "errorMessage": ""
}