{
  "imDbId": "tt2937900",
  "title": "The Knick",
  "fullTitle": "The Knick (TV Series 2014–2015)",
  "type": "TVSeries",
  "year": "2014",
  "episodes": [
    {
      "id": "tt3270666",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Method and Madness",
      "image": "https://m.media-amazon.com/images/M/MV5BMzk4MzU2M2ItZTIyZC00NWQ0LThlYjAtYzJmNGQ4ZDAxNWU4XkEyXkFqcGdeQXVyMDM0MzU2NA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "8 Aug. 2014",
      "plot": "Dr Thackery is Chief Of Medicine in a 1900 New York hospital, The Kickerbocker, battling a cocaine addiction, high mortality rates and bureaucratic corruption to save lives in a world before antibiotics and blood transfusions.",
      "imDbRating": "8.3",
      "imDbRatingCount": "1655"
    },
    {
      "id": "tt3237960",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Mr. Paris Shoes",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU4Mzk3MTAwMV5BMl5BanBnXkFtZTgwNDAyNDU0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "15 Aug. 2014",
      "plot": "Already fuming over the hospital's faulty new electrical system, Thackery tasks Herman Barrow, The Knick's crooked superintendent, to deliver more cadavers so he and his team can test out novel surgical procedures. With more patients dying, Algernon offers to share a procedure he learned in France, but is rebuffed by Thackery and Everett. Cornelia addresses a typhoid-fever outbreak; Lucy is taken into Thackery's confidence; Sister Harriet breaks a taboo. Algernon finds an alternative way to perform his duties.",
      "imDbRating": "7.9",
      "imDbRatingCount": "1320"
    },
    {
      "id": "tt3237470",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "The Busy Flea",
      "image": "https://m.media-amazon.com/images/M/MV5BMjIzMjM4NjgzNV5BMl5BanBnXkFtZTgwOTk5NjA1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "22 Aug. 2014",
      "plot": "An old friend of Thackery's, Abbie Alford, arrives at the hospital seeking his help. She has lost most of her nose as the result of syphilis, which she acquired from her now absent husband. Thackery agrees to perform a skin graft. Drs. Gallinger and Chickering try to learn the surgical process Edwards offered to show them but are unable to do so. Dr. Edwards is looking to open a treatment center in his basement office during night hours to treat black patients. He has to face the realities of what he can accomplish with limited resources however. Herman Barrow faces ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "1212"
    },
    {
      "id": "tt3264168",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Where's the Dignity",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE4NTAxMTcwMl5BMl5BanBnXkFtZTgwMTg3MTE2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "5 Sep. 2014",
      "plot": "Dr. Edwards is finally invited into the surgical theater but Thackery makes it clear that he's only there to guide Dr. Gallinger through the procedure. Herman Barrow is making money any way he can including selling bodies. Cleary tells Sister Harriet they will be working together from now on and he will be finding her future clients. He'll also be keeping 60% of the proceeds. Cornelia accompanies the uncouth health inspector Jacob Speight as he begins his investigation into the recent cases of typhoid. Thackery has been avoiding his friend Abbie Alford even though her...",
      "imDbRating": "8.0",
      "imDbRatingCount": "1133"
    },
    {
      "id": "tt3264160",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "They Capture the Heat",
      "image": "https://m.media-amazon.com/images/M/MV5BMzAwNDY3NDA0NF5BMl5BanBnXkFtZTgwNjMzMjg2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "12 Sep. 2014",
      "plot": "Gangster Bunky Collier shows up at the Knick after one of his pimps is shot in the leg. Thackery is called in to perform the surgery and is surprised to find Edwards there at that early hour. Barrow uses the opportunity to get a reduction in what he owes. Edwards is still performing surgeries at night and experiments with silver thread as sutures. He's called to the Robertson home when his mother falls ill. Cornelia and Jacob Speight continue their interviews in the typhoid cases. After seeing a demonstration, Thackery argues in favor of acquiring an Edison x-ray ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1115"
    },
    {
      "id": "tt3270682",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "Start Calling Me Dad",
      "image": "https://m.media-amazon.com/images/M/MV5BMjEwOTkxNDg0M15BMl5BanBnXkFtZTgwMTMyODM3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "19 Sep. 2014",
      "plot": "Having lost yet another patient while performing a Cesarean section, Thackery develops a completely new method to reduce the bleeding and invites Bertie Chickering to help him experiment. Their new method works quite well. The Gallinger's baby is in hospital but declining rapidly. At the funeral, Mrs. Gallinger refuses to accept her daughter's death. Cornelia and Speight are making progress in tracking down the source of the typhoid outbreak and focus on Mary Mallon who made peach Melba for all those who fell sick. Barrow tries out a second hand x-ray machine and buys...",
      "imDbRating": "8.7",
      "imDbRatingCount": "1201"
    },
    {
      "id": "tt3246584",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "Get the Rope",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQzMDM0NDQ5MV5BMl5BanBnXkFtZTgwNjM5Njk3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "26 Sep. 2014",
      "plot": "A riot breaks out when a police officer is stabbed by a black man defending his wife. The employees of the Knickerbocker fight to protect the lives of blacks injured in the riots.",
      "imDbRating": "9.1",
      "imDbRatingCount": "1467"
    },
    {
      "id": "tt3264170",
      "seasonNumber": "1",
      "episodeNumber": "8",
      "title": "Working Late a Lot",
      "image": "https://m.media-amazon.com/images/M/MV5BMjM1NjI2MzUwNV5BMl5BanBnXkFtZTgwMzkyODk4MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "3 Oct. 2014",
      "plot": "Thackery's affair with Nurse Lucy Elkins continues. Bertie continues to pursue her. There is a shortage of cocaine due to the war in the Philippines and attacks on shipping. It has a detrimental effect of Thackery who goes into withdrawal. Fortunately, Lucy has a small supply but it's insufficient to his needs. Edwards and Cornelia continue their affair as well. 'Typhoid' Mary Mallon petitions the courts to set her free. The judge isn't convinced that a person can be asymptomatic and pass on the disease and so releases her. She's soon looking for a new job as a cook. ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1046"
    },
    {
      "id": "tt3270696",
      "seasonNumber": "1",
      "episodeNumber": "9",
      "title": "The Golden Lotus",
      "image": "https://m.media-amazon.com/images/M/MV5BNjgwNzA5NTg0Ml5BMl5BanBnXkFtZTgwNjEzODk4MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "10 Oct. 2014",
      "plot": "The Knick continues its slide into wrack and ruin, instigated by the recent riot and the cocaine shortage. Dr. Thackery is caught in a compromising position and Lucy in her efforts to help him begins her descent into possible hell as well. Dr. Thackery's secret addiction is no longer so secret after he commits and act of desperation. Dr. Gallinger's home life is falling to pieces and it looks like his temporary family unit has broken irretrievably apart. Cornelia is forced to turn to her black lover, Dr. Algernon, but he refuses to help her. Will the feisty nun ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "1053"
    },
    {
      "id": "tt3264172",
      "seasonNumber": "1",
      "episodeNumber": "10",
      "title": "Crutchfield",
      "image": "https://m.media-amazon.com/images/M/MV5BNmY2NmZhNjUtOGE1My00NzM0LThiODctNmI4MzFjZDJlYjg0XkEyXkFqcGdeQXVyMDM0MzU2NA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "17 Oct. 2014",
      "plot": "Thackery's drug habit is catching up with him. He is growing increasingly paranoid as he is unable to perform even when under the drug's influence. When he learns that Dr. Levi Zinberg is studying the properties of blood so that it can be typed and safely transfused, he sets out to find a solution before him. It leads to tragedy however. Cornelia is determined to terminate her pregnancy and is shocked when Cleary collects her and by the identity of the abortionist. It means the end of her relationship with Algie and she decides to proceed with her wedding. Algie deals...",
      "imDbRating": "8.9",
      "imDbRatingCount": "1229"
    }
  ],
  "errorMessage": ""
}