{
  "imDbId": "tt2937900",
  "title": "The Knick",
  "fullTitle": "The Knick (TV Series 2014–2015)",
  "type": "TVSeries",
  "year": "2014",
  "language": "en",
  "titleInLanguage": "The Knick",
  "url": "https://en.wikipedia.org/wiki/The_Knick",
  "plotShort": {
    "plainText": "The Knick is an American medical period drama television series on Cinemax created by Jack Amiel and Michael Begler and directed by Steven Soderbergh. The series follows Dr. John W. Thackery (Clive Owen) and the staff at a fictionalized version of the Knickerbocker Hospital (the Knick) in New York during the early twentieth century. Amiel and Begler wrote the majority of the episodes and are executive producers. Owen, Soderbergh, Gregory Jacobs, and Michael Sugar (Anonymous Content) were executive producers. Steven Katz was the supervising producer and also writer, Michael Polaire was the producer and David Kirchner the associate producer.\r\nThe show premiered on Cinemax on August 8, 2014. On July 10, 2014, Cinemax renewed The Knick for a ten-episode second season, which premiered on October 16, 2015. In March 2017, Cinemax announced the series was canceled.\r\nIn September 2020, Soderbergh confirmed that a new season of The Knick is in development led by Barry Jenkins and André Holland, who would return as his character Dr. Algernon C. Edwards, and that original creators Jack Amiel and Michael Begler have written a pilot episode.",
    "html": "<p>The Knick is an American medical period drama television series on Cinemax created by Jack Amiel and Michael Begler and directed by Steven Soderbergh. The series follows Dr. John W. Thackery (Clive Owen) and the staff at a fictionalized version of the Knickerbocker Hospital (the Knick) in New York during the early twentieth century. Amiel and Begler wrote the majority of the episodes and are executive producers. Owen, Soderbergh, Gregory Jacobs, and Michael Sugar (Anonymous Content) were executive producers. Steven Katz was the supervising producer and also writer, Michael Polaire was the producer and David Kirchner the associate producer.</p><p>The show premiered on Cinemax on August 8, 2014. On July 10, 2014, Cinemax renewed The Knick for a ten-episode second season, which premiered on October 16, 2015. In March 2017, Cinemax announced the series was canceled.</p><p>In September 2020, Soderbergh confirmed that a new season of The Knick is in development led by Barry Jenkins and André Holland, who would return as his character Dr. Algernon C. Edwards, and that original creators Jack Amiel and Michael Begler have written a pilot episode.</p>"
  },
  "plotFull": {
    "plainText": "The Knick is an American medical period drama television series on Cinemax created by Jack Amiel and Michael Begler and directed by Steven Soderbergh. The series follows Dr. John W. Thackery (Clive Owen) and the staff at a fictionalized version of the Knickerbocker Hospital (the Knick) in New York during the early twentieth century. Amiel and Begler wrote the majority of the episodes and are executive producers. Owen, Soderbergh, Gregory Jacobs, and Michael Sugar (Anonymous Content) were executive producers. Steven Katz was the supervising producer and also writer, Michael Polaire was the producer and David Kirchner the associate producer.\r\nThe show premiered on Cinemax on August 8, 2014. On July 10, 2014, Cinemax renewed The Knick for a ten-episode second season, which premiered on October 16, 2015. In March 2017, Cinemax announced the series was canceled.\r\nIn September 2020, Soderbergh confirmed that a new season of The Knick is in development led by Barry Jenkins and André Holland, who would return as his character Dr. Algernon C. Edwards, and that original creators Jack Amiel and Michael Begler have written a pilot episode.\r\nPremise\r\nIn New York City in 1900, the Knickerbocker Hospital operates with inventive surgeons, nurses and staff who struggle against the limitations of medical understanding and practice, to minimize morbidity and mortality. Dr. John Thackery (partially based on historical figure William Stewart Halsted), the new leader of the surgery staff, balances his cocaine and opium addictions against his ambition for medical discovery and his reputation among his peers. Dr. Algernon Edwards, a Harvard-educated Black American surgeon (probably based on the historical Daniel Hale Williams and Louis T. Wright) who trained in Paris, and is much more qualified than any other candidate, must fight for respect among the all-white hospital staff, as well as in the racially charged city. While struggling to keep the lights on, the hospital attempts to attract a wealthy clientele, without sacrificing quality of care.\r\nCast\r\nMain\r\nClive Owen as Dr. John W. \"Thack\" Thackery: Chief surgeon at the Knickerbocker Hospital, highly talented and respected in the operating room. He is also a drug addict, regularly injecting cocaine during the day and spending nights at a Chinatown opium den.\r\nAndré Holland as Dr. Algernon C. Edwards: New Black American assistant chief surgeon at the Knick. He manages a secret after-hours clinic in the basement for Black Americans, who ordinarily are turned away from the hospital. He encounters constant racism from White doctors and patients.\r\nJeremy Bobb as Herman Barrow: Manager of the Knick. He is constantly striving to finance the hospital with wealthy patrons and patients. Having mismanaged hospital funds, he is in debt to ruthless mobster Bunky Collier.\r\nJuliet Rylance as Cornelia Robertson: Head of the Knick's social welfare office. Daughter to Captain August Robertson, she serves as his representative on the board of directors. She is an old friend of Edwards, whose parents have worked for her family for years.\r\nEve Hewson as Lucy Elkins: Nurse at the Knick. A West Virginia native, she grows close to Thack and Bertie.\r\nMichael Angarano as Dr. Bertram \"Bertie\" Chickering, Jr.: A young surgeon at the Knick. He is the son of Dr. Bertram Chickering, Sr. who is displeased with his son's choice of hospitals and admiration of Thack.\r\nChris Sullivan as Tom Cleary: Ambulance driver. He augments his income by stealing possessions off those he picks up, as well as earning a fee from Barrow for delivering patients who can pay.\r\nCara Seymour as Sister Harriet: Catholic nun and midwife who runs the orphanage affiliated with the Knick. She secretly conducts abortions in her off-hours.\r\nEric Johnson as Dr. Everett Gallinger: Surgeon at the Knick. He resents Edwards for taking the assistant chief surgeon position, which Thack promised to Gallinger.\r\nDavid Fierro as Jacob Speight: Health department inspector. Although rude and abrasive, he works closely with Cornelia to identify the source of disease outbreaks.\r\nMaya Kazan as Eleanor Gallinger (née Walcott): Everett Gallinger's wife. The two have a baby daughter named Lillian.\r\nLeon Addison Brown as Jesse Edwards: Dr. Edwards' father who works for Captain Robertson as carriage driver.\r\nGrainger Hines as Captain August Robertson: Cornelia's father, a shipping tycoon and member of the Knick's board of directors. He is fond of Edwards and supports his medical career, which led to his appointment at the Knick.\r\nMatt Frewer as Dr. J. M. Christiansen: Former chief surgeon at the Knick and Thackery's mentor, who committed suicide after a fatal placenta previa operation. After his death, he appears in flashbacks and Thackery's visions. (season 1)\r\nZaraah Abrahams as Opal Edwards: Algernon's European wife. (season 2)\r\nCharles Aitken as Henry Robertson: Cornelia's brother. (recurring season 1, starring season 2)\r\nLaTonya Borsay as Evaline Edwards: Dr. Edwards' mother. (recurring season 1, starring season 2)\r\nRachel Korine as Junia: a local prostitute whom Barrow is in love with. (recurring season 1, starring season 2)\r\nTom Lipinski as Phillip Showalter: Cornelia's husband. (recurring season 1, starring season 2)\r\nMichael Nathanson as Dr. Levi Zinberg: Surgeon at Mount Sinai Hospital whom Thackery views as a rival. (recurring season 1, starring season 2)\r\nRecurring\r\nJennifer Ferrin as Abigail Alford: Thackery's former lover who comes to him seeking medical help.\r\nPerry Yung as Ping Wu: Owner of the opium den on Mott Street which Thackery frequents.\r\nReg Rogers as Dr. Bertram Chickering, Sr.: Bertie's father.\r\nSuzanne Savoy as Victoria Robertson: Cornelia's mother.\r\nGary Simpson as Hobart Showalter: Phillip's father.\r\nMolly Price as Effie Barrow: Herman's wife.\r\nJohanna Day as Eunice Showalter: Phillip's mother.\r\nHappy Anderson as Mr. James \"Jimmy\" Fester: Bunky Collier's associate.\r\nLucas Papaelias as Eldon Pouncey: Tom Cleary's colleague at the Knick.\r\nZuzanna Szadkowski as Nurse Pell: Nurse at the Knick.\r\nYlfa Edelstein as Nurse Baker: Nurse at the Knick.\r\nYing Ying Li as Lin-Lin: Prostitute owned by Ping Wu.\r\nFrank Wood as Mr. Havershorn\r\nRichard James Porter as Monsignor Joseph Mills Lawlor\r\nJohn Hodgman as Dr. Henry Cotton\r\nEmily Bergl as Mrs. Hemming: Dr. Thackery's patient. (season 1)\r\nDanny Hoch as Bunky Collier: New York mobster to whom Barrow is heavily indebted. (season 1)\r\nCollin Meath as Phineas \"Phinny\" Sears: Irish-born New York City cop who tries to figure out how to get his piece of the pie. (season 1)\r\nTom Papa as Luff (season 1)\r\nArielle Goldman as Genevieve Everidge: Investigative reporter. (season 2)\r\nStephen Spinella as A.D. Elkins: Revival preacher and Lucy's father. (season 2)\r\nLinda Emond as Anne Chickering: Bertie's mother. (season 2)\r\nNtare Guma Mbaho Mwine as D.W. Garrison Carr: an influential African-American intellectual. (season 2)\r\nEmily Kinney as Nurse Daisy Ryan. (season 2)\r\nAnnabelle Attanasio as Dorothy Walcott: Eleanor Gallinger's sister. (season 2)\r\nAndrew Rannells as Frazier H. Wingo: Architect of the new Knick. (season 2)\r\nBen Livingston as Dr. William H. Mays, a general practitioner who joins the Knick's surgical staff (season 2)\r\nColman Domingo as Dr. Russell Daniels. (season 2)\r\nFred Weller as Mr. Brockhurst (season 2)\r\nProduction\r\nProduction for season 1 began in September 2013 in New York City. Dr. Stanley Burns, founder and CEO of The Burns Archive, served as the on-set medical adviser on the series, and worked closely with production and the actors to make the hospital scenes realistic and authentic to the period. Images from the Burns Archive became important references for everything from the antiseptic atomizers in the operating theater to an early X-ray machine, to the prosthetic worn by a recurring character.\r\nJack Amiel and Michael Begler wrote the majority of the first-season episodes, and Steven Soderbergh directed all 10 episodes in the first season. Soderbergh was also the director of photography and editor, under his usual pseudonyms Peter Andrews and Mary Ann Bernard, respectively.\r\nAfter the conclusion of the second season on December 18, 2015, it was announced that Cinemax had ordered a script for the season three premiere and a season outline, with negotiations for a third season. In a December 2015 interview with director Steven Soderbergh, he confirmed that Dr. Thackery dies in the season two finale, and that it was all planned from the beginning, and Clive Owen only had a two-year contract for the series. Soderbergh also said, \"I told them that I'm going to do the first two years and then we are going to break out the story for seasons 3 and 4 and try to find a filmmaker or filmmakers to do this the way that I did. This is how we want to do this so that every two years, whoever comes on, has the freedom to create their universe.\" However, Soderbergh decided, depending upon what those future seasons were, he would like to direct them. \"We always envisioned The Knick in two-year increments and with the idea of annihilating what came before every two years. In a 2021 interview Soderbergh outlined his original plan for a six-season series that would involve substantial leaps in time. Seasons 3 and 4 were to be set in the post-WWII era and seasons 5 and 6 in the immediate future. The entire cast and characters were to change.\r\nIn March 2017, the series was officially canceled by Cinemax. Kary Antholis, Cinemax's program director, stated that \"espite our pride in and affection for the series, as well as our respect for and gratitude towards Steven Soderbergh and his team, we have decided to return Cinemax to its original primetime series fare of high-octane action dramas, many of which will be internationally co-produced.\"\r\nGallery\r\nFilming the show in Brooklyn\r\nActors in period clothing during filming\r\nSchool building dressed up as the Knickerbocker Hospital\r\nEpisodes\r\nReception\r\nThe first season of The Knick scored 75 out of 100 on Metacritic based on 37 \"generally favorable\" reviews. The review aggregator Rotten Tomatoes reports an 87% \"certified fresh\" critics rating with an average rating of 8.3/10 based on 170 reviews. The website consensus reads: \"The Knick is sincere, emotional period television that takes a down-to-earth, no-holds-barred approach to vital topics\".\r\nAfter the first season aired, IGN reviewer Matt Fowler gave it an 8.6 out of 10 score, saying \"The Knick was impressive, intense television - with fascinating, oft-gruesome topics brought ferociously to the forefront by Soderbergh's adept hand. It was hard to watch at times, both due to gore and pure depressing content, but it was always thought-provoking and incredibly well-rendered.\" Keith Uhlich of The A.V. Club named the episode \"Get the Rope\" as his seventh favorite motion picture of 2014.\r\nThe second season received critical praise. Metacritic scored it an 85 out of 100 based on 17 \"universal acclaim\" reviews. Rotten Tomatoes gave the second season a 97% approval rating with an average score of 8.55/10 based on 120 reviews, with the critical consensus: \"The Knick delivers an addictive second season with stunning visuals, knockout performances, and disturbing moments adding up to a period drama that's anything but dated.\"\r\nAccolades\r\nHome media\r\nThe first season was released on Blu-ray and DVD in region 1 on August 11, 2015. The set contains all 10 episodes, plus three audio commentaries by cast and crew, and two-minute behind-the-scenes featurettes for the episodes. The second season was released on Blu-ray and DVD in region 1 on August 2, 2016. Bonus features include several behind-the-scenes looks at the costumes and sets, including the extravagant ball constructed for the seventh episode, \"Williams and Walker\", as well as audio commentaries with cast and crew.",
    "html": "<p>The Knick is an American medical period drama television series on Cinemax created by Jack Amiel and Michael Begler and directed by Steven Soderbergh. The series follows Dr. John W. Thackery (Clive Owen) and the staff at a fictionalized version of the Knickerbocker Hospital (the Knick) in New York during the early twentieth century. Amiel and Begler wrote the majority of the episodes and are executive producers. Owen, Soderbergh, Gregory Jacobs, and Michael Sugar (Anonymous Content) were executive producers. Steven Katz was the supervising producer and also writer, Michael Polaire was the producer and David Kirchner the associate producer.</p><p>The show premiered on Cinemax on August 8, 2014. On July 10, 2014, Cinemax renewed The Knick for a ten-episode second season, which premiered on October 16, 2015. In March 2017, Cinemax announced the series was canceled.</p><p>In September 2020, Soderbergh confirmed that a new season of The Knick is in development led by Barry Jenkins and André Holland, who would return as his character Dr. Algernon C. Edwards, and that original creators Jack Amiel and Michael Begler have written a pilot episode.</p><br/><h3>Premise</h3><p>In New York City in 1900, the Knickerbocker Hospital operates with inventive surgeons, nurses and staff who struggle against the limitations of medical understanding and practice, to minimize morbidity and mortality. Dr. John Thackery (partially based on historical figure William Stewart Halsted), the new leader of the surgery staff, balances his cocaine and opium addictions against his ambition for medical discovery and his reputation among his peers. Dr. Algernon Edwards, a Harvard-educated Black American surgeon (probably based on the historical Daniel Hale Williams and Louis T. Wright) who trained in Paris, and is much more qualified than any other candidate, must fight for respect among the all-white hospital staff, as well as in the racially charged city. While struggling to keep the lights on, the hospital attempts to attract a wealthy clientele, without sacrificing quality of care.</p><br/><h3>Cast</h3><h4>Main</h4><ul><li>Clive Owen as Dr. John W. \"Thack\" Thackery: Chief surgeon at the Knickerbocker Hospital, highly talented and respected in the operating room. He is also a drug addict, regularly injecting cocaine during the day and spending nights at a Chinatown opium den.</li><li>André Holland as Dr. Algernon C. Edwards: New Black American assistant chief surgeon at the Knick. He manages a secret after-hours clinic in the basement for Black Americans, who ordinarily are turned away from the hospital. He encounters constant racism from White doctors and patients.</li><li>Jeremy Bobb as Herman Barrow: Manager of the Knick. He is constantly striving to finance the hospital with wealthy patrons and patients. Having mismanaged hospital funds, he is in debt to ruthless mobster Bunky Collier.</li><li>Juliet Rylance as Cornelia Robertson: Head of the Knick's social welfare office. Daughter to Captain August Robertson, she serves as his representative on the board of directors. She is an old friend of Edwards, whose parents have worked for her family for years.</li><li>Eve Hewson as Lucy Elkins: Nurse at the Knick. A West Virginia native, she grows close to Thack and Bertie.</li><li>Michael Angarano as Dr. Bertram \"Bertie\" Chickering, Jr.: A young surgeon at the Knick. He is the son of Dr. Bertram Chickering, Sr. who is displeased with his son's choice of hospitals and admiration of Thack.</li><li>Chris Sullivan as Tom Cleary: Ambulance driver. He augments his income by stealing possessions off those he picks up, as well as earning a fee from Barrow for delivering patients who can pay.</li><li>Cara Seymour as Sister Harriet: Catholic nun and midwife who runs the orphanage affiliated with the Knick. She secretly conducts abortions in her off-hours.</li><li>Eric Johnson as Dr. Everett Gallinger: Surgeon at the Knick. He resents Edwards for taking the assistant chief surgeon position, which Thack promised to Gallinger.</li><li>David Fierro as Jacob Speight: Health department inspector. Although rude and abrasive, he works closely with Cornelia to identify the source of disease outbreaks.</li><li>Maya Kazan as Eleanor Gallinger (née Walcott): Everett Gallinger's wife. The two have a baby daughter named Lillian.</li><li>Leon Addison Brown as Jesse Edwards: Dr. Edwards' father who works for Captain Robertson as carriage driver.</li><li>Grainger Hines as Captain August Robertson: Cornelia's father, a shipping tycoon and member of the Knick's board of directors. He is fond of Edwards and supports his medical career, which led to his appointment at the Knick.</li><li>Matt Frewer as Dr. J. M. Christiansen: Former chief surgeon at the Knick and Thackery's mentor, who committed suicide after a fatal placenta previa operation. After his death, he appears in flashbacks and Thackery's visions. (season 1)</li><li>Zaraah Abrahams as Opal Edwards: Algernon's European wife. (season 2)</li><li>Charles Aitken as Henry Robertson: Cornelia's brother. (recurring season 1, starring season 2)</li><li>LaTonya Borsay as Evaline Edwards: Dr. Edwards' mother. (recurring season 1, starring season 2)</li><li>Rachel Korine as Junia: a local prostitute whom Barrow is in love with. (recurring season 1, starring season 2)</li><li>Tom Lipinski as Phillip Showalter: Cornelia's husband. (recurring season 1, starring season 2)</li><li>Michael Nathanson as Dr. Levi Zinberg: Surgeon at Mount Sinai Hospital whom Thackery views as a rival. (recurring season 1, starring season 2)</li></ul><h4>Recurring</h4><ul><li>Jennifer Ferrin as Abigail Alford: Thackery's former lover who comes to him seeking medical help.</li><li>Perry Yung as Ping Wu: Owner of the opium den on Mott Street which Thackery frequents.</li><li>Reg Rogers as Dr. Bertram Chickering, Sr.: Bertie's father.</li><li>Suzanne Savoy as Victoria Robertson: Cornelia's mother.</li><li>Gary Simpson as Hobart Showalter: Phillip's father.</li><li>Molly Price as Effie Barrow: Herman's wife.</li><li>Johanna Day as Eunice Showalter: Phillip's mother.</li><li>Happy Anderson as Mr. James \"Jimmy\" Fester: Bunky Collier's associate.</li><li>Lucas Papaelias as Eldon Pouncey: Tom Cleary's colleague at the Knick.</li><li>Zuzanna Szadkowski as Nurse Pell: Nurse at the Knick.</li><li>Ylfa Edelstein as Nurse Baker: Nurse at the Knick.</li><li>Ying Ying Li as Lin-Lin: Prostitute owned by Ping Wu.</li><li>Frank Wood as Mr. Havershorn</li><li>Richard James Porter as Monsignor Joseph Mills Lawlor</li><li>John Hodgman as Dr. Henry Cotton</li><li>Emily Bergl as Mrs. Hemming: Dr. Thackery's patient. (season 1)</li><li>Danny Hoch as Bunky Collier: New York mobster to whom Barrow is heavily indebted. (season 1)</li><li>Collin Meath as Phineas \"Phinny\" Sears: Irish-born New York City cop who tries to figure out how to get his piece of the pie. (season 1)</li><li>Tom Papa as Luff (season 1)</li><li>Arielle Goldman as Genevieve Everidge: Investigative reporter. (season 2)</li><li>Stephen Spinella as A.D. Elkins: Revival preacher and Lucy's father. (season 2)</li><li>Linda Emond as Anne Chickering: Bertie's mother. (season 2)</li><li>Ntare Guma Mbaho Mwine as D.W. Garrison Carr: an influential African-American intellectual. (season 2)</li><li>Emily Kinney as Nurse Daisy Ryan. (season 2)</li><li>Annabelle Attanasio as Dorothy Walcott: Eleanor Gallinger's sister. (season 2)</li><li>Andrew Rannells as Frazier H. Wingo: Architect of the new Knick. (season 2)</li><li>Ben Livingston as Dr. William H. Mays, a general practitioner who joins the Knick's surgical staff (season 2)</li><li>Colman Domingo as Dr. Russell Daniels. (season 2)</li><li>Fred Weller as Mr. Brockhurst (season 2)</li></ul><br/><h3>Production</h3><p>Production for season 1 began in September 2013 in New York City. Dr. Stanley Burns, founder and CEO of The Burns Archive, served as the on-set medical adviser on the series, and worked closely with production and the actors to make the hospital scenes realistic and authentic to the period. Images from the Burns Archive became important references for everything from the antiseptic atomizers in the operating theater to an early X-ray machine, to the prosthetic worn by a recurring character.</p><p>Jack Amiel and Michael Begler wrote the majority of the first-season episodes, and Steven Soderbergh directed all 10 episodes in the first season. Soderbergh was also the director of photography and editor, under his usual pseudonyms Peter Andrews and Mary Ann Bernard, respectively.</p><p>After the conclusion of the second season on December 18, 2015, it was announced that Cinemax had ordered a script for the season three premiere and a season outline, with negotiations for a third season. In a December 2015 interview with director Steven Soderbergh, he confirmed that Dr. Thackery dies in the season two finale, and that it was all planned from the beginning, and Clive Owen only had a two-year contract for the series. Soderbergh also said, \"I told them that I'm going to do the first two years and then we are going to break out the story for seasons 3 and 4 and try to find a filmmaker or filmmakers to do this the way that I did. This is how we want to do this so that every two years, whoever comes on, has the freedom to create their universe.\" However, Soderbergh decided, depending upon what those future seasons were, he would like to direct them. \"We always envisioned The Knick in two-year increments and with the idea of annihilating what came before every two years. In a 2021 interview Soderbergh outlined his original plan for a six-season series that would involve substantial leaps in time. Seasons 3 and 4 were to be set in the post-WWII era and seasons 5 and 6 in the immediate future. The entire cast and characters were to change.</p><p>In March 2017, the series was officially canceled by Cinemax. Kary Antholis, Cinemax's program director, stated that \"espite our pride in and affection for the series, as well as our respect for and gratitude towards Steven Soderbergh and his team, we have decided to return Cinemax to its original primetime series fare of high-octane action dramas, many of which will be internationally co-produced.\"</p><ul><li>Gallery</li><li>Filming the show in Brooklyn</li><li>Actors in period clothing during filming</li><li>School building dressed up as the Knickerbocker Hospital</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">August 8, 2014</td><td style=\"padding:0 8px\">October 17, 2014</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 16, 2015</td><td style=\"padding:0 8px\">December 18, 2015</td></tr></tbody></table><br/><h3>Reception</h3><p>The first season of The Knick scored 75 out of 100 on Metacritic based on 37 \"generally favorable\" reviews. The review aggregator Rotten Tomatoes reports an 87% \"certified fresh\" critics rating with an average rating of 8.3/10 based on 170 reviews. The website consensus reads: \"The Knick is sincere, emotional period television that takes a down-to-earth, no-holds-barred approach to vital topics\".</p><p>After the first season aired, IGN reviewer Matt Fowler gave it an 8.6 out of 10 score, saying \"The Knick was impressive, intense television - with fascinating, oft-gruesome topics brought ferociously to the forefront by Soderbergh's adept hand. It was hard to watch at times, both due to gore and pure depressing content, but it was always thought-provoking and incredibly well-rendered.\" Keith Uhlich of The A.V. Club named the episode \"Get the Rope\" as his seventh favorite motion picture of 2014.</p><p>The second season received critical praise. Metacritic scored it an 85 out of 100 based on 17 \"universal acclaim\" reviews. Rotten Tomatoes gave the second season a 97% approval rating with an average score of 8.55/10 based on 120 reviews, with the critical consensus: \"The Knick delivers an addictive second season with stunning visuals, knockout performances, and disturbing moments adding up to a period drama that's anything but dated.\"</p><br/><h3>Accolades</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"vertical-align:bottom;\"><th scope=\"col\">Ceremony</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient(s)</th><th scope=\"col\">Result</th></tr><tr><td><span>72nd Golden Globe Awards</span></td><td><span>Best Actor – Television Series Drama</span></td><td><span>Clive Owen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span>19th Satellite Awards</span></td><td><span class=\"mw-redirect\">Best Drama Series</span></td><td><i>The Knick</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor in a Drama Series</span></td><td>Clive Owen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor in a Series, Miniseries or TV Film</span></td><td><span class=\"mw-redirect\">Andre Holland</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Ensemble</span></td><td>Clive Owen, Andre Holland, <span>Jeremy Bobb</span>, <span>Juliet Rylance</span>, <span>Eve Hewson</span>, <span>Michael Angarano</span>, <span>Chris Sullivan</span>, <span>Cara Seymour</span>, <span>Eric Johnson</span>, <span>David Fierro</span>, <span>Maya Kazan</span>, Leon Addison Brown, <span>Grainger Hines</span>, and <span>Matt Frewer</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Writers Guild of America Awards 2014</span></td><td><span>New Series</span></td><td><i>The Knick</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">74th Peabody Awards</span></td><td><span class=\"mw-redirect\">Peabody Award</span></td><td><i>The Knick</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\"><span>67th Primetime Emmy Awards</span></td><td><span>Outstanding Directing for a Drama Series</span></td><td><span>Steven Soderbergh</span> for \"Method and Madness\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Production Design for a Narrative Period Program</td><td>Howard Cumming, Henry Dunn, and Regina Graves for \"Method and Madness\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">tied</td></tr><tr><td>Outstanding Hairstyling for a Single-Camera Series</td><td>Jerry DeCarlo, Rose Chatterton, Suzy Mazzarese Allison, Victor De Nicola, and Christine Cantrell for \"Get the Rope\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Makeup for a Single-Camera Series (Non-Prosthetic)</td><td>Nicki Ledermann, Stephanie Pasicov, Sunday Englis, Cassandra Saulter, Michael Laudati, and LuAnn Claps for \"Method and Madness\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Prosthetic Makeup for a Series, Limited Series, Movie or a Special</td><td>Justin Raleigh, Kevin Kirkpatrick, Kelly Golden, Ozzy Alvarez, Danielle Noe, Bernie Eichholz, Michael Ezell, and Kodai Yoshizawa for \"Crutchfield\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span class=\"mw-redirect\">6th Critics' Choice Television Awards</span></td><td><span>Best Drama Series</span></td><td><i>The Knick</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Drama Series</span></td><td>Clive Owen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor in a Drama Series</span></td><td>Andre Holland</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>68th Directors Guild of America Awards</span></td><td><span>Outstanding Directing – Drama Series</span></td><td>Steven Soderbergh for \"Williams and Walker\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>68th Primetime Emmy Awards</span></td><td>Outstanding Directing for a Drama Series</td><td>Steven Soderbergh for \"This Is All We Are\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><br/><h3>Home media</h3><p>The first season was released on Blu-ray and DVD in region 1 on August 11, 2015. The set contains all 10 episodes, plus three audio commentaries by cast and crew, and two-minute behind-the-scenes featurettes for the episodes. The second season was released on Blu-ray and DVD in region 1 on August 2, 2016. Bonus features include several behind-the-scenes looks at the costumes and sets, including the extravagant ball constructed for the seventh episode, \"Williams and Walker\", as well as audio commentaries with cast and crew.</p><br/>"
  },
  "errorMessage": ""
}