{
  "imDbId": "tt5189670",
  "title": "Making a Murderer",
  "fullTitle": "Making a Murderer (TV Series 2015–2018)",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "SpankyWardOnAmazonPrime",
      "userUrl": "https://www.imdb.com/user/ur23862217",
      "reviewLink": "https://www.imdb.com/review/rw4408818",
      "warningSpoilers": false,
      "date": "20 October 2018",
      "rate": "10",
      "helpful": "136 out of 157 found this helpful.",
      "title": "More addictive than chocolate.",
      "content": "I should have been in bed 5 hours ago but I can't stop watching the new chapter of the Avery Saga. The miscarriage of justice is frighteningly insurmountable. Being a screenwriter, if this were a movie I was going to write, I would never have been able to use this plot. I wouldn't have believed an audience would accept such a series of ludacris events like the mishandling and planting of evidence, unethical prosecutorial actions and the total and complete lack of ability to self examine their actions, due to fear. Fear because they've fully committed to their guilty story and if found innocent, how bad they'll look."
    },
    {
      "username": "TheLeon1897",
      "userUrl": "https://www.imdb.com/user/ur36929500",
      "reviewLink": "https://www.imdb.com/review/rw4331539",
      "warningSpoilers": false,
      "date": "10 September 2018",
      "rate": "10",
      "helpful": "116 out of 132 found this helpful.",
      "title": "A deep look into the terrible American justice system.",
      "content": "This is one of the best documentaries ever created and a must-watch for everybody. The story is so insane and unbelievable that you would think this is a piece of fictional work, but it is not.The only thing that could have been made a bit better is the episode running-time, sometimes the episodes feel a bit too long. --9 out of 10 stars--"
    },
    {
      "username": "nagasaki-98019",
      "userUrl": "https://www.imdb.com/user/ur92208226",
      "reviewLink": "https://www.imdb.com/review/rw4348875",
      "warningSpoilers": false,
      "date": "20 September 2018",
      "rate": "10",
      "helpful": "112 out of 127 found this helpful.",
      "title": "Disturbing",
      "content": "You need to watch this to see what are the autorities capable to do to protect them self"
    },
    {
      "username": "moway1114",
      "userUrl": "https://www.imdb.com/user/ur20704709",
      "reviewLink": "https://www.imdb.com/review/rw4417785",
      "warningSpoilers": true,
      "date": "24 October 2018",
      "rate": "10",
      "helpful": "179 out of 193 found this helpful.",
      "title": "Get ready to change your mind.",
      "content": "As a rule I do not believe much of what I see on TV or the news for that matter, but part 2 changed it all for me . This series was thought provoking,filled with intrigue and at times terrifying.The thought that this kind of witch hunt can still happen and does happen with more regularity than I would like to admit,is a horrifying reality. Part 1 made me sit up and listen...part 2 left no doubt. If you were on the fence about part 1,watch part 2. Kathleen Zellner rips apart the prosecutions case; step by step,point by point, with real science,a team of REAL experts and an unstoppable need to expose the corruption,seek out the truth and bring attention to the gross violation of human rights. How is that for a run on sentence?! I could not catch my breath while writing this...I felt the same way watching it."
    },
    {
      "username": "mactbc",
      "userUrl": "https://www.imdb.com/user/ur92374968",
      "reviewLink": "https://www.imdb.com/review/rw4334284",
      "warningSpoilers": false,
      "date": "12 September 2018",
      "rate": "10",
      "helpful": "144 out of 164 found this helpful.",
      "title": "Unbelievable true story.",
      "content": "After watching this I will never set foot in the State of Wisconsin. What was done to this man was a fate worse than death. I am normally a supporter of the police but not in WI."
    },
    {
      "username": "nicksholl",
      "userUrl": "https://www.imdb.com/user/ur1076365",
      "reviewLink": "https://www.imdb.com/review/rw4417843",
      "warningSpoilers": false,
      "date": "24 October 2018",
      "rate": "10",
      "helpful": "80 out of 93 found this helpful.",
      "title": "Kathleen Zellner brings hope...",
      "content": "....don't mess with Avery's new lawyer. Her relentless and intelligent approach leaves no stone unturned and has brought much astounding new evidence to light.I was impressed by the 2 original lawyers in Part 1, but they come across feeble and impenetrable compared to her.Exploding to see the corruption finally get unfolded- this show has clearly taken the world by storm, and I pray justice and the truth will be brought to light."
    },
    {
      "username": "vasiln",
      "userUrl": "https://www.imdb.com/user/ur59843574",
      "reviewLink": "https://www.imdb.com/review/rw3376217",
      "warningSpoilers": false,
      "date": "20 December 2015",
      "rate": "10",
      "helpful": "263 out of 347 found this helpful.",
      "title": "The best true crime legal documentary ever made",
      "content": "Making a Murderer documents the true story of Steven Avery, sent to prison under questionable circumstances, exonerated on DNA evidence 18 years later, and accused of murder shortly thereafter under equally questionable circumstances.MaM, ten hours long, is gripping throughout. The story is revealed chronologically, paced so perfectly to leave the viewer gasping at regular intervals, yet never feeling manipulated. But make no mistake: the filmmakers do have an opinion. And by the end of MaM, it is an opinion you will share.The comparisons to gems like Paradise Lost and The Jinx are inevitable. Up until now, Paradise Lost represented the pinnacle of the genre; MaM tells its story similarly, yet surpasses PL. Where The Jinx, an otherwise excellent documentary, left me with a bad taste, feeling that the truth played second fiddle to its filmmakers' ambitions, MaM never focuses on its creators. The drama is narrated only by the players, the argument made convincingly by historical footage, media and police manipulation made plain not by rhetoric, but by the simple evidence provided by context.Avery's story, as presented in MaM, is a horrifying story that leaves one infuriated at law enforcement, politicians, and news media. Not generally one for righteous indignation, this was the first series I've ever watched from which I had to take regular breaks out of sheer rage. Avery's story is not a pleasant or uplifting one. But it is as well-told as any I've seen."
    },
    {
      "username": "thomassmith74",
      "userUrl": "https://www.imdb.com/user/ur53826463",
      "reviewLink": "https://www.imdb.com/review/rw4424199",
      "warningSpoilers": false,
      "date": "28 October 2018",
      "rate": "10",
      "helpful": "67 out of 78 found this helpful.",
      "title": "2+2=5. Orwell was right.",
      "content": "This is an incredible documentary. There is no doubt that Steven Avery was framed by the police in order to prevent the $36M law suit. I wonder how long this will go on until the State of Wisconsin admits to the unbelievable injustice of Avery and the corruption of its officers. This also proves how much power lies in the State and how they really can do whatever they want, and how they control all authorities across it's jurisdiction."
    },
    {
      "username": "eogeaux",
      "userUrl": "https://www.imdb.com/user/ur54941028",
      "reviewLink": "https://www.imdb.com/review/rw4413388",
      "warningSpoilers": false,
      "date": "22 October 2018",
      "rate": "10",
      "helpful": "98 out of 116 found this helpful.",
      "title": "Just when you thought it couldn't get any worse",
      "content": "This documentary is incredible. It may seem a bit one sided but if you look at the list of people at the end who declined to be interviewed you will see why. You can't begrudge the producers for the other side not cooperating. That being said, the outcome is not very surprising. If you've paid any attention to America's justice system ..... ever ....you would understand that cops and judges are above the law and they can do whatever they want and they have zero accountability. This series just solidified that. Everyone is going to act angry and appalled but then never actually do anything about it. And it will continue and the \"good ol' boys\" will continue trampling on our basic \"freedoms and liberties.\" Yay USA!! *insert exaggerated eye roll here*"
    },
    {
      "username": "a_biltagi",
      "userUrl": "https://www.imdb.com/user/ur63007396",
      "reviewLink": "https://www.imdb.com/review/rw4418250",
      "warningSpoilers": false,
      "date": "25 October 2018",
      "rate": "10",
      "helpful": "148 out of 162 found this helpful.",
      "title": "OMG!",
      "content": "This documentary is insane! The best true crime documentary out there. It purely sheds light on the TRUTH of this nightmare of a case. Its infuriating to say the least. The American criminal justice system is SO corrupt, twisted, and flat out wrong for convicting Steven and Brenden to life for a crime they did not commit. EVERYONE needs to watch this documentary and be angry at how they were 100% framed.unbelievable."
    },
    {
      "username": "monastery27",
      "userUrl": "https://www.imdb.com/user/ur44598738",
      "reviewLink": "https://www.imdb.com/review/rw4411702",
      "warningSpoilers": false,
      "date": "21 October 2018",
      "rate": "10",
      "helpful": "42 out of 53 found this helpful.",
      "title": "Sickening",
      "content": "Planted evidence, multiple LE departments colluding to frame a target, coerced false confessions, unconscionable behaviors, ruined lives.Justice is an illusion, held hostage by those with twisted motives and the means to subvert it. Shocking, infuriating. But then again, this is one case which has come to light. Very possible this is a systemic ill within the US justice system, something we subconsciously tend to overlook since the repercussions, were it true, could be so shattering."
    },
    {
      "username": "Thomas_from_CA",
      "userUrl": "https://www.imdb.com/user/ur59634307",
      "reviewLink": "https://www.imdb.com/review/rw3375857",
      "warningSpoilers": false,
      "date": "20 December 2015",
      "rate": "10",
      "helpful": "332 out of 416 found this helpful.",
      "title": "Haunting; Unbelievable",
      "content": "It's hard to put into words how moving this documentary series was. The view of this work from 30,000 feet is perhaps that it is a beautiful but tragic depiction of the powerful versus the powerless in the context of the American criminal justice system, and a haunting reminder of what human beings are capable of when we believe the ends justify the means. The view on the ground - from a very intimate front row seat in Steven Avery's hometown of Manitowoc, WI - is that one man likely endured not one, but two of the most egregious injustices imaginable. One thing that sets this series apart from previous shows in this genre (like NPR's Serial) is that the producers never once make an appearance on camera, nor does the viewer ever hear their voices, at least not in a literal sense. Instead, they rely on interviews, court proceedings, news clips, and telephone and video recordings to tell the story, often against the backdrop of the Avery's family compound. In a simple and clean way, the series is beautifully shot. And the story itself... unbelievable. But even the most reasonable, even skeptical viewer will have to grapple with the theories put forward. Theories that would seem a reach at best if it weren't for the overwhelming hard evidence unfolding, on film, right before your eyes. I started out by saying that it was hard to describe how moving this documentary was, and I actually found myself transitioning through the same emotional states (albeit to a much lesser degree) that the key figures seemed to experience: from shock and disbelief to anger and ultimately to a sense of despair. To me, what separates television and film that constitutes true \"art\" from that which is merely entertaining, is that it reveals something perhaps not so obvious but nonetheless true about human nature or the human experience. This easily surpasses that standard, but what makes it particularly chilling is that this is not a carefully constructed fictional plot designed to pull our heart strings. This actually happened. And it happened to real a person. To a real family."
    },
    {
      "username": "deltaop",
      "userUrl": "https://www.imdb.com/user/ur22490110",
      "reviewLink": "https://www.imdb.com/review/rw3375304",
      "warningSpoilers": false,
      "date": "19 December 2015",
      "rate": "9",
      "helpful": "153 out of 231 found this helpful.",
      "title": "Gripping and at times almost unbelievable",
      "content": "This documentary series potentially depicts the greatest miscarriage of justice on American soil as the producers go out to prove that Stephen Avery, a Wisconsin resident, is purposely being made a scapegoat for crimes he did not commit.The series possesses the hallmark quality of Netflix's original programming:'bingeability'. Once you get a grasp of what it is all about, you just continue on with the flow until the documentary reaches its conclusion.An important point if you are coming fresh from the similar true crime series, The Jinx, then you might feel that this documentary series doesn't put as much emphasis on flair and reenactments. Instead the approach is based on journalistic substance with a lot of focus being placed on police reports, recordings, court documents etc. However, I found the series intro theme to be hauntingly beautiful. It really gets stuck inside your head.Like The Thin Blue Line, Murder on a Sunday Morning, and Paradise Lost documentaries before it, the approach is overwhelmingly in favor of the defendant. You feel like you are witnessing a great injustice unfold before your eyes. There is little room for you to argue that Avery is guilty. But with the amount of evidence both substantial and circumstantial presented in Avery's favor, there is certainly little to argue anyway.In conclusion, I would recommend this documentary to anyone into true crime. It really is well-prepared and worth a watch despite being a tad exhausting due to its length."
    },
    {
      "username": "pipo_brutal",
      "userUrl": "https://www.imdb.com/user/ur47804406",
      "reviewLink": "https://www.imdb.com/review/rw4293777",
      "warningSpoilers": false,
      "date": "19 August 2018",
      "rate": "10",
      "helpful": "78 out of 94 found this helpful.",
      "title": "Perfect portrait of the unreliability of the American Judicial System",
      "content": "This was one of the most heartbreaking, inhumane and irrational criminal cases I came across in my entire life.You will find two major types of reviews in here:1. The skeptic type, based on rational and logical analysis of all the evidence and framings towards Steven Avery and Brenden Dassen making them not guilty (attributing around 10/10 rating).2. The emotional type, based on irrational and illogical analysis of all the speeches and horror stories the prosecution, the police and the media told the public making them guilty (attributing around 01/10 rating). This documentary series is constructed to favour the skeptic type (1). However, reality favoured the emotional type (2).Living the American nightmare, shall them say.Enjoy this highly unbiased masterpiece."
    },
    {
      "username": "xtinec-nyc",
      "userUrl": "https://www.imdb.com/user/ur35666692",
      "reviewLink": "https://www.imdb.com/review/rw4104104",
      "warningSpoilers": true,
      "date": "25 March 2018",
      "rate": "10",
      "helpful": "36 out of 46 found this helpful.",
      "title": "Great doc movie",
      "content": "It is shocking to see how justice system was so twisted and it really disgusts me to see those shameless disgusting faces from police dept. It is a great film and I truly admire the team who documentaried the film and the lawyers who had courage and wisdom to defend Steven Avery. Although i was truly devastated when I saw the result and it's so depressing to see Avery's family had to suffer from all this non sense. It is so sad and disappointing to know how ugly this reality is."
    },
    {
      "username": "dinadavis-99505",
      "userUrl": "https://www.imdb.com/user/ur95288900",
      "reviewLink": "https://www.imdb.com/review/rw4462801",
      "warningSpoilers": false,
      "date": "16 November 2018",
      "rate": "9",
      "helpful": "123 out of 132 found this helpful.",
      "title": "Are the Authorities watching the same confession tapes as we are?",
      "content": "I've been binge watching this and I'm halfway thru season 2 and all I can say is I'm thoroughly disgusted with the cops, prosecutors, judges, jurors all of them. All one needs to do is watch the very 1st time Brendan's so-called confession tape was aired in the series! That CHILD had NO CLUE what the interrogators were talking about nor what they wanted him to say. This boy was, no IS so innocent, that when they started their LEADING questions regarding \"what happened around her head area\"...after a long bout of silence he responds quote: \"I CUT HER HAIR?\". That is how innocent and non-violent Brendan is. That the first thing he could think of ON HIS OWN was a freaking HAIRCUT!!! Those interrogators were SO frustrated by his obvious lack of knowledge of what happened to the poor woman that they announced for all of us to see THAT THEY TOLD HIM she was shot in the head. Haircut to a Bullet in the Brain. Despicable. Wisconsin is full of corrupt cops, prosecutors, state attorneys, forensic analysts, and judges...in at least TWO COUNTIES. SHAME ON YOU!"
    },
    {
      "username": "kiss_fans",
      "userUrl": "https://www.imdb.com/user/ur38205897",
      "reviewLink": "https://www.imdb.com/review/rw3376460",
      "warningSpoilers": false,
      "date": "20 December 2015",
      "rate": "10",
      "helpful": "222 out of 299 found this helpful.",
      "title": "This is one important documentary",
      "content": "This is one important documentary. This shows just how wrong the justice system is in America. Im from Sweden and did not know anything prior to this series. But If you have - like me, been reading and seeing other documentaries of this kind. You know this have happened several times. It makes me sick. When it comes to Brendan and his statement I immediately started to think about Jessie Misskelley. A boy with below average IQ and was one of three teenagers that got falsely accused of murdering three young boys in Memphis. He also made a \"confession\" after the cops had lured and guiding him towards what they wanted to hear. Anyway, I hope that one day, the truth will come out and the ones, that still walks free, get the judgement they deserve and that Brendan and Steven Avry will get their freedom back. This is something everyone should see. If I were a parent I would show it to my kids, if I was a teacher I would show it to my students. I will recommend it to everyone I know."
    },
    {
      "username": "elliotjeory",
      "userUrl": "https://www.imdb.com/user/ur69864183",
      "reviewLink": "https://www.imdb.com/review/rw4412190",
      "warningSpoilers": true,
      "date": "21 October 2018",
      "rate": "8",
      "helpful": "15 out of 22 found this helpful.",
      "title": "Season 2 review",
      "content": "Just as fascinating as the first. You want to finish it as soon as you start it to get all the information which makes it compelling viewing. The contributions from Steven's lawyer and Brendan's lawyers are the most interesting and there is a different theory to the murder that wasn't in the first one. It is also interesting to watch the timeline of events in Brendan's appeals and see the tricks prosecutors played in sealing their conviction. As for the alternative theory it makes you think and doubt the official explaination and it's up to you to draw your own conclusion but it makes a good series to watch and I highly recommend it."
    },
    {
      "username": "rasmusramsboel-891-696992",
      "userUrl": "https://www.imdb.com/user/ur49640241",
      "reviewLink": "https://www.imdb.com/review/rw3378161",
      "warningSpoilers": false,
      "date": "22 December 2015",
      "rate": "10",
      "helpful": "124 out of 194 found this helpful.",
      "title": "Bone chilling documentary",
      "content": "I'm speechless, just speechless.I checked out this documentary because it somehow struck a chord with me in some resemblance of True Detective.Only thing, this is real, which makes it so much more frightening.I sat through all episodes on end, while rewinding bits to get details I missed.Had it been fiction, it would have come off as too far out.Most engaging and chilling piece of documentary I've ever seen bar none.I'm still shaken and really disturbed."
    },
    {
      "username": "Michael-Hallows-Eve",
      "userUrl": "https://www.imdb.com/user/ur30274890",
      "reviewLink": "https://www.imdb.com/review/rw3377073",
      "warningSpoilers": false,
      "date": "21 December 2015",
      "rate": "9",
      "helpful": "72 out of 137 found this helpful.",
      "title": "One of the Best documentary series you'll ever see!",
      "content": "I've watched many Documentary TV series, I've seen 'The Jinx' and 'Paradise Lost' series, and this has to be as good, if not better. I've not been so wild, surprised, annoyed and upset over a TV show like this in years. What Steven Avery and his family goes through is amazing. I knew that some police departments in the U.S have 'questionable' tactics, and after seeing the 'Paradise Lost' series you see that, but you really do hope it's not a common thing. But then you see shows like this one, and it really makes you wonder, how systemic is it in some of the State Police departments? And if this is just one other example of it, how many other times have other Police Departments gotten away with doing this? How many innocent people are in jail right now? Then add to that the privatization of the prison systems, meaning they have to keep the incarceration rate to near capacity to make their profits, then it makes you wonder how many people have been incarcerated using false evidence or coerced confessions. The judicial system leaves a lot to be desired, I'll say that much. I highly recommend this documentary series. It will leave you flabbergasted, it did that for me. I'll give this a 9.5 out of 10."
    },
    {
      "username": "JoeKulik",
      "userUrl": "https://www.imdb.com/user/ur58945063",
      "reviewLink": "https://www.imdb.com/review/rw8096840",
      "warningSpoilers": false,
      "date": "28 April 2022",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "What A Clueless Family !!!",
      "content": "After viewing both Parts 1 & 2, I see the Avery family as basically honest hard working people, but they seem Incredibly Naive as well. I would even call them Clueless. When I first heard of this case in 2005, my immediate reaction was how Dumb poor Steven Avery was to continue living in the same county where he was wrongfully convicted, and the fact that he was pursuing a $33 Million lawsuit against the county at the same time made it seem Even More Dumb. The man obviously made himself a target for a police agency who he already knew to be corrupt.Now after viewing this excellent documentary, my conviction that Steven wasn't a very wise man is even reinforced. The same can be said for the whole Dumb Avery family. How could they have allowed Brendan or any family member be interviewed by police after Steven's second wrongful arrest in that county ??? No one in the Avery family was obligated to speak with police, yet they all kept blabbing themselves into trouble.I just can't believe that this honest hard working family didn't have someone close by who could've Smartened Them Up at some point."
    },
    {
      "username": "The_Boxing_Cat",
      "userUrl": "https://www.imdb.com/user/ur48586167",
      "reviewLink": "https://www.imdb.com/review/rw5423472",
      "warningSpoilers": false,
      "date": "20 January 2020",
      "rate": "10",
      "helpful": "9 out of 13 found this helpful.",
      "title": "The negative reviews haven't seen ALL THE EVIDENCE",
      "content": "Steven Avery was wrongly convicted and spent 18 years in prison. When he was freed he sued for over 30 million dollars. The powers that be didn't like that and was hell bent on locking him up- they planted evidence, got a FALSE confession out of a 16 year with an IQ of 80., he is completely innocent- everyone should see what these crooked cops did!Steven now has a top notch attorney and will prove his innocence. Kathleen Zellner took his case because she looked at the evidence and saw a gross miscarriage of justice- not only against Steven Avery, but also the victim Teresa Halbach who deserves to have peace.Later the District attorney was caught sexting with the girlfriend of a man that he was prosecuting (tried to exchange sex for her boyfriend's freedom! Yep, that's ALL true.The real killer is still at large -the cops and their ass kissers need to set down and have a great big fat meal of CROW.As MLK said, \"injustice anywhere, is injustice everywhere\"."
    },
    {
      "username": "ArthurGD3",
      "userUrl": "https://www.imdb.com/user/ur64477599",
      "reviewLink": "https://www.imdb.com/review/rw3379805",
      "warningSpoilers": false,
      "date": "24 December 2015",
      "rate": "10",
      "helpful": "86 out of 149 found this helpful.",
      "title": "Hard to believe this is a documentary not fiction",
      "content": "Halfway into this, every episode has me saying wow at least a handful of times. The fact that this is not fiction, it is Steven Avery's reality and all of close ones is nothing short of incredible.The obvious nature of this is not for the weak of mind or weak of emotion. More times than I can recall I became so frustrated with what I was watching, the sheer denial by the police of what was obviously taking place is mind-blowing.Trying to review this as what it is, a real life documentary shot over the course of many years is tough. It is very well shot and incredibly gripping and many times edge of your seat fascinating, easily putting the best drama shows to shame. It is so easy to get caught up in the series to the point that you forget this is not a make believe drama and that it's very much real.For fans of true crime who can stomach going through 10 episodes of this type of torture, nail biting real life drama, I highly recommend watching this and I applaud the creators for putting this out there to expose what goes on in law enforcement in this country and the real crimes that THEY get away with on a regular basis."
    },
    {
      "username": "heartyjoanna",
      "userUrl": "https://www.imdb.com/user/ur94305628",
      "reviewLink": "https://www.imdb.com/review/rw4417761",
      "warningSpoilers": false,
      "date": "24 October 2018",
      "rate": "10",
      "helpful": "54 out of 68 found this helpful.",
      "title": "Kathleen zellner",
      "content": "What a women ! She makes me feel powerful and strong ! Women to stand up for what they believe in ! It's so hard sometimes to be a women in this world ! she is in incredible! And so so strong !"
    },
    {
      "username": "jake_fantom",
      "userUrl": "https://www.imdb.com/user/ur48867866",
      "reviewLink": "https://www.imdb.com/review/rw3381525",
      "warningSpoilers": true,
      "date": "27 December 2015",
      "rate": "3",
      "helpful": "119 out of 246 found this helpful.",
      "title": "Less than it seems",
      "content": "I watched all ten episodes of this original Netflix series over the course of two days, which will give you an idea of how immersive and compelling it is. Why the low rating then? Simply because this documentary is not really a search for truth in the case of Steven Avery, now a convicted murderer, than it is a biased presentation of one side of the story — Avery's side. Ten minutes of fact checking after my binge viewing revealed a wealth of damning evidence, along with a disturbing picture of Avery's criminal history, that is nowhere mentioned in the documentary as it attempts successfully to portray him as a railroaded innocent, a victim of police corruption and duplicity. If anything, the documentary does provide an inescapable indictment of the Wisconsin criminal justice system — for that it gets 3 stars. You get a visceral sense of how powerless most indicted nobodies are before a system that is stacked against them. But at the end of the day, this documentary fails in its main task, which is to provide all the pertinent facts, and let viewers draw their own conclusions. For that reason, even though I enjoyed it from beginning to end, I feel it is essentially a waste of time — a slick presentation of a single point of view, with critical facts hidden when they support a different conclusion than the filmmakers clearly started with."
    }
  ],
  "errorMessage": ""
}