{
  "imDbId": "tt5189670",
  "title": "Making a Murderer",
  "fullTitle": "Making a Murderer (TV Series 2015–2018)",
  "type": "TVSeries",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "Making a Murderer",
  "url": "https://en.wikipedia.org/wiki/Making_a_Murderer",
  "plotShort": {
    "plainText": "Making a Murderer is an American true crime documentary television series written and directed by Laura Ricciardi and Moira Demos. The show tells the story of Steven Avery, a man from Manitowoc County, Wisconsin, who served 18 years in prison (1985–2003) after his wrongful conviction for the sexual assault and attempted murder of Penny Beerntsen. He was later charged with and convicted of the 2005 murder of Teresa Halbach. The connected story is that of Avery's nephew Brendan Dassey, who was accused and convicted as an accessory in the murder of Halbach.\r\nThe first season mainly chronicles the period between 1985 and 2007, portraying Avery's 1985 arrest and conviction, his subsequent exoneration and release in 2003, the civil lawsuit Avery filed against Manitowoc County, his 2005 arrest, and his ensuing trial and conviction in 2007. It also depicts the arrest, prosecution, and conviction of Dassey, focusing on the accusations of coercion and attorney ineptitude.\r\nThe second season explores the aftermath of both Avery's and Dassey's convictions, focusing on Avery's and Dassey's families, the investigation and findings of Avery's new attorney Kathleen Zellner, which supported the thesis of Avery's innocence and him being framed for the murder of Halbach, and Dassey's legal team's efforts in arguing that his confession was coerced by prosecutors and his constitutional rights were violated.\r\nThe first season premiered on Netflix on December 18, 2015. It was filmed over the course of 10 years, with the filmmakers moving back and forth from New York City to Wisconsin during filming. To promote the series, Netflix released the first episode concurrently on YouTube and on Netflix, which it had not done for any other original programming.\r\nIn July 2016, Netflix announced the second season, to explore the aftermath of Dassey's conviction and the numerous appeals that had taken place. The 10-episode second season was released on October 19, 2018.\r\nMaking a Murderer won several awards, including four Primetime Emmy Awards in 2016. As a production, the series was favorably compared to the HBO series The Jinx and the podcast Serial. Making a Murderer was widely viewed and has generated considerable controversy, both in Manitowoc County, the setting of events, and nationwide. A petition in December 2015 to the White House to pardon Avery garnered more than 500,000 signatures. The White House's statement noted \"the President cannot pardon a state criminal offense.\"",
    "html": "<p>Making a Murderer is an American true crime documentary television series written and directed by Laura Ricciardi and Moira Demos. The show tells the story of Steven Avery, a man from Manitowoc County, Wisconsin, who served 18 years in prison (1985–2003) after his wrongful conviction for the sexual assault and attempted murder of Penny Beerntsen. He was later charged with and convicted of the 2005 murder of Teresa Halbach. The connected story is that of Avery's nephew Brendan Dassey, who was accused and convicted as an accessory in the murder of Halbach.</p><p>The first season mainly chronicles the period between 1985 and 2007, portraying Avery's 1985 arrest and conviction, his subsequent exoneration and release in 2003, the civil lawsuit Avery filed against Manitowoc County, his 2005 arrest, and his ensuing trial and conviction in 2007. It also depicts the arrest, prosecution, and conviction of Dassey, focusing on the accusations of coercion and attorney ineptitude.</p><p>The second season explores the aftermath of both Avery's and Dassey's convictions, focusing on Avery's and Dassey's families, the investigation and findings of Avery's new attorney Kathleen Zellner, which supported the thesis of Avery's innocence and him being framed for the murder of Halbach, and Dassey's legal team's efforts in arguing that his confession was coerced by prosecutors and his constitutional rights were violated.</p><p>The first season premiered on Netflix on December 18, 2015. It was filmed over the course of 10 years, with the filmmakers moving back and forth from New York City to Wisconsin during filming. To promote the series, Netflix released the first episode concurrently on YouTube and on Netflix, which it had not done for any other original programming.</p><p>In July 2016, Netflix announced the second season, to explore the aftermath of Dassey's conviction and the numerous appeals that had taken place. The 10-episode second season was released on October 19, 2018.</p><p>Making a Murderer won several awards, including four Primetime Emmy Awards in 2016. As a production, the series was favorably compared to the HBO series The Jinx and the podcast Serial. Making a Murderer was widely viewed and has generated considerable controversy, both in Manitowoc County, the setting of events, and nationwide. A petition in December 2015 to the White House to pardon Avery garnered more than 500,000 signatures. The White House's statement noted \"the President cannot pardon a state criminal offense.\"</p>"
  },
  "plotFull": {
    "plainText": "Making a Murderer is an American true crime documentary television series written and directed by Laura Ricciardi and Moira Demos. The show tells the story of Steven Avery, a man from Manitowoc County, Wisconsin, who served 18 years in prison (1985–2003) after his wrongful conviction for the sexual assault and attempted murder of Penny Beerntsen. He was later charged with and convicted of the 2005 murder of Teresa Halbach. The connected story is that of Avery's nephew Brendan Dassey, who was accused and convicted as an accessory in the murder of Halbach.\r\nThe first season mainly chronicles the period between 1985 and 2007, portraying Avery's 1985 arrest and conviction, his subsequent exoneration and release in 2003, the civil lawsuit Avery filed against Manitowoc County, his 2005 arrest, and his ensuing trial and conviction in 2007. It also depicts the arrest, prosecution, and conviction of Dassey, focusing on the accusations of coercion and attorney ineptitude.\r\nThe second season explores the aftermath of both Avery's and Dassey's convictions, focusing on Avery's and Dassey's families, the investigation and findings of Avery's new attorney Kathleen Zellner, which supported the thesis of Avery's innocence and him being framed for the murder of Halbach, and Dassey's legal team's efforts in arguing that his confession was coerced by prosecutors and his constitutional rights were violated.\r\nThe first season premiered on Netflix on December 18, 2015. It was filmed over the course of 10 years, with the filmmakers moving back and forth from New York City to Wisconsin during filming. To promote the series, Netflix released the first episode concurrently on YouTube and on Netflix, which it had not done for any other original programming.\r\nIn July 2016, Netflix announced the second season, to explore the aftermath of Dassey's conviction and the numerous appeals that had taken place. The 10-episode second season was released on October 19, 2018.\r\nMaking a Murderer won several awards, including four Primetime Emmy Awards in 2016. As a production, the series was favorably compared to the HBO series The Jinx and the podcast Serial. Making a Murderer was widely viewed and has generated considerable controversy, both in Manitowoc County, the setting of events, and nationwide. A petition in December 2015 to the White House to pardon Avery garnered more than 500,000 signatures. The White House's statement noted \"the President cannot pardon a state criminal offense.\"\r\nSubject matter\r\nMaking a Murderer details the life of Steven Avery, a man whose family owned an auto salvage yard in Manitowoc County, Wisconsin and the murder of a woman called Teresa Halbach.\r\nIn 1985, Avery was arrested and convicted of the sexual assault of Penny Beerntsen, despite having an alibi. After serving 18 years in prison, Avery was exonerated with the aid of the Innocence Project, when the DNA in the case was matched to another man known to police. Avery was released in September 2003.\r\nIn October 2004, he filed a $36 million civil lawsuit against Manitowoc County and county officials associated with his conviction. In November 2005, Avery was arrested and charged with the murder of Teresa Halbach, a photographer who disappeared after she photographed a vehicle at Avery's salvage yard on 31 October 2005. The handling of the Halbach murder case is highly controversial. Avery and his lawyers argued at his trial in 2007 that he had once again been set up. Bloodstains recovered from the interior of Halbach's car matched Avery's DNA. Avery maintained the murder charge was a frameup, promulgated to discredit his pending civil lawsuit. His attorneys accused Manitowoc officials of evidence tampering after a vial of Avery's blood, stored in an evidence locker since the 1985 trial, was found with broken container seals and a puncture hole in the stopper, suggesting that blood from the vial could have been used to plant incriminating evidence in the victim's vehicle. The Avery tube contained ethylenediamine-tetraacetic acid (EDTA), which prevents blood coagulation and degradation. EDTA is not naturally present in human blood, and the defense argued that if EDTA was found in the crime scene blood, it would prove the blood was planted. While the tampering charge was never substantiated, accusations of prosecutorial misconduct have persisted. The series explores issues and procedures in the Manitowoc County Sheriff's Department that led to Avery's original conviction, and argues the department had a conflict of interest in investigating Halbach's murder.\r\nThe series covers the arrest, prosecution, and conviction of Avery's nephew, Brendan Dassey, who was accused and convicted as an accessory to the murder, based largely on his confession under interrogation. The series depicts his trial, along with subsequent accusations of coercion and ineffective assistance of counsel. Avery is found guilty of intentional homicide, and Dassey found guilty of sexual assault and party to a homicide and mutilation of a corpse. In Summer 2007 Avery, aged 44, is sentenced to life imprisonment, without possibility of parole; Dassey, 17, is sentenced to life imprisonment, with possibility of parole in 2048.\r\nPart 2 of the series looks at the many attempts to overturn the convictions of Avery and Dassey. It includes further forensic tests undertaken by Avery's lawyers. In August 2016, Dassey had his conviction overturned by a federal judge on the grounds he was unconstitutionally coerced by the police into confessing to the murder, and this was the only substantial evidence in the case. On November 14, 2016, Federal District Court Judge William Duffin ordered Dassey's release from within 90 days if Wisconsin prosecutors did not move forward with a retrial. On November 17, the U.S. Court of Appeals for the Seventh Circuit blocked Dassey's release while the appeal was being heard. A three-judge panel from the 7th Circuit affirmed Judge Duffin's decision to release Dassey, and stated that Dassey should be freed unless the state chose to retry him. In December 2017, an en banc panel of seven judges of the United States Court of Appeals for the Seventh Circuit ruled in favor of upholding the original conviction, in a split vote of 4 to 3, ruling police had properly obtained Dassey's confession. In June 2018, the U.S. Supreme Court declined to hear Dassey's appeal of the 7th Circuit's en banc decision.\r\nIn other media\r\nThe story of the crime for which Avery was initially charged and imprisoned was featured in the Radiolab episode, \"Are You Sure?\" (airdate March 26, 2013), in the segment \"Reasonable Doubt\". The show featured an interview with Penny Beerntsen, the subject of the attack for which Avery was wrongfully convicted.\r\nPersons featured\r\nAvery family\r\nSteven Avery – Wrongfully convicted of a sexual assault, for which he served an 18-year sentence. Defendant convicted of Halbach's murder.\r\nAllan Avery – Steven Avery's father\r\nDolores Avery – Steven Avery's mother\r\nChuck Avery – Steven Avery's brother\r\nEarl Avery – Steven Avery's brother\r\nBarb Dassey – Steven Avery's sister, mother of Brendan and Bobby Dassey\r\nBrendan Dassey – Avery's nephew, son of Barb Dassey, defendant convicted of assisting Avery in Halbach's murder.\r\nBobby Dassey – Brendan Dassey's brother, son of Barb Dassey\r\nScott Tadych – married Barb Dassey (before the trials), stepfather of her children\r\nKayla Avery – Brendan Dassey's cousin\r\nKim Ducat – Steven Avery's cousin\r\nCarla Chase - Steven Avery's niece, Brendan Dassey's cousin\r\nBrad Dassey - Brendan's half brother, voice actor, and aspiring rapper.\r\nVictims\r\nPenny Beerntsen – Victim of a sexual assault and attempted murder in 1985, for which Steven Avery was wrongfully convicted\r\nTeresa Halbach – Murder victim in 2005\r\nRape victim of Gregory Allen, convicted for an attempted rape on Penny Beerntsen.\r\nDefense lawyers\r\nKathleen Zellner – post-conviction attorney for Steven Avery\r\nDean Strang – for Steven Avery\r\nJerome Buting – for Steven Avery\r\nRobert Henak – post-conviction attorney for Steven Avery\r\nStephen Glynn – civil rights lawyer for Steven Avery\r\nLen Kachinsky – Brendan Dassey's first appointed lawyer\r\nMark Fremgen – for Brendan Dassey, appointed lawyer (second lawyer)\r\nRay Edelstein – for Brendan Dassey, appointed lawyer (second lawyer)\r\nSteven Drizin – post-conviction attorney for Brendan Dassey\r\nRobert Dvorak – post-conviction attorney for Brendan Dassey\r\nLaura Nirider – post-conviction attorney for Brendan Dassey\r\nProsecution\r\nDenis Vogel – Manitowoc County District Attorney, prosecuted Avery's 1985 sexual assault case\r\nKen Kratz – special prosecutor, district attorney of Calumet County, Wisconsin, prosecuted Halbach murder case\r\nNorm Gahn – special prosecutor, assistant district attorney of Milwaukee County\r\nJudges\r\nPatrick Willis – Manitowoc County Circuit Court Judge, presided over Steven Avery's trial\r\nJerome Fox – Manitowoc County Circuit Court Judge, presided over Brendan Dassey's trial\r\nAngela Sutkiewicz - Manitowoc County Circuit Court Judge, presides over Steven Avery's appeals\r\nLaw enforcement\r\nTom Kocourek – Manitowoc County Sheriff (1979–2001)\r\nKenneth Petersen – Manitowoc County Sheriff (2001–07)\r\nGene Kusche – Manitowoc County Chief Deputy Sheriff at time of Avery's 1985 trial\r\nJames Lenk – lieutenant, Manitowoc County Sheriff's Department\r\nAndrew Colborn – sergeant, Manitowoc County Sheriff's Department\r\nJudy Dvorak – deputy, Manitowoc County Sheriff's Department\r\nTom Fassbender – investigator, Wisconsin Division of Criminal Investigation, lead investigator in Halbach murder trial\r\nMark Wiegert – sergeant, Calumet County Sheriff's Department\r\nJerry Pagel – Calumet County Sheriff\r\nPrivate investigators\r\nMichael O'Kelly – investigator hired by Len Kachinsky\r\nProduction\r\nThe series was written and directed by filmmakers Laura Ricciardi and Moira Demos. They met as graduate students in Columbia University's film program. The two learned about Avery after reading a 2005 article in The New York Times about his 2003 exoneration and 2005 arrest for murder. Both thought that his case could be an interesting subject for a documentary.\r\nBefore meeting with Netflix, Demos and Ricciardi met with executives at PBS and HBO, but neither network was interested in the project. Netflix originally planned an eight-episode first season, but later expanded its order to 10.\r\nThe show's graphics and main title sequence were completed by Santa Monica–based design studio Elastic.\r\nReception\r\nCritical response\r\nThe series received praise and criticism from critics. Some praised its comprehensive nature, and the first season has an approval rating of 98% on Rotten Tomatoes, based on 44 reviews, with an average rating of 8.7 out of 10. The site's critical consensus describes Making a Murderer as \"a spellbinding slow burn that effectively utilizes the documentary format to tell a twisty mystery.\" On Metacritic, the first season has a weighted average score of 84 out of 100, based on 21 critics, indicating \"universal acclaim\". Lenika Cruz, writing for The Atlantic, commended the series for its \"sense of total immersion\". Mike Hale, for The New York Times, described it as giving an:\r\nalmost Dickensian account of the tragedy of the Averys. The uniformly stoic family members shift allegiances over the years, while Mr. Avery's parents, as movingly bewildered and terrified as any fictional creations, steadfastly believe in their son's innocence, even as their long battle takes down their business and any sense they may have had of belonging to a community.\r\nSome critics, however, have described Making a Murderer as one-sided and emotionally manipulative. Prosecutor Ken Kratz claimed key evidence from the trial was omitted from the documentary, claiming that, on one of Halbach's previous visits, Avery had come to the door in his towel, and that Halbach \"said she wouldn't go back because she was scared of him.\"\r\nMaking a Murderer has been compared to The Jinx, a miniseries on HBO, and Serial, a podcast. All three investigate criminal cases: The Jinx detailed murders allegedly committed by Robert Durst. The first season of Serial dealt with the Killing of Hae Min Lee.\r\nThe second season received positive reviews from critics, though less acclaimed than the first season. On Rotten Tomatoes, it has a 71% approval rating based on 41 reviews, with an average rating of 6.6 out of 10. The site's critical consensus is, \"Making a Murderer's return may not yield closure for this maddening saga of crime and punishment, but the series' exploration of the U.S. justice system remains riveting.\" On Metacritic, it has a score of 67 out of 100, based on 13 critics, indicating \"generally favorable reviews\".\r\nAccolades\r\nPublic reaction\r\nThe series gained a very large international audience. Some celebrities, including Alec Baldwin, Ricky Gervais, and Mandy Moore, praised the series on social media.\r\nA petition to the White House that requested pardons for Avery and Dassey garnered more than 128,000 signatures. The White House responded that, as the convictions were made in state court, the President had no authority to pardon either defendant. Then-governor Scott Walker of Wisconsin said he would not consider a pardon.\r\nDassey is being represented by the Center on Wrongful Convictions of Youth at Northwestern University. Appeals within the state courts failed, but his conviction was overturned in federal district court on August 12, 2016, by a Magistrate Judge, based on the unconstitutional coercion of his confession. His defense team had petitioned the court to hear his case on habeas corpus grounds. The U.S. Court of Appeals for the Seventh Circuit granted a stay of the release on November 16, 2016, pending resolution of the appeal.\r\nAs of January 9, 2016, Avery was being represented by Kathleen Zellner, a noted Chicago-area attorney, and Tricia Bushnell, legal director of the Midwest Innocence Project. In April 2019 Bushnell stopped representing Avery.\r\nLocal reporters' comments\r\nLocal reporter Angenette Levy was interviewed after the series and said: \"I did notice there were some parts of the state's theory, and some other things that weren't discussed in the documentary,\" but she also noted that it was a six-week trial with much evidence reviewed in court. She said she was surprised that the trial, which she found compelling on many levels, had not received more national attention when it was being conducted. She found Dassey's conviction \"tragic,\" as was Avery's wrongful conviction in 1985 but did not comment on the conviction in the Halbach case. TV reporter Diana Alvear wrote on her blog that she believed Halbach's life and character deserved more coverage in the series. Other local reporters said that the case still weighed on them nearly a decade after the trial.\r\nLaw enforcement comments\r\nIn an interview with the Manitowoc Herald Times Reporter, Sheriff Robert Hermann criticized the series, calling it \"skewed\" and not objective, but he admitted he had not watched it.\r\nAccording to Fox local news, Ken Kratz, the former Calumet County district attorney who prosecuted Avery, said that he had not been able to give his side of the story. In another interview, he said that in 2013 Demos and Ricciardi denied him an opportunity for an interview. The documentary makers said this statement was false, as it was Kratz who refused an interview.\r\nIn an interview with People magazine, Kratz has said that the Netflix documentary left out key pieces of evidence against Steven Avery. He said Avery used a fake name when requesting Halbach as a photographer, and that he had placed three calls to her cell phone on October 31. Kratz said Halbach's cellphone, camera and PDA were found near Avery's trailer. He noted other physical evidence that was found in the firepit on Avery's property, and that Avery's DNA was found on the hood latch of the victim's car. A ballistics report indicated that the bullet found in the garage was fired by Avery's rifle. In an email sent to The Wrap, Kratz alleged that while in prison for the rape conviction, Avery told another inmate of his intent to build a \"torture chamber\" to use for young women when he was released.\r\nIn February 2017, Kratz published a book titled Avery: The Case Against Steven Avery and What \"Making a Murderer\" Gets Wrong.\r\nFilmmakers' response\r\nThe filmmakers have said that they gave prosecutors an opportunity to answer questions, but that Kratz refused invitations to be interviewed for the series. Demos and Ricciardi said they believed the documentary was fair and included the most significant evidence of the six-week trial, including much of the state's key evidence. Demos said that Kratz \"is going on television and lodging accusations against us. Much of what he says, simply his facts are not true. It's not about 'do we include it, do we not include it', they simply are not facts.\" The filmmakers maintain that their documentary was thorough, accurate, and fair.\r\nStrang comments\r\nDean Strang, one of Avery's attorneys for the Halbach trial, stated the filmmakers did \"a good editorial job\" with the documentary. Strang noted that the trial lasted for six weeks and featured approximately 200 to 240 hours of evidence. Strang believes that showing the full trial would have been too long for audiences and that only the most significant points on both sides could be shown. He disagreed that significant evidence was left out.\r\nComments by other involved parties\r\nJodi Stachowski, a former fiancée of Avery's, defended him in the documentary. But, during an interview on HLN's Nancy Grace in January 2016, she was asked whether she believes Avery killed Halbach. She said, \"Yes, I do, because he threatened to kill me and my family and a friend of mine.\" Stachowski also said that Avery forced her to lie to Netflix producers, threatening that otherwise she would \"pay for it.\" She quoted other alleged comments by him.\r\nThe Halbach family stated they were \"saddened to learn that individuals and corporations continue to create entertainment and to seek profit from their loss.\" In a People article, Kay Giordana, Halbach's aunt, was quoted as saying that the documentary was \"terrible\" and \"unfortunate\", and\r\nnot even close to what really happened. Everybody has their own side of a story. That is the Avery family's side of the story. I wouldn't expect it to be different. They think he is innocent. I am not surprised. I am surprised that someone would put that together in that way and have it one-sided.\" She added that Avery is \"100 percent guilty. No doubt about it.\"\r\nHalbach's cousin-in-law, Jeremy Fournier, described the documentary as \"very one-sided\" and feels that viewers are \"only getting one side of the story.\"\r\nBeerntsen, whose testimony contributed to the wrongful conviction of Avery for rape, declined to be interviewed for Making a Murderer. Beerntsen had previously apologized to Avery, in 2003, after learning of his exoneration; they later met and collaborated on The Forgiveness Project. In a 2016 interview, Beerntsen said she had watched the show and that its portrayal of her case was accurate. However, as to the murder of Halbach, Beerntsen expressed that she was \"not convinced\" of his innocence, and that she had refused to speak to the documentary's producers for being \"too close with Avery’s family and attorneys\".\r\nEpisodes\r\nSeason 1 (2015)\r\nSeason 2 (2018)",
    "html": "<p>Making a Murderer is an American true crime documentary television series written and directed by Laura Ricciardi and Moira Demos. The show tells the story of Steven Avery, a man from Manitowoc County, Wisconsin, who served 18 years in prison (1985–2003) after his wrongful conviction for the sexual assault and attempted murder of Penny Beerntsen. He was later charged with and convicted of the 2005 murder of Teresa Halbach. The connected story is that of Avery's nephew Brendan Dassey, who was accused and convicted as an accessory in the murder of Halbach.</p><p>The first season mainly chronicles the period between 1985 and 2007, portraying Avery's 1985 arrest and conviction, his subsequent exoneration and release in 2003, the civil lawsuit Avery filed against Manitowoc County, his 2005 arrest, and his ensuing trial and conviction in 2007. It also depicts the arrest, prosecution, and conviction of Dassey, focusing on the accusations of coercion and attorney ineptitude.</p><p>The second season explores the aftermath of both Avery's and Dassey's convictions, focusing on Avery's and Dassey's families, the investigation and findings of Avery's new attorney Kathleen Zellner, which supported the thesis of Avery's innocence and him being framed for the murder of Halbach, and Dassey's legal team's efforts in arguing that his confession was coerced by prosecutors and his constitutional rights were violated.</p><p>The first season premiered on Netflix on December 18, 2015. It was filmed over the course of 10 years, with the filmmakers moving back and forth from New York City to Wisconsin during filming. To promote the series, Netflix released the first episode concurrently on YouTube and on Netflix, which it had not done for any other original programming.</p><p>In July 2016, Netflix announced the second season, to explore the aftermath of Dassey's conviction and the numerous appeals that had taken place. The 10-episode second season was released on October 19, 2018.</p><p>Making a Murderer won several awards, including four Primetime Emmy Awards in 2016. As a production, the series was favorably compared to the HBO series The Jinx and the podcast Serial. Making a Murderer was widely viewed and has generated considerable controversy, both in Manitowoc County, the setting of events, and nationwide. A petition in December 2015 to the White House to pardon Avery garnered more than 500,000 signatures. The White House's statement noted \"the President cannot pardon a state criminal offense.\"</p><br/><h3>Subject matter</h3><p>Making a Murderer details the life of Steven Avery, a man whose family owned an auto salvage yard in Manitowoc County, Wisconsin and the murder of a woman called Teresa Halbach.</p><p>In 1985, Avery was arrested and convicted of the sexual assault of Penny Beerntsen, despite having an alibi. After serving 18 years in prison, Avery was exonerated with the aid of the Innocence Project, when the DNA in the case was matched to another man known to police. Avery was released in September 2003.</p><p>In October 2004, he filed a $36 million civil lawsuit against Manitowoc County and county officials associated with his conviction. In November 2005, Avery was arrested and charged with the murder of Teresa Halbach, a photographer who disappeared after she photographed a vehicle at Avery's salvage yard on 31 October 2005. The handling of the Halbach murder case is highly controversial. Avery and his lawyers argued at his trial in 2007 that he had once again been set up. Bloodstains recovered from the interior of Halbach's car matched Avery's DNA. Avery maintained the murder charge was a frameup, promulgated to discredit his pending civil lawsuit. His attorneys accused Manitowoc officials of evidence tampering after a vial of Avery's blood, stored in an evidence locker since the 1985 trial, was found with broken container seals and a puncture hole in the stopper, suggesting that blood from the vial could have been used to plant incriminating evidence in the victim's vehicle. The Avery tube contained ethylenediamine-tetraacetic acid (EDTA), which prevents blood coagulation and degradation. EDTA is not naturally present in human blood, and the defense argued that if EDTA was found in the crime scene blood, it would prove the blood was planted. While the tampering charge was never substantiated, accusations of prosecutorial misconduct have persisted. The series explores issues and procedures in the Manitowoc County Sheriff's Department that led to Avery's original conviction, and argues the department had a conflict of interest in investigating Halbach's murder.</p><p>The series covers the arrest, prosecution, and conviction of Avery's nephew, Brendan Dassey, who was accused and convicted as an accessory to the murder, based largely on his confession under interrogation. The series depicts his trial, along with subsequent accusations of coercion and ineffective assistance of counsel. Avery is found guilty of intentional homicide, and Dassey found guilty of sexual assault and party to a homicide and mutilation of a corpse. In Summer 2007 Avery, aged 44, is sentenced to life imprisonment, without possibility of parole; Dassey, 17, is sentenced to life imprisonment, with possibility of parole in 2048.</p><p>Part 2 of the series looks at the many attempts to overturn the convictions of Avery and Dassey. It includes further forensic tests undertaken by Avery's lawyers. In August 2016, Dassey had his conviction overturned by a federal judge on the grounds he was unconstitutionally coerced by the police into confessing to the murder, and this was the only substantial evidence in the case. On November 14, 2016, Federal District Court Judge William Duffin ordered Dassey's release from within 90 days if Wisconsin prosecutors did not move forward with a retrial. On November 17, the U.S. Court of Appeals for the Seventh Circuit blocked Dassey's release while the appeal was being heard. A three-judge panel from the 7th Circuit affirmed Judge Duffin's decision to release Dassey, and stated that Dassey should be freed unless the state chose to retry him. In December 2017, an en banc panel of seven judges of the United States Court of Appeals for the Seventh Circuit ruled in favor of upholding the original conviction, in a split vote of 4 to 3, ruling police had properly obtained Dassey's confession. In June 2018, the U.S. Supreme Court declined to hear Dassey's appeal of the 7th Circuit's en banc decision.</p><h4>In other media</h4><p>The story of the crime for which Avery was initially charged and imprisoned was featured in the Radiolab episode, \"Are You Sure?\" (airdate March 26, 2013), in the segment \"Reasonable Doubt\". The show featured an interview with Penny Beerntsen, the subject of the attack for which Avery was wrongfully convicted.</p><br/><h3>Persons featured</h3><h4>Avery family</h4><ul><li>Steven Avery – Wrongfully convicted of a sexual assault, for which he served an 18-year sentence. Defendant convicted of Halbach's murder.</li><li>Allan Avery – Steven Avery's father</li><li>Dolores Avery – Steven Avery's mother</li><li>Chuck Avery – Steven Avery's brother</li><li>Earl Avery – Steven Avery's brother</li><li>Barb Dassey – Steven Avery's sister, mother of Brendan and Bobby Dassey</li><li>Brendan Dassey – Avery's nephew, son of Barb Dassey, defendant convicted of assisting Avery in Halbach's murder.</li><li>Bobby Dassey – Brendan Dassey's brother, son of Barb Dassey</li><li>Scott Tadych – married Barb Dassey (before the trials), stepfather of her children</li><li>Kayla Avery – Brendan Dassey's cousin</li><li>Kim Ducat – Steven Avery's cousin</li><li>Carla Chase - Steven Avery's niece, Brendan Dassey's cousin</li><li>Brad Dassey - Brendan's half brother, voice actor, and aspiring rapper.</li></ul><h4>Victims</h4><ul><li>Penny Beerntsen – Victim of a sexual assault and attempted murder in 1985, for which Steven Avery was wrongfully convicted</li><li>Teresa Halbach – Murder victim in 2005</li><li>Rape victim of Gregory Allen, convicted for an attempted rape on Penny Beerntsen.</li></ul><h4>Defense lawyers</h4><ul><li>Kathleen Zellner – post-conviction attorney for Steven Avery</li><li>Dean Strang – for Steven Avery</li><li>Jerome Buting – for Steven Avery</li><li>Robert Henak – post-conviction attorney for Steven Avery</li><li>Stephen Glynn – civil rights lawyer for Steven Avery</li><li>Len Kachinsky – Brendan Dassey's first appointed lawyer</li><li>Mark Fremgen – for Brendan Dassey, appointed lawyer (second lawyer)</li><li>Ray Edelstein – for Brendan Dassey, appointed lawyer (second lawyer)</li><li>Steven Drizin – post-conviction attorney for Brendan Dassey</li><li>Robert Dvorak – post-conviction attorney for Brendan Dassey</li><li>Laura Nirider – post-conviction attorney for Brendan Dassey</li></ul><h4>Prosecution</h4><ul><li>Denis Vogel – Manitowoc County District Attorney, prosecuted Avery's 1985 sexual assault case</li><li>Ken Kratz – special prosecutor, district attorney of Calumet County, Wisconsin, prosecuted Halbach murder case</li><li>Norm Gahn – special prosecutor, assistant district attorney of Milwaukee County</li></ul><h4>Judges</h4><ul><li>Patrick Willis – Manitowoc County Circuit Court Judge, presided over Steven Avery's trial</li><li>Jerome Fox – Manitowoc County Circuit Court Judge, presided over Brendan Dassey's trial</li><li>Angela Sutkiewicz - Manitowoc County Circuit Court Judge, presides over Steven Avery's appeals</li></ul><h4>Law enforcement</h4><ul><li>Tom Kocourek – Manitowoc County Sheriff (1979–2001)</li><li>Kenneth Petersen – Manitowoc County Sheriff (2001–07)</li><li>Gene Kusche – Manitowoc County Chief Deputy Sheriff at time of Avery's 1985 trial</li><li>James Lenk – lieutenant, Manitowoc County Sheriff's Department</li><li>Andrew Colborn – sergeant, Manitowoc County Sheriff's Department</li><li>Judy Dvorak – deputy, Manitowoc County Sheriff's Department</li><li>Tom Fassbender – investigator, Wisconsin Division of Criminal Investigation, lead investigator in Halbach murder trial</li><li>Mark Wiegert – sergeant, Calumet County Sheriff's Department</li><li>Jerry Pagel – Calumet County Sheriff</li></ul><h4>Private investigators</h4><ul><li>Michael O'Kelly – investigator hired by Len Kachinsky</li></ul><br/><h3>Production</h3><p>The series was written and directed by filmmakers Laura Ricciardi and Moira Demos. They met as graduate students in Columbia University's film program. The two learned about Avery after reading a 2005 article in The New York Times about his 2003 exoneration and 2005 arrest for murder. Both thought that his case could be an interesting subject for a documentary.</p><p>Before meeting with Netflix, Demos and Ricciardi met with executives at PBS and HBO, but neither network was interested in the project. Netflix originally planned an eight-episode first season, but later expanded its order to 10.</p><p>The show's graphics and main title sequence were completed by Santa Monica–based design studio Elastic.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>The series received praise and criticism from critics. Some praised its comprehensive nature, and the first season has an approval rating of 98% on Rotten Tomatoes, based on 44 reviews, with an average rating of 8.7 out of 10. The site's critical consensus describes Making a Murderer as \"a spellbinding slow burn that effectively utilizes the documentary format to tell a twisty mystery.\" On Metacritic, the first season has a weighted average score of 84 out of 100, based on 21 critics, indicating \"universal acclaim\". Lenika Cruz, writing for The Atlantic, commended the series for its \"sense of total immersion\". Mike Hale, for The New York Times, described it as giving an:</p><blockquote>almost Dickensian account of the tragedy of the Averys. The uniformly stoic family members shift allegiances over the years, while Mr. Avery's parents, as movingly bewildered and terrified as any fictional creations, steadfastly believe in their son's innocence, even as their long battle takes down their business and any sense they may have had of belonging to a community.</blockquote><p>Some critics, however, have described Making a Murderer as one-sided and emotionally manipulative. Prosecutor Ken Kratz claimed key evidence from the trial was omitted from the documentary, claiming that, on one of Halbach's previous visits, Avery had come to the door in his towel, and that Halbach \"said she wouldn't go back because she was scared of him.\"</p><p>Making a Murderer has been compared to The Jinx, a miniseries on HBO, and Serial, a podcast. All three investigate criminal cases: The Jinx detailed murders allegedly committed by Robert Durst. The first season of Serial dealt with the Killing of Hae Min Lee.</p><p>The second season received positive reviews from critics, though less acclaimed than the first season. On Rotten Tomatoes, it has a 71% approval rating based on 41 reviews, with an average rating of 6.6 out of 10. The site's critical consensus is, \"Making a Murderer's return may not yield closure for this maddening saga of crime and punishment, but the series' exploration of the U.S. justice system remains riveting.\" On Metacritic, it has a score of 67 out of 100, based on 13 critics, indicating \"generally favorable reviews\".</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" style=\"width:2%;\">Year</th><th scope=\"col\" style=\"width:25%;\">Award</th><th scope=\"col\" style=\"width:30%;\">Category</th><th scope=\"col\" style=\"width:20%;\">Nominee(s)</th><th scope=\"col\" style=\"width:13%;\">Result</th><th scope=\"col\" class=\"unsortable\" style=\"width:1%;\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><td rowspan=\"19\">2016</td><td><span>Empire Awards</span></td><td>Best Documentary</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td rowspan=\"2\"><span>Television Critics Association Awards</span></td><td><span>Program of the Year</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span>Outstanding Achievement in Reality Programming</span></td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"6\"><span>Primetime Emmy Awards</span></td><td><span>Outstanding Documentary or Nonfiction Series</span></td><td><span>Moira Demos</span>, <span>Laura Ricciardi</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"6\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span class=\"mw-redirect\">Outstanding Directing For Nonfiction Programming</span></td><td>Laura Ricciardi, Moira Demos</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Writing for Nonfiction Programming</span></td><td>Laura Ricciardi, Moira Demos</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Picture Editing For Nonfiction Programming</span></td><td>Moira Demos</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Sound Mixing for a Nonfiction Program</span></td><td><span>Leslie Shatz</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Sound Editing For Non Fiction Programming</span></td><td>Daniel Ward, Leslie Bloome</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Webby Awards</span></td><td>Film &amp; Video Breakout of the Year</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span>International Documentary Association Awards</span></td><td>Best Limited Series</td><td>Moira Demos, Laura Ricciardi</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td rowspan=\"4\">Online Film &amp; Television Association Awards</td><td>Best Reality or Non-Fiction Program</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"4\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td>Best Writing of a Reality or Non-Fiction Program</td><td>Laura Ricciardi, Moira Demos</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Direction of a Reality or Non-Fiction Program</td><td>Laura Ricciardi, Moira Demos</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Editing in a Non-Series</td><td>Moira Demos</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Golden Tomato Awards</span></td><td>Best-Reviewed Documentary Series</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span>Dorian Awards</span></td><td>Documentary of the Year</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span class=\"mw-redirect\">Producers Guild of America Awards</span></td><td><span>Outstanding Producer of Non-Fiction Television</span></td><td>Laura Ricciardi, Moira Demos</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span>National Television Awards</span></td><td>Factual Entertainment Programme</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr></tbody></table><br/><h3>Public reaction</h3><p>The series gained a very large international audience. Some celebrities, including Alec Baldwin, Ricky Gervais, and Mandy Moore, praised the series on social media.</p><p>A petition to the White House that requested pardons for Avery and Dassey garnered more than 128,000 signatures. The White House responded that, as the convictions were made in state court, the President had no authority to pardon either defendant. Then-governor Scott Walker of Wisconsin said he would not consider a pardon.</p><p>Dassey is being represented by the Center on Wrongful Convictions of Youth at Northwestern University. Appeals within the state courts failed, but his conviction was overturned in federal district court on August 12, 2016, by a Magistrate Judge, based on the unconstitutional coercion of his confession. His defense team had petitioned the court to hear his case on habeas corpus grounds. The U.S. Court of Appeals for the Seventh Circuit granted a stay of the release on November 16, 2016, pending resolution of the appeal.</p><p>As of January 9, 2016, Avery was being represented by Kathleen Zellner, a noted Chicago-area attorney, and Tricia Bushnell, legal director of the Midwest Innocence Project. In April 2019 Bushnell stopped representing Avery.</p><h4>Local reporters' comments</h4><p>Local reporter Angenette Levy was interviewed after the series and said: \"I did notice there were some parts of the state's theory, and some other things that weren't discussed in the documentary,\" but she also noted that it was a six-week trial with much evidence reviewed in court. She said she was surprised that the trial, which she found compelling on many levels, had not received more national attention when it was being conducted. She found Dassey's conviction \"tragic,\" as was Avery's wrongful conviction in 1985 but did not comment on the conviction in the Halbach case. TV reporter Diana Alvear wrote on her blog that she believed Halbach's life and character deserved more coverage in the series. Other local reporters said that the case still weighed on them nearly a decade after the trial.</p><h4>Law enforcement comments</h4><p>In an interview with the Manitowoc Herald Times Reporter, Sheriff Robert Hermann criticized the series, calling it \"skewed\" and not objective, but he admitted he had not watched it.</p><p>According to Fox local news, Ken Kratz, the former Calumet County district attorney who prosecuted Avery, said that he had not been able to give his side of the story. In another interview, he said that in 2013 Demos and Ricciardi denied him an opportunity for an interview. The documentary makers said this statement was false, as it was Kratz who refused an interview.</p><p>In an interview with People magazine, Kratz has said that the Netflix documentary left out key pieces of evidence against Steven Avery. He said Avery used a fake name when requesting Halbach as a photographer, and that he had placed three calls to her cell phone on October 31. Kratz said Halbach's cellphone, camera and PDA were found near Avery's trailer. He noted other physical evidence that was found in the firepit on Avery's property, and that Avery's DNA was found on the hood latch of the victim's car. A ballistics report indicated that the bullet found in the garage was fired by Avery's rifle. In an email sent to The Wrap, Kratz alleged that while in prison for the rape conviction, Avery told another inmate of his intent to build a \"torture chamber\" to use for young women when he was released.</p><p>In February 2017, Kratz published a book titled Avery: The Case Against Steven Avery and What \"Making a Murderer\" Gets Wrong.</p><h4>Filmmakers' response</h4><p>The filmmakers have said that they gave prosecutors an opportunity to answer questions, but that Kratz refused invitations to be interviewed for the series. Demos and Ricciardi said they believed the documentary was fair and included the most significant evidence of the six-week trial, including much of the state's key evidence. Demos said that Kratz \"is going on television and lodging accusations against us. Much of what he says, simply his facts are not true. It's not about 'do we include it, do we not include it', they simply are not facts.\" The filmmakers maintain that their documentary was thorough, accurate, and fair.</p><h4>Strang comments</h4><p>Dean Strang, one of Avery's attorneys for the Halbach trial, stated the filmmakers did \"a good editorial job\" with the documentary. Strang noted that the trial lasted for six weeks and featured approximately 200 to 240 hours of evidence. Strang believes that showing the full trial would have been too long for audiences and that only the most significant points on both sides could be shown. He disagreed that significant evidence was left out.</p><h4>Comments by other involved parties</h4><p>Jodi Stachowski, a former fiancée of Avery's, defended him in the documentary. But, during an interview on HLN's Nancy Grace in January 2016, she was asked whether she believes Avery killed Halbach. She said, \"Yes, I do, because he threatened to kill me and my family and a friend of mine.\" Stachowski also said that Avery forced her to lie to Netflix producers, threatening that otherwise she would \"pay for it.\" She quoted other alleged comments by him.</p><p>The Halbach family stated they were \"saddened to learn that individuals and corporations continue to create entertainment and to seek profit from their loss.\" In a People article, Kay Giordana, Halbach's aunt, was quoted as saying that the documentary was \"terrible\" and \"unfortunate\", and</p><blockquote>not even close to what really happened. Everybody has their own side of a story. That is the Avery family's side of the story. I wouldn't expect it to be different. They think he is innocent. I am not surprised. I am surprised that someone would put that together in that way and have it one-sided.\" She added that Avery is \"100 percent guilty. No doubt about it.\"</blockquote><p>Halbach's cousin-in-law, Jeremy Fournier, described the documentary as \"very one-sided\" and feels that viewers are \"only getting one side of the story.\"</p><p>Beerntsen, whose testimony contributed to the wrongful conviction of Avery for rape, declined to be interviewed for Making a Murderer. Beerntsen had previously apologized to Avery, in 2003, after learning of his exoneration; they later met and collaborated on The Forgiveness Project. In a 2016 interview, Beerntsen said she had watched the show and that its portrayal of her case was accurate. However, as to the murder of Halbach, Beerntsen expressed that she was \"not convinced\" of his innocence, and that she had refused to speak to the documentary's producers for being \"too close with Avery’s family and attorneys\".</p><br/><h3>Episodes</h3><h4>Season 1 (2015)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#A62821;width:1%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#A62821;width:1%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#A62821;width:20%\">Title</th><th scope=\"col\" style=\"background:#A62821;width:10%\">Length (minutes)</th><th scope=\"col\" style=\"background:#A62821;width:15%\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Eighteen Years Lost\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">64</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">December 18, 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A62821\">When Steven Avery is freed from a wrongful conviction, his search for justice raises questions about the authorities who put him behind bars.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Turning the Tables\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">57</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">December 18, 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A62821\">As Steven starts a new life for himself, he pushes a lawsuit against Manitowoc County law enforcement officials for corruption in his case.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Plight of the Accused\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">63</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">December 18, 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A62821\">Steven is back in jail, charged with murder, but there are troubling questions about how he was arrested and why.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Indefensible\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">66</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">December 18, 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A62821\">An unexpected confession casts doubt on Steven's role in the murder case, but the new suspect gives conflicting accounts of what occurred.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Last Person to See Teresa Alive\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">59</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">December 18, 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A62821\">As Steven's trial begins, his attorneys argue that law enforcement officials framed him and were negligent in not pursuing other leads in the case.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Testing the Evidence\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">59</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">December 18, 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A62821\">Steven's attorneys cross-examine forensic experts about contaminated evidence and the absence of proof linking Steven to the crime.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Framing Defense\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">63</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">December 18, 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A62821\">As the murder trial continues, Steven's attorneys present their case that law enforcement officials planted evidence to frame him.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Great Burden\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">47</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">December 18, 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A62821\">After two long days of closing arguments, the jury deliberates. Steven's fate hinges on whether the jury believes police misconduct may have occurred.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Lack of Humility\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">66</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">December 18, 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A62821\">Steven's trial is over, but a new one is just beginning. Will the jury find the suspect's confession or his conflicting statements more believable?</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Fighting for Their Lives\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">63</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">December 18, 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A62821\">In the years after Steven and Brendan's very public trials, the various members of the Avery family struggle to mend their broken lives.</td></tr></tbody></table><h4>Season 2 (2018)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#CCCCCC;width:1%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#CCCCCC;width:1%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#CCCCCC;width:20%\">Title</th><th scope=\"col\" style=\"background:#CCCCCC;width:10%\">Length (minutes)</th><th scope=\"col\" style=\"background:#CCCCCC;width:15%\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Number 18\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">57</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">October 19, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #CCCCCC\">Powerhouse lawyer Kathleen Zellner offers to take Steven's case. Brendan's postconviction lawyers fight in federal court to try to get him released.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Words and Words Only\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">67</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">October 19, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #CCCCCC\">Brendan's lawyers work to prove his conviction was based on a coerced confession. Kathleen tests Steven in new ways and visits the alleged crime scene.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A Legal Miracle\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">66</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">October 19, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #CCCCCC\">Kathleen's forensic experts review the evidence found in Steven’s burn pit. <span>A 1996 statute</span> limits Brendan's chances of success in federal court.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Welcome to Wisconsin\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">58</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">October 19, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #CCCCCC\">Cautiously optimistic, Brendan and his family wait to hear important news about his case. Kathleen files a motion for new scientific testing.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep15\" style=\"text-align:center\">15</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"What + Why = Who\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">64</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">October 19, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #CCCCCC\">Searching for evidence of tampering, Kathleen visits Steven's trailer. A new twist in Brendan's case sends his family on an emotional roller coaster.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep16\" style=\"text-align:center\">16</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Everything Takes Time\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">65</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">October 19, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #CCCCCC\">Kathleen obtains access to some of the original physical evidence from the case. The former prosecutor holds a press conference.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep17\" style=\"text-align:center\">17</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Item FL\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">60</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">October 19, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #CCCCCC\">Kathleen runs new tests on the bullet believed to have killed Teresa Halbach and tracks Teresa's movements on the day she disappeared.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep18\" style=\"text-align:center\">18</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Special Care\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">60</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">October 19, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #CCCCCC\">Kathleen uncovers evidence about one of the State's star witnesses. Brendan's case takes another unexpected turn.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep19\" style=\"text-align:center\">19</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Friday Nite\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">63</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">October 19, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #CCCCCC\">A witness comes forward with new information about Teresa's car. Kathleen attempts to build the timeline of what happened to Teresa on Oct. 31, 2005.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep20\" style=\"text-align:center\">20</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Trust No One\"</td><td style=\"text-align:center\"><span class=\"duration\"><span class=\"min\">77</span>:<span class=\"s\">00</span></span></td><td style=\"text-align:center\">October 19, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #CCCCCC\">Kathleen makes two of the biggest discoveries of the case. Brendan's lawyers take his case to the next level.</td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}