{
  "imDbId": "tt5421602",
  "title": "Anne with an E",
  "fullTitle": "Anne with an E (TV Series 2017–2019)",
  "type": "TVSeries",
  "year": "2017",
  "language": "en",
  "titleInLanguage": "Anne with an E",
  "url": "https://en.wikipedia.org/wiki/Anne_with_an_E",
  "plotShort": {
    "plainText": "Anne with an E (initially titled Anne for its first season within Canada) is a Canadian television series loosely adapted from Lucy Maud Montgomery's 1908 classic work of children's literature, Anne of Green Gables. It was created by Moira Walley-Beckett for CBC and stars Amybeth McNulty as orphan Anne Shirley, Geraldine James as Marilla Cuthbert, R. H. Thomson as Matthew Cuthbert, Dalila Bela as Diana Barry and Lucas Jade Zumann as Gilbert Blythe.\r\nThe series premiered on March 19, 2017, on CBC and on May 12 internationally on Netflix. It was renewed for a second season in August 2017 and for a third season in August 2018. Shortly after the third season was released in 2019, CBC and Netflix announced the series had been canceled.\r\nAnne with an E received positive reviews and won Canadian Screen Award for Best Dramatic Series in both 2017 and 2018. The series tackles a range of issues such as orphaning, child abandonment, psychological trauma, social issues such as conformity, gender inequality, racism, religion, homosexuality, bullying and freedom of speech.",
    "html": "<p>Anne with an E (initially titled Anne for its first season within Canada) is a Canadian television series loosely adapted from Lucy Maud Montgomery's 1908 classic work of children's literature, Anne of Green Gables. It was created by Moira Walley-Beckett for CBC and stars Amybeth McNulty as orphan Anne Shirley, Geraldine James as Marilla Cuthbert, R. H. Thomson as Matthew Cuthbert, Dalila Bela as Diana Barry and Lucas Jade Zumann as Gilbert Blythe.</p><p>The series premiered on March 19, 2017, on CBC and on May 12 internationally on Netflix. It was renewed for a second season in August 2017 and for a third season in August 2018. Shortly after the third season was released in 2019, CBC and Netflix announced the series had been canceled.</p><p>Anne with an E received positive reviews and won Canadian Screen Award for Best Dramatic Series in both 2017 and 2018. The series tackles a range of issues such as orphaning, child abandonment, psychological trauma, social issues such as conformity, gender inequality, racism, religion, homosexuality, bullying and freedom of speech.</p>"
  },
  "plotFull": {
    "plainText": "Anne with an E (initially titled Anne for its first season within Canada) is a Canadian television series loosely adapted from Lucy Maud Montgomery's 1908 classic work of children's literature, Anne of Green Gables. It was created by Moira Walley-Beckett for CBC and stars Amybeth McNulty as orphan Anne Shirley, Geraldine James as Marilla Cuthbert, R. H. Thomson as Matthew Cuthbert, Dalila Bela as Diana Barry and Lucas Jade Zumann as Gilbert Blythe.\r\nThe series premiered on March 19, 2017, on CBC and on May 12 internationally on Netflix. It was renewed for a second season in August 2017 and for a third season in August 2018. Shortly after the third season was released in 2019, CBC and Netflix announced the series had been canceled.\r\nAnne with an E received positive reviews and won Canadian Screen Award for Best Dramatic Series in both 2017 and 2018. The series tackles a range of issues such as orphaning, child abandonment, psychological trauma, social issues such as conformity, gender inequality, racism, religion, homosexuality, bullying and freedom of speech.\r\nSynopsis\r\nIn 1896, elderly brother and sister Matthew and Marilla Cuthbert (who live together as they never married) decide to adopt an orphan boy to help out around their ancestral farm of Green Gables, on the outskirts of the Canadian town of Avonlea, Prince Edward Island. When Matthew goes to pick the child up at the railway station, he finds 13-year-old Anne Shirley, an imaginative, bright, high-spirited, and talkative girl, instead. Anne was orphaned when her parents died when she was a few months old, and lived as a servant in various households before being placed in an orphanage.\r\nWhile Matthew decides he would like her to stay, Marilla does not trust Anne, given her status as an unknown orphan and the perceived uselessness of a young girl. Her distrust appears confirmed when Marilla cannot locate a brooch, thus leading her to believe that Anne is a thief. The Cuthberts send her away, thus \"returning\" her to the orphanage. While she does arrive back at the orphanage, she is terrified to enter, haunted by the bullying she had endured there, and returns to the train station. Meanwhile, Marilla discovers that the brooch had been misplaced rather than stolen and that discovery leads her to understand that Anne is not a thief. Matthew consequently finds Anne and convinces her to return to Green Gables, where she is officially made part of their family. However, Anne continues to face bullying from students in the Avonlea school and class-based discrimination from Diana's parents and others in the community. Anne once again returns and attempts to gain acceptance by the rest of Avonlea, using her survival mechanisms of intelligence, problem-solving abilities, and imagination.\r\nCast\r\nMain character\r\nAmybeth McNulty as Anne Shirley (later called Anne Shirley-Cuthbert)\r\nGeraldine James as Marilla Cuthbert\r\nDalila Bela as Diana Barry\r\nLucas Jade Zumann as Gilbert Blythe\r\nAymeric Jett Montaz as Jerry Baynard\r\nR. H. Thomson as Matthew Cuthbert\r\nCorrine Koslo as Rachel Lynde (seasons 2–3; recurring season 1)\r\nDalmar Abuzeid as Sebastian \"Bash\" Lacroix (seasons 2–3)\r\nCory Grüter-Andrew as Cole Mackenzie (seasons 2–3)\r\nJoanna Douglas as Miss Muriel Stacy (season 3; recurring season 2)\r\nAshleigh Stewart as Winifred \"Winnie\" Rose (season 3)\r\nRecurring and guest\r\nJonathan Holmes as Mr. William Barry\r\nHelen Johns as Mrs. Eliza Barry\r\nRyan Kiera Armstrong as Minnie May Barry\r\nDeborah Grover as Josephine Barry\r\nWayne Best as John Blythe\r\nPhillip Williams as Thomas Lynde\r\nDavid Ingram as Mr. Harmon Andrews\r\nJanet Porter as Mrs. Andrews\r\nChristian Martyn as Billy Andrews\r\nLia Pappas-Kemps as Jane Andrews\r\nElla Jonas Farlinger as Prissy Andrews\r\nJim Annan as Mr. Gillis\r\nFiona Byrne as Mrs. Gillis\r\nKyla Matthews as Ruby Gillis\r\nJacob Ursomarzo as Moody Spurgeon\r\nStephen Tracey as Mr. Phillips\r\nMiranda McKeon as Josie Pye\r\nGlenna Walters as Tillie Boulter\r\nKatelyn Wells as Mary Joe\r\nJacob Horsley as Charlie Sloane\r\nTaras Lavren as Nate\r\nShane Carty as Mr. Dunlop\r\nCara Ricketts as Mary LaCroix\r\nAraya Mengesha as Elijah Hanford\r\nNicky Lawrence as Jocelyn\r\nLisa Codrington as Constance\r\nMelanie Nicholls-King as Hazel Lacroix\r\nKiawenti:io Tarbell as Ka'kwet\r\nBrandon Oakes as Aluk\r\nDana Jeffrey as Oqwatnuk\r\nInes Feghouli as Sandy Baynard\r\nTrenna Keating as Mrs. Pye\r\nBrenda Bazinet as Jeannie Pippett\r\nEpisodes\r\nSeason 1 (2017)\r\nThe first season was first aired on CBC on March 19, 2017. It premiered on Netflix on May 12, 2017. Titles of the season are quotes from Charlotte Brontë, Jane Eyre.\r\nSeason 2 (2018)\r\nThe entire second season premiered on Netflix on July 6, 2018, before premiering on CBC on September 23, 2018. Titles of the season are quotes from George Eliot, Middlemarch.\r\nSeason 3 (2019)\r\nThe third season was first aired on CBC on September 22, 2019. It premiered on Netflix on January 3, 2020. Titles of the season are quotes from Mary Shelley, Frankenstein.\r\nProduction\r\nDevelopment\r\nThe production companies are listed as Northwood Anne, Northwood Entertainment and Canadian Broadcasting Corporation. The executive producers are Miranda de Pencier and series creator Moira Walley-Beckett.\r\nAccording to de Pencier, the adaptation of the novel for this television series was intended to provide a different look and feel compared to past productions; they were aiming for a \"documentary level of realism\", as reflected in the extraordinary detail which has gone into the design of sets and costumes.\r\nProduction on the third season started in March 2019.\r\nCrew\r\nBesides the show itself having a larger number of female characters than male, women serving as executive producer and showrunner, the series has several female directors. Every writer on the series is also female; showrunner Moira Walley-Beckett scripted the entire first season, and was joined by a team of women writers in seasons 2 and 3.\r\nCasting\r\nApproximately 1800 girls on three continents auditioned for the role of Anne Shirley through an open casting call. Amybeth McNulty was chosen for her ability to deliver dialogue which is \"incredibly thick and dynamic and beautiful\", according to Miranda de Pencier. Walley-Beckett describes her as at once \"luminous\", transparent, smart, soulful and emotional. According to an interview with McNulty, an Irish Canadian whose career on stage has included roles in Annie, The Sound of Music, and Oliver!, and on screen in Agatha Raisin and Clean Break, her audition for Anne \"consisted of talking to trees, chatting with flowers and building thrones out of twigs.\"\r\nFilming\r\nThe series was occasionally filmed on Prince Edward Island but, for budgetary reasons, it was primarily filmed in Southern Ontario, at a Toronto studio, at outdoor locations in or near Toronto including Black Creek Pioneer Village, in Waterloo Region at locations including Doon Pioneer Village, Castle Kilbride, New Hamburg, Cambridge, and in communities such as Millbrook, Pickering, Orono, Hamilton, and Caledon.\r\nMusic\r\nThe opening theme is the song \"Ahead by a Century\" performed and originally composed by Canadian band The Tragically Hip. The series underscore is composed by Amin Bhatia and Ari Posner.\r\nThemes\r\nWhile \"many classic moments are dutifully re-created,\" Walley-Beckett constructed Anne with an E with \"a darker undercurrent\" than previous adaptations of Anne of Green Gables. She envisioned Anne as an antihero, adding original backstories to her adaptation that emphasized the impact of bullying, class-based discrimination, social isolation, and consequent PTSD on the construction of Anne's character (themes hinted at, but never elaborated upon, in the original novel). Walley-Beckett further states: \"In this day and age, themes of identity, prejudice, bullying, being an outsider, searching for a way to be accepted and how to belong are entirely topical and super relevant, and those are themes that are built into the story of Anne Shirley. She went on to call Anne Shirley an \"accidental feminist\", and how she \"really wanted to tell this story now\". Amybeth McNulty (who portrays Anne) also stated that, \"people might think are quite graphic ... but I think it was time to be honest.”\r\nSeason 2\r\nFor the second season, according to what she called her \"master plan\", Walley-Beckett introduced an entirely new character of her own, Bash, to reflect the racial diversity present in and around Charlottetown at the time of the novel, with a view to representing a community absent from previous adaptations, achieving this by having Gilbert travel on a steamship and meet with the new character in Trinidad: \"Bash is the vehicle to explore intolerance and inequality, even more when he goes to The Bog, when he learns that other black people live there.\" Walley-Beckett explained: \"The Bog is the community that's just outside of Charlottetown, where people of color were marginalized and had their own community there.\"\r\nSeason 3\r\nIn the third season, topics such as identity, feminism, bullying and gender parity were explored. The third season also focused on residential schools and treatment of Indigenous people in Canada's history.\r\nRelease\r\nThe series initially premiered on March 19, 2017, on CBC and aired on a weekly basis, the season finale airing on April 30, 2017. The series debuted on Netflix on May 12, 2017, under the title Anne with an E.\r\nOn August 3, 2017, CBC and Netflix renewed the series for a 10-episode second season, which premiered on Netflix on July 6, 2018, and on CBC on September 23, 2018. CBC adopted the Anne with an E name beginning in the second season.\r\nIn August 2018, CBC and Netflix renewed the series for a 10-episode third season, which premiered on September 22, 2019, on CBC and was released on Netflix on January 3, 2020.\r\nCancellation\r\nCBC president Catherine Tait stated in October 2019 that it would no longer involve itself in co-productions with Netflix, as they constitute deals \"that hurt the long-term viability of our domestic industry\". A day after the third season concluded its Canadian run and despite statements from CBC previously expressing \"no doubt that Canadians will continue to fall in love with this beautiful and heartwarming series for seasons to come,\" Netflix and CBC announced the show's cancellation the morning after the season three finale aired in Canada, marketing the season three release on Netflix as the show's \"final season.\"\r\nAlternate reasons for cancellation were given on November 27 in response to a Twitter campaign to save the show, namely a lack of audience growth in the 25–54 age range, which fans on Twitter and Facebook have challenged by questioning how CBC tracks viewers' ages, and the fact their CBC Gem app does not ask for personal information. Despite the CBC indicating that Netflix had agreed that the third season would be the show's last, fans started a concerted online and offline campaign, much of it led by Twitter fans through the hashtag #renewannewithane.\r\nThere were some fans who attempted to flood and bombard unrelated CBC and Netflix posts with the #renewannewithane hashtag (and general commentary regarding renewal) leading the CBC to block them from commenting on future posts. Netflix has never responded to campaign efforts.\r\nA petition was started by fans to protest the cancellation of the show, and is currently the largest petition ever started by a fanbase for a cancelled television show. Some fans also created an informative website for other fans where they can keep up to date on renewal efforts.\r\nFans also crowdfunded to erect billboards in an effort to garner attention of current and potential new viewers, but also other television networks and the press. In January 2020 a set of billboards were put on display at the centre of Yonge and Dundas Square in Toronto, and shortly after another large billboard was on display in Times Square, New York City. The fans followed this successful run with another several days of billboards in Toronto, using various art and imagery done by fans of the show from various parts of the world. Many of the cast and crew, including Amybeth and Moira, visited the billboards in person and posted on their social media pages.\r\nCanadian actor Ryan Reynolds and English singer Sam Smith also tweeted in support of the series.\r\nReception\r\nCritical response\r\nPalak Jayswal gives the entire series five out of five stars and notes that while classic works of literature are often best left intact, Anne with an E offers a useful case study of when \"the remake of a classic is done better than the original\". She suggests that while \"the Netflix adaptation is brutal\", its portrayal is one that is \"realistic of what life was like during the time period for an orphan girl\". She thus states that \"the reason this show is so successful is its ability to not only bring the original story to life but to add to it in a truly authentic way\". Erin Maxwell concurs, arguing that in contrast to Tiger King, \"Anne with an E might be the most wholesome and engaging TV show that no one in America is talking about. But it is definitely a show that needs to be consumed, discussed, and re-watched just as appreciatively\". She also notes that \"there are occasional changes in the narrative and attempts to be 'woke', but it wisely doesn't derail much from the original story\". Chad Jones qualifies the entire series as a \"cool\" adaptation of the novel, noting that \"from the theme song by The Tragically Hip to the assortment of timely issues – racism, feminism, bullying – that may have been hinted at in the book but have definitely been brought to the fore by creator Moira Walley-Beckett, this is not your grandmother's Green Gables\". Jon Hersey at The Objective Standard writes, \"If you can stand a tearjerker—and if you enjoy art that glorifies imagination, individualism, free inquiry, and the passionate pursuit of values—you may just fall in love with Walley-Beckett's Anne with an E\".\r\nSeason 1\r\nOn Rotten Tomatoes season 1 has an approval rating of 83% based on 29 critic reviews. The site's critical consensus states: \"Anne with an E uses its complex central character to offer a boldly stylish, emotionally resonant spin on classic source material that satisfies in its own right.\" The series has received a rating of 79 on Metacritic based on fifteen reviews, indicating \"generally favorable reviews\".\r\nEmily Ashby, writing for Common Sense Media, calls the series an \"exceptional\" and \"spectacular\" interpretation, giving it four out of five stars. Tasha Cerny, contributor for the Tracking Board, praises the cinematography as lush and colourful, the characters vibrant, and the plot \"surprisingly thrilling for a story about a young girl living in a small secluded community in the late nineteenth century. I laughed, I cried, and I didn't expect either from a show about a little girl.\" Gwen Inhat of The A.V. Club calls the series \"at once darker and sweeter than the original\" novel, praising the core cast, reserving the highest for the series lead:\r\nAmybeth McNulty defies her youth with a performance that's less a portrayal of Anne than an absolute possession. It can't be easy to make Anne's fanciful language sing the way she does, and McNulty captures the endearing awkwardness that enables Anne to win over everyone she comes in contact with.\r\nWriting of the 90-minute premiere episode for the Toronto Star, Johanna Schneller was appreciative of Walley-Beckett's departures from the novel, bringing its subtext to the fore: \"Reading between the novel's lines and adding verisimilitude, she gives us quick but potent glimpses of the miseries many orphans faced in 1890s imperialist culture.\" Hanh Nguyen, reviewing the series for IndieWire, concurred with this assessment, saying:\r\nRather than ruining the series, they give the context for why Anne would be filled with gratitude for the beauties of nature, basic human decency and having a family to call her own. Montgomery had based much of Anne's need for escape into imagination on her own lonely childhood, and her stories have always had an underlying poignancy that made them all the sweeter.\r\nJen Chaney, writing for Vulture.com, agrees, saying: \"What distinguishes it from other previous Anne iterations is its willingness to harden some of the story's softness, just enough, to create an element of realism that period pieces, Gables-related or not, can be inclined to avoid.\" Neil Genzlinger writing for The New York Times, commenting on reports of darkness and grittiness, also praises the production: \"Ms. McNulty's Anne is still wonderfully ebullient and eminently likable; she's just not the one-dimensional figure of other adaptations\". Annie Hirschlag, writing for Mic, suggests that a genuinely contemporary Anne is bound to reflect the current television landscape and wider culture of its times (the 2010s): \"Since today's entertainment is peppered with antiheroes — characters who are far from perfect, even occasionally villainous — it makes sense that Anne's familiar idealism is fringed with darkness and agony.\"\r\nSome reviewers were more ambivalent, mainly about Walley-Beckett's changes to the story. Canadian novelist Saleema Nawaz, who reviewed the 90-minute first episode for Toronto Life, said she enjoyed it more than she expected, particularly the set designs and costumes, as well as the performances by McNulty and Thomson, and she approved of the choice of theme song as reflective of the continued relevance of the source material. She was less sure about how far the series intended to stray from that source material, and disapproved of the \"manufactured drama, such as Matthew's wild horse ride\". Writing for Entertainment Weekly, Isabella Beidenharn expressed similar feelings, but, \"putting the source material aside, it's a fine show on its own\", and she conceded that \"inventing a dark side might help Anne With an E fit into today's TV landscape\". Allison Keene, writing for Collider, agrees that Anne is a good drama on its own terms, but allows it is \"only a fair adaptation\" of the novel, at its best in the home scenes: \"Anne with an E is undeniably the most stylish adaptation we've ever seen of Anne of Green Gables. But its desire to reveal more of Anne's miserable past in order to be more true to what the desperation of an orphan is like feels at odds with Montgomery's story.\" Writing for Variety, critic Sonia Saraiya is even more ambivalent, describing the series as on the one hand \"a brilliant adaptation\" which \"succeeds admirably\", but on the other hand, \"the show can't quite sustain the brilliance, veering first into maudlin territory and then into the oddly saccharine as it tests out its tone\", contending that \"the show gets a bit bogged down in telling the story of Anne's dysfunction\", presenting \"a slightly soapy view of Anne's trials and tribulations that at times really humanize her and in others, are rather infantilizing\".\r\nSarah Larson, writing for The New Yorker, was not at all impressed with changes made to the story, arguing that they alter Anne's character to the point of non-recognition. While she acknowledges that bringing subtext to the fore is a fine idea, she is not pleased with the execution, saying that the result is part \"the Anne we know and love\" and part \"untrustworthy stranger\", calling the alteration and addition of scenes a \"betrayal\" of Montgomery's novel, comparing the treatment unfavourably to Patricia Rozema's 1999 adaptation of Jane Austen's Mansfield Park. Laura Finch writing for \"World\", agrees, saying, \"...despite some of the positive feminist themes found here (like whether or not girls should go to school), it's often hard to find the original Anne amid the extraneous storylines.\" For Joanna Robinson, writing for Vanity Fair, a central problem with the show is that it \"seems to think that in order for Anne to be a feminist figure, she has to butt up against a straw-man-filled patriarchy,\" and so it turned many of the male characters into misogynists, most notably the Reverend Allan, who is considered by Anne to be a \"kindred spirit\" in the book: \"Anne with an E seems to think Anne's triumphs are only noteworthy if she's continually told she can't succeed, when in fact her unfettered brilliance needs no such clumsy opposition. It also seems to think that Anne needs a radical feminist makeover when, in fact, the story of her success was feminist in its own right.\" This is part of a more general problem Robinson notes, that conflicts are exaggerated and overdone: \"this series thrives on non-stop tragedy.\"\r\nSeason 2\r\nOn Rotten Tomatoes, season 2 has an approval rating of 43% based on 8 critic reviews, with an average rating of 8/10. Hanh Nguyen writes that despite \"periods of melancholy and turmoil, this season feels more energetic and subsequently lighter because of the faster pace. It also is more comfortable in its skin and handles humor in its everyday situations deftly while also poking fun at itself.\" Allison Keene, despite her misgivings about the first season's divergence from the original novel, says it grew on her; she approves of the second season's \"major shift in tone\" and how, in moving away from the books and expanding the world, \"it also moves towards excellence.\" Conversely, Heather Hogan, who \"hated\" the first season for similar reasons in her review of the first season, and despite loving the now open \"gayness\" of the second season, nevertheless concludes her review thus: \"Anne With an E continues to use characters shoehorned in from 2018 to explain race and gender and sexuality to people on Prince Edward Island in 1908 as a way of explaining those things to people watching television on the internet in 2018. It's clunky and weird and sometimes embarrassing. The dialogue sometimes feels like it was written in an alien language and run through Google Translator. The drama is so overwrought it's ridiculous. The characters remain unrecognizable.\"\r\nMeghan O'Keefe, who was \"charmed\" by the first season, is \"baffled\" by the second season's choices of new storylines: \"I'm not such a purist that I need TV adaptations to hit every beat of a novel, but I do think that television made for families should understand what their own core philosophy is. While Walley-Beckett's instincts are good, I think this show is too enamored with its trappings of darkness to realize that Anne of Green Gables has endured this long because people love the small specificity of the characters' lives. Warping these details for showier TV kind of dilutes the story.\" Author Amy Glynn says \"it's agonizing because it is visually lovely and incredibly well-acted sanctimonious twaddle.\"\r\nSeason 3\r\nOn Rotten Tomatoes, season 3 has three positive (out of three) critic reviews. Alici Rengifo finds that the series ends on a fitting note, bringing Anne to a point of \"real growth\"; the finale is \"all about how life does indeed go on\". Shannon Campe lamented: \"It's hard not to feel the series was ending just as it began to find its voice, even if it muddles some of its 'kid-friendly' messages on racism and other issues\". Rengifo appreciates the final season's \"many little twists, journeys and a vast array of characters\".\r\nIt's a shame this show has to leave, it has a classic style that harkens back to books like Little Women, while updating the tone for contemporary viewers who could have a lot of fun while taking in a few life lessons along the way. Anne will be missed, hopefully she'll have heirs.\r\nAwards and nominations",
    "html": "<p>Anne with an E (initially titled Anne for its first season within Canada) is a Canadian television series loosely adapted from Lucy Maud Montgomery's 1908 classic work of children's literature, Anne of Green Gables. It was created by Moira Walley-Beckett for CBC and stars Amybeth McNulty as orphan Anne Shirley, Geraldine James as Marilla Cuthbert, R. H. Thomson as Matthew Cuthbert, Dalila Bela as Diana Barry and Lucas Jade Zumann as Gilbert Blythe.</p><p>The series premiered on March 19, 2017, on CBC and on May 12 internationally on Netflix. It was renewed for a second season in August 2017 and for a third season in August 2018. Shortly after the third season was released in 2019, CBC and Netflix announced the series had been canceled.</p><p>Anne with an E received positive reviews and won Canadian Screen Award for Best Dramatic Series in both 2017 and 2018. The series tackles a range of issues such as orphaning, child abandonment, psychological trauma, social issues such as conformity, gender inequality, racism, religion, homosexuality, bullying and freedom of speech.</p><br/><h3>Synopsis</h3><p>In 1896, elderly brother and sister Matthew and Marilla Cuthbert (who live together as they never married) decide to adopt an orphan boy to help out around their ancestral farm of Green Gables, on the outskirts of the Canadian town of Avonlea, Prince Edward Island. When Matthew goes to pick the child up at the railway station, he finds 13-year-old Anne Shirley, an imaginative, bright, high-spirited, and talkative girl, instead. Anne was orphaned when her parents died when she was a few months old, and lived as a servant in various households before being placed in an orphanage.</p><p>While Matthew decides he would like her to stay, Marilla does not trust Anne, given her status as an unknown orphan and the perceived uselessness of a young girl. Her distrust appears confirmed when Marilla cannot locate a brooch, thus leading her to believe that Anne is a thief. The Cuthberts send her away, thus \"returning\" her to the orphanage. While she does arrive back at the orphanage, she is terrified to enter, haunted by the bullying she had endured there, and returns to the train station. Meanwhile, Marilla discovers that the brooch had been misplaced rather than stolen and that discovery leads her to understand that Anne is not a thief. Matthew consequently finds Anne and convinces her to return to Green Gables, where she is officially made part of their family. However, Anne continues to face bullying from students in the Avonlea school and class-based discrimination from Diana's parents and others in the community. Anne once again returns and attempts to gain acceptance by the rest of Avonlea, using her survival mechanisms of intelligence, problem-solving abilities, and imagination.</p><br/><h3>Cast</h3><h4>Main character</h4><ul><li>Amybeth McNulty as Anne Shirley (later called Anne Shirley-Cuthbert)</li><li>Geraldine James as Marilla Cuthbert</li><li>Dalila Bela as Diana Barry</li><li>Lucas Jade Zumann as Gilbert Blythe</li><li>Aymeric Jett Montaz as Jerry Baynard</li><li>R. H. Thomson as Matthew Cuthbert</li><li>Corrine Koslo as Rachel Lynde (seasons 2–3; recurring season 1)</li><li>Dalmar Abuzeid as Sebastian \"Bash\" Lacroix (seasons 2–3)</li><li>Cory Grüter-Andrew as Cole Mackenzie (seasons 2–3)</li><li>Joanna Douglas as Miss Muriel Stacy (season 3; recurring season 2)</li><li>Ashleigh Stewart as Winifred \"Winnie\" Rose (season 3)</li></ul><h4>Recurring and guest</h4><ul><li>Jonathan Holmes as Mr. William Barry</li><li>Helen Johns as Mrs. Eliza Barry</li><li>Ryan Kiera Armstrong as Minnie May Barry</li><li>Deborah Grover as Josephine Barry</li><li>Wayne Best as John Blythe</li><li>Phillip Williams as Thomas Lynde</li><li>David Ingram as Mr. Harmon Andrews</li><li>Janet Porter as Mrs. Andrews</li><li>Christian Martyn as Billy Andrews</li><li>Lia Pappas-Kemps as Jane Andrews</li><li>Ella Jonas Farlinger as Prissy Andrews</li><li>Jim Annan as Mr. Gillis</li><li>Fiona Byrne as Mrs. Gillis</li><li>Kyla Matthews as Ruby Gillis</li><li>Jacob Ursomarzo as Moody Spurgeon</li><li>Stephen Tracey as Mr. Phillips</li><li>Miranda McKeon as Josie Pye</li><li>Glenna Walters as Tillie Boulter</li><li>Katelyn Wells as Mary Joe</li><li>Jacob Horsley as Charlie Sloane</li><li>Taras Lavren as Nate</li><li>Shane Carty as Mr. Dunlop</li><li>Cara Ricketts as Mary LaCroix</li><li>Araya Mengesha as Elijah Hanford</li><li>Nicky Lawrence as Jocelyn</li><li>Lisa Codrington as Constance</li><li>Melanie Nicholls-King as Hazel Lacroix</li><li>Kiawenti:io Tarbell as Ka'kwet</li><li>Brandon Oakes as Aluk</li><li>Dana Jeffrey as Oqwatnuk</li><li>Ines Feghouli as Sandy Baynard</li><li>Trenna Keating as Mrs. Pye</li><li>Brenda Bazinet as Jeannie Pippett</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired (Canada)</th><th scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\">Netflix release date (international)</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 19, 2017</td><td style=\"padding:0 8px\">April 30, 2017</td><td>May 12, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 23, 2018</td><td style=\"padding:0 8px\">November 18, 2018</td><td>July 6, 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 22, 2019</td><td style=\"padding:0 8px\">November 24, 2019</td><td>January 3, 2020</td></tr></tbody></table><h4>Season 1 (2017)</h4><p>The first season was first aired on CBC on March 19, 2017. It premiered on Netflix on May 12, 2017. Titles of the season are quotes from Charlotte Brontë, Jane Eyre.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#475A69;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#475A69;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#475A69;width:36%\">Title</th><th scope=\"col\" style=\"background:#475A69;width:18%\">Directed by</th><th scope=\"col\" style=\"background:#475A69;width:20%\">Written by</th><th scope=\"col\" style=\"background:#475A69;width:16%\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Your Will Shall Decide Your Destiny\"</td><td style=\"text-align:center\"><span>Niki Caro</span></td><td style=\"text-align:center\"><span>Moira Walley-Beckett</span></td><td style=\"text-align:center\">March 19, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #475A69\">Thirteen-year-old <span>Anne Shirley</span> is a bright, over-imaginative orphan. The talkative girl is overjoyed when Marilla and Matthew Cuthbert, the aging siblings who own Green Gables farm in Avonlea, adopt her. Upon arriving, Anne discovers they expected a boy to serve as a hand to Matthew. While Matthew immediately likes the girl, Marilla is determined to send her back, but relents after glimpsing what Anne's life would be. She agrees to a one-week trial period. Anne is determined to show the Cuthberts her usefulness on the farm and Marilla eventually grows a liking to the young girl and Anne finds a friend in Diana Barry. However, when Marilla cannot find a precious brooch, she accuses Anne of stealing it. Anne denies taking it, but when Marilla threatens to send her away unless she confesses, Anne claims she lost it while playing with it outdoors. Marilla sends Anne back to the orphanage, but later discovers the brooch fell in-between the chair cushions. She sends Matthew after Anne, but he arrives at the train station too late.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"I Am No Bird, and No Net Ensnares Me\"</td><td style=\"text-align:center\"><span>Helen Shaver</span></td><td style=\"text-align:center\">Moira Walley-Beckett</td><td style=\"text-align:center\">March 26, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #475A69\">Plagued with memories of being bullied and tormented, Anne arrives at the orphanage. Meanwhile, Matthew tries to catch up with her. Marilla, worried and anxious at Green Gables, wants to follow them, but her friend Mrs. Lynde convinces her to stay. Meanwhile, Anne has slept outside the orphanage and convinces a milkman to take her with him, saying she’s just found about relatives who wish to adopt her.  When Matthew arrives at the orphanage looking for the girl, the matron says Anne has not returned. The milkman tells Matthew he encountered Anne the day before, leading Matthew to understand where she is. They reunite at the train station where Anne recites poems for change. Anne is reluctant to return, but when Matthew calls her his daughter, she embraces him. Back in Avonlea, Anne is saddened when Marilla does not express joy for her return; the next Sunday, Anne, Matthew, and Marilla attend a church picnic and Anne runs away after hearing the townspeople's hateful comments about her. Marilla finds her and asks for forgiveness. The Cuthberts ask Anne to take their last name by signing the family Bible, which she does excitedly, becoming officially part of the family.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"But What Is So Headstrong as Youth?\"</td><td style=\"text-align:center\"><span>Sandra Goldbacher</span></td><td style=\"text-align:center\">Moira Walley-Beckett</td><td style=\"text-align:center\">April 2, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #475A69\">Anne is excited to begin school and make friends, but her high hopes are met with disappointment when she gets teased and bullied for her looks and queer way of expressing herself. Marilla too, tests new waters as she accepts an invitation to join a \"Progressive Mothers\" group. After watching older student Prissy Andrews in an intimate moment with their teacher Mr. Phillips, Anne naively suggest to her classmates they were having sex and recounts scenes of violence she witnesses in the last family she served, causing her classmates and the town to isolate her even more. Because of this Marilla is no longer invited to the \"Progressive Mothers\" meetings and, on the way to school, Anne receives threats from Prissy’s brother, Billy Andrews, but is promptly rescued by Gilbert Blythe, who has returned to school and tries to befriend Anne. Anne refuses Gilbert’s attention when she’s informed that he was liked by one of her other classmates and decides to ignore him, in an attempt to be accepted by her peers. Trying to catch her attention Gilbert pulls one of her braids and calls her \"carrots\", causing Anne to hit him over the head with her slate. After being chastised in front of the class, she runs from the classroom and arrives home crying in Marilla's arms saying she will no longer go back to school.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"An Inward Treasure is Born\"</td><td style=\"text-align:center\">David Evans</td><td style=\"text-align:center\">Moira Walley-Beckett</td><td style=\"text-align:center\">April 9, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #475A69\">The Cuthberts worry about Anne's increasing isolation, as she continues to refuse to go to school. Marilla asks for advice to Mrs. Rachel Lynde who suggests to keep Anne home, but when a distracted Anne burns a pie in the oven, Marilla resolves to have her go back to school. Anne decides to lie and pretend to go to school, while she spends the days in the woods fantasizing and inventing stories. When her lies about going to school are later exposed, the minister suggests Anne to be educated at home and taught to be a good wife. After a fire at the Gillis house, during which Anne heroically runs into the burning house to close doors and windows to deprive the fire of oxygen, Ruby stays with the Cuthberts and becomes friends with Anne. After talking to Marilla who leaves the choice up to the girl, Anne eventually decides to return to school, experiencing the enthusiastic welcome she initially wished for.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Tightly Knotted to a Similar String\"</td><td style=\"text-align:center\"><span>Patricia Rozema</span></td><td style=\"text-align:center\">Moira Walley-Beckett</td><td style=\"text-align:center\">April 16, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #475A69\">Anne has finally caught up with the best student in her class, Gilbert Blythe, but she does not get to celebrate as she must cope with the inevitability of womanhood when she gets her very first <span>period</span>. In an attempt to help Anne feel better, Marilla proposes Anne invites Diana over for  “grown-up” tea, but the afternoon turns into a disaster when Anne mistakes red wine for raspberry cordial and serves it to her guest, the both of them ending up drunk. When Diana’s mother comes to retrieve her daughter and finds the two girls drunk, she forbids Diana to ever see Anne again, believing Anne is no good fit for her daughter. Matthew buys Anne a present she has been longing for, a dress with <span class=\"new\">puff sleeves</span> and encounters Jeannie, an old school friend who he hasn’t seen ever since he abandoned school after his older brother’s death. Separated at school, Anne and Diana managed to get a few moments together during recess and swear love and devotion to each other, promising they won’t have another friend. Anne is overjoyed by Matthew’s present, finally having realized her dream of possessing a dress with puff sleeves.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Remorse Is the Poison of Life\"</td><td style=\"text-align:center\">Paul Fox</td><td style=\"text-align:center\">Moira Walley-Beckett</td><td style=\"text-align:center\">April 23, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #475A69\">When her younger sister Minnie May becomes ill with <span>croup</span>, Diana runs to Green Gables for help. Anne manages to save Minnie May through her previous experiences serving and amazes everyone, Diana’s visiting great-aunt Josephine included, who takes a particular liking to Anne. Meanwhile, the Blythe farm sees change, as Gilbert’s sick father John passes, leaving the boy to fend for himself. During the funeral, Marilla reminisces on her youth and her love for John Blythe, while Anne inadvertently insults Gilbert when she tries to dispense advice on how to be an orphan. Anne talks to Aunt Josephine, who just lost her friend Gertrude, and decides to take the old woman as her role model, planning to make her own path in the world. Anne, Diana and Ruby Gillis prepare food to console Gilbert and Anne discusses <span>Jane Eyre</span> with Aunt Josephine; as the three girls bring the food to Gilbert, Anne refuses to face him and runs off and she talks to Josephine, who reveals she and Gertrude spent their lives together because they were in love. Marilla pays a visit to John Blythe’s grave and confesses Gilbert his father had asked her to leave Avonlea with him, but she wasn’t brave enough; Gilbert is reminded of his father’s love for adventure and travel and he decides to leave the farm and Avonlea. Matthew receives some unsettling news when he discovers that the ship carrying his crops’ results sank and he takes out a loan on Green Gables.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Wherever You Are Is My Home\"</td><td style=\"text-align:center\"><span>Amanda Tapping</span></td><td style=\"text-align:center\">Moira Walley-Beckett</td><td style=\"text-align:center\">April 30, 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #475A69\">Marilla and Anne learn about Matthew’s doing and, during a lively confrontation with his sister, Matthew suffers a heart attack. He survives, but he’s confined in bed, while Anne and Marilla pay a visit to the bank, finding out that the bank is going to pull the loan back. Anne and Marilla decide to raise the money to save their home by selling all precious items and putting an ad in the paper looking for boarders; Marilla grimly announces that they are to let Jerry go because they can’t pay him any more. Anne and Jerry head to <span class=\"new\">Charlottestown</span>, where Anne deals with a tough pawnbroker and invents adventurous stories about the items to up their price. Anne decides to contribute to the cause by selling her puff-sleeved dress and meets Miss Jeannie who recognizes her as “Matthew’s Anne”. Anne encounters Gilbert, who is working on the docks and trying to get on a ship: they apologize and declare a truce; meanwhile, Jerry gets attacked and his money stolen by two mysterious men. A guilt-ridden Matthew confesses to his sister he wishes he’d die, leaving Marilla and Anne his life insurance money. Anne and beaten-up Jerry spend the night at Josephine Barry’s house and, after learning about the Cuthberts’ situation, Josephine hires Jerry to work at Green Gables and gifts Anne a <span>George Eliot</span> book containing money, claiming that “love isn’t charity”. A desperate Matthew tries to take his life, but he’s saved by Miss Jeannie and Marilla, who angrily accuses him of wanting to leave her and Anne. Matthew apologizes and welcomes Anne back home. With Christmas approaching, Anne sells her service as a cleaner to the families of Avonlea and the Cuthberts take in two boarders, emerging from their financial crisis.</td></tr></tbody></table><h4>Season 2 (2018)</h4><p>The entire second season premiered on Netflix on July 6, 2018, before premiering on CBC on September 23, 2018. Titles of the season are quotes from George Eliot, Middlemarch.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#46214C;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#46214C;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#46214C;width:36%\">Title</th><th scope=\"col\" style=\"background:#46214C;width:18%\">Directed by</th><th scope=\"col\" style=\"background:#46214C;width:20%\">Written by</th><th scope=\"col\" style=\"background:#46214C;width:16%\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Youth is the Season of Hope\"</td><td style=\"text-align:center\"><span>Helen Shaver</span></td><td style=\"text-align:center\"><span>Moira Walley-Beckett</span></td><td style=\"text-align:center\">September 23, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #46214C\">The Cuthberts' boarders, who are conmen, claim there is gold in Avonlea. Nate, one of the boarders, offers to help the residents of Avonlea in testing their soil for gold for $150 per property.  Elsewhere, Gilbert makes a new friend, Bash, at sea.  Anne, Marilla, and Matthew make a trip to the beach.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Signs are Small Measurable Things, but Interpretations are Illimitable\"</td><td style=\"text-align:center\">Paul Fox</td><td style=\"text-align:center\">Shernold Edwards</td><td style=\"text-align:center\">September 30, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #46214C\">The steamer lands in Trinidad, bringing Bash face to face with his mother and his past. The Barrys get behind the gold rush, but Matthew and Marilla decide not to spend the $150 to have their land tested for gold.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The True Seeing is Within\"</td><td style=\"text-align:center\"><span>Ken Girotti</span></td><td style=\"text-align:center\"><span>Kathryn Borel, Jr.</span></td><td style=\"text-align:center\">October 7, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #46214C\">Anne goes with the Barrys to Charlottetown.  There, she and Diana investigate the claims of gold in Avonlea, and are told by a journalist that a scam like this had happened in another part of Canada a few years ago, and claims of gold in Avonlea are also probably fake.  Anne tries to warn the Barrys about this, but is sternly rebuffed.  Mr. Barry gives all of the money to Nate, who now plans to leave with Dunlop.  Anne warns Marilla about Nate and Dunlop, but the men overhear her and tie them up. They escape and notify Matthew of what has happened, and he along with his neighbors ride to try to catch them. Dunlop is caught, but Nate escapes with all the money.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Painful Eagerness of Unfed Hope\"</td><td style=\"text-align:center\"><span>Anne Wheeler</span></td><td style=\"text-align:center\">Jane Maggs</td><td style=\"text-align:center\">October 14, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #46214C\">Pretending she is Matthew, Anne writes letters to Jeannie to try to rekindle a romance. Matthew eventually finds out and tells Anne how hurt he is with what she has done, which devastates her. Matthew meets Jeannie in town and tells her of Anne's ruse, but that he wants to spend his remaining years raising Anne. Diana and Minnie May are being trained by their mother on how to be ladies, which causes tremendous tension in their household. A pregnant woman needs Gilbert's help to deliver her baby.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Determining Acts of Her Life\"</td><td style=\"text-align:center\"><span>Norma Bailey</span></td><td style=\"text-align:center\">Amanda Fahey</td><td style=\"text-align:center\">October 21, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #46214C\">A game of <span>Spin the Bottle</span> prompts burning questions about love and beauty. Anne and Cole bond over their differences as Gilbert makes his way back to Avonlea, bringing along Bash.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"I Protest Against Any Absolute Conclusion\"</td><td style=\"text-align:center\">Ken Girotti</td><td style=\"text-align:center\">Naledi Jackson</td><td style=\"text-align:center\">October 28, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #46214C\">Anne faces the world with very short hair, after having ruined it trying to dye it raven black. The town preps for its annual Christmas pantomime, and Anne is unexpectedly thrust into one of the lead roles at the last minute. Gilbert and Bash join the Cuthberts for Christmas dinner. A jealous Billy causes Cole to fall, who ends up breaking his wrist.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Memory Has as Many Moods as the Temper\"</td><td style=\"text-align:center\">Anne Wheeler</td><td style=\"text-align:center\">Jane Maggs</td><td style=\"text-align:center\">November 4, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #46214C\">Cole accompanies the girls to Great-Aunt Josephine's for a lavish party filled with surprises. Back at home, Marilla begins having debilitating headaches, and worries that she will be a burden to Anne as her late mother was to her.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep15\" style=\"text-align:center\">15</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Struggling Against the Perception of Facts\"</td><td style=\"text-align:center\"><span>Amanda Tapping</span></td><td style=\"text-align:center\">Shernold Edwards</td><td style=\"text-align:center\">November 11, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #46214C\">Marilla sees an oculist, and is given new reading glasses.  Bash encounters racism in Avonlea, and meets a woman in \"the Bog,\" a nearby place where all the black people in the area seem to live.  Marilla buys back a number of her family heirlooms that she sees displayed at a local pawn shop.  After being told by Mr. Phillips that she cannot go to college after they are married, Priscilla leaves him at the altar on their wedding day.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep16\" style=\"text-align:center\">16</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"What We Have Been Makes Us What We Are\"</td><td style=\"text-align:center\">Paul Fox</td><td style=\"text-align:center\">Moira Walley-Beckett</td><td style=\"text-align:center\">November 18, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #46214C\">A brand-new teacher named Miss Stacy brings unconventional methods – and a motorbike – to Avonlea. Gilbert's plan to speed up his studies leaves Bash feeling lost.  Anne is smitten with the new teacher because she feels Miss Stacy is a kindred spirit.  The boys who have bullied Cole come upon his secret building in the woods and destroy it along with all his sculptures.  Cole realizes that it is probably Billy, and comes back to school and gets into a fight with him.  Anne is extremely upset and consumed with the trap set by Matthew to catch her beloved fox.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep17\" style=\"text-align:center\">17</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Growing Good of the World\"</td><td style=\"text-align:center\">Paul Fox</td><td style=\"text-align:center\">Moira Walley-Beckett</td><td style=\"text-align:center\">November 18, 2018</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #46214C\">A town hall meeting is called to decide on the fate of Miss Stacy, but Anne and her friends demonstrate their love and need for her, and the town votes to keep Miss Stacy as the teacher for Avonlea. Great-Aunt Josephine permits Cole to stay with her in Charlottetown. Meanwhile, Bash and Mary marry.</td></tr></tbody></table><h4>Season 3 (2019)</h4><p>The third season was first aired on CBC on September 22, 2019. It premiered on Netflix on January 3, 2020. Titles of the season are quotes from Mary Shelley, Frankenstein.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#31471B;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#31471B;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#31471B;width:36%\">Title</th><th scope=\"col\" style=\"background:#31471B;width:18%\">Directed by</th><th scope=\"col\" style=\"background:#31471B;width:20%\">Written by</th><th scope=\"col\" style=\"background:#31471B;width:16%\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep18\" style=\"text-align:center\">18</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A Secret Which I Desired to Divine\"</td><td style=\"text-align:center\"><span>Anne Wheeler</span></td><td style=\"text-align:center\"><span>Moira Walley-Beckett</span></td><td style=\"text-align:center\">September 22, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #31471B\">As Anne's sixteenth birthday approaches, she finds herself longing to know more about her lineage, which surprises and distresses Matthew and Marilla. Nevertheless, they agree to let her go back to the orphanage to learn more, as long as she is chaperoned.  Mary and Bash have a baby girl, and Marilla comes over three times a week to help them out.  Diana is upset that her parents will not let her study at Queens next year with the rest of her friends.  Anne writes an article about a local Indian tribe, and becomes friends with one of the girls there.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep19\" style=\"text-align:center\">19</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"There is Something at Work in My Soul Which I Do Not Understand\"</td><td style=\"text-align:center\"><span>Kim Nguyen</span></td><td style=\"text-align:center\">Jane Maggs</td><td style=\"text-align:center\">September 29, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #31471B\">Anne's search takes her back to the orphanage, but they do not have records of her parents.  Cole suggests they come back the following week and go the local church to see if they have any information on Anne's parents. Meanwhile, Elijah pays a visit to Avonlea, but resents that Mary has a new baby, and gets drunk.  He later ends up leaving and steals some of Gilbert's valuables. Gilbert meets a woman named Winifred Rose.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep20\" style=\"text-align:center\">20</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"What Can Stop the Determined Heart\"</td><td style=\"text-align:center\">Anne Wheeler</td><td style=\"text-align:center\">Shernold Edwards</td><td style=\"text-align:center\">October 6, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #31471B\">Mary is diagnosed with <span>sepsis</span>, and the doctor gives her only about 1–2 weeks to live.  In response to this, the Avonlea community surprises Mary on Easter with a big party at the Barry residence.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep21\" style=\"text-align:center\">21</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A Hope of Meeting You in Another World\"</td><td style=\"text-align:center\">Norma Bailey</td><td style=\"text-align:center\"><span>Tracey Deer</span></td><td style=\"text-align:center\">October 13, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #31471B\">Matthew permits Anne to continue her search for information about her birth parents, despite Marilla's misgivings. While doing her research, Anne discovers that they did die when she was a baby, and that they were originally from Scotland. Following Mary's death, Bash tries to give her letter to Elijah but they end up getting in a fistfight. Ka’kwet is excited to be going to a Canadian school for Indians, but is very unhappy with the school's imperialist regime once she is there. Diana fakes an ankle injury to spend time away from her parents.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep22\" style=\"text-align:center\">22</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"I Am Fearless and Therefore Powerful\"</td><td style=\"text-align:center\">Paul Fox</td><td style=\"text-align:center\">Naledi Jackson</td><td style=\"text-align:center\">October 20, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #31471B\">The school kids practice for the upcoming County Fair barn dance, bringing romantic anxieties to a head. The girls are plagued with fears about marriage and motherhood. Gilbert writes an obituary for Mary in the school newspaper. Jerry walks Diana home from school, and a potential romance begins.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep23\" style=\"text-align:center\">23</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Summit of My Desires\"</td><td style=\"text-align:center\">Norma Bailey</td><td style=\"text-align:center\">Amanda Fahey</td><td style=\"text-align:center\">October 27, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #31471B\">Avonlea hosts the Island County Fair.  Jerry and Diana become closer, while a jealous Anne lashes out at Gilbert when she sees him with Winifred Rose.  Meanwhile, Billy besmirches the reputation of Josie.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep24\" style=\"text-align:center\">24</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A Strong Effort of the Spirit of Good\"</td><td style=\"text-align:center\">Paul Fox</td><td style=\"text-align:center\">Kathryn Borel, Jr</td><td style=\"text-align:center\">November 3, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #31471B\">Anne's opinion article isn't received quite as she planned, and the town elders ban Anne from the newspaper, and direct them on what they can and can't write about.  In protest, Anne organizes a protest with her friends claiming that they should have freedom of speech.  Anne and Diana get into a fight with each other, and are no longer friends.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep25\" style=\"text-align:center\">25</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Great and Sudden Change\"</td><td style=\"text-align:center\"><span>Amanda Tapping</span></td><td style=\"text-align:center\">Jane Maggs</td><td style=\"text-align:center\">November 10, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #31471B\">The town elders secretly burn down the school and take their printing press.  Mrs. Lynde realizes that they did it, and threatens to tell everyone unless three more women are added to the town board.  The students sit for the Queens entrance exams, including Diana, who is encouraged by Aunt Josephine to take it. Ka'kwet runs away from residential school and returns to her village. Bash's mother comes to Avonlea to help take care of the baby.  Mr. Rose gives permission to Gilbert to marry his daughter, and intimates that he will help pay for his medical education in Paris.  Before going forward with his proposal to Winifred, Gilbert speaks with Anne to see if she might want to be with him, but Anne is unsure what to do, and dismisses him.  Diana and Anne make up and become friends again.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep26\" style=\"text-align:center\">26</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A Dense and Frightful Darkness\"</td><td style=\"text-align:center\">Paul Fox</td><td style=\"text-align:center\">Tracey Deer &amp; Shernold Edwards</td><td style=\"text-align:center\">November 17, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #31471B\">The authorities come back to the Indian village and forcibly remove Ka'kwet and bring her back to school. Matthew and Anne journey with Ka'kwet's parents to bring Ka'kwet back. Anne writes down her feelings for Gilbert in a note, but the note is misplaced and Gilbert never reads it. Instead, he travels to Charlottetown to propose to Winifred. Bash and his mother argue about their differences. With her parents unable to gain access, Ka'kwet remains alone at her school.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep27\" style=\"text-align:center\">27</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Better Feeling of My Heart\"</td><td style=\"text-align:center\">Amanda Tapping</td><td style=\"text-align:center\">Moira Walley-Beckett</td><td style=\"text-align:center\">November 24, 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #31471B\">Most of the students pass their test for acceptance into Queen's College. Diana is also accepted, but it takes some time before her parents will permit her to attend. Gilbert ends up telling Winifred that he can't ask her to marry him, as he is in love with someone else. Meanwhile, Anne rips up a note without reading it where Gilbert professes his love to her. Marilla and Matthew discover information about Anne's deceased parents. A reformed Elijah returns, and Bash and his mother eventually allow him to stay. Anne and Gilbert eventually find out about each other's feelings, share a kiss and promise to stay in touch while she is at Queen's College and he is at University of Toronto. In her first letter to Gilbert, Anne delightedly reports that her red hair is inherited from her late mother Bertha.</td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>The production companies are listed as Northwood Anne, Northwood Entertainment and Canadian Broadcasting Corporation. The executive producers are Miranda de Pencier and series creator Moira Walley-Beckett.</p><p>According to de Pencier, the adaptation of the novel for this television series was intended to provide a different look and feel compared to past productions; they were aiming for a \"documentary level of realism\", as reflected in the extraordinary detail which has gone into the design of sets and costumes.</p><p>Production on the third season started in March 2019.</p><h4>Crew</h4><p>Besides the show itself having a larger number of female characters than male, women serving as executive producer and showrunner, the series has several female directors. Every writer on the series is also female; showrunner Moira Walley-Beckett scripted the entire first season, and was joined by a team of women writers in seasons 2 and 3.</p><h4>Casting</h4><p>Approximately 1800 girls on three continents auditioned for the role of Anne Shirley through an open casting call. Amybeth McNulty was chosen for her ability to deliver dialogue which is \"incredibly thick and dynamic and beautiful\", according to Miranda de Pencier. Walley-Beckett describes her as at once \"luminous\", transparent, smart, soulful and emotional. According to an interview with McNulty, an Irish Canadian whose career on stage has included roles in Annie, The Sound of Music, and Oliver!, and on screen in Agatha Raisin and Clean Break, her audition for Anne \"consisted of talking to trees, chatting with flowers and building thrones out of twigs.\"</p><h4>Filming</h4><p>The series was occasionally filmed on Prince Edward Island but, for budgetary reasons, it was primarily filmed in Southern Ontario, at a Toronto studio, at outdoor locations in or near Toronto including Black Creek Pioneer Village, in Waterloo Region at locations including Doon Pioneer Village, Castle Kilbride, New Hamburg, Cambridge, and in communities such as Millbrook, Pickering, Orono, Hamilton, and Caledon.</p><h4>Music</h4><p>The opening theme is the song \"Ahead by a Century\" performed and originally composed by Canadian band The Tragically Hip. The series underscore is composed by Amin Bhatia and Ari Posner.</p><br/><h3>Themes</h3><p>While \"many classic moments are dutifully re-created,\" Walley-Beckett constructed Anne with an E with \"a darker undercurrent\" than previous adaptations of Anne of Green Gables. She envisioned Anne as an antihero, adding original backstories to her adaptation that emphasized the impact of bullying, class-based discrimination, social isolation, and consequent PTSD on the construction of Anne's character (themes hinted at, but never elaborated upon, in the original novel). Walley-Beckett further states: \"In this day and age, themes of identity, prejudice, bullying, being an outsider, searching for a way to be accepted and how to belong are entirely topical and super relevant, and those are themes that are built into the story of Anne Shirley. She went on to call Anne Shirley an \"accidental feminist\", and how she \"really wanted to tell this story now\". Amybeth McNulty (who portrays Anne) also stated that, \"people might think are quite graphic ... but I think it was time to be honest.”</p><h4>Season 2</h4><p>For the second season, according to what she called her \"master plan\", Walley-Beckett introduced an entirely new character of her own, Bash, to reflect the racial diversity present in and around Charlottetown at the time of the novel, with a view to representing a community absent from previous adaptations, achieving this by having Gilbert travel on a steamship and meet with the new character in Trinidad: \"Bash is the vehicle to explore intolerance and inequality, even more when he goes to The Bog, when he learns that other black people live there.\" Walley-Beckett explained: \"The Bog is the community that's just outside of Charlottetown, where people of color were marginalized and had their own community there.\"</p><h4>Season 3</h4><p>In the third season, topics such as identity, feminism, bullying and gender parity were explored. The third season also focused on residential schools and treatment of Indigenous people in Canada's history.</p><br/><h3>Release</h3><p>The series initially premiered on March 19, 2017, on CBC and aired on a weekly basis, the season finale airing on April 30, 2017. The series debuted on Netflix on May 12, 2017, under the title Anne with an E.</p><p>On August 3, 2017, CBC and Netflix renewed the series for a 10-episode second season, which premiered on Netflix on July 6, 2018, and on CBC on September 23, 2018. CBC adopted the Anne with an E name beginning in the second season.</p><p>In August 2018, CBC and Netflix renewed the series for a 10-episode third season, which premiered on September 22, 2019, on CBC and was released on Netflix on January 3, 2020.</p><h4>Cancellation</h4><p>CBC president Catherine Tait stated in October 2019 that it would no longer involve itself in co-productions with Netflix, as they constitute deals \"that hurt the long-term viability of our domestic industry\". A day after the third season concluded its Canadian run and despite statements from CBC previously expressing \"no doubt that Canadians will continue to fall in love with this beautiful and heartwarming series for seasons to come,\" Netflix and CBC announced the show's cancellation the morning after the season three finale aired in Canada, marketing the season three release on Netflix as the show's \"final season.\"</p><p>Alternate reasons for cancellation were given on November 27 in response to a Twitter campaign to save the show, namely a lack of audience growth in the 25–54 age range, which fans on Twitter and Facebook have challenged by questioning how CBC tracks viewers' ages, and the fact their CBC Gem app does not ask for personal information. Despite the CBC indicating that Netflix had agreed that the third season would be the show's last, fans started a concerted online and offline campaign, much of it led by Twitter fans through the hashtag #renewannewithane.</p><p>There were some fans who attempted to flood and bombard unrelated CBC and Netflix posts with the #renewannewithane hashtag (and general commentary regarding renewal) leading the CBC to block them from commenting on future posts. Netflix has never responded to campaign efforts.</p><p>A petition was started by fans to protest the cancellation of the show, and is currently the largest petition ever started by a fanbase for a cancelled television show. Some fans also created an informative website for other fans where they can keep up to date on renewal efforts.</p><p>Fans also crowdfunded to erect billboards in an effort to garner attention of current and potential new viewers, but also other television networks and the press. In January 2020 a set of billboards were put on display at the centre of Yonge and Dundas Square in Toronto, and shortly after another large billboard was on display in Times Square, New York City. The fans followed this successful run with another several days of billboards in Toronto, using various art and imagery done by fans of the show from various parts of the world. Many of the cast and crew, including Amybeth and Moira, visited the billboards in person and posted on their social media pages.</p><p>Canadian actor Ryan Reynolds and English singer Sam Smith also tweeted in support of the series.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Palak Jayswal gives the entire series five out of five stars and notes that while classic works of literature are often best left intact, Anne with an E offers a useful case study of when \"the remake of a classic is done better than the original\". She suggests that while \"the Netflix adaptation is brutal\", its portrayal is one that is \"realistic of what life was like during the time period for an orphan girl\". She thus states that \"the reason this show is so successful is its ability to not only bring the original story to life but to add to it in a truly authentic way\". Erin Maxwell concurs, arguing that in contrast to Tiger King, \"Anne with an E might be the most wholesome and engaging TV show that no one in America is talking about. But it is definitely a show that needs to be consumed, discussed, and re-watched just as appreciatively\". She also notes that \"there are occasional changes in the narrative and attempts to be 'woke', but it wisely doesn't derail much from the original story\". Chad Jones qualifies the entire series as a \"cool\" adaptation of the novel, noting that \"from the theme song by The Tragically Hip to the assortment of timely issues – racism, feminism, bullying – that may have been hinted at in the book but have definitely been brought to the fore by creator Moira Walley-Beckett, this is not your grandmother's Green Gables\". Jon Hersey at The Objective Standard writes, \"If you can stand a tearjerker—and if you enjoy art that glorifies imagination, individualism, free inquiry, and the passionate pursuit of values—you may just fall in love with Walley-Beckett's Anne with an E\".</p><h4>Season 1</h4><p>On Rotten Tomatoes season 1 has an approval rating of 83% based on 29 critic reviews. The site's critical consensus states: \"Anne with an E uses its complex central character to offer a boldly stylish, emotionally resonant spin on classic source material that satisfies in its own right.\" The series has received a rating of 79 on Metacritic based on fifteen reviews, indicating \"generally favorable reviews\".</p><p>Emily Ashby, writing for Common Sense Media, calls the series an \"exceptional\" and \"spectacular\" interpretation, giving it four out of five stars. Tasha Cerny, contributor for the Tracking Board, praises the cinematography as lush and colourful, the characters vibrant, and the plot \"surprisingly thrilling for a story about a young girl living in a small secluded community in the late nineteenth century. I laughed, I cried, and I didn't expect either from a show about a little girl.\" Gwen Inhat of The A.V. Club calls the series \"at once darker and sweeter than the original\" novel, praising the core cast, reserving the highest for the series lead:</p><blockquote>Amybeth McNulty defies her youth with a performance that's less a portrayal of Anne than an absolute possession. It can't be easy to make Anne's fanciful language sing the way she does, and McNulty captures the endearing awkwardness that enables Anne to win over everyone she comes in contact with.</blockquote><p>Writing of the 90-minute premiere episode for the Toronto Star, Johanna Schneller was appreciative of Walley-Beckett's departures from the novel, bringing its subtext to the fore: \"Reading between the novel's lines and adding verisimilitude, she gives us quick but potent glimpses of the miseries many orphans faced in 1890s imperialist culture.\" Hanh Nguyen, reviewing the series for IndieWire, concurred with this assessment, saying:</p><blockquote>Rather than ruining the series, they give the context for why Anne would be filled with gratitude for the beauties of nature, basic human decency and having a family to call her own. Montgomery had based much of Anne's need for escape into imagination on her own lonely childhood, and her stories have always had an underlying poignancy that made them all the sweeter.</blockquote><p>Jen Chaney, writing for Vulture.com, agrees, saying: \"What distinguishes it from other previous Anne iterations is its willingness to harden some of the story's softness, just enough, to create an element of realism that period pieces, Gables-related or not, can be inclined to avoid.\" Neil Genzlinger writing for The New York Times, commenting on reports of darkness and grittiness, also praises the production: \"Ms. McNulty's Anne is still wonderfully ebullient and eminently likable; she's just not the one-dimensional figure of other adaptations\". Annie Hirschlag, writing for Mic, suggests that a genuinely contemporary Anne is bound to reflect the current television landscape and wider culture of its times (the 2010s): \"Since today's entertainment is peppered with antiheroes — characters who are far from perfect, even occasionally villainous — it makes sense that Anne's familiar idealism is fringed with darkness and agony.\"</p><p>Some reviewers were more ambivalent, mainly about Walley-Beckett's changes to the story. Canadian novelist Saleema Nawaz, who reviewed the 90-minute first episode for Toronto Life, said she enjoyed it more than she expected, particularly the set designs and costumes, as well as the performances by McNulty and Thomson, and she approved of the choice of theme song as reflective of the continued relevance of the source material. She was less sure about how far the series intended to stray from that source material, and disapproved of the \"manufactured drama, such as Matthew's wild horse ride\". Writing for Entertainment Weekly, Isabella Beidenharn expressed similar feelings, but, \"putting the source material aside, it's a fine show on its own\", and she conceded that \"inventing a dark side might help Anne With an E fit into today's TV landscape\". Allison Keene, writing for Collider, agrees that Anne is a good drama on its own terms, but allows it is \"only a fair adaptation\" of the novel, at its best in the home scenes: \"Anne with an E is undeniably the most stylish adaptation we've ever seen of Anne of Green Gables. But its desire to reveal more of Anne's miserable past in order to be more true to what the desperation of an orphan is like feels at odds with Montgomery's story.\" Writing for Variety, critic Sonia Saraiya is even more ambivalent, describing the series as on the one hand \"a brilliant adaptation\" which \"succeeds admirably\", but on the other hand, \"the show can't quite sustain the brilliance, veering first into maudlin territory and then into the oddly saccharine as it tests out its tone\", contending that \"the show gets a bit bogged down in telling the story of Anne's dysfunction\", presenting \"a slightly soapy view of Anne's trials and tribulations that at times really humanize her and in others, are rather infantilizing\".</p><p>Sarah Larson, writing for The New Yorker, was not at all impressed with changes made to the story, arguing that they alter Anne's character to the point of non-recognition. While she acknowledges that bringing subtext to the fore is a fine idea, she is not pleased with the execution, saying that the result is part \"the Anne we know and love\" and part \"untrustworthy stranger\", calling the alteration and addition of scenes a \"betrayal\" of Montgomery's novel, comparing the treatment unfavourably to Patricia Rozema's 1999 adaptation of Jane Austen's Mansfield Park. Laura Finch writing for \"World\", agrees, saying, \"...despite some of the positive feminist themes found here (like whether or not girls should go to school), it's often hard to find the original Anne amid the extraneous storylines.\" For Joanna Robinson, writing for Vanity Fair, a central problem with the show is that it \"seems to think that in order for Anne to be a feminist figure, she has to butt up against a straw-man-filled patriarchy,\" and so it turned many of the male characters into misogynists, most notably the Reverend Allan, who is considered by Anne to be a \"kindred spirit\" in the book: \"Anne with an E seems to think Anne's triumphs are only noteworthy if she's continually told she can't succeed, when in fact her unfettered brilliance needs no such clumsy opposition. It also seems to think that Anne needs a radical feminist makeover when, in fact, the story of her success was feminist in its own right.\" This is part of a more general problem Robinson notes, that conflicts are exaggerated and overdone: \"this series thrives on non-stop tragedy.\"</p><h4>Season 2</h4><p>On Rotten Tomatoes, season 2 has an approval rating of 43% based on 8 critic reviews, with an average rating of 8/10. Hanh Nguyen writes that despite \"periods of melancholy and turmoil, this season feels more energetic and subsequently lighter because of the faster pace. It also is more comfortable in its skin and handles humor in its everyday situations deftly while also poking fun at itself.\" Allison Keene, despite her misgivings about the first season's divergence from the original novel, says it grew on her; she approves of the second season's \"major shift in tone\" and how, in moving away from the books and expanding the world, \"it also moves towards excellence.\" Conversely, Heather Hogan, who \"hated\" the first season for similar reasons in her review of the first season, and despite loving the now open \"gayness\" of the second season, nevertheless concludes her review thus: \"Anne With an E continues to use characters shoehorned in from 2018 to explain race and gender and sexuality to people on Prince Edward Island in 1908 as a way of explaining those things to people watching television on the internet in 2018. It's clunky and weird and sometimes embarrassing. The dialogue sometimes feels like it was written in an alien language and run through Google Translator. The drama is so overwrought it's ridiculous. The characters remain unrecognizable.\"</p><p>Meghan O'Keefe, who was \"charmed\" by the first season, is \"baffled\" by the second season's choices of new storylines: \"I'm not such a purist that I need TV adaptations to hit every beat of a novel, but I do think that television made for families should understand what their own core philosophy is. While Walley-Beckett's instincts are good, I think this show is too enamored with its trappings of darkness to realize that Anne of Green Gables has endured this long because people love the small specificity of the characters' lives. Warping these details for showier TV kind of dilutes the story.\" Author Amy Glynn says \"it's agonizing because it is visually lovely and incredibly well-acted sanctimonious twaddle.\"</p><h4>Season 3</h4><p>On Rotten Tomatoes, season 3 has three positive (out of three) critic reviews. Alici Rengifo finds that the series ends on a fitting note, bringing Anne to a point of \"real growth\"; the finale is \"all about how life does indeed go on\". Shannon Campe lamented: \"It's hard not to feel the series was ending just as it began to find its voice, even if it muddles some of its 'kid-friendly' messages on racism and other issues\". Rengifo appreciates the final season's \"many little twists, journeys and a vast array of characters\".</p><blockquote>It's a shame this show has to leave, it has a classic style that harkens back to books like Little Women, while updating the tone for contemporary viewers who could have a lot of fun while taking in a few life lessons along the way. Anne will be missed, hopefully she'll have heirs.</blockquote><br/><h3>Awards and nominations</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th>Ref</th></tr><tr><td rowspan=\"9\">2018</td><td rowspan=\"8\"><span>Canadian Screen Awards</span></td><td><span>Best Lead Actress, Drama Series</span></td><td><span>Amybeth McNulty</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Best Drama Series</span></td><td><i>Anne with an E</i></td><td rowspan=\"2\" style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"7\"></td></tr><tr><td>Best Supporting Actor, Drama</td><td><span>R. H. Thomson</span></td></tr><tr><td>Best Supporting Actress, Drama</td><td><span>Geraldine James</span></td><td rowspan=\"6\" style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Guest Performance, Drama</td><td><span>Deborah Grover</span></td></tr><tr><td rowspan=\"2\">Best Direction, Drama Series</td><td><span>Helen Shaver</span></td></tr><tr><td><span>Niki Caro</span></td></tr><tr><td>Best Writing, Drama Series</td><td><span>Moira Walley-Beckett</span></td></tr><tr><td><span>Teen Choice Awards</span></td><td><span>Breakout TV Show</span></td><td><i>Anne with an E</i></td><td></td></tr><tr><td rowspan=\"9\">2019</td><td><span>ACTRA Toronto Awards</span></td><td>Outstanding Performance – Female</td><td><span>Amybeth McNulty</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>GLAAD Media Award</span></td><td>Outstanding Kids &amp; Family Programming</td><td rowspan=\"2\"><i>Anne with an E</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"7\"><span>Canadian Screen Awards</span></td><td>Best Drama Series</td><td rowspan=\"4\" style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"7\"></td></tr><tr><td>Best Actress, Drama Series</td><td><span>Amybeth McNulty</span></td></tr><tr><td>Best Supporting Actress, Drama</td><td><span>Geraldine James</span></td></tr><tr><td>Best Supporting Actor, Drama</td><td><span>R. H. Thomson</span></td></tr><tr><td>Best Direction, Drama Series</td><td><span>Helen Shaver</span></td><td rowspan=\"3\" style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Writing, Drama Series</td><td><span>Kathryn Borel</span></td></tr><tr><td>Best Guest Performance, Drama</td><td><span>Dalmar Abuzeid</span></td></tr><tr><td rowspan=\"3\">2020</td><td rowspan=\"3\"><span class=\"mw-redirect\">ACTRA Toronto Awards</span></td><td>Outstanding Performance – Female</td><td><span>Cara Ricketts</span></td><td rowspan=\"2\" style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td rowspan=\"2\">Outstanding Performance – Male</td><td><span>Dalmar Abuzeid</span></td></tr><tr><td><span>Araya Mengesha</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}