{
  "imDbId": "tt4934214",
  "title": "Taskmaster",
  "fullTitle": "Taskmaster (TV Series 2015– )",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "gibbs-18172",
      "userUrl": "https://www.imdb.com/user/ur103624323",
      "reviewLink": "https://www.imdb.com/review/rw5143874",
      "warningSpoilers": false,
      "date": "26 September 2019",
      "rate": "9",
      "helpful": "33 out of 34 found this helpful.",
      "title": "A good vintage, it gets better with age",
      "content": "The barmy and bizarre comedy game show that pits mainly comedians against each in a series of hilarious tasks started life on the unusual place of UK Golds, and Dave channel. The station more well know for repeats and re runs.It is the highest watched show over the entire UK Gold network and for a very good reason. For not only does the show keep itself fresh with 5 new faces every season but the kameradory between Greg and Little Alex Horne never goes stale.Deffo worth watching box set to box set"
    },
    {
      "username": "NeilisDead",
      "userUrl": "https://www.imdb.com/user/ur2717196",
      "reviewLink": "https://www.imdb.com/review/rw4478292",
      "warningSpoilers": false,
      "date": "25 November 2018",
      "rate": "10",
      "helpful": "58 out of 60 found this helpful.",
      "title": "Sit Down",
      "content": "You have 45 minutes to spare and haven't laughed in years. Make me laugh little Alex Horn.And laugh I did."
    },
    {
      "username": "deniseactress",
      "userUrl": "https://www.imdb.com/user/ur5552542",
      "reviewLink": "https://www.imdb.com/review/rw5216228",
      "warningSpoilers": false,
      "date": "27 October 2019",
      "rate": "10",
      "helpful": "32 out of 34 found this helpful.",
      "title": "The FUNNIEST show ever!",
      "content": "And I just happened to stumble upon it randomly never heard of it before. I saw the USA version but the UK version is side splitting hilarious."
    },
    {
      "username": "Kittypants1979",
      "userUrl": "https://www.imdb.com/user/ur31771531",
      "reviewLink": "https://www.imdb.com/review/rw5240178",
      "warningSpoilers": false,
      "date": "6 November 2019",
      "rate": "10",
      "helpful": "60 out of 64 found this helpful.",
      "title": "Literally the most I've ever laughed at a TV show",
      "content": "I was in a really deep depression (really, I have mental health issues) and I started to watch a random episode of this and got into it, I ended up howling with laughter like I never have before. I have now watched every episode and always really look forward to a new series. It so funny but in such a simple way and it also has the tip top gold of the UK comedy scene. Watch it now!"
    },
    {
      "username": "leesimon-26357",
      "userUrl": "https://www.imdb.com/user/ur126737391",
      "reviewLink": "https://www.imdb.com/review/rw6671584",
      "warningSpoilers": false,
      "date": "7 March 2021",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Best series in existence",
      "content": "I am overjoyed at the success this show has seen. It is so funny, so clever, so exciting, and overall so fun to watch. I watch and re-watch each series regularly. Highly, highly recommended."
    },
    {
      "username": "mjb301086",
      "userUrl": "https://www.imdb.com/user/ur13863190",
      "reviewLink": "https://www.imdb.com/review/rw4988336",
      "warningSpoilers": false,
      "date": "10 July 2019",
      "rate": "10",
      "helpful": "21 out of 24 found this helpful.",
      "title": "Love it!",
      "content": "It's so utterly ridiculous and silly but man I love it! Hope it goes on forever"
    },
    {
      "username": "ericanaess",
      "userUrl": "https://www.imdb.com/user/ur84351127",
      "reviewLink": "https://www.imdb.com/review/rw5655078",
      "warningSpoilers": false,
      "date": "19 April 2020",
      "rate": "9",
      "helpful": "13 out of 14 found this helpful.",
      "title": "Funny and entertaining",
      "content": "I have to admit that when my husband wanted to watch this, I had never heard of it and was skeptical. But when I saw the good reviews on here, I said ok. Glad we did! We have only watched seasons 4&5, but thought they were both funny. I think 5 is a bit better though. I would love to do some of these types of challenges with my students!"
    },
    {
      "username": "steelthrough",
      "userUrl": "https://www.imdb.com/user/ur68912702",
      "reviewLink": "https://www.imdb.com/review/rw5047165",
      "warningSpoilers": false,
      "date": "8 August 2019",
      "rate": "10",
      "helpful": "20 out of 22 found this helpful.",
      "title": "No other show like it... in fits every time I watch it!",
      "content": "I've watched all seasons multiple times and it still has me in fits. No other show has me laughing like this one. The relationship between Greg and Alex is hysterical and I couldn't imagine any other duo pulling it off like they do. The mix of comedians is great and I've since gone on to enjoy many of them in other TV shows. The wait for each new season is unreal but totally worth it each and every time!"
    },
    {
      "username": "kendrageorge",
      "userUrl": "https://www.imdb.com/user/ur90646383",
      "reviewLink": "https://www.imdb.com/review/rw4565758",
      "warningSpoilers": false,
      "date": "6 January 2019",
      "rate": "10",
      "helpful": "34 out of 37 found this helpful.",
      "title": "Comedy gold",
      "content": "Such a simple concept, executed flawlessly! Greg is a perfect host, Alex is a pure genius for coming up with everything, brilliant choice of contestants."
    },
    {
      "username": "budgefudge",
      "userUrl": "https://www.imdb.com/user/ur122819248",
      "reviewLink": "https://www.imdb.com/review/rw5982684",
      "warningSpoilers": false,
      "date": "11 August 2020",
      "rate": "10",
      "helpful": "18 out of 19 found this helpful.",
      "title": "One of the Funniest Shows on British TV",
      "content": "There is something special about the humor of Taskmaster. It is a funny combination of the subtle remarks of the comedians and the overtly absurd tasks they have to complete. Although the first few series are great, they still hadn't found that balance which series 4/5 onward nails. Greg Davies and Alex Horne's comedic chemistry is truly phenomenal. Also the music and editing is surprisingly good too.10/10."
    },
    {
      "username": "GW42",
      "userUrl": "https://www.imdb.com/user/ur113111839",
      "reviewLink": "https://www.imdb.com/review/rw6567157",
      "warningSpoilers": false,
      "date": "6 February 2021",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "A Simple Show With Hilariously Chaotic Results",
      "content": "The combination of Greg Davis's Authority, Little Alex Horns IPad, 5 confused and often deranged comedians and challenges from a school fun day from hell somehow creates the perfect equation for comedy."
    },
    {
      "username": "d-tank",
      "userUrl": "https://www.imdb.com/user/ur34184658",
      "reviewLink": "https://www.imdb.com/review/rw4412116",
      "warningSpoilers": false,
      "date": "21 October 2018",
      "rate": "10",
      "helpful": "35 out of 37 found this helpful.",
      "title": "It's only Dave but I love it!",
      "content": "Yes it's on Dave but hold fire it's bloody brilliant! First review on IMD and I've been a member for over 7 years (signed in with Facebook), just give it ago people. Peace!"
    },
    {
      "username": "klaythoring",
      "userUrl": "https://www.imdb.com/user/ur67735403",
      "reviewLink": "https://www.imdb.com/review/rw6279027",
      "warningSpoilers": false,
      "date": "17 November 2020",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Just the Greatest",
      "content": "I have rewatched this show over and over, introduced everyone I know to it and pounce on new episodes with glee!The format is amazing, I love the tasks that Alex comes up with & that there's all kinds - artistic, athletic, intellectual, obscure.the ridiculous authority of Greg with moments of softness that are super charming. (Checking on Knappit, hugging Katherine R., the bond with Asim)I like the way they all take criticism & the way they put their all into things. That Alex considers feedback and adapts to it instead of ignoring it. (The stage tie task stands out for that, and made me feel even more stoked on TM.)I can't decide whether the best bit is seeing how different people's brains work as they come up with task solutions, or trying to imagine how you would do the same task (yourself or with friends).Fave season so far is Acaster's, but it's a testament to the awesomeness of this show that it's so hard to pick!"
    },
    {
      "username": "beverleyhunniford",
      "userUrl": "https://www.imdb.com/user/ur80320551",
      "reviewLink": "https://www.imdb.com/review/rw6746390",
      "warningSpoilers": false,
      "date": "26 March 2021",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Must watch - it's funny",
      "content": "It's one of those shows that had passed me by. Then I saw a bit of one episode, something about eggs, balloons and a frying pan. Then a few months later, a bit more, but the same episode unless eggs, balloons and frying pans crop up a lot (must have been on Dave). As 4 On Demand have Taskmaster from series 1, I opted to watch from the beginning. I regularly find I'm laughing so much it hurts. There are indeed, many eggs, loads of balloons and several frying pans."
    },
    {
      "username": "soirk",
      "userUrl": "https://www.imdb.com/user/ur88452864",
      "reviewLink": "https://www.imdb.com/review/rw5008169",
      "warningSpoilers": false,
      "date": "20 July 2019",
      "rate": "10",
      "helpful": "19 out of 22 found this helpful.",
      "title": "Original and brilliantly executed",
      "content": "It's a show that offers what no other show does. To a degree, it's quality comes down to the quality of the guests or competitors. Alex Horne has given birth to a brilliant concept and his rapport with Greg Davies is magical and makes the show. Each series has had at least one brilliant guest and the tasks are usually amazing and bring out amazing insights into the competitors minds, which in some cases is scary!Overall, I love each episode and often laugh out loud on numerous occasions. I recommend this to anyone because it can appeal to anyone, regardless of age etc."
    },
    {
      "username": "elodiedanzelman",
      "userUrl": "https://www.imdb.com/user/ur129748991",
      "reviewLink": "https://www.imdb.com/review/rw6974275",
      "warningSpoilers": false,
      "date": "28 May 2021",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "This show makes me proud to be british",
      "content": "Firstly, Alex Horne is a genius. This show is just incredible. Every series is hilarious and unique and the tasks are great! So many great comedians have taken part , all bringing there own unique humour and take on the tasks making this programme so enjoyable. Greg Davies as the hilarious headteacher-like taskmaster and \"Little Alex Horneeee!\" are what make Taskmaster so special though. This show is fantastic and i hope it continues for years to come!"
    },
    {
      "username": "simianfriday",
      "userUrl": "https://www.imdb.com/user/ur126645799",
      "reviewLink": "https://www.imdb.com/review/rw7408365",
      "warningSpoilers": false,
      "date": "4 October 2021",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Simply the best.",
      "content": "This show is simply the best comedy game show I've seen - hands down. It's funny, it's clever, it's unique, and it's just *FUN* in the best ways imaginable."
    },
    {
      "username": "goof1couk",
      "userUrl": "https://www.imdb.com/user/ur1844870",
      "reviewLink": "https://www.imdb.com/review/rw6139993",
      "warningSpoilers": false,
      "date": "1 October 2020",
      "rate": "10",
      "helpful": "21 out of 24 found this helpful.",
      "title": "Why did it take me so long to give it a go!",
      "content": "I hate myself for ignoring the number of ads I watched promoting the show. 2020 has been a year to forget but I will always remember it fondly for the year I binged and I binged on this absolute genius show. The task are excellent, the calibre of contestants is extremely high and Greg and (little) Alex Horne are the couple you look at and wonder 'who is the big spoon and who is the little spoon' just watch it! If you don't enjoy this show you don't deserve it!"
    },
    {
      "username": "Darkside-Reviewer",
      "userUrl": "https://www.imdb.com/user/ur100147162",
      "reviewLink": "https://www.imdb.com/review/rw4814434",
      "warningSpoilers": false,
      "date": "29 April 2019",
      "rate": "7",
      "helpful": "11 out of 17 found this helpful.",
      "title": "Best show on Dave",
      "content": "This is comedy and creativeness brought together to bring you something new putting comedian's and presenters together and giving them the kind of tasks you'd give children on activity afternoon makes for some interesting situations and comedy gold.Big comedy names are involved and compete for points to win a golden statue of Greg Davies massive head as he judges there performance on each task.It's a very active show and with every series being a new set a challengers and tasks it's always new and funny.Give this show a try if you love a good laugh and like seeing daft comedian's doing what they do best mucking about to make you laugh."
    },
    {
      "username": "rafidchy-04631",
      "userUrl": "https://www.imdb.com/user/ur128552693",
      "reviewLink": "https://www.imdb.com/review/rw6506107",
      "warningSpoilers": false,
      "date": "20 January 2021",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Amazing and very addicting",
      "content": "You'll first watch a couple of clips on YouTube and then a couple more and then start to watch the episodes chronologically and voila! You're addicted! Your next 2 weeks is covered full off surprises and tasks!"
    },
    {
      "username": "barlsmith",
      "userUrl": "https://www.imdb.com/user/ur128225437",
      "reviewLink": "https://www.imdb.com/review/rw6468575",
      "warningSpoilers": false,
      "date": "12 January 2021",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Fantastic",
      "content": "Excellent, bingeable show. Greg and little Alex have perfect chemistry, the tasks are always great. My only critique would be of some of the guest comedians but that critique would not lower my score at all."
    },
    {
      "username": "ameliaberk",
      "userUrl": "https://www.imdb.com/user/ur128554535",
      "reviewLink": "https://www.imdb.com/review/rw6506328",
      "warningSpoilers": false,
      "date": "20 January 2021",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Great telly",
      "content": "Brilliant, unique, hilarious. It has truly grown as a show over the past ten series, and I look forward to see it continue for years to come. Greg's dynamic with Alex and the contestants is almost always funny, and I love seeing everyone's differing approaches to the tasks (and their outcomes)."
    },
    {
      "username": "dontakeitpersonal",
      "userUrl": "https://www.imdb.com/user/ur68176810",
      "reviewLink": "https://www.imdb.com/review/rw6804350",
      "warningSpoilers": true,
      "date": "11 April 2021",
      "rate": "8",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Absolutely worth my time",
      "content": "So, huge fan of british comedy. I was just finished with \"would I lie to you\", looking for something new to watch and it was actually through imdb that I discovered this show! It's good fun, not all parts are funny but in overall its very entertaining. Love the comedians coming on and the different tasks they have to do. If you are looking for 45 min of laughter, give this a go."
    },
    {
      "username": "benshorthouse",
      "userUrl": "https://www.imdb.com/user/ur84331737",
      "reviewLink": "https://www.imdb.com/review/rw4848649",
      "warningSpoilers": false,
      "date": "13 May 2019",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Very Very funny",
      "content": "This is always an amazing show the chemistry and the comedians they bring always are amazing. It's a great refreshing show"
    },
    {
      "username": "thomasharris-67958",
      "userUrl": "https://www.imdb.com/user/ur68286696",
      "reviewLink": "https://www.imdb.com/review/rw4837737",
      "warningSpoilers": false,
      "date": "8 May 2019",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": ">>>> INCREDIBLE <<<<",
      "content": "The best show on TV, every element is comedy perfection. Incredible chemistry between Greg and Alex, brilliant range of contestants and outrageously clever tasks. Nothing else like it!"
    }
  ],
  "errorMessage": ""
}