{
  "imDbId": "tt7562112",
  "title": "Pose",
  "fullTitle": "Pose (TV Series 2018–2021)",
  "type": "TVSeries",
  "year": "2018",
  "items": [
    {
      "username": "karinhendry",
      "userUrl": "https://www.imdb.com/user/ur74099913",
      "reviewLink": "https://www.imdb.com/review/rw5083795",
      "warningSpoilers": false,
      "date": "27 August 2019",
      "rate": "10",
      "helpful": "155 out of 170 found this helpful.",
      "title": "POSE- A series that taught me a lot",
      "content": "This is a series that opened my eyes and taught me a lot about a world that I'm ashamed to say I didn't know much about. What is really nice about the series ,except the fact that all the actors in the series are simply amazing, is that we are shown (although I'm sure it's only fragile) all the experiences and difficulties the characters go through. Although it is a matter of years past, you can see that our world has progressed, but not much in its attitude towards the different. Maybe if all people are exposed to this series, then maybe something will change, because as the series says, the world does not change on its own, the people are the ones who change it."
    },
    {
      "username": "eileenpa",
      "userUrl": "https://www.imdb.com/user/ur28835914",
      "reviewLink": "https://www.imdb.com/review/rw5028796",
      "warningSpoilers": false,
      "date": "30 July 2019",
      "rate": "10",
      "helpful": "39 out of 47 found this helpful.",
      "title": "Amazing show. Evokes both the drag/club scene and the fear caused by AIDS in the community, particularly for POC, during the 80s/early 90s.",
      "content": "I remember this time so clearly. The clubs, the slow - then rapid - rise of AIDS, the combination of having the freedom of clubs to go for the LGBT community combined with friends either being terrified they had AIDS - or their despair when they found out they did. Finally, fighting back: ACT UP, drug imports from foreign countries, the AIDS quilt, protest marches.This show should be watched by every LGBT person who did not live through the AIDS epidemic before the triple cocktail was invented and people could actually survive long-term once they knew they had HIV/AIDS. The world for about 15 years was a terrifying place for the community, and POC were so disproportionately hit, it was horrifying - because the few drugs/treatments available were extremely expensive, and they had two forms of discrimination working against them. This was true even after the triple cocktail was first available.The one good thing that came out of it was that it brought lesbians/bi women, gay men and trans people together for a common cause: that we not be considered disposable."
    },
    {
      "username": "jgrv-1",
      "userUrl": "https://www.imdb.com/user/ur12117551",
      "reviewLink": "https://www.imdb.com/review/rw4226354",
      "warningSpoilers": false,
      "date": "5 July 2018",
      "rate": "9",
      "helpful": "70 out of 93 found this helpful.",
      "title": "A rare gem",
      "content": "I'm in agreement with everyone who is in love with this show. Just want to give a shout out to MJ Rodriguez, who plays Blanca. She is the real standout in a very good cast."
    },
    {
      "username": "dmrogers-63013",
      "userUrl": "https://www.imdb.com/user/ur62913395",
      "reviewLink": "https://www.imdb.com/review/rw4208887",
      "warningSpoilers": false,
      "date": "19 June 2018",
      "rate": "9",
      "helpful": "131 out of 149 found this helpful.",
      "title": "I love POSE!!!",
      "content": "This is an original show with a fantastic cast! I suspect a lot of us are learning a lot about \"things we didn't know we didn't know.\" The ballroom culture of the 80's is fascinating, as are many of the characters. This show operates smoothly at several different levels and tackles the hard stuff. At its heart is the issue of family-it's enduring position as safe harbor & moral compass, and the human tendency to create families of our own to uphold and sustain us when the traditional model has failed."
    },
    {
      "username": "cam21-660-801606",
      "userUrl": "https://www.imdb.com/user/ur42696124",
      "reviewLink": "https://www.imdb.com/review/rw5150669",
      "warningSpoilers": false,
      "date": "29 September 2019",
      "rate": "10",
      "helpful": "23 out of 31 found this helpful.",
      "title": "And The Category Is...",
      "content": "Outstanding! This is a story that had to be told and dang they're telling it goood! It's moving, heartbreaking, empowering, uplifting and captivating, I had to watch the whole series in one sitting, I couldn't stop."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw4998296",
      "warningSpoilers": false,
      "date": "16 July 2019",
      "rate": "10",
      "helpful": "22 out of 33 found this helpful.",
      "title": "a real ball (but even more)",
      "content": "Ryan Murphy is one of the people who has revolutionized TV in the 21st century: \"Glee\", \"American Horror Story\", and now \"Pose\". While mainly about the 1980s ball culture in New York, it also looks at how hard life was for these folks: discrimination (especially against transgender people), HIV, a president ignoring the AIDS crisis, and other things. But without a doubt, it's something that you gotta see to believe."
    },
    {
      "username": "jjdawg",
      "userUrl": "https://www.imdb.com/user/ur76091954",
      "reviewLink": "https://www.imdb.com/review/rw7007109",
      "warningSpoilers": false,
      "date": "7 June 2021",
      "rate": "10",
      "helpful": "20 out of 25 found this helpful.",
      "title": "I'm conflicted",
      "content": "Seasons 1 and 2 were some of the greatest episodes of television I have watched.Felt there was quite a disconnect when beginning Season 3: almost as if I had missed some episodes. While Season 3 provides some sweet moments, the pacing at felt rushed at points and others felt as if they were never going to end. There also seemed to be a reduction in performance quality from some of the leads in the final season, which made some lines more clunky than they would appear on paper.Overall still a very impactful and important show."
    },
    {
      "username": "joshua-neves",
      "userUrl": "https://www.imdb.com/user/ur48592777",
      "reviewLink": "https://www.imdb.com/review/rw4207978",
      "warningSpoilers": false,
      "date": "18 June 2018",
      "rate": "10",
      "helpful": "145 out of 173 found this helpful.",
      "title": "Beautifully made",
      "content": "Pose is an importante TV show. Period. Even though there are very clear critics to made on the acting, which sometimes looks a bit amateur, and texts that could use a more profund, reflexive and subtle tone instead of what looks to me as ready-for-consumption drama, the show is BEAUTIFULLY made and you can see the passion of the people who worked on it. Serving face, looks ans subjects that actually matter in our society. I hope it grows, pushing the actors forward to get better and better. Meryl Streep wasn't made from dawn to dusk and I think this show is working with a lot of talents on the making. WATCH IT!!"
    },
    {
      "username": "catjenkins-57799",
      "userUrl": "https://www.imdb.com/user/ur131175659",
      "reviewLink": "https://www.imdb.com/review/rw6889142",
      "warningSpoilers": false,
      "date": "7 May 2021",
      "rate": "10",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Speechless",
      "content": "I'm not a member of the LGBT (and whatever other letters should be added) community, but this show touches my heart. I lived in NYC in the late 70s and early 80s. I worked Broadway and NYC Ballet and a soap at CBS. But I never brushed shoulders with the sub-culture Pose depicts. I wish I'd known. The culture may be foreign to me, but the simple, human dignity and pain make this show universal and timeless. Not to mention I've rarely seen an ensemble of more gifted actors. Pose is a sparkling, heart-breaking, terribly human, beautifully tragic gem. Well done and thank you for creating it."
    },
    {
      "username": "jadzia-87886",
      "userUrl": "https://www.imdb.com/user/ur68196436",
      "reviewLink": "https://www.imdb.com/review/rw4191354",
      "warningSpoilers": false,
      "date": "5 June 2018",
      "rate": "10",
      "helpful": "58 out of 86 found this helpful.",
      "title": "Yes Yes Yes LOVE IT",
      "content": "Great to finally see such an honest depiction of the 80's Thank you for the truth Great performances Brilliant music Please keep the conversation going LOVE"
    },
    {
      "username": "stieffguy",
      "userUrl": "https://www.imdb.com/user/ur29032075",
      "reviewLink": "https://www.imdb.com/review/rw4216897",
      "warningSpoilers": false,
      "date": "26 June 2018",
      "rate": "10",
      "helpful": "30 out of 47 found this helpful.",
      "title": "Breathtaking - if you don't yet know why, you will.",
      "content": "Yes it seems harsh, yes it seems unreal and yes there are elements of fiction to convey a story. This is possibly as real as it gets because yes, this is how it was.At first I couldn't understand the casting. Did some research and all I can say now is that I hold each and every actor in this production in the highest awe and regard.Ryan Murphy. If I could, I would thank you for bringing this to the world. For every forgotten soul of that time, I applaud you for commemorating each and every one."
    },
    {
      "username": "robertconyers",
      "userUrl": "https://www.imdb.com/user/ur49176411",
      "reviewLink": "https://www.imdb.com/review/rw5036020",
      "warningSpoilers": false,
      "date": "2 August 2019",
      "rate": "7",
      "helpful": "71 out of 98 found this helpful.",
      "title": "Wonderful concept that deserves better writing",
      "content": "I love POSE. Which is why I care about it. It's one of the first trans led, trans positive shows to tell the story of lgbtq+ culture in 80s/90s New York ball scene. Yet as much as I love it, I feel half the episodes are like watching re-runs of Jem and the holograms. There's goodies and baddies for every episode, push down your throat morality lessons, and unrealistic poverty living standards. The main lesson I've learnt is that as long as your beautiful and wear amazing clothes you'll life will be fabulous. Forget hardship, just put on a lipstick, spend all your money on outfits and the gym and you'll be fine. The shows premise is amazing, the actors are great and the background stories for the main characters need telling. Yet we need to be able tell these stories in a realistic way so they can be properly understood, so that the audience can fully explore and comprehend the real drama of people's Lives. I feel Pose takes important issues and works to raise awareness but does so with so much millennial style filtering that the real meaning is lost amongst all the gloss and glitter."
    },
    {
      "username": "toby_a_smith",
      "userUrl": "https://www.imdb.com/user/ur31211718",
      "reviewLink": "https://www.imdb.com/review/rw4197436",
      "warningSpoilers": false,
      "date": "10 June 2018",
      "rate": "8",
      "helpful": "54 out of 77 found this helpful.",
      "title": "Amazing new show!",
      "content": "Soundtrack takes me back to the 80's, luv the selection! It's an interesting view of the 80's I didn't know existed. The characters have gone through so much pain and sadness to be who they are at this point in their lives. The acting isn't the best but the show is fun. I can't wait to see more!"
    },
    {
      "username": "semilovatomanchester",
      "userUrl": "https://www.imdb.com/user/ur71469186",
      "reviewLink": "https://www.imdb.com/review/rw5913701",
      "warningSpoilers": false,
      "date": "17 July 2020",
      "rate": "10",
      "helpful": "12 out of 18 found this helpful.",
      "title": "How are people giving this under a 7 is a Joke",
      "content": "This is one of the most important shows in television history!!The cast are phenomenal I must of watched this at least 10 times over and still love it It doesn't sugar coat the AIDS crisis or the struggle of the trans community! It's brutal sometimes and upsetting to see how hard times were and still have a long way to go still Bring on season 3"
    },
    {
      "username": "Br4ve-trave1or",
      "userUrl": "https://www.imdb.com/user/ur42927804",
      "reviewLink": "https://www.imdb.com/review/rw4204669",
      "warningSpoilers": false,
      "date": "16 June 2018",
      "rate": "8",
      "helpful": "22 out of 43 found this helpful.",
      "title": "Pose 2018",
      "content": "All of the scenes are so colorful and full of life with style and dont forget culture. Speaking of color and the lead in direction, I must be watching a Ryan Murphy production. His style has always been one of my favorite. For e.g. the cinmatography from The normal Heart and The people Vs OJ to name two fright off my head. The music more than everything is like a character in this series itself, playing the mid 80s music, especially whenever it was capturing the nostalgia. This shows isnt what it says to be at first. In fact, I watched the first 5 minutes intrigued and then it turned into something different. Watch the whole first episode before deciding on whether you like it or not. You will find after two episodes that the characters go through hard times through the character development that really feel like the shows main strength. Its gritty and raw. The first scene with the son being confronted by his dad was showing the exact range this series has. Five minutes before that the characters in the present were absolutely playing different roles. The switch back to time scene was jarring but true to how being a homosexual was and sadly is still is for those. I'm appalled by the great reviews left and not supported by this community. It leaves me wondering why people would find their reviews mir helpful. READ ALL THE POSTIVE REVIEWS here too, I suggest bc tbey I'm usually reluctant about reviews but this show is put together by the masterful Rynan Murphy, or the guy Netflix just paid 300 million for! If you want to lose yourself and escape to this world of bright colors and incredible music and great directing, though some of the acting may not be top tier all the time. It. Will. Still be refreshing and feel like a breath of fresh air when you've watched what episodes theres to offer (2 at the point of this review). Do conineue it will be so much and original and unique imo!!!"
    },
    {
      "username": "fshardlow",
      "userUrl": "https://www.imdb.com/user/ur69552028",
      "reviewLink": "https://www.imdb.com/review/rw6780612",
      "warningSpoilers": false,
      "date": "4 April 2021",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "POSE is absolutely brilliant",
      "content": "I've Just finished season 1 and I have to say that Pose exceeded my expectations completely. What a marvellous and rewarding experience to watch these characters grow, make mistakes, learn and most of all show the purest love (with an occasional heavy dose of shade) that genuinely warms my heart.I want to go into every character and storyline but I feel like it's redundant- If you're at all curious about this fantastic show and you see this review... go give it a watch ASAP!I will add that it took me about 2/3 episodes to get me hooked, it wasn't instant- I think due to the huge range of characters and plots, however I'm so glad I gave it time because I think this is my favourite TV show now.I'm so happy I can watch season 2 already, I've heard it only gets better!Ps. MJ. Rodriguez, Dominique Jackson, Billy Porter, Evan Peters and Indya Moore are all absolute triumphs- it's rare to have a show with so much raw, unfiltered TALENT!"
    },
    {
      "username": "jerryjak",
      "userUrl": "https://www.imdb.com/user/ur14400546",
      "reviewLink": "https://www.imdb.com/review/rw4193412",
      "warningSpoilers": true,
      "date": "7 June 2018",
      "rate": "8",
      "helpful": "35 out of 52 found this helpful.",
      "title": "More than meets the eye",
      "content": "Just finished watching Pose on my DVR and to say I was blown away was an understatement. The great thing about this show is the characters. They have focused heavily on character development and the \"show, don't tell\" aspect of the community and their lives. The opening, when they hid in the museum hooked me. Near the end when the head of the house declared, \"I'm his mother!\" I knew I'd be watching this series. The characters are interesting, the story is compelling, and the overall tone is about people making the most of their lives. The fact that their gay, or different, while central to the show, transcends the show, so what you're left with is a quality piece of television. This is definitely for adults as an F-bomb was dropped but unless you were really looking for it, it was almost overlooked. Even the minor characters are relevant; love the man on the mic at the ball! I'll continue to watch this. My only downside, which is why I gave it an 8 instead of something higher has to do with some of the acting that is fabulous but stiff. Elektra, the head of House Abundance, makes me think of the \"William Shatner School of Acting\" sometimes. Her deliveries are over-the-top but also sound like she's reading her lines. She needs to loosen up a bit more. It seems her character is formal, almost too formal, but she's not selling it. I hope as time goes on, she'll get better. Other times, the dancing seemed to stiff and not believable. The dance-off felt like \"we must lose this because, you know, drama!\" as opposed to a natural lose.Overall, a great show. As I said, I'll be watching this."
    },
    {
      "username": "dspear66",
      "userUrl": "https://www.imdb.com/user/ur26193068",
      "reviewLink": "https://www.imdb.com/review/rw4199960",
      "warningSpoilers": false,
      "date": "11 June 2018",
      "rate": "10",
      "helpful": "64 out of 90 found this helpful.",
      "title": "Shade, shimmer, flash, trade, rejection and reflection",
      "content": "Short and sweet review. Love Live Laugh at Life. As we all have an unknown expiration date I must say that this show makes my dimples stay active. The time was \"back in the day\" the mission was not to be invisible to your own tribe or others for most, for the others it was blending like a vitamix. The music, dress, terms and struggle was just as real then as it is today. To be accepted, sometimes you have to be fearless. This takes place \"back in the day\" when it was thought that only gay men got hiv, all males who danced ballet were considered gay or curious. Today, folks are quick to think things have always been they way they are now- this show brilliantly shows you that it was a clear struggle to get where we are today its a constant struggle. The clothes, ohh dear, story line and the mere audacity to make it with real people- love it. I wont miss a show"
    },
    {
      "username": "sgws-73239",
      "userUrl": "https://www.imdb.com/user/ur89255583",
      "reviewLink": "https://www.imdb.com/review/rw4208163",
      "warningSpoilers": false,
      "date": "19 June 2018",
      "rate": "9",
      "helpful": "75 out of 98 found this helpful.",
      "title": "So Far, So Good!",
      "content": "It's very early in the season to begin an assessment as the story arc is just developing, but I'm \"in\" thus far. I'm hoping that Ryan Murphy doesn't create a trajectory similar to what we observed with \"Glee\" and am comforted that he stayed away from a \"Paris Is Burning\" musical (thus far) as the film itself caused controversy and uproar related to matters of appropriation. I hope that the Pose writers listen to community members on set and keep it real, though many are too young to have experienced, first hand, the events they portray. Please continue to seek out and promote talent in the form of community members who were in the ballroom scene and solicit their input! HIV ravaged the community during this time period and those seeking the comfort of others living the same experience, sharing the same space, were challenged in many ways. It's difficult to invest in relationships that may be fleeting due to a deadly illness. For those critiquing the acting, it's unfortunate you're not celebrating the use of transgender talent within a community that exists largely in the shadows and is marginalized in our narrow-minded society. For those making societal degradation comments, there are lots of other channels. TV Land may be more your speed.All that said, I'm loving what I see so far! Thank you for taking this on."
    },
    {
      "username": "br_ashtonopc",
      "userUrl": "https://www.imdb.com/user/ur30295377",
      "reviewLink": "https://www.imdb.com/review/rw4193363",
      "warningSpoilers": false,
      "date": "7 June 2018",
      "rate": "10",
      "helpful": "66 out of 93 found this helpful.",
      "title": "Beautiful storytelling!",
      "content": "It's so great that this show is bringing to light a culture that has saved lost souls for generations! Brilliantly written!"
    },
    {
      "username": "tm-sheehan",
      "userUrl": "https://www.imdb.com/user/ur25552762",
      "reviewLink": "https://www.imdb.com/review/rw4997987",
      "warningSpoilers": false,
      "date": "16 July 2019",
      "rate": "8",
      "helpful": "6 out of 10 found this helpful.",
      "title": "Series 2 continues to deliver",
      "content": "Pose - Series 1 & 2 is a magical history tour of the late 1980's Pageant Ball scene in New York and makes makes Ru Paul Drag Stars look like a dress up party. Pose is a breakthrough for Trans Gender actors in the fact that all the main transgender characters are actually played by trans actors. The series has a heart and is very emotional at times when depicting the struggle the Gay Community went through during the AIDS plague that wiped out a generation of gifted and wonderful people. It reminds us of the complacency and neglect the Reagan Administration demonstrated during the crises by denying medication and support to the homeless and sick in America. The glamour costumes and music are fantastic and the different houses competing for the coveted trophies are a part of New York culture I didn't know much about . The Transgender \"House Mothers\" took in so many desperate homeless young GLBT men and women who were given a chance of acceptance and creativity in a world that shunned and rejected their natures."
    },
    {
      "username": "unikorn-67905",
      "userUrl": "https://www.imdb.com/user/ur127613192",
      "reviewLink": "https://www.imdb.com/review/rw6420754",
      "warningSpoilers": false,
      "date": "29 December 2020",
      "rate": "7",
      "helpful": "10 out of 18 found this helpful.",
      "title": "Inconsistent yet entertaining.",
      "content": "This show fluctuates between dramatic realism and cartoonish silliness.One big flaw is the transfication of ballroom culture. True ballroom culture was mostly male drag queens and gay men, not transwomen.At some points that is clear because it doesn't make sense. For example at some points in ball competitions there will be 'realness checks' to see how well some of the performers pass as Women.Well, when they depict this in the show the actors are transwomen who've been on hormones and have implants. Of course they 'pass' and furthermore we're told transwomen are women so how are women passing as women?This would of been better if it was about early Trans culture in the 80s instead of centering it in ballroom culture.It can still be entertaining. You get plenty of drama, queer culture, 80s/90s vibes, shining moments and nice aesthetics.Sometimes there are slumps, poor acting, farfetched storylines, glaring potholes and straight up non-sense.I would suggest watching it but don't expect too much."
    },
    {
      "username": "chaosrachel-95190",
      "userUrl": "https://www.imdb.com/user/ur99926384",
      "reviewLink": "https://www.imdb.com/review/rw4966785",
      "warningSpoilers": false,
      "date": "29 June 2019",
      "rate": "2",
      "helpful": "41 out of 96 found this helpful.",
      "title": "Great idea but",
      "content": "Couldn't get pass the chessy-ness and terrible acting from most of the cast. Most of the bad acting wasn't their fault it mostly came from the awful dialogue and direction."
    },
    {
      "username": "chicago85",
      "userUrl": "https://www.imdb.com/user/ur1020147",
      "reviewLink": "https://www.imdb.com/review/rw4196895",
      "warningSpoilers": false,
      "date": "9 June 2018",
      "rate": "6",
      "helpful": "38 out of 78 found this helpful.",
      "title": "Inspiration for this show",
      "content": "In 1990 I saw the documentary \"Paris is Burning\" covering this same scene, Find yourself a cd somewhere pr watch it on You Tube and see the real thing. Madonna went to the balls and incorporated backup dancers voguing to material from these balls. It gave her career another boost, Many of the young people lead marginal existences living on dreams. One of the most petite fragile people was found beaten to death soon after with no biological family to claim her body. Her house saved her body being dumped in potter's field.I'll revise my score if this show starts getting more realistic about how it actually was."
    },
    {
      "username": "God_is_with_us",
      "userUrl": "https://www.imdb.com/user/ur97777216",
      "reviewLink": "https://www.imdb.com/review/rw5008103",
      "warningSpoilers": false,
      "date": "20 July 2019",
      "rate": "10",
      "helpful": "11 out of 22 found this helpful.",
      "title": "This film is so real",
      "content": "This film is the epitome of the real life of New York Life. Aside from the shopping and hustle and Bustle of the Big Apple's life, this film provides such an honest, realistic, and creative film of what the epitome of the New York Life, Dream, and Struggles.Obviously not all people in the Big Apple struggle with the realities of the characters in this film, but the concept is spot on. To the extent where I believe 100% of New Yorkers would understand and relate if they could see the obvious reality of what this film capitalizes on \"Dog eat Dog\" and \"the city of slaved dreams and staged roles\"."
    }
  ],
  "errorMessage": ""
}