{
  "imDbId": "tt7562112",
  "title": "Pose",
  "fullTitle": "Pose (TV Series 2018–2021)",
  "type": "TVSeries",
  "year": "2018",
  "language": "en",
  "titleInLanguage": "Pose (TV series)",
  "url": "https://en.wikipedia.org/wiki/Pose_(TV_series)",
  "plotShort": {
    "plainText": "Pose (stylized as POSE) is an American drama television series about New York City's ball culture, an LGBTQ subculture in the African-American and Latino communities, throughout the 1980s and 1990s. Featured characters are dancers and models, who compete for trophies and recognition in this underground culture and who support one another in a network of chosen families known as Houses.\r\nCreated by Ryan Murphy, Brad Falchuk, and Steven Canals, the series aired from June 3, 2018, to June 6, 2021, on FX. It stars an ensemble cast including Evan Peters, Kate Mara, James Van Der Beek, Michaela Jaé Rodriguez, Dominique Jackson, Billy Porter, Indya Moore, Ryan Jamaal Swain, Charlayne Woodard, Hailie Sahar, Angelica Ross, Angel Bismark Curiel, Dyllón Burnside, Sandra Bernhard, and Jason A. Rodriguez.\r\nThe first season was met with largely positive reception and subsequently received numerous award nominations including the Golden Globe Award for Best Television Series – Drama and the Golden Globe Award for Best Actor – Television Series Drama for Billy Porter. In 2019, Porter was awarded the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series – the first openly gay Black man to be nominated for and win in an Emmy lead acting category. The series was nominated for Outstanding Drama Series at the same ceremony.\r\nThe second season premiered on June 11, 2019, to further acclaim. The third and final season premiered on May 2, 2021, and concluded on June 6, 2021, to further positive reviews. On July 13, 2021, Michaela Jaé Rodriguez became the first trans lead ever nominated for the Primetime Emmy Award for Outstanding Lead Actress In A Drama Series.",
    "html": "<p>Pose (stylized as POSE) is an American drama television series about New York City's ball culture, an LGBTQ subculture in the African-American and Latino communities, throughout the 1980s and 1990s. Featured characters are dancers and models, who compete for trophies and recognition in this underground culture and who support one another in a network of chosen families known as Houses.</p><p>Created by Ryan Murphy, Brad Falchuk, and Steven Canals, the series aired from June 3, 2018, to June 6, 2021, on FX. It stars an ensemble cast including Evan Peters, Kate Mara, James Van Der Beek, Michaela Jaé Rodriguez, Dominique Jackson, Billy Porter, Indya Moore, Ryan Jamaal Swain, Charlayne Woodard, Hailie Sahar, Angelica Ross, Angel Bismark Curiel, Dyllón Burnside, Sandra Bernhard, and Jason A. Rodriguez.</p><p>The first season was met with largely positive reception and subsequently received numerous award nominations including the Golden Globe Award for Best Television Series – Drama and the Golden Globe Award for Best Actor – Television Series Drama for Billy Porter. In 2019, Porter was awarded the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series – the first openly gay Black man to be nominated for and win in an Emmy lead acting category. The series was nominated for Outstanding Drama Series at the same ceremony.</p><p>The second season premiered on June 11, 2019, to further acclaim. The third and final season premiered on May 2, 2021, and concluded on June 6, 2021, to further positive reviews. On July 13, 2021, Michaela Jaé Rodriguez became the first trans lead ever nominated for the Primetime Emmy Award for Outstanding Lead Actress In A Drama Series.</p>"
  },
  "plotFull": {
    "plainText": "Pose (stylized as POSE) is an American drama television series about New York City's ball culture, an LGBTQ subculture in the African-American and Latino communities, throughout the 1980s and 1990s. Featured characters are dancers and models, who compete for trophies and recognition in this underground culture and who support one another in a network of chosen families known as Houses.\r\nCreated by Ryan Murphy, Brad Falchuk, and Steven Canals, the series aired from June 3, 2018, to June 6, 2021, on FX. It stars an ensemble cast including Evan Peters, Kate Mara, James Van Der Beek, Michaela Jaé Rodriguez, Dominique Jackson, Billy Porter, Indya Moore, Ryan Jamaal Swain, Charlayne Woodard, Hailie Sahar, Angelica Ross, Angel Bismark Curiel, Dyllón Burnside, Sandra Bernhard, and Jason A. Rodriguez.\r\nThe first season was met with largely positive reception and subsequently received numerous award nominations including the Golden Globe Award for Best Television Series – Drama and the Golden Globe Award for Best Actor – Television Series Drama for Billy Porter. In 2019, Porter was awarded the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series – the first openly gay Black man to be nominated for and win in an Emmy lead acting category. The series was nominated for Outstanding Drama Series at the same ceremony.\r\nThe second season premiered on June 11, 2019, to further acclaim. The third and final season premiered on May 2, 2021, and concluded on June 6, 2021, to further positive reviews. On July 13, 2021, Michaela Jaé Rodriguez became the first trans lead ever nominated for the Primetime Emmy Award for Outstanding Lead Actress In A Drama Series.\r\nPremise\r\nPose is set in 1987–98 and looks at \"the juxtaposition of several segments of life and society in New York\": the African-American and Latino ball culture world, the downtown social and literary scene, and the rise of the yuppie milieu, and HIV.\r\nCast and characters\r\nMain\r\nEvan Peters as Stan Bowes, Patty's yuppie husband who works in Trump Tower and becomes Angel's lover (season 1)\r\nKate Mara as Patty Bowes, Stan's wife and mother of their children (season 1)\r\nJames Van Der Beek as Matt Bromley, Stan's kingpin boss (season 1)\r\nMichaela Jaé Rodriguez as Blanca Rodriguez-Evangelista, a trans woman with HIV/AIDS and former member of the House of Abundance. She is the founder and mother of the House of Evangelista.\r\nDominique Jackson as Elektra Evangelista, mother of the former House of Abundance. After brief stints in the Houses of Evangelista and Ferocity, she forms the House of Wintour before rejoining the House of Evangelista in the final season.\r\nBilly Porter as Prayerful \"Pray\" Tell, emcee of the balls in New York, fashion designer, and mentor to members of the community, especially the members of the House of Evangelista. He later enters a relationship with Ricky.\r\nIndya Moore as Angel Vasquez-Evangelista, a trans woman sex worker who joins the House of Evangelista after leaving the House of Abundance. She has an affair with Stan during the first season, before entering a relationship with Papi.\r\nRyan Jamaal Swain as Damon Richards-Evangelista, a homeless, talented dancer who becomes the first member of the House of Evangelista. After the season 3 premiere, the character was written out of the show due to the murder of Swain's sister in their hometown of Birmingham, Alabama. Damon was said to have relapsed into alcoholism and moved to his cousin's home in South Carolina. In the series finale, he was revealed to be in Chicago, teaching dancing.\r\nCharlayne Woodard as Helena St. Rogers, a modern dance teacher at the New School for Dance (season 1; guest, season 2)\r\nHailie Sahar as Lulu Evangelista, the founder of the House of Ferocity alongside Candy. She joins the House of Evangelista in the final season.\r\nAngelica Ross as Candy Johnson-Ferocity, the founder of the House of Ferocity alongside Lulu (seasons 1–2; guest, season 3)\r\nAngel Bismark Curiel as Esteban \"Lil Papi\" Martinez-Evangelista, a member of the House of Evangelista\r\nDyllón Burnside as Ricky Evangelista, Damon's ex-boyfriend and a former member of the House of Evangelista who joins the House of Wintour. In the final season he rejoins the House of Evangelista.\r\nSandra Bernhard as Judy Kubrak, a nurse who works with people with AIDS and member of ACT UP (seasons 2–3; guest, season 1)\r\nJason A. Rodriguez as Lemar Khan, a former member of the House of Abundance, Ferocity, Evangelista and Wintour, before becoming the father of the House of Khan (season 3; recurring, seasons 1–2)\r\nRecurring\r\nIntroduced in season 1\r\nJeremy McClain as Cubby Wintour, a young gay man and a former member of the House of Abundance, Ferocity, and Evangelista, who joins the House of Wintour and later dies in the first episode of season 3\r\nAlexia Garcia as Aphrodite Ferocity, a trans woman who defects from the House of Xtravaganza to the House of Ferocity\r\nBianca Castro as Veronica Ferocity, a thrift store cashier who joins the House of Ferocity\r\nSamantha Grace Blumm as Amanda Bowes, Stan and Patty's daughter\r\nJose Gutierez Xtravaganza as himself, a Judge and member of the real-life House of Xtravaganza\r\nJohnny Sibilly as Costas Perez, Pray Tell's boyfriend who dies of AIDS\r\nJack Mizrahi as himself, a ballroom emcee and member of the Masters of Ceremony Council\r\nLeiomy Maldonado as Florida Ferocity, a member of the House of Ferocity\r\nSol Williams (a/k/a Grandfather Sol Pen'davis) as a member of the judges panel. Sol also was in the documentary movie Paris Is Burning (1990), upon which the series is largely based.\r\nIntroduced in season 2\r\nPatti LuPone as Frederica Norman, a wealthy and shady real estate mogul\r\nDamaris Lewis as Jazmine Wintour, a member of the House of Wintour\r\nBrielle Rheames as Silhouette Wintour, a member of the House of Wintour\r\nDashaun Wesley as Shadow Wintour, a member of the House of Wintour\r\nDanielle Cooper as Wanda, Judy's girlfriend and member of ACT UP\r\nTrudie Styler as Eileen Ford, a fashion model agent\r\nAndré Ward as Manhattan, a member of the Masters of Ceremony Council\r\nJ. Cameron Barnet as Castle, a member of the Masters of Ceremony Council\r\nPatricia Black as Chi Chi, Elektra's co-worker at the Hellfire Club\r\nIntroduced in season 3\r\nJeremy Pope as Christopher, Blanca's caring boyfriend\r\nNotable guest stars\r\nIntroduced in season 1\r\nClark Jackson as Lawrence Richards (\"Pilot\"), Damon's father\r\nRoslyn Ruff as Mrs. Richards (\"Pilot\"), Damon's mother\r\nDeidre Goodwin as Wanda Green (\"Pilot\"), employee at the New School for Dance\r\nMatt McGrath as Mitchell (\"Access\"), the manager of Boy Lounge\r\nTamara M. Williams as Summer, a trans woman who attempts to seduce Stan (\"Access\", \"The Fever\")\r\nSol Pendavis Williams as himself (\"Access\", \"Mother of the Year\"), a Judge and member of the real-life House of Pendavis\r\nKathryn Erbe as Dr. Gottfried (\"Giving and Receiving\", \"The Fever\"), Elektra's physician\r\nChristine Ebersole as Bobbi (\"Giving and Receiving\"), Patty's mother\r\nChristopher Meloni as Dick Ford (\"The Fever\", \"Pink Slip\"), Elektra's wealthy lover and financier\r\nCecilia Gentili as Miss Orlando (\"The Fever\", \"Butterfly/Cocoon\"), a shady woman that offers discounted plastic surgery\r\nFlor de Liz Perez as Carmen Rodriguez (\"Mother's Day\"), Blanca's sister\r\nCharles Brice as Darius (\"Love Is the Message\"), Blanca's love interest\r\nOur Lady J as Sherilyn (\"Love Is the Message\", \"Love's in Need of Love Today\"), a local pianist\r\nTrace Lysette as Tess Wintour (\"Love is the Message\", \"Worth It\"), a clothing store saleswoman who later joins House of Wintour\r\nLaith Ashley as \"Sebastian\" (\"Love Is the Message\"), a sexy participant in one of the ballroom-scenes\r\nIntroduced in season 2\r\nAlexander DiPersia as Andre Taglioni (\"Acting Up\", \"Revelations\"), a famed photographer and fetishistic predator\r\nEdward Carnevale as Jonas Norman (\"Worth It\", \"Love's in Need of Love Today\"), Frederica Norman's son\r\nBlaine Alden Krauss as Chris (\"Worth it\", \"What Would Candy Do?\"), dancer and Ricky's former lover\r\nPeppermint as Euphoria (\"Butterfly/Cocoon\"), a trans sex worker\r\nDanny Johnson as Darnell Johnson (\"Never Knew Love Like This Before\"), Candy's father\r\nPatrice Johnson Chevannes as Vivica Johnson (\"Never Knew Love Like This Before\"), Candy's mother\r\nAustin Scott as Adrian (\"Life's a Beach\"), a lifeguard and Blanca's love interest\r\nKJ Aikens as Quincy and Gia Parr as Chilly (\"In My Heels\"), street kids who Blanca takes under her wing\r\nIntroduced in season 3\r\nEisa Davis as Angie, Christopher's mother, who has a judgmental behavior towards Blanca\r\nCurtiss Cook as Thomas, Christopher's father\r\nRahne Jones as Leisa, an alcoholism counselor advising Pray Tell\r\nNoma Dumezweni as Tasha Jackson, Elektra's mother\r\nNorm Lewis as Vernon Jackson, Pray Tell's former lover, who is a now a pastor\r\nAnna Maria Horsford as Charlene, Pray Tell's mother\r\nJanet Hubert as Latrice, Pray Tell's aunt\r\nJackée Harry as Jada, Pray Tell's aunt\r\nMichelle Hurd as Ebony Jackson, Vernon's wife and Pray Tell's childhood best friend\r\nJordan Aaron Hall as a young Pray Tell\r\nAnnelise Cepero as Jimena, sister of Lil Papi's ex-girlfriend\r\nMark Lotito as Marco Ciccone, a mobster with whom Elektra makes business\r\nChris Tardio as Vicent Massino, a mobster with whom Elektra makes business\r\nEpisodes\r\nSeason 1 (2018)\r\nSeason 2 (2019)\r\nSeason 3 (2021)\r\nProduction\r\nDevelopment\r\nOn March 16, 2017, it was announced that FX had given the production a pilot order. The pilot was written by Ryan Murphy, Brad Falchuk, and Steven Canals all of whom were also set to executive produce alongside Nina Jacobson, Brad Simpson, and Sherry Marsh. Production companies involved with the pilot were slated to consist of include FX Productions and Fox21 Television Studios. In October 2018, it was reported that Leiomy Maldonado and Danielle Polanco would be choreographing the series' ball scenes and that Janet Mock and Our Lady J had joined the show's writing and producing staff.\r\nOn December 27, 2017, it was announced that FX had given the production a series for a first season consisting of eight episodes. On May 9, 2018, ahead of the series premiere, Murphy announced that he would be donating all of his profits from Pose to non-profit charitable organizations that work with LGBTQ+ people, including the Sylvia Rivera Law Project, the Transgender Legal Defense & Education Fund, and the Callen-Lorde Community Health Center. Murphy explained this decision saying, \"The thing that struck me in talking to so many of them, was how much they've struggled, how under attack they feel, how many of them find it difficult getting healthcare, and finding jobs. I just decided I need to do more than just making a show for this community. I want to reach out and help this community.\" On July 12, 2018, it was announced that the series had been renewed for a second season which premiered on June 11, 2019. On June 17, 2019, FX renewed the series for a third season. In March 2021, FX confirmed the third season would be its last. The final season premiered on May 2, 2021.\r\nCasting\r\nIn March 2017, Ryan Murphy and his team began casting for the series. On October 25, 2017, it was announced that transgender actors Michaela Jaé Rodriguez, Indya Moore, Dominique Jackson, Hailie Sahar, and Angelica Ross and cisgender actors Ryan Jamaal Swain, Billy Porter and Dyllón Burnside had been cast in main roles. The series' production team claimed that they had assembled the largest transgender cast ever for a scripted series. The series was expected to include over 50 transgender characters total. On October 26, 2017, it was announced that Evan Peters, Kate Mara, James Van Der Beek, and Tatiana Maslany had also joined the main cast.\r\nOn December 27, 2017, it was reported that Maslany had exited the series following the redevelopment of her part into that of a 50-year-old African-American woman. The character was then recast with Charlayne Woodard assuming the role. On September 19, 2018, it was announced that Sandra Bernhard would reprise her role of Nurse Judy in season two as a series regular. On March 23, 2019, at PaleyFest, Ryan Murphy revealed that Patti LuPone would guest star in the second season.\r\nFilming\r\nProduction for the pilot began in New York City in October 2017. The following episodes of the first season were expected to begin production in February 2018. Murphy directed the series' first two episodes and Mock directed the sixth, thus making her the first transgender woman of color to write and direct any episode of television. On March 14, 2020, production on the third season was suspended due to the COVID-19 health crisis. The third and final season's filming wrapped on March 20, 2021.\r\nRelease\r\nMarketing\r\nOn April 12, 2018, FX released the first teaser trailer for the series. It was also announced that the series was set to premiere on June 3, 2018. On May 3, 2018, the first official trailer was released.\r\nPremiere\r\nOn May 17, 2018, the series held its world premiere at the Hammerstein Ballroom in Manhattan. On July 23, 2018, Dyllón Burnside emceed a benefit concert, duetting with co-stars Billy Porter and Ryan Jamaal Swain to celebrate the season one finale, and raise money for GLSEN. During the event, a conversation was held between Burnside and former Vibe editor-in-chief Emil Wilbekin, where Burnside discussed his coming out story and spoke about the importance of safe spaces for LGBTQ people. Later on in the evening, Porter sang from his latest album and Michaela Jaé Rodriguez sang \"Waving Through a Window\" from Dear Evan Hansen.\r\nIn March 2019, the series was part of the Paley Center for Media's annual Paleyfest LA at the Dolby Theatre in Los Angeles, California.\r\nPose premiered in the United Kingdom on March 21, 2019, on BBC Two. Season 2 premiered on October 26, 2019, and Season 3 on August 8, 2021. All full series made available on BBC iPlayer straight after each series' premiere.\r\nInfluences\r\nWhile a work of creative fiction, the series is \"heavily inspired by\" Jennie Livingston's 1990 documentary, Paris Is Burning. Livingston also served as a consulting producer on the show. Several of the houses and characters were based on, or named after, real people, and several people featured in the documentary also made cameos in the series, such as Jose Gutierez Xtravaganza, an icon of the voguing scene, who plays a judge throughout the first series, and Sol Pendavis Williams, of the House of Pendavis. Creators and producers of the series, Murphy, Canals, and writer/producer Janet Mock all considered Paris Is Burning \"a text that helped inform not only the show, but also their identities when they first saw it.\"\r\nPose also expands on one of Paris Is Burning's subtler themes. At various points in the film, Livingston contrasts the drag performers with ordinary, affluent New Yorkers, walking down busy Manhattan sidewalks. It's often hard to tell which of these two groups is more \"real\", which of them are fashion models or Wall Street power players and which are simply costumed as such. Pose elaborates on those subtle distinctions with a subplot involving Stan (Evan Peters), a rising star in the Trump organization with an obnoxious boss (James Van Der Beek), a pretty wife (Kate Mara), and a secret relationship with Angel (Indya Moore), a trans woman. The show aims to capture some of the diversity of New York in the '80s, while also emphasizing the idea that, whether rich or poor, everyone in the city is pretending, in one way or another.\r\nReception\r\nCritical response\r\nSeason 1\r\nOn the review aggregation website Rotten Tomatoes, the first season holds a 96% approval rating with an average rating of 8.3/10 based on 84 reviews. The website's critical consensus reads, \"Charged with energy, poise, and confidence, Pose pirouettes between artistic opulence and deliciously soapy drama to create a fresh new addition to Ryan Murphy's lexicon.\" Metacritic, which uses a weighted average, assigned the first season a score of 75 out of 100 based on 27 critics, indicating \"generally favorable reviews\".\r\nIn a positive review, Vanity Fair's Richard Lawson was effusive, describing the series as \"an engaging portrait of dark days met with merriment. Pain and perseverance are sewn together to create something humble yet fabulous—and, it should be shouted over all the show's loud and glorious clamor, very much long overdue.\" In a similarly favorable critique, Vulture's Matt Zoller Seitz praised the series' ambition, aesthetic, and spotlight on minorities saying, \"it shows American audiences a world that has never been visualized on television at this length and at such an obviously grand budget level. The camera swings and swoops, glides and tumbles as in a Scorsese epic like Gangs of New York; in both the outdoor street scenes and indoor crowd scenes, it's obvious that FX has spared no expense to get the clothes, the cars, the streets, the business signs, and even the distinctive yellow-brown glow of streetlights correct.\" In a more mixed assessment, Newsday's gave the series two-and-a-half stars out of four and described it far less approvingly saying, \"good intentions don't always lead to good TV, and a couple episodes in, that appears to be the case with Pose. This certainly isn't bad TV—Murphy isn't about to leave his longtime home with a turkey—but it's often bland TV, and oddly enough, stock TV.\" In a negative evaluation, Slate's Willa Paskin was outright dismissive saying, \"It's a TV show from one of the most canny creators working today, yet as a viewing experience it can feel like an object lesson.\" She continued on specifically criticizing the show's character development saying, \"So many of the people on Pose are strong women, trans paragons, and this comes at the expense of them being recognizably flawed human beings.\"\r\nSeason 2\r\nOn Rotten Tomatoes, the second season holds a 98% approval rating with an average rating of 8.40/10 based on 41 reviews. The website's critical consensus reads, \"A delightful, delicate dance of light and dark, Pose's second season achieves a striking balance between the grittiness of reality and the glamour of the runway and shines even brighter.\" On Metacritic, season 2 holds a score of 79 out of 100 based on 14 critics, indicating \"generally favorable reviews.\"\r\nSeason 3\r\nOn Rotten Tomatoes, the third season holds a 100% approval rating with an average rating of 7.70/10 based on 29 reviews. The website's critical consensus reads, \"Though it's entirely too short, Pose's final season is a joyously entertaining celebration of life that is not to be missed.\" On Metacritic, season 3 holds a score of 76 out of 100 based on 11 critics, indicating \"generally favorable reviews.\"\r\nRatings\r\nSeason 1\r\nSeason 2\r\nSeason 3\r\nAccolades",
    "html": "<p>Pose (stylized as POSE) is an American drama television series about New York City's ball culture, an LGBTQ subculture in the African-American and Latino communities, throughout the 1980s and 1990s. Featured characters are dancers and models, who compete for trophies and recognition in this underground culture and who support one another in a network of chosen families known as Houses.</p><p>Created by Ryan Murphy, Brad Falchuk, and Steven Canals, the series aired from June 3, 2018, to June 6, 2021, on FX. It stars an ensemble cast including Evan Peters, Kate Mara, James Van Der Beek, Michaela Jaé Rodriguez, Dominique Jackson, Billy Porter, Indya Moore, Ryan Jamaal Swain, Charlayne Woodard, Hailie Sahar, Angelica Ross, Angel Bismark Curiel, Dyllón Burnside, Sandra Bernhard, and Jason A. Rodriguez.</p><p>The first season was met with largely positive reception and subsequently received numerous award nominations including the Golden Globe Award for Best Television Series – Drama and the Golden Globe Award for Best Actor – Television Series Drama for Billy Porter. In 2019, Porter was awarded the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series – the first openly gay Black man to be nominated for and win in an Emmy lead acting category. The series was nominated for Outstanding Drama Series at the same ceremony.</p><p>The second season premiered on June 11, 2019, to further acclaim. The third and final season premiered on May 2, 2021, and concluded on June 6, 2021, to further positive reviews. On July 13, 2021, Michaela Jaé Rodriguez became the first trans lead ever nominated for the Primetime Emmy Award for Outstanding Lead Actress In A Drama Series.</p><br/><h3>Premise</h3><p>Pose is set in 1987–98 and looks at \"the juxtaposition of several segments of life and society in New York\": the African-American and Latino ball culture world, the downtown social and literary scene, and the rise of the yuppie milieu, and HIV.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Evan Peters as Stan Bowes, Patty's yuppie husband who works in Trump Tower and becomes Angel's lover (season 1)</li><li>Kate Mara as Patty Bowes, Stan's wife and mother of their children (season 1)</li><li>James Van Der Beek as Matt Bromley, Stan's kingpin boss (season 1)</li><li>Michaela Jaé Rodriguez as Blanca Rodriguez-Evangelista, a trans woman with HIV/AIDS and former member of the House of Abundance. She is the founder and mother of the House of Evangelista.</li><li>Dominique Jackson as Elektra Evangelista, mother of the former House of Abundance. After brief stints in the Houses of Evangelista and Ferocity, she forms the House of Wintour before rejoining the House of Evangelista in the final season.</li><li>Billy Porter as Prayerful \"Pray\" Tell, emcee of the balls in New York, fashion designer, and mentor to members of the community, especially the members of the House of Evangelista. He later enters a relationship with Ricky.</li><li>Indya Moore as Angel Vasquez-Evangelista, a trans woman sex worker who joins the House of Evangelista after leaving the House of Abundance. She has an affair with Stan during the first season, before entering a relationship with Papi.</li><li>Ryan Jamaal Swain as Damon Richards-Evangelista, a homeless, talented dancer who becomes the first member of the House of Evangelista. After the season 3 premiere, the character was written out of the show due to the murder of Swain's sister in their hometown of Birmingham, Alabama. Damon was said to have relapsed into alcoholism and moved to his cousin's home in South Carolina. In the series finale, he was revealed to be in Chicago, teaching dancing.</li><li>Charlayne Woodard as Helena St. Rogers, a modern dance teacher at the New School for Dance (season 1; guest, season 2)</li><li>Hailie Sahar as Lulu Evangelista, the founder of the House of Ferocity alongside Candy. She joins the House of Evangelista in the final season.</li><li>Angelica Ross as Candy Johnson-Ferocity, the founder of the House of Ferocity alongside Lulu (seasons 1–2; guest, season 3)</li><li>Angel Bismark Curiel as Esteban \"Lil Papi\" Martinez-Evangelista, a member of the House of Evangelista</li><li>Dyllón Burnside as Ricky Evangelista, Damon's ex-boyfriend and a former member of the House of Evangelista who joins the House of Wintour. In the final season he rejoins the House of Evangelista.</li><li>Sandra Bernhard as Judy Kubrak, a nurse who works with people with AIDS and member of ACT UP (seasons 2–3; guest, season 1)</li><li>Jason A. Rodriguez as Lemar Khan, a former member of the House of Abundance, Ferocity, Evangelista and Wintour, before becoming the father of the House of Khan (season 3; recurring, seasons 1–2)</li></ul><h4>Recurring</h4><h4>Introduced in season 1</h4><ul><li>Jeremy McClain as Cubby Wintour, a young gay man and a former member of the House of Abundance, Ferocity, and Evangelista, who joins the House of Wintour and later dies in the first episode of season 3</li><li>Alexia Garcia as Aphrodite Ferocity, a trans woman who defects from the House of Xtravaganza to the House of Ferocity</li><li>Bianca Castro as Veronica Ferocity, a thrift store cashier who joins the House of Ferocity</li><li>Samantha Grace Blumm as Amanda Bowes, Stan and Patty's daughter</li><li>Jose Gutierez Xtravaganza as himself, a Judge and member of the real-life House of Xtravaganza</li><li>Johnny Sibilly as Costas Perez, Pray Tell's boyfriend who dies of AIDS</li><li>Jack Mizrahi as himself, a ballroom emcee and member of the Masters of Ceremony Council</li><li>Leiomy Maldonado as Florida Ferocity, a member of the House of Ferocity</li><li>Sol Williams (a/k/a Grandfather Sol Pen'davis) as a member of the judges panel. Sol also was in the documentary movie Paris Is Burning (1990), upon which the series is largely based.</li></ul><h4>Introduced in season 2</h4><ul><li>Patti LuPone as Frederica Norman, a wealthy and shady real estate mogul</li><li>Damaris Lewis as Jazmine Wintour, a member of the House of Wintour</li><li>Brielle Rheames as Silhouette Wintour, a member of the House of Wintour</li><li>Dashaun Wesley as Shadow Wintour, a member of the House of Wintour</li><li>Danielle Cooper as Wanda, Judy's girlfriend and member of ACT UP</li><li>Trudie Styler as Eileen Ford, a fashion model agent</li><li>André Ward as Manhattan, a member of the Masters of Ceremony Council</li><li>J. Cameron Barnet as Castle, a member of the Masters of Ceremony Council</li><li>Patricia Black as Chi Chi, Elektra's co-worker at the Hellfire Club</li></ul><h4>Introduced in season 3</h4><ul><li>Jeremy Pope as Christopher, Blanca's caring boyfriend</li></ul><h4>Notable guest stars</h4><h4>Introduced in season 1</h4><ul><li>Clark Jackson as Lawrence Richards (\"Pilot\"), Damon's father</li><li>Roslyn Ruff as Mrs. Richards (\"Pilot\"), Damon's mother</li><li>Deidre Goodwin as Wanda Green (\"Pilot\"), employee at the New School for Dance</li><li>Matt McGrath as Mitchell (\"Access\"), the manager of Boy Lounge</li><li>Tamara M. Williams as Summer, a trans woman who attempts to seduce Stan (\"Access\", \"The Fever\")</li><li>Sol Pendavis Williams as himself (\"Access\", \"Mother of the Year\"), a Judge and member of the real-life House of Pendavis</li><li>Kathryn Erbe as Dr. Gottfried (\"Giving and Receiving\", \"The Fever\"), Elektra's physician</li><li>Christine Ebersole as Bobbi (\"Giving and Receiving\"), Patty's mother</li><li>Christopher Meloni as Dick Ford (\"The Fever\", \"Pink Slip\"), Elektra's wealthy lover and financier</li><li>Cecilia Gentili as Miss Orlando (\"The Fever\", \"Butterfly/Cocoon\"), a shady woman that offers discounted plastic surgery</li><li>Flor de Liz Perez as Carmen Rodriguez (\"Mother's Day\"), Blanca's sister</li><li>Charles Brice as Darius (\"Love Is the Message\"), Blanca's love interest</li><li>Our Lady J as Sherilyn (\"Love Is the Message\", \"Love's in Need of Love Today\"), a local pianist</li><li>Trace Lysette as Tess Wintour (\"Love is the Message\", \"Worth It\"), a clothing store saleswoman who later joins House of Wintour</li><li>Laith Ashley as \"Sebastian\" (\"Love Is the Message\"), a sexy participant in one of the ballroom-scenes</li></ul><h4>Introduced in season 2</h4><ul><li>Alexander DiPersia as Andre Taglioni (\"Acting Up\", \"Revelations\"), a famed photographer and fetishistic predator</li><li>Edward Carnevale as Jonas Norman (\"Worth It\", \"Love's in Need of Love Today\"), Frederica Norman's son</li><li>Blaine Alden Krauss as Chris (\"Worth it\", \"What Would Candy Do?\"), dancer and Ricky's former lover</li><li>Peppermint as Euphoria (\"Butterfly/Cocoon\"), a trans sex worker</li><li>Danny Johnson as Darnell Johnson (\"Never Knew Love Like This Before\"), Candy's father</li><li>Patrice Johnson Chevannes as Vivica Johnson (\"Never Knew Love Like This Before\"), Candy's mother</li><li>Austin Scott as Adrian (\"Life's a Beach\"), a lifeguard and Blanca's love interest</li><li>KJ Aikens as Quincy and Gia Parr as Chilly (\"In My Heels\"), street kids who Blanca takes under her wing</li></ul><h4>Introduced in season 3</h4><ul><li>Eisa Davis as Angie, Christopher's mother, who has a judgmental behavior towards Blanca</li><li>Curtiss Cook as Thomas, Christopher's father</li><li>Rahne Jones as Leisa, an alcoholism counselor advising Pray Tell</li><li>Noma Dumezweni as Tasha Jackson, Elektra's mother</li><li>Norm Lewis as Vernon Jackson, Pray Tell's former lover, who is a now a pastor</li><li>Anna Maria Horsford as Charlene, Pray Tell's mother</li><li>Janet Hubert as Latrice, Pray Tell's aunt</li><li>Jackée Harry as Jada, Pray Tell's aunt</li><li>Michelle Hurd as Ebony Jackson, Vernon's wife and Pray Tell's childhood best friend</li><li>Jordan Aaron Hall as a young Pray Tell</li><li>Annelise Cepero as Jimena, sister of Lil Papi's ex-girlfriend</li><li>Mark Lotito as Marco Ciccone, a mobster with whom Elektra makes business</li><li>Chris Tardio as Vicent Massino, a mobster with whom Elektra makes business</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 3, 2018</td><td style=\"padding:0 8px\">July 22, 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 11, 2019</td><td style=\"padding:0 8px\">August 20, 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">May 2, 2021</td><td style=\"padding:0 8px\">June 6, 2021</td></tr></tbody></table><h4>Season 1 (2018)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#EFAFD8;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#EFAFD8;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#EFAFD8;width:26%\">Title</th><th scope=\"col\" style=\"background:#EFAFD8;width:17%\">Directed by</th><th scope=\"col\" style=\"background:#EFAFD8;width:19%\">Written by</th><th scope=\"col\" style=\"background:#EFAFD8;width:13%\">Original air date</th><th scope=\"col\" style=\"background:#EFAFD8;width:6%\"><abbr title=\"Production\">Prod.</abbr><br>code</th><th scope=\"col\" style=\"background:#EFAFD8;width:9%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Pilot</span>\"</td><td style=\"text-align:center\"><span class=\"mw-redirect\">Ryan Murphy</span></td><td style=\"text-align:center\">Ryan Murphy &amp; <span>Brad Falchuk</span> &amp; <span>Steven Canals</span></td><td style=\"text-align:center\">June 3, 2018</td><td id=\"pc1WBF01\" rowspan=\"1\" style=\"text-align:center\">1WBF01</td><td style=\"text-align:center\">0.688</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #EFAFD8\">In 1987, after being diagnosed as <span>HIV</span>-positive, Blanca decides to leave the House of Abundance and start the House of Evangelista. A young dancer, Damon, is kicked out of his conservative and religious parents' home after they discover he is gay. Blanca invites Damon to join the House of Evangelista. Angel is picked up by Stan, a married man who has just begun working at <span>Trump Tower</span>. The two kiss and talk but do not have sex. Abundance and Evangelista face off at a ball and Abundance is victorious. Damon auditions for the <span>New School for Dance</span> and is accepted.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Access\"</td><td style=\"text-align:center\">Ryan Murphy</td><td style=\"text-align:center\">Ryan Murphy &amp; Brad Falchuk &amp; Steven Canals</td><td style=\"text-align:center\">June 10, 2018</td><td id=\"pc1WBF02\" rowspan=\"1\" style=\"text-align:center\">1WBF02</td><td style=\"text-align:center\">0.548</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #EFAFD8\">Blanca is <span>denied entry</span> to a <span>gay bar</span> and sets out to gain access through a solo <span>sit-in</span>. Stan asks for a raise at work so that he may give Angel her own apartment. Damon meets a dancer named Ricky and is enamored, but resists Ricky's seduction, as he's not ready to have sex. Blanca offers Damon guidance regarding love and relationships and encourages him to practice <span>safe sex</span>. Damon misses his first date with Ricky to attend the ballet. The two make amends and attend the ballet together. Despite being kicked out of the bar multiple times and even being arrested, Blanca keeps returning to the bar in protest.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Giving and Receiving\"</td><td style=\"text-align:center\"><span>Nelson Cragg</span></td><td style=\"text-align:center\"><span>Janet Mock</span> &amp; <span class=\"nowrap\"><span>Our Lady J</span></span></td><td style=\"text-align:center\">June 17, 2018</td><td id=\"pc1WBF03\" rowspan=\"1\" style=\"text-align:center\">1WBF03</td><td style=\"text-align:center\">0.561</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #EFAFD8\">Pray Tell pays a visit to his lover, Costas, who is dying of <span>AIDS</span>. Elektra enlists two of her children, Lulu and Candy, to help her steal from a <span>Salvation Army</span> donation bucket. She uses the money for a down payment on her <span class=\"mw-redirect\">gender confirmation surgery</span>. Stan welcomes Angel to her new studio apartment. She makes him promise to be with her for just an hour on <span>Christmas</span>. Stan's boss, Matt, arrives at Stan's home bearing gifts and makes a pass at Stan's wife, Patty, who is home alone. Patty rebuffs Matt's advances. Matt is angry and subtly implies that Stan has a <span>mistress</span>. Stan is unable to visit Angel on Christmas after Patty questions him. The House of Evangelista has Christmas dinner at a Chinese restaurant with Pray Tell.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Fever\"</td><td style=\"text-align:center\"><span>Gwyneth Horder-Payton</span></td><td style=\"text-align:center\">Janet Mock</td><td style=\"text-align:center\">June 24, 2018</td><td id=\"pc1WBF04\" rowspan=\"1\" style=\"text-align:center\">1WBF04</td><td style=\"text-align:center\">0.719</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #EFAFD8\">Damon is sick with a high <span>fever</span> and Blanca fears that he may have <span>contracted HIV</span> after he tells her that he and Ricky haven't always been practicing <span>safe sex</span>. Pray Tell takes Damon, Ricky, Lil Papi, and himself to get tested and everyone's results are negative except for Pray Tell, who chooses not to tell anyone except Blanca. Candy resorts to getting cheap, amateur <span>silicone injections</span> after getting ridiculed at a ball for her frame which has a negative impact on her health; Angel also considers plastic surgery after an incident with Stan leaves her feeling insecure. Meanwhile, Elektra undergoes gender confirmation surgery, despite the objections and disapproval of her <span>sugar daddy</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Mother's Day\"</td><td style=\"text-align:center\"><span>Silas Howard</span></td><td style=\"text-align:center\">Steven Canals</td><td style=\"text-align:center\">July 1, 2018</td><td id=\"pc1WBF05\" rowspan=\"1\" style=\"text-align:center\">1WBF05</td><td style=\"text-align:center\">0.582</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #EFAFD8\">A flashback shows Blanca's attending her first ball and fails to impress; however, Elektra takes her into the House of Abundance. In the present day, Blanca receives the news that her biological mother has died, and attends her <span>funeral</span> and <span>wake</span>, much to the distaste of her biological family. Blanca visits Elektra in the hospital where she is recovering from her gender confirmation surgery. Meanwhile, Stan gets a promotion at work which angers Matt, and he seeks revenge by telling Patty about Stan's ongoing affair with Angel. Matt provides Angel's whereabouts to Patty who shows up at the home of the House of Evangelista, and Lil' Papi takes Patty to the ball where she confronts Angel.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Love Is the Message\"</td><td style=\"text-align:center\">Janet Mock</td><td style=\"text-align:center\">Ryan Murphy &amp; Janet Mock</td><td style=\"text-align:center\">July 8, 2018</td><td id=\"pc1WBF06\" rowspan=\"1\" style=\"text-align:center\">1WBF06</td><td style=\"text-align:center\">0.594</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #EFAFD8\">Patty and Angel have a long conversation in a nearby diner about Angel's relationship with Stan, and Patty is shocked to learn that she is transgender. Later, Patty takes Stan to <span>couples therapy</span>, and after a lengthy session tells Stan that she wants some time apart and kicks Stan out of the family home. Stan retaliates by physically confronting Matt at the office, in which Matt comes out on top. Pray Tell hosts a <span>cabaret</span> at the AIDS ward where his boyfriend Costas is staying; subsequently Costas dies from complications from HIV. Although initially angry, Pray Tell is consoled and comforted by Blanca and her children.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Pink Slip\"</td><td style=\"text-align:center\"><span>Tina Mabry</span></td><td style=\"text-align:center\">Steven Canals &amp; Our Lady J</td><td style=\"text-align:center\">July 15, 2018</td><td id=\"pc1WBF07\" rowspan=\"1\" style=\"text-align:center\">1WBF07</td><td style=\"text-align:center\">0.689</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #EFAFD8\">Stan and Angel are now living together as a couple, however, this is short-lived when Angel takes Stan to a ball. He is overwhelmed by the atmosphere and culture and realizes this life isn't for him and leaves Angel. Meanwhile, Elektra finds herself out on the street when her sugar daddy, and others like him, reject her due to her gender confirmation surgery and resorts to <span>stripping</span> to keep herself afloat after being <span>evicted</span> from her apartment. Elsewhere, Lulu and Candy, tired of living in Elektra's shadow and under her rule, leave and form their own house called the House of Ferocity. Blanca finds out that Lil' Papi is <span>dealing drugs</span> and evicts him from the house. He later joins the House of Ferocity, and during a confrontation with Blanca at a ball, tells her they are determined to take her down.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Mother of the Year\"</td><td style=\"text-align:center\">Gwyneth Horder-Payton</td><td style=\"text-align:center\">Ryan Murphy &amp; Brad Falchuk &amp; Steven Canals</td><td style=\"text-align:center\">July 22, 2018</td><td id=\"pc1WBF08\" rowspan=\"1\" style=\"text-align:center\">1WBF08</td><td style=\"text-align:center\">0.781</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #EFAFD8\">Blanca and Elektra reunite after she invites and welcomes Elektra into the House of Evangelista and helps her get a job at an elegant restaurant. Damon and Ricky successfully audition to tour with <span>Al B. Sure!</span> as part of the dance troupe, however Damon stays behind to continue his studies while Ricky goes on tour. Before the Princess Ball, Stan shows up and begs Angel to take him back but she rejects him. Elektra manages to recruit two new members into the House of Evangelista, and Lil' Papi also returns to the house. The House of Ferocity challenges the House of Evangelista at the Princess Ball, the latter wins and Blanca is crowned Mother of the Year.</td></tr></tbody></table><h4>Season 2 (2019)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#7C0046;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#7C0046;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#7C0046;width:26%\">Title</th><th scope=\"col\" style=\"background:#7C0046;width:17%\">Directed by</th><th scope=\"col\" style=\"background:#7C0046;width:19%\">Written by</th><th scope=\"col\" style=\"background:#7C0046;width:13%\">Original air date</th><th scope=\"col\" style=\"background:#7C0046;width:6%\"><abbr title=\"Production\">Prod.</abbr><br>code</th><th scope=\"col\" style=\"background:#7C0046;width:9%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Acting Up\"</td><td style=\"text-align:center\"><span>Gwyneth Horder-Payton</span></td><td style=\"text-align:center\"><span class=\"mw-redirect\">Ryan Murphy</span> &amp; <span>Brad Falchuk</span> &amp; <span>Steven Canals</span></td><td style=\"text-align:center\">June 11, 2019</td><td id=\"pc2WBF01\" rowspan=\"1\" style=\"text-align:center\">2WBF01</td><td style=\"text-align:center\">0.672</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #7C0046\">It is now 1990, and the <span>voguing</span> aspect of <span>ballroom culture</span> is beginning to go mainstream with the release of <span class=\"mw-redirect\">Madonna's</span> song, \"<span>Vogue</span>\". The community has conflicted feelings about this. Blanca, though still feeling healthy, discovers her T cell count has dropped to 200, which means her diagnosis has shifted from HIV positive to <span class=\"mw-redirect\">AIDS</span>. Judy Kubrak helps Blanca get <span class=\"mw-redirect\">AZT</span>, and brings a reluctant Pray Tell to an <span>ACT UP</span> meeting. Judy, Blanca, Pray Tell, and most of Blanca's household participate in ACT UP's <span>\"Stop the Church\" protest</span> at <span class=\"mw-redirect\">St Patrick's Cathedral</span>, and are arrested for <span>civil disobedience</span>. Angel enters a modeling competition held by <span>Ford Models</span>, and is selected as a top-ten finalist, but is exploited by a photographer who fetishizes her. Blanca and Papi beat up the exploitative photographer and take back the photos and negatives.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Worth It\"</td><td style=\"text-align:center\">Gwyneth Horder-Payton</td><td style=\"text-align:center\"><span>Janet Mock</span></td><td style=\"text-align:center\">June 18, 2019</td><td id=\"pc2WBF02\" rowspan=\"1\" style=\"text-align:center\">2WBF02</td><td style=\"text-align:center\">0.567</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #7C0046\">Elektra embarks on a new career as a dominatrix. Feeling empowered, she leaves the House of Ferocity and recruits members for her new House of <span>Wintour</span>. Blanca rents a storefront from shady real estate mogul Frederica Norman with plans to open a <span>nail salon</span>. When Frederica finds out Blanca is transgender she tries to evict her but Blanca claims <span class=\"mw-redirect\">squatter's rights</span>. Damon suspects Ricky is having sex with other people, so he breaks up with him. Ricky leaves the House of Evangelista and joins the House of Wintour.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Butterfly/Cocoon\"</td><td style=\"text-align:center\">Janet Mock</td><td style=\"text-align:center\"><span>Our Lady J</span></td><td style=\"text-align:center\">June 25, 2019</td><td id=\"pc2WBF03\" rowspan=\"1\" style=\"text-align:center\">2WBF03</td><td style=\"text-align:center\">0.589</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #7C0046\">Newly-minted <span>dominatrix</span> Elektra leaves a client alone in her dungeon and is horrified upon her return to discover him dead. The client had snorted <span>cocaine</span>, overdosed and suffocated in the bondage mask. Elektra enlists the aid of Blanca and then Candy, who help her <span>mummify</span> and seal the client's body in a trunk and hide it in Elektra's closet. Angel and Papi begin to explore their relationship but a last-minute modeling assignment derails their first official date. At the end of the episode, Angel becomes the new face of Wet 'n Wild cosmetics.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Never Knew Love Like This Before\"</td><td style=\"text-align:center\">Ryan Murphy</td><td style=\"text-align:center\">Ryan Murphy &amp; Janet Mock</td><td style=\"text-align:center\">July 9, 2019</td><td id=\"pc2WBF04\" rowspan=\"1\" style=\"text-align:center\">2WBF04</td><td style=\"text-align:center\">0.580</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #7C0046\">Candy is murdered while <span>working</span> at a motel. Candy attends her funeral in spirit, where she and Blanca hum and sing together. Pray Tell, Angel, Lulu, and Candy's parents all see Candy in spirit form. Before Candy's demise, Pray Tell and the council of emcees had rejected having the lip sync category at the balls (leading them to be showered with diner cutlery by Candy). At Candy's funeral Pray Tell announces that, in honor of Candy, they will now have the lip synching, naming it \"Candy's Sweet Refrain\". At the end of the episode Candy lip sync <span>Stephanie Mills</span> song \"<span>Never Knew Love Like This Before</span>\".</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"What Would Candy Do?\"</td><td style=\"text-align:center\"><span>Tina Mabry</span></td><td style=\"text-align:center\">Steven Canals</td><td style=\"text-align:center\">July 16, 2019</td><td id=\"pc2WBF05\" rowspan=\"1\" style=\"text-align:center\">2WBF05</td><td style=\"text-align:center\">0.497</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #7C0046\">Ricky and Damon both audition to be dancers for <span class=\"mw-redirect\">Madonna</span>'s <span>Blond Ambition World Tour</span>. Elektra schemes to have Damon injured by Candy's hammer (handed off to various potential assailants) in an effort to better Ricky's chances of securing a spot on the tour, but calls off the plan after she is berated by Blanca.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Love's In Need Of Love Today\"</td><td style=\"text-align:center\">Tina Mabry</td><td style=\"text-align:center\">Brad Falchuk &amp; Our Lady J</td><td style=\"text-align:center\">July 23, 2019</td><td id=\"pc2WBF06\" rowspan=\"1\" style=\"text-align:center\">2WBF06</td><td style=\"text-align:center\">0.505</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #7C0046\">Pray Tell has a severe, adverse reaction to <span class=\"mw-redirect\">AZT</span> and is hospitalized. Blanca organizes his annual AIDS cabaret in his place. She shares that she is HIV-positive to the cabaret crowd, for the first time, before performing \"Love's in Need of Love Today\" by <span>Stevie Wonder</span> with Pray Tell. The ballroom community, led by Lulu and Elektra, comes together to protest Frederica after Frederica betrays Blanca and has Blanca's nail salon boarded up while everyone is at the cabaret/benefit.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep15\" style=\"text-align:center\">15</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Blow\"</td><td style=\"text-align:center\"><span>Jennie Livingston</span></td><td style=\"text-align:center\">Janet Mock</td><td style=\"text-align:center\">July 30, 2019</td><td id=\"pc2WBF07\" rowspan=\"1\" style=\"text-align:center\">2WBF07</td><td style=\"text-align:center\">0.405</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #7C0046\">Pray Tell and Blanca realize they are now elders in the community, and challenge the young members of House Evangelista to organize an ACT UP action, inflating a <span>giant condom to wrap the house</span> of Frederica Norman, protesting her financial exploitation of Blanca and others. Angel and Papi drink and snort cocaine at an uptown party, causing Angel to arrive late and hungover to an important modeling job, where the photographer is revealed to be the fetishistic predator from the season opening (\"Acting Up\"). Ricky learns his HIV test was positive.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep16\" style=\"text-align:center\">16</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Revelations\"</td><td style=\"text-align:center\">Steven Canals</td><td style=\"text-align:center\">Steven Canals</td><td style=\"text-align:center\">August 6, 2019</td><td id=\"pc2WBF08\" rowspan=\"1\" style=\"text-align:center\">2WBF08</td><td style=\"text-align:center\">0.508</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #7C0046\">Ricky and Pray Tell, who have been growing closer as friends, become lovers. Damon graduates from the dance academy. At the graduation party back home, Damon confronts Angel and Pray Tell about their secret drug use and lying to Blanca, and informs Blanca, leading to a huge blow up Blanca and Pray Tell's relationship severely damaged. Realizing her fault and not wanting to undermine Blanca being a mother, Angel and Papi move out, and into an apartment in <span>The Village</span> that Papi found. Damon makes peace with Blanca and leaves to perform on a European tour for <span>Malcolm McLaren</span>. Blanca begins to feel <span>empty nest syndrome</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep17\" style=\"text-align:center\">17</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Life's a Beach\"</td><td style=\"text-align:center\">Gwyneth Horder-Payton</td><td style=\"text-align:center\">Janet Mock and Our Lady J</td><td style=\"text-align:center\">August 13, 2019</td><td id=\"pc2WBF09\" rowspan=\"1\" style=\"text-align:center\">2WBF09</td><td style=\"text-align:center\">0.547</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #7C0046\">Blanca's nail salon burns down.  Elektra, Blanca, Angel and Lulu take a girls trip to a fancy <span>Long Island</span> beach house owned by one of Elektra's clients. Blanca meets a man there and they have a romantic date on the beach. On the drive home to the city, Candy appears in spirit, singing along with them in the car.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep18\" style=\"text-align:center\">18</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"In My Heels\"</td><td style=\"text-align:center\">Janet Mock</td><td style=\"text-align:center\">Ryan Murphy &amp; Brad Falchuk &amp; Steven Canals</td><td style=\"text-align:center\">August 20, 2019</td><td id=\"pc2WBF10\" rowspan=\"1\" style=\"text-align:center\">2WBF10</td><td style=\"text-align:center\">0.536</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #7C0046\">Fast forward to May 1991, Blanca is running her nail salon inside her home. While visited by Pray Tell, Blanca becomes so sick that she must be hospitalized. Blanca and Pray Tell see on the news that Frederica Norman is responsible for <span>burning</span> Blanca's nail salon; Frederica is arrested for her crimes. Damon returns from Europe. Angel is outed as trans, and loses her Ford Modeling contract. During the Mother's Day Ball, Angel and Papi become engaged, and Angel secures a new modelling job overseas thanks to Papi becoming her manager. Angel is scared she will be outed again, but Papi has founded an agency based on truth and transparency – all the new clients know the truth about the models. Shortly afterwards, Angel is booked through Papi's new agency for a job in Berlin and they get engaged at the next ball. Followed by Blanca's lip sync win and Elektra's Mother of the Year coronation, Elektra takes Pray Tell's position as MC, and Pray Tell, Ricky and other male contestants walk in drag for the first time. At the end of the episode, after bidding Angel and Papi farewell, Blanca, now in a wheelchair, meets two homeless teenagers outside, Quincy and Chilly. She and Pray Tell take the new kids to dinner.</td></tr></tbody></table><h4>Season 3 (2021)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#2D4C5E;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#2D4C5E;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#2D4C5E;width:26%\">Title</th><th scope=\"col\" style=\"background:#2D4C5E;width:17%\">Directed by</th><th scope=\"col\" style=\"background:#2D4C5E;width:19%\">Written by</th><th scope=\"col\" style=\"background:#2D4C5E;width:13%\">Original air date</th><th scope=\"col\" style=\"background:#2D4C5E;width:6%\"><abbr title=\"Production\">Prod.</abbr><br>code</th><th scope=\"col\" style=\"background:#2D4C5E;width:9%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep19\" style=\"text-align:center\">19</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"On the Run\"</td><td style=\"text-align:center\"><span>Janet Mock</span></td><td style=\"text-align:center\"><span>Steven Canals</span> &amp; Janet Mock</td><td style=\"text-align:center\">May 2, 2021</td><td id=\"pc3WBF01\" rowspan=\"1\" style=\"text-align:center\">3WBF01</td><td style=\"text-align:center\">0.498</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #2D4C5E\"><p>The year is now 1994. Newly-elected New York mayor <span>Rudy Giuliani</span> has cracked down on sex work in the city, forcing Elektra to leave the Hellfire Club. Lemar has become the house father of the greedy, fame-hungry House of Khan. Blanca juggles working as a nurse's aide with dating Christopher, a doctor who works at the same hospital. Papi's talent agency is thriving, while Angel's modeling career has stagnated. The House of Evangelista, including Elektra and Lulu, is brought together by both the live coverage of <span class=\"mw-redirect\">O.J. Simpson's slow-speed chase</span> and by the death of Cubby after his battle with AIDS. These events encourage Blanca to reunite the House of Evangelista to walk at the Summer Solstice Ball, where they compete against the House of Khan and win.</p>Note: Prior to this episode, House of Wintour and House of Ferocity were disbanded at an unknown date. This is also <span>Ryan Jamaal Swain</span>'s last episode.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep20\" style=\"text-align:center\">20</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Intervention\"</td><td style=\"text-align:center\">Steven Canals</td><td style=\"text-align:center\">Steven Canals &amp; <span>Our Lady J</span></td><td style=\"text-align:center\">May 2, 2021</td><td id=\"pc3WBF02\" rowspan=\"1\" style=\"text-align:center\">3WBF02</td><td style=\"text-align:center\">0.370</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #2D4C5E\">Blanca stages an intervention when Pray Tell's alcoholism leads to expected consequences. Ricky leaves Pray Tell due to Pray Tell's alcoholism. Damon's alcoholism relapses, thus making him relocate to his cousin's place in South Carolina. Blanca nervously prepares to meet Christopher's parents, and his mother is not very friendly to her after their meeting. Pray Tell first refuses to go to rehab, but later relents. Elektra prevents Lulu from performing at the ball in order for her to be sober. Angel decides to clean up from her crack habit.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep21\" style=\"text-align:center\">21</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Trunk\"</td><td style=\"text-align:center\"><span>Tina Mabry</span></td><td style=\"text-align:center\">Janet Mock &amp; <span>Brad Falchuk</span></td><td style=\"text-align:center\">May 9, 2021</td><td id=\"pc3WBF03\" rowspan=\"1\" style=\"text-align:center\">3WBF03</td><td style=\"text-align:center\">0.394</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #2D4C5E\">Elektra, now running a legitimate <span>phone sex</span> business, is unjustly arrested by police in an effort to uncover and arrest any wealthy, high-status financiers of her company. Elektra asks Blanca to remove the trunk containing her client's remains (season 2 episode 3) from her closet before the police search her apartment and discover it; Blanca stores it in her flat with the help of Lil Papi and Ricky. Christopher comes over to Blanca's flat, but discovers the body and agrees to help dispose of it. A flashback to 1974 shows Elektra, working the piers at night before returning home in the morning, being thrown out of her mother's house, while a flashback to 1983 shows Elektra taking Cubby, Lemar and Angel into the House of Abundance, alongside her existing children, Blanca, Candy and Lulu.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep22\" style=\"text-align:center\">22</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Take Me To Church\"</td><td style=\"text-align:center\">Janet Mock</td><td style=\"text-align:center\">Janet Mock &amp; Steven Canals &amp; Brad Falchuk</td><td style=\"text-align:center\">May 16, 2021</td><td id=\"pc3WBF04\" rowspan=\"1\" style=\"text-align:center\">3WBF04</td><td style=\"text-align:center\">0.404</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #2D4C5E\">After receiving a terminal diagnosis of untreatable lymphoma, Pray Tell visits his hometown to inform his family and friends, whom he left 20 years ago. Pray Tell faces difficult reactions: his mother (guest star Anna Maria Horsford) laments that she knew he would contract AIDS when he came out to her; his Aunt Latrice (guest star Janet Hubert), now choir director at the local church, prays for his soul. Pray Tell's Aunt Jada (guest star Jackee Harry) promises to support him. Pray Tell encounters his former high school sweetheart Vernon Jackson (guest star Norm Lewis), who has now become a pastor and married Pray Tell's high school best friend Ebony (guest star Michelle Hurd), who knows that he is gay. Pray Tell is invited to dinner at their house, and Ebony confides that she finds their marriage difficult and painful. Vernon and Pray Tell go for a walk, where they kiss, and Vernon promises that he will leave his wife and family for him. At home, Pray Tell's mother expresses regret for having failed her son, and the two reconcile. After performing at church, Pray Tell reconciles with Aunt Jada, who gives him forms to ensure the power of attorney passes to her, promising that she will do everything she can to fulfill his last wishes. Leaving for New York alone, Pray Tell sees visions of his younger self on the sidewalk with Vernon.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep23\" style=\"text-align:center\">23</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Something Borrowed, Something Blue\"</td><td style=\"text-align:center\">Steven Canals</td><td style=\"text-align:center\">Brad Falchuk &amp; Steven Canals</td><td style=\"text-align:center\">May 23, 2021</td><td id=\"pc3WBF05\" rowspan=\"1\" style=\"text-align:center\">3WBF05</td><td style=\"text-align:center\">0.360</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #2D4C5E\">Elektra has franchised out her phone sex business with the help of the <span>American Mafia</span>, and has moved into an expensive high-rise apartment. Lil Papi and Angel decide on a small, intimate New Years' wedding date; however, Elektra decides to finance their wedding, turning it into a much larger, grander one, to Lil Papi's initial disapproval. Lil Papi discovers that he has a love child named Beto from a previous relationship. After being clocked and refused purchase by the transphobic owner of an expensive bridalwear shop, Elektra tasks her Mafia associates to mop it clean of dresses to send a message, before inviting all the ballroom girls to Angel's bachelorette party and giving them each a dress. Returning home from the bachelorette party, Lil Papi tells Angel about Beto, and that he wants him to live with them; distraught, Angel leaves.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep24\" style=\"text-align:center\">24</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Something Old, Something New\"</td><td style=\"text-align:center\">Janet Mock</td><td style=\"text-align:center\">Janet Mock</td><td style=\"text-align:center\">May 30, 2021</td><td id=\"pc3WBF06\" rowspan=\"1\" style=\"text-align:center\">3WBF06</td><td style=\"text-align:center\">0.430</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #2D4C5E\">Lil Papi begins looking after Beto, and concedes to Ricky that if he has to raise him as a single father, he will. Angel, now living separately, threatens to cancel the wedding, but is convinced to try and work through her feelings by Blanca. Angel visits her estranged father, whom she ran away from, but has been sending money to since their separation; she informs him that she is engaged, and attempts to reconcile with him, but is unable to. Angel realises that she still wants to be with Lil Papi, and returns, agreeing to live as a family with him and Beto. Before Angel and Papi get their marriage license, Angel's anxiety over her license goes through the roof, fearing that with her passport still showing the wrong gender, she will be clocked and refused; however, they secure their marriage license with no problem, and the wedding goes ahead seamlessly. Cubby and Candy also appear in this episode.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep25\" style=\"text-align:center\">25</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Series Finale (Part I)\"</td><td style=\"text-align:center\">Steven Canals</td><td style=\"text-align:center\"><span class=\"mw-redirect\">Ryan Murphy</span> &amp; Brad Falchuk &amp; Steven Canals &amp; Janet Mock &amp; Our Lady J</td><td style=\"text-align:center\">June 6, 2021</td><td id=\"pc3WBF07\" rowspan=\"1\" style=\"text-align:center\">3WBF07</td><td style=\"text-align:center\">0.530</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #2D4C5E\">Blanca is still working as a nurse's aide, and towards becoming a nurse, at the hospital. Pray Tell checks himself in without telling anyone, having received a diagnosis of pneumonia, and having been told that his immune system is too weak to fight it this time. Pray Tell reflects that Blanca has been positive for seven years and has never faced recurring health problems, where Pray Tell has faced pneumonia, growing blindness in one eye, and lymphoma; the two agree to finish his panel for the <span>AIDS Memorial Quilt</span> together. At the hospital, Blanca sees one of her HIV/AIDS patients improve significantly after getting on a drugs trial, and Christopher and Judy manage to get Blanca and Pray Tell a space on the trial, allowing Pray Tell to recover. Pray Tell and Ricky join a gay men's choir, where the surviving original three members dress in white, and the rest dress in black, symbolising those lost to HIV/AIDS. Later, when the trial announces that they are not letting any more people of colour onto the trial, ACT UP protest, getting the cost of the medications to go down. Pray Tell and Blanca perform \"<span>Ain't No Mountain High Enough</span>\" at the Winter Fundraiser Ball together. The day after the ball, Ricky discovers him dead in his flat; at dinner with the House of Evangelista, Ricky realises that Pray Tell had been giving him his trial medication, and not taking it himself.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep26\" style=\"text-align:center\">26</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Series Finale (Part II)\"</td><td style=\"text-align:center\">Steven Canals</td><td style=\"text-align:center\">Ryan Murphy &amp; Brad Falchuk &amp; Steven Canals &amp; Janet Mock &amp; Our Lady J</td><td style=\"text-align:center\">June 6, 2021</td><td id=\"pc3WBF07\" rowspan=\"1\" style=\"text-align:center\">3WBF07</td><td style=\"text-align:center\">0.485</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #2D4C5E\">Pray Tell's mother, Charlene, visits Blanca, thanking her for being a mother to him, and giving her both half of Pray Tell's ashes and some heart-shaped lockets to keep them in, per his last wishes. ACT UP decide to protest by dumping the ashes of loved ones who have died of HIV/AIDS on the lawn of the mayor. At Pray Tell's apartment, Blanca hands out the lockets and reads out what Pray Tell wrote about his extended ballroom family. Ricky performs \"<span>The Man I Love</span>\" with the gay men's choir, now all dressed in black. Flashing forward to 1998, Blanca celebrates both becoming a nurse and her four-year anniversary with Christopher. Blanca visits Judy on the fourth floor of the hospital – now a ward for mothers and babies – and the two reminisce. Working at St. Vincent's, Blanca gives a patient a diagnosis of HIV, and invites her to the next ball on Saturday. Blanca meets up with Elektra, Lulu and Angel for lunch; all have now become successful, and have careers in the categories – <span>runway model</span>, <span>businessperson</span> and <span>accountant</span> – that they used to walk, and during the brunch it's learned that Papi is successful, and Damon is living in <span>Chicago</span> with a man, and now has 3 dance studios. It's also learned that due to Pray Tell giving Ricky his <span>HIV</span> meds, the virus ravaged his body and as a result, he died due to complications.  After the brunch, it's shown that Blanca is looking after new house children. At the ball, Blanca is awarded Legendary status by Elektra. Accosted by another ball mother outside, Blanca is asked how it is possible to keep going without winning anything. Blanca responds that the reason to keep going is to support, and lift up the children of a house.</td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>On March 16, 2017, it was announced that FX had given the production a pilot order. The pilot was written by Ryan Murphy, Brad Falchuk, and Steven Canals all of whom were also set to executive produce alongside Nina Jacobson, Brad Simpson, and Sherry Marsh. Production companies involved with the pilot were slated to consist of include FX Productions and Fox21 Television Studios. In October 2018, it was reported that Leiomy Maldonado and Danielle Polanco would be choreographing the series' ball scenes and that Janet Mock and Our Lady J had joined the show's writing and producing staff.</p><p>On December 27, 2017, it was announced that FX had given the production a series for a first season consisting of eight episodes. On May 9, 2018, ahead of the series premiere, Murphy announced that he would be donating all of his profits from Pose to non-profit charitable organizations that work with LGBTQ+ people, including the Sylvia Rivera Law Project, the Transgender Legal Defense & Education Fund, and the Callen-Lorde Community Health Center. Murphy explained this decision saying, \"The thing that struck me in talking to so many of them, was how much they've struggled, how under attack they feel, how many of them find it difficult getting healthcare, and finding jobs. I just decided I need to do more than just making a show for this community. I want to reach out and help this community.\" On July 12, 2018, it was announced that the series had been renewed for a second season which premiered on June 11, 2019. On June 17, 2019, FX renewed the series for a third season. In March 2021, FX confirmed the third season would be its last. The final season premiered on May 2, 2021.</p><h4>Casting</h4><p>In March 2017, Ryan Murphy and his team began casting for the series. On October 25, 2017, it was announced that transgender actors Michaela Jaé Rodriguez, Indya Moore, Dominique Jackson, Hailie Sahar, and Angelica Ross and cisgender actors Ryan Jamaal Swain, Billy Porter and Dyllón Burnside had been cast in main roles. The series' production team claimed that they had assembled the largest transgender cast ever for a scripted series. The series was expected to include over 50 transgender characters total. On October 26, 2017, it was announced that Evan Peters, Kate Mara, James Van Der Beek, and Tatiana Maslany had also joined the main cast.</p><p>On December 27, 2017, it was reported that Maslany had exited the series following the redevelopment of her part into that of a 50-year-old African-American woman. The character was then recast with Charlayne Woodard assuming the role. On September 19, 2018, it was announced that Sandra Bernhard would reprise her role of Nurse Judy in season two as a series regular. On March 23, 2019, at PaleyFest, Ryan Murphy revealed that Patti LuPone would guest star in the second season.</p><h4>Filming</h4><p>Production for the pilot began in New York City in October 2017. The following episodes of the first season were expected to begin production in February 2018. Murphy directed the series' first two episodes and Mock directed the sixth, thus making her the first transgender woman of color to write and direct any episode of television. On March 14, 2020, production on the third season was suspended due to the COVID-19 health crisis. The third and final season's filming wrapped on March 20, 2021.</p><br/><h3>Release</h3><h4>Marketing</h4><p>On April 12, 2018, FX released the first teaser trailer for the series. It was also announced that the series was set to premiere on June 3, 2018. On May 3, 2018, the first official trailer was released.</p><h4>Premiere</h4><p>On May 17, 2018, the series held its world premiere at the Hammerstein Ballroom in Manhattan. On July 23, 2018, Dyllón Burnside emceed a benefit concert, duetting with co-stars Billy Porter and Ryan Jamaal Swain to celebrate the season one finale, and raise money for GLSEN. During the event, a conversation was held between Burnside and former Vibe editor-in-chief Emil Wilbekin, where Burnside discussed his coming out story and spoke about the importance of safe spaces for LGBTQ people. Later on in the evening, Porter sang from his latest album and Michaela Jaé Rodriguez sang \"Waving Through a Window\" from Dear Evan Hansen.</p><p>In March 2019, the series was part of the Paley Center for Media's annual Paleyfest LA at the Dolby Theatre in Los Angeles, California.</p><p>Pose premiered in the United Kingdom on March 21, 2019, on BBC Two. Season 2 premiered on October 26, 2019, and Season 3 on August 8, 2021. All full series made available on BBC iPlayer straight after each series' premiere.</p><br/><h3>Influences</h3><p>While a work of creative fiction, the series is \"heavily inspired by\" Jennie Livingston's 1990 documentary, Paris Is Burning. Livingston also served as a consulting producer on the show. Several of the houses and characters were based on, or named after, real people, and several people featured in the documentary also made cameos in the series, such as Jose Gutierez Xtravaganza, an icon of the voguing scene, who plays a judge throughout the first series, and Sol Pendavis Williams, of the House of Pendavis. Creators and producers of the series, Murphy, Canals, and writer/producer Janet Mock all considered Paris Is Burning \"a text that helped inform not only the show, but also their identities when they first saw it.\"</p><blockquote>Pose also expands on one of Paris Is Burning's subtler themes. At various points in the film, Livingston contrasts the drag performers with ordinary, affluent New Yorkers, walking down busy Manhattan sidewalks. It's often hard to tell which of these two groups is more \"real\", which of them are fashion models or Wall Street power players and which are simply costumed as such. Pose elaborates on those subtle distinctions with a subplot involving Stan (Evan Peters), a rising star in the Trump organization with an obnoxious boss (James Van Der Beek), a pretty wife (Kate Mara), and a secret relationship with Angel (Indya Moore), a trans woman. The show aims to capture some of the diversity of New York in the '80s, while also emphasizing the idea that, whether rich or poor, everyone in the city is pretending, in one way or another.</blockquote><br/><h3>Reception</h3><h4>Critical response</h4><h4>Season 1</h4><p>On the review aggregation website Rotten Tomatoes, the first season holds a 96% approval rating with an average rating of 8.3/10 based on 84 reviews. The website's critical consensus reads, \"Charged with energy, poise, and confidence, Pose pirouettes between artistic opulence and deliciously soapy drama to create a fresh new addition to Ryan Murphy's lexicon.\" Metacritic, which uses a weighted average, assigned the first season a score of 75 out of 100 based on 27 critics, indicating \"generally favorable reviews\".</p><p>In a positive review, Vanity Fair's Richard Lawson was effusive, describing the series as \"an engaging portrait of dark days met with merriment. Pain and perseverance are sewn together to create something humble yet fabulous—and, it should be shouted over all the show's loud and glorious clamor, very much long overdue.\" In a similarly favorable critique, Vulture's Matt Zoller Seitz praised the series' ambition, aesthetic, and spotlight on minorities saying, \"it shows American audiences a world that has never been visualized on television at this length and at such an obviously grand budget level. The camera swings and swoops, glides and tumbles as in a Scorsese epic like Gangs of New York; in both the outdoor street scenes and indoor crowd scenes, it's obvious that FX has spared no expense to get the clothes, the cars, the streets, the business signs, and even the distinctive yellow-brown glow of streetlights correct.\" In a more mixed assessment, Newsday's gave the series two-and-a-half stars out of four and described it far less approvingly saying, \"good intentions don't always lead to good TV, and a couple episodes in, that appears to be the case with Pose. This certainly isn't bad TV—Murphy isn't about to leave his longtime home with a turkey—but it's often bland TV, and oddly enough, stock TV.\" In a negative evaluation, Slate's Willa Paskin was outright dismissive saying, \"It's a TV show from one of the most canny creators working today, yet as a viewing experience it can feel like an object lesson.\" She continued on specifically criticizing the show's character development saying, \"So many of the people on Pose are strong women, trans paragons, and this comes at the expense of them being recognizably flawed human beings.\"</p><h4>Season 2</h4><p>On Rotten Tomatoes, the second season holds a 98% approval rating with an average rating of 8.40/10 based on 41 reviews. The website's critical consensus reads, \"A delightful, delicate dance of light and dark, Pose's second season achieves a striking balance between the grittiness of reality and the glamour of the runway and shines even brighter.\" On Metacritic, season 2 holds a score of 79 out of 100 based on 14 critics, indicating \"generally favorable reviews.\"</p><h4>Season 3</h4><p>On Rotten Tomatoes, the third season holds a 100% approval rating with an average rating of 7.70/10 based on 29 reviews. The website's critical consensus reads, \"Though it's entirely too short, Pose's final season is a joyously entertaining celebration of life that is not to be missed.\" On Metacritic, season 3 holds a score of 76 out of 100 based on 11 critics, indicating \"generally favorable reviews.\"</p><h4>Ratings</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per season of <i>Pose</i></span></caption><tbody><tr><th scope=\"col\" rowspan=\"2\">Season</th><th scope=\"col\" rowspan=\"2\">Timeslot (<span>ET</span>)</th><th scope=\"col\" rowspan=\"2\">Episodes</th><th scope=\"col\" colspan=\"2\">First aired</th><th scope=\"col\" colspan=\"2\">Last aired</th><th scope=\"col\" rowspan=\"2\"><abbr title=\"Average\">Avg.</abbr> viewers<br>(millions)</th><th scope=\"col\" rowspan=\"2\">18–49<br>rank</th><th scope=\"col\" rowspan=\"2\"><abbr title=\"Average\">Avg.</abbr> 18–49<br>rating</th></tr><tr><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(millions)</th><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>1</span></th><td rowspan=\"1\">Sunday 9:00 pm</td><td>8</td><td>June 3, 2018</td><td>0.688</td><td>July 22, 2018</td><td>0.781</td><td rowspan=\"1\">0.645</td><td rowspan=\"1\"><small><span style=\"color: #2C2C2C\">TBD</span></small></td><td rowspan=\"1\">0.25</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>2</span></th><td rowspan=\"1\">Tuesday 10:00 pm</td><td>10</td><td>June 11, 2019</td><td>0.672</td><td>August 20, 2019</td><td>0.536</td><td rowspan=\"1\">0.541</td><td rowspan=\"1\"><small><span style=\"color: #2C2C2C\">TBD</span></small></td><td rowspan=\"1\">0.19</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>3</span></th><td rowspan=\"1\">Sunday 10:00 pm</td><td>8</td><td>May 2, 2021</td><td>0.498</td><td>June 6, 2021</td><td>0.485</td><td rowspan=\"1\"><small><span style=\"color: #2C2C2C\">TBD</span></small></td><td rowspan=\"1\"><small><span style=\"color: #2C2C2C\">TBD</span></small></td><td rowspan=\"1\"><small><span style=\"color: #2C2C2C\">TBD</span></small></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\" style=\"text-align: left;\"><div class=\"mbox-text-span\">Graphs are temporarily unavailable due to technical issues.</div></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" rowspan=\"2\" style=\"padding-left:.8em;padding-right:.8em\">Season</th><th colspan=\"10\" style=\"padding-left:.8em;padding-right:.8em\">Episode number</th><th scope=\"col\" rowspan=\"2\" style=\"padding-left:.8em;padding-right:.8em\">Average</th></tr><tr><th scope=\"col\">1</th><th scope=\"col\">2</th><th scope=\"col\">3</th><th scope=\"col\">4</th><th scope=\"col\">5</th><th scope=\"col\">6</th><th scope=\"col\">7</th><th scope=\"col\">8</th><th scope=\"col\">9</th><th scope=\"col\">10</th></tr><tr><th style=\"background-color:#EFAFD8;width:10px\"></th><th scope=\"row\">1</th><td style=\"width:35px\">688</td><td style=\"width:35px\">548</td><td style=\"width:35px\">561</td><td style=\"width:35px\">719</td><td style=\"width:35px\">582</td><td style=\"width:35px\">594</td><td style=\"width:35px\">689</td><td style=\"width:35px\">781</td><td data-sort-value=\"\" class=\"table-na\" colspan=\"2\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\">–</td><td>645</td></tr><tr><th style=\"background-color:#7C0046;width:10px\"></th><th scope=\"row\">2</th><td style=\"width:35px\">672</td><td style=\"width:35px\">567</td><td style=\"width:35px\">589</td><td style=\"width:35px\">580</td><td style=\"width:35px\">497</td><td style=\"width:35px\">505</td><td style=\"width:35px\">405</td><td style=\"width:35px\">508</td><td style=\"width:35px\">547</td><td style=\"width:35px\">536</td><td>541</td></tr><tr><th style=\"background-color:#2D4C5E;width:10px\"></th><th scope=\"row\">3</th><td style=\"width:35px\">498</td><td style=\"width:35px\">370</td><td style=\"width:35px\">394</td><td style=\"width:35px\">404</td><td style=\"width:35px\">360</td><td style=\"width:35px\">430</td><td style=\"width:35px\">530</td><td style=\"width:35px\">485</td><td data-sort-value=\"\" class=\"table-na\" colspan=\"2\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\">–</td><td data-sort-value=\"\" class=\"table-na\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\">TBD</td></tr></tbody></table><h4>Season 1</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per episode of <i>Pose</i></span></caption><tbody><tr><th scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\">Title</th><th scope=\"col\">Air date</th><th scope=\"col\" data-sort-type=\"number\"><span class=\"mw-redirect\">Rating</span><br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">DVR<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">DVR viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">Total<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Total viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\">1</th><td style=\"text-align:left\">\"<span>Pilot</span>\"</td><td style=\"text-align:left\">June 3, 2018</td><td>0.2</td><td>0.688</td><td>0.2</td><td>0.444</td><td>0.4</td><td>1.132</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">2</th><td style=\"text-align:left\">\"<span>Access</span>\"</td><td style=\"text-align:left\">June 10, 2018</td><td>0.2</td><td>0.548</td><td>0.1</td><td>0.338</td><td>0.3</td><td>0.887</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">3</th><td style=\"text-align:left\">\"<span>Giving and Receiving</span>\"</td><td style=\"text-align:left\">June 17, 2018</td><td>0.2</td><td>0.561</td><td>0.2</td><td>0.358</td><td>0.4</td><td>0.919</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">4</th><td style=\"text-align:left\">\"<span>The Fever</span>\"</td><td style=\"text-align:left\">June 24, 2018</td><td>0.3</td><td>0.719</td><td>0.2</td><td>0.438</td><td>0.5</td><td>1.158</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">5</th><td style=\"text-align:left\">\"<span>Mother's Day</span>\"</td><td style=\"text-align:left\">July 1, 2018</td><td>0.3</td><td>0.582</td><td>0.1</td><td>0.390</td><td>0.4</td><td>0.973</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">6</th><td style=\"text-align:left\">\"<span>Love Is the Message</span>\"</td><td style=\"text-align:left\">July 8, 2018</td><td>0.3</td><td>0.594</td><td>0.2</td><td>0.436</td><td>0.5</td><td>1.031</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">7</th><td style=\"text-align:left\">\"<span>Pink Slip</span>\"</td><td style=\"text-align:left\">July 15, 2018</td><td>0.3</td><td>0.689</td><td>0.1</td><td>0.372</td><td>0.4</td><td>1.062</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">8</th><td style=\"text-align:left\">\"<span>Mother of the Year</span>\"</td><td style=\"text-align:left\">July 22, 2018</td><td>0.3</td><td>0.781</td><td>0.1</td><td>0.371</td><td>0.4</td><td>1.153</td></tr></tbody></table><h4>Season 2</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per episode of <i>Pose</i></span></caption><tbody><tr><th scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\">Title</th><th scope=\"col\">Air date</th><th scope=\"col\" data-sort-type=\"number\"><span class=\"mw-redirect\">Rating</span><br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">DVR<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">DVR viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">Total<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Total viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\">1</th><td style=\"text-align:left\">\"<span>Acting Up</span>\"</td><td style=\"text-align:left\">June 11, 2019</td><td>0.3</td><td>0.672</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>0.653</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>1.328</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">2</th><td style=\"text-align:left\">\"<span>Worth It</span>\"</td><td style=\"text-align:left\">June 18, 2019</td><td>0.2</td><td>0.567</td><td>0.2</td><td>0.640</td><td>0.4</td><td>1.208</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">3</th><td style=\"text-align:left\">\"<span>Butterfly/Cocoon</span>\"</td><td style=\"text-align:left\">June 25, 2019</td><td>0.2</td><td>0.589</td><td>0.2</td><td>0.573</td><td>0.4</td><td>1.163</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">4</th><td style=\"text-align:left\">\"<span>Never Knew Love Like This Before</span>\"</td><td style=\"text-align:left\">July 9, 2019</td><td>0.2</td><td>0.580</td><td>0.2</td><td>0.686</td><td>0.4</td><td>1.268</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">5</th><td style=\"text-align:left\">\"<span>What Would Candy Do?</span>\"</td><td style=\"text-align:left\">July 16, 2019</td><td>0.1</td><td>0.497</td><td>0.3</td><td>0.596</td><td>0.4</td><td>1.094</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">6</th><td style=\"text-align:left\">\"<span>Love's In Need Of Love Today</span>\"</td><td style=\"text-align:left\">July 23, 2019</td><td>0.2</td><td>0.505</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>0.588</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>1.095</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">7</th><td style=\"text-align:left\">\"<span>Blow</span>\"</td><td style=\"text-align:left\">July 30, 2019</td><td>0.2</td><td>0.405</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>0.617</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>1.023</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">8</th><td style=\"text-align:left\">\"<span>Revelations</span>\"</td><td style=\"text-align:left\">August 6, 2019</td><td>0.2</td><td>0.508</td><td>0.2</td><td>0.540</td><td>0.4</td><td>1.051</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">9</th><td style=\"text-align:left\">\"<span>Life's a Beach</span>\"</td><td style=\"text-align:left\">August 13, 2019</td><td>0.2</td><td>0.547</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>0.553</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>1.102</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">10</th><td style=\"text-align:left\">\"<span>In My Heels</span>\"</td><td style=\"text-align:left\">August 20, 2019</td><td>0.2</td><td>0.536</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr></tbody></table><h4>Season 3</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per episode of <i>Pose</i></span></caption><tbody><tr><th scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\">Title</th><th scope=\"col\">Air date</th><th scope=\"col\" data-sort-type=\"number\"><span class=\"mw-redirect\">Rating</span><br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">DVR<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">DVR viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">Total<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Total viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\">1</th><td style=\"text-align:left\">\"<span>On the Run</span>\"</td><td style=\"text-align:left\">May 2, 2021</td><td>0.1</td><td>0.498</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">2</th><td style=\"text-align:left\">\"<span>Intervention</span>\"</td><td style=\"text-align:left\">May 2, 2021</td><td>0.1</td><td>0.370</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">3</th><td style=\"text-align:left\">\"<span>The Trunk</span>\"</td><td style=\"text-align:left\">May 9, 2021</td><td>0.1</td><td>0.394</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">4</th><td style=\"text-align:left\">\"<span>Take Me To Church</span>\"</td><td style=\"text-align:left\">May 16, 2021</td><td>0.1</td><td>0.404</td><td>0.1</td><td>0.399</td><td>0.3</td><td>0.803</td></tr></tbody></table><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Year</th><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Nominee(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><td align=\"center\" rowspan=\"2\">2018</td><td align=\"left\"><span>Gotham Independent Film Awards</span></td><td>Breakthrough Series – Long Form</td><td><i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"left\"><span class=\"mw-redirect\">American Film Institute Awards</span></td><td>Top 10 TV Programs of the Year</td><td><i>Pose</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"31\">2019</td><td align=\"left\" rowspan=\"2\"><span>Golden Globe Awards</span></td><td><span>Best Television Series – Drama</span></td><td><i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td><span>Best Actor – Television Series Drama</span></td><td><span>Billy Porter</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"left\" rowspan=\"4\"><span>Dorian Awards</span></td><td>TV Drama of the Year</td><td><i>Pose</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"4\"><br></td></tr><tr><td>TV Performance of the Year — Actor</td><td>Billy Porter</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>LGBTQ TV Show of the Year</td><td><i>Pose</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>TV Musical Performance of the Year</td><td>Billy Porter, <span>Michaela Jaé Rodriguez</span> and <span>Our Lady J</span> <small>(performing \"Home\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"left\" rowspan=\"2\"><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td><span>Best Drama Series</span></td><td><i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td><span>Best Actor in a Drama Series</span></td><td>Billy Porter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"left\"><span>Writers Guild of America Awards</span></td><td><span>Television: New Series</span></td><td style=\"max-width: 18em;\"><span>Steven Canals</span>, <span>Brad Falchuk</span>, Todd Kubrak, <span>Janet Mock</span>, <span class=\"mw-redirect\">Ryan Murphy</span> and Our Lady J</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"left\"><span>GLAAD Media Awards</span></td><td><span>Outstanding Drama Series</span></td><td><i>Pose</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"left\"><span>Peabody Awards</span></td><td>Entertainment honoree</td><td><i>Pose</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Television Academy Honors</span></td><td>Outstanding Programs and Storytellers Advancing Social Change Through Television</td><td><i>Pose</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>MTV Movie &amp; TV Awards</span></td><td>Breakthrough Performance</td><td>Michaela Jaé Rodriguez</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"left\" rowspan=\"4\"><span>TCA Awards</span></td><td><span>Program of the Year</span></td><td rowspan=\"3\"><i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"4\"></td></tr><tr><td><span>Outstanding New Program</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Achievement in Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Individual Achievement in Drama</span></td><td>Billy Porter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"7\">Gold Derby Awards</td><td>Best Drama Series</td><td><i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"7\"></td></tr><tr><td rowspan=\"2\">Best Drama Episode</td><td>\"Love Is the Message\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>\"Mother of the Year\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Drama Actor</td><td>Billy Porter</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Drama Actress</td><td>Michaela Jaé Rodriguez</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Drama Guest Actor</td><td><span>Christopher Meloni</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Ensemble</td><td>The cast of <i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"left\" rowspan=\"2\"><span>Primetime Emmy Awards</span></td><td><span>Outstanding Drama Series</span></td><td>Ryan Murphy, Brad Falchuk, <span>Nina Jacobson</span>, <span>Brad Simpson</span>, Alexis Martin Woodall, Sherry Marsh, Steven Canals, <span>Silas Howard</span>, Janet Mock, Our Lady J, <span>Lou Eyrich</span> and Erica Kay</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"7\"><br></td></tr><tr><td><span>Outstanding Lead Actor in a Drama Series</span></td><td>Billy Porter <small>(for \"Love Is the Message\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"left\" rowspan=\"5\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Casting for a Drama Series</span></td><td>Alexa L. Fogel</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Hairstyling for a Single-Camera Series</span></td><td>Chris Clark, Barry Lee Moe, Jameson Eaton, Mia Neal, Tim Harvey and Sabana Majeed <small>(for \"<span>Pilot</span>\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Makeup for a Single-Camera Series</span></td><td>Sherri Laurence, Nicky Pattison Illum, Chris Milone, Deja Smith, Lucy O'Reilly and Andrew Sotomayor <small>(for \"<span>Pilot</span>\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Period Costumes</span></td><td>Lou Eyrich, Analucia Mcgorty, Amy Ritchings and Kevin Ritter <small>(for \"<span>Pilot</span>\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Short Form Nonfiction or Reality Series</span></td><td><i>Pose: Identity, Family Community (Inside Look)</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\" rowspan=\"23\">2020</td><td align=\"left\"><span>Golden Globe Awards</span></td><td>Best Actor – Television Series Drama</td><td rowspan=\"2\">Billy Porter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"left\"><span>NAACP Image Awards</span></td><td>Outstanding Actor in a Drama Series</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"left\" rowspan=\"3\"><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td>Best Drama Series</td><td><i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td>Best Actor in a Drama Series</td><td>Billy Porter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress in a Drama Series</span></td><td>Michaela Jaé Rodriguez</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"left\"><span>Make-Up Artists and Hair Stylists Guilds</span></td><td>Television Series, Mini-Series or New Media – Best Period and/or Character Hair Styling</td><td>Barry Lee Moe, Timothy Harvey and Sabana Majeed</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"left\"><span>Casting Society of America</span></td><td>Television Pilot &amp; First Season – Drama</td><td>Alexa L. Fogel, Kathryn Zamora-Benson and Caitlin D. Jones</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"left\"><span>GLAAD Media Awards</span></td><td><span>Outstanding Drama Series</span></td><td><i>Pose</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td align=\"left\" rowspan=\"4\"><span>Dorian Awards</span></td><td>TV Drama of the Year</td><td><i>Pose</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"4\"></td></tr><tr><td>TV Performance of the Year — Actress</td><td>Michaela Jaé Rodriguez</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>TV Performance of the Year — Actor</td><td>Billy Porter</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>LGBTQ TV Show of the Year</td><td><i>Pose</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>TCA Awards</span></td><td>Outstanding Achievement in Drama</td><td><i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"left\"><span>Primetime Emmy Awards</span></td><td>Outstanding Lead Actor in a Drama Series</td><td>Billy Porter <small>(for \"Love's in Need of Love Today\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"6\"><br></td></tr><tr><td align=\"left\" rowspan=\"5\"><span>Primetime Creative Arts Emmy Awards</span></td><td>Outstanding Period Costumes</td><td>Analucia McGorty, Nicky Smith, Alexa DeFazio and Linda Giammarese <small>(for \"Acting Up\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Period and/or Character Hairstyling</td><td>Barry Lee Moe, Timothy Harvey, Sabana Majeed, Liliana Meyrick, Lisa Thomas, Greg Bazemore, Jessie Mojica and Charlene Belmond <small>(for \"Worth It\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Period and/or Character Makeup (Non-Prosthetic)</td><td>Sherri Berman Laurence, Nicky Pattison Illum, Chris Milone, Deja Smith and Jessica Padilla <small>(for \"Acting Up\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Prosthetic Makeup for a Series, Limited Series, Movie or Special</span></td><td>David Presto, Greg Pikulski, Brett Schmidt, Lisa Forst and Keith Palmer <small>(for \"Love's in Need of Love Today\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Short Form Nonfiction or Reality Series</td><td><i>Pose: Identity, Family, Community</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"left\" rowspan=\"4\"><span>Black Reel Television Awards</span></td><td>Outstanding Drama Series</td><td><i>Pose</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"4\"></td></tr><tr><td><span>Outstanding Actor, Drama Series</span></td><td>Billy Porter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Directing, Drama Series</td><td>Janet Mock <small>(for \"In My Heels\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Writing, Drama Series</td><td>Janet Mock and Ryan Murphy <small>(for \"Love Like This Before\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"21\" align=\"center\">2021</td><td rowspan=\"6\"><span>Hollywood Critics Association TV Awards</span></td><td>Best Cable Series, Drama</td><td><i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"6\" align=\"center\"></td></tr><tr><td>Best Actor in a Broadcast Network or Cable Series, Drama</td><td>Billy Porter</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actress in a Broadcast Network or Cable Series, Drama</td><td>Michaela Jaé Rodriguez</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Supporting Actor in a Broadcast Network or Cable Series, Drama</td><td>Jason Rodriguez</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Best Supporting Actress in a Broadcast Network or Cable Series, Drama</td><td><span>Dominique Jackson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Indya Moore</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>TCA Awards</span></td><td><span>Outstanding Achievement in Drama</span></td><td><i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" align=\"center\"></td></tr><tr><td><span>Individual Achievement in Drama</span></td><td>Michaela Jaé Rodriguez</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"left\" rowspan=\"3\"><span>Black Reel Television Awards</span></td><td><span>Outstanding Actor, Drama Series</span></td><td>Billy Porter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td>Outstanding Directing, Drama Series</td><td>Tina Mabry <small>(for \"The Trunk\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Music</td><td><span>Mac Quayle</span>, Amanda Krieg Thomas, Alexis Martin Woodall and Ryan Murphy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\"><span>Primetime Emmy Awards</span></td><td><span>Outstanding Drama Series</span></td><td>Ryan Murphy, Brad Falchuk, Nina Jacobson, Brad Simpson, Alexis Martin Woodall, Sherry Marsh, Steven Canals, Janet Mock, Our Lady J, Tanase Popa, Lou Eyrich, Jeff Dickerson, Todd Nenninger and Kip Davis Myers</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"5\" style=\"text-align:center;\"></td></tr><tr><td><span>Outstanding Lead Actor in a Drama Series</span></td><td>Billy Porter <span style=\"font-size:85%;\">(for \"Take Me To Church\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Lead Actress in a Drama Series</span></td><td>Michaela Jaé Rodriguez <span style=\"font-size:85%;\">(for \"Series Finale\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Directing for a Drama Series</span></td><td>Steven Canals <span style=\"font-size:85%;\">(for \"Series Finale\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Writing for a Drama Series</span></td><td>Ryan Murphy, Brad Falchuk, Steven Canals, Janet Mock and Our Lady J <span style=\"font-size:85%;\">(for \"Series Finale\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Contemporary Costumes</span></td><td>Analucia McGorty, Michelle Roy and Linda Giammarese <span style=\"font-size:85%;\">(for \"Series Finale\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"5\"></td></tr><tr><td><span class=\"mw-redirect\">Outstanding Contemporary Hairstyling</span></td><td>Barry Lee Moe, Timothy Harvey, Greg Bazemore, Tene Wilder, Lisa Thomas and Rob Harmon <span style=\"font-size:85%;\">(for \"Series Finale\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Contemporary Makeup (Non-Prosthetic)</span></td><td>Sherri Berman Laurence, Nicky Pattison Illum, Charles Zambrano, Shaun Thomas Gibson, Jessica Padilla and Jennifer Suarez <span style=\"font-size:85%;\">(for \"Series Finale\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Prosthetic Makeup</span></td><td>Thomas Denier Jr. <span style=\"font-size:85%;\">(for \"On the Run\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Short Form Nonfiction or Reality Series</td><td><i>Pose: Identity, Family, Community</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"9\">2022</td><td rowspan=\"3\"><span>Golden Globe Awards</span></td><td><span>Best Television Series – Drama</span></td><td><i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" style=\"text-align:center;\"></td></tr><tr><td><span>Best Actor – Television Series Drama</span></td><td>Billy Porter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress – Television Series Drama</span></td><td>Michaela Jae Rodriguez</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Make-Up Artists and Hair Stylists Guild Awards</span></td><td>Best Period and/or Character Make-Up</td><td>Sherri Berman Laurence, Nicky Pattison Illum, Charles Zambrano, Jai Williams</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td>Best Hair Styling</td><td>Joe Matke, Genyii Scott</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>NAACP Image Awards</span></td><td><span>Outstanding Drama Series</span></td><td><i>Pose</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" style=\"text-align:center;\"></td></tr><tr><td><span>Outstanding Actor in a Drama Series</span></td><td>Billy Porter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Writing in a Drama Series</span></td><td>Steven Canals, Janet Mock, Our Lady J, Brad Falchuk, Ryan Murphy <small>(for \"Series Finale\") </small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>GLAAD Media Awards</span></td><td><span>Outstanding Drama Series</span></td><td><i>Pose</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}