{
  "imDbId": "tt7920978",
  "title": "Persona",
  "fullTitle": "Persona (TV Series 2018–2018)",
  "type": "TVSeries",
  "year": "2018",
  "items": [
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw4105371",
      "warningSpoilers": false,
      "date": "26 March 2018",
      "rate": "10",
      "helpful": "200 out of 229 found this helpful.",
      "title": "I think this series is top of among the Turkish series.",
      "content": "After Fi, I started with a low expectation and continued with admiration. Hakan Günday and Azra Kohen are not comparable to each other. There is no need to look for flaws in Sahsiyet. Thanks to Puhu TV, quality in the Turkish series sector has risen so much. Sahsiyet's story is a bit like Breaking Bad, a bit of a Dexter mix, much more different and much more intimate.Sahsiyet's greatest trump card; Behind the screen are two successful names such as Hakan Gunday and Onur Saylak. Hakan Gunday, one of the greatest writers that Turkish literature has recently released, writes the screenplay of Sahsiyet. The scenarios in each section are overly pleasing. Those who know their books, I am sure they felt this.The second biggest trump card in the series is the Haluk Bilginer factor. As for the Cansu Dere... Everyone has a prejudice against her. But I do not think it's bad. I did not see an exaggeration. Exceptionally lean, understated, with a moderate performance on display, without too much trouble. Only the character Nevra, a little too American. The Turkish police is like a Behzat Ç. Police office looks like the American Police Department in Sahsiyet. It's a very successful mini-series. I wish it was a few seasons. 10/10"
    },
    {
      "username": "gk303007",
      "userUrl": "https://www.imdb.com/user/ur102935740",
      "reviewLink": "https://www.imdb.com/review/rw6825933",
      "warningSpoilers": false,
      "date": "18 April 2021",
      "rate": "9",
      "helpful": "24 out of 25 found this helpful.",
      "title": "Not unique, but definitely different",
      "content": "Frankly, it took for me like ages to get past the first episode. But then, I increased pace and completed the entire season in 2 days; 2 days because i needed some sleep so as to grasp and catch hold of the sequences.Sahsiyet gets my applause. It has well deserved cinematography, appeal, timing, and pace. It is slow at times, and yet thoughtful and decisive. Bravo its creators, director, and actors.The main lead, Agah, is impressive and quirky. Really, his timings at times made me into thinking like he was really suffering with Alzihmers. How well executed. The other actors also did a great job.Above all, the last two episodes had a dreadful atmosphere, and i think, that was something which sums up to all the reasons the firsts ten episodes left an impression on me; and definitely the other audiences who watched this show. Unsettling, nervebreaking and tear jerkers. Maybe through a fictional way, the creators wanted to showcase the brutal reality of our \"world\".Don't miss this if you love mystery, thrill, and an impeccable creativity."
    },
    {
      "username": "AkKrock",
      "userUrl": "https://www.imdb.com/user/ur14816089",
      "reviewLink": "https://www.imdb.com/review/rw4662157",
      "warningSpoilers": false,
      "date": "16 February 2019",
      "rate": "10",
      "helpful": "95 out of 109 found this helpful.",
      "title": "One of the best",
      "content": "One of the best crime series that ever been made. You need full focus, no riddles just go with the flow."
    },
    {
      "username": "wladimirgrozni",
      "userUrl": "https://www.imdb.com/user/ur79269641",
      "reviewLink": "https://www.imdb.com/review/rw5039461",
      "warningSpoilers": false,
      "date": "4 August 2019",
      "rate": "9",
      "helpful": "169 out of 183 found this helpful.",
      "title": "NIce job...",
      "content": "How I was wrong about Turkish production. Its just because my wife consume some bunch of stupid soap stories from Turkey. Persona is heavy story about what is place and role of women in Tukrish society, even today, in 21st century and clearing conscience. Story is very good, plot is heavy, directing beutifuly, music nice, dialogs in some moments fantastic and with heavy social messages. It could be shorter for one or two episode but in overall its ok."
    },
    {
      "username": "princess_lilmisspiggy",
      "userUrl": "https://www.imdb.com/user/ur66288629",
      "reviewLink": "https://www.imdb.com/review/rw4119157",
      "warningSpoilers": true,
      "date": "6 April 2018",
      "rate": "10",
      "helpful": "82 out of 98 found this helpful.",
      "title": "Amazing !!!",
      "content": "I have not watched a Turkish serial in this quality for a long time. I watched while I stick to computer screen. Agah Beyoglu's attitude of \"not even hurting the ant\" learns that his life is going to change, on the contrary it is just a summary of human being's evolution. Nevertheless, she never gave up on her characteristic of valuing women because the people she killed were from people who had been violent to women. Is it really a single diagnosis of Alzheimer's causing murder? Why do we like Agah even though he is a serial killer?"
    },
    {
      "username": "muhammedali-42884",
      "userUrl": "https://www.imdb.com/user/ur69586172",
      "reviewLink": "https://www.imdb.com/review/rw4721165",
      "warningSpoilers": false,
      "date": "13 March 2019",
      "rate": "10",
      "helpful": "58 out of 68 found this helpful.",
      "title": "This job could be a revolution in turkish TV shows",
      "content": "I don't know why have I delayed this show to watch. A wonderful story, great cinematography, and a flow that does not get you bored. Some how, it keeps you awake. highly unpredictable. Beside this, the show focuses on some huge problems in turkish society, shamefull incedents and knowing them by a community that act like it is not happening. The show throws this up to us to face this mass so rigorously."
    },
    {
      "username": "ozanss55",
      "userUrl": "https://www.imdb.com/user/ur43607352",
      "reviewLink": "https://www.imdb.com/review/rw4180301",
      "warningSpoilers": false,
      "date": "27 May 2018",
      "rate": "10",
      "helpful": "52 out of 65 found this helpful.",
      "title": "Great tv show especially not-Turkish people should watch it",
      "content": "Master Haluk Bilginer and co-stars Cansu Dere and Metin Akguler and the others (especially young actors and actress did great job). Great cast, unique story and script. For me if you wanna watch fluent tv show dont stop just start to first episode you can find it on puhutv.com"
    },
    {
      "username": "blankyblank",
      "userUrl": "https://www.imdb.com/user/ur57668284",
      "reviewLink": "https://www.imdb.com/review/rw7419564",
      "warningSpoilers": false,
      "date": "7 October 2021",
      "rate": "9",
      "helpful": "9 out of 10 found this helpful.",
      "title": "It's truly a masterpiece, -1 star for some boring events in first couple of eps",
      "content": "As serial killer stories go - there's a psycho, presumably, on a killing spree with seemingly unrelated victims making local police station look like a circus. Pretty much everything is revealed to us viewers except how will they catch him and more importantly- why is he doing this. The \"why\" will keep you glued to your seat, make you assume and connect these men in your head. And once you think you've got the hangs of it the story turns upside down and leaves you speechless. Seriously, I did not expect *that* at all The finale is easily 11/10 but it takes a while to get thereAround first 5 or 6 episodes I found everyone who is not Agah very boring, almost a snooze fest which I have to go trough in order to understand what's going on. Especially Nevra, who seemed like your typical idealistic protagonist with added struggle of a woman in man's world. Agah carries that first half of the series, he's pretty funny guy actually. Follow him on his quest of revisiting old friends while Nevra slowly takes bigger and bigger role and very sharply becomes the focus of the story. Wait and see what all of those 53 similar looking men did to deserve the sticker on the forehead. You won't be dissappointed. I mean, you will detest them even if they're fictional but it makes a great story Avoid the spoilers like a plague and take the story as It goes. Warning -it's a lot. It's heavy, it's scary, it leaves a knot somewhere inside that hard to untangle. Because it is very much real. It certainly happened in the past, And it might as well be happening right now. And although this series ends on a positive note, justice isn't that common in the real world sadly."
    },
    {
      "username": "Hardbottle9",
      "userUrl": "https://www.imdb.com/user/ur58875691",
      "reviewLink": "https://www.imdb.com/review/rw4211298",
      "warningSpoilers": false,
      "date": "21 June 2018",
      "rate": "9",
      "helpful": "62 out of 72 found this helpful.",
      "title": "excellent",
      "content": "This is an excellent serie. This is rare to see Turkish TV series competing with foreign ones. I can say this is as good as famous american crime TV series. Without spoilers I can just say suprise connections were great. the only dissapointing thing for me was Zuhal and Deva. Their story was a bit weak. Anyway I highly recommend to watch this show; even for not Turkish people."
    },
    {
      "username": "jensimmons55",
      "userUrl": "https://www.imdb.com/user/ur27077243",
      "reviewLink": "https://www.imdb.com/review/rw5334193",
      "warningSpoilers": false,
      "date": "20 December 2019",
      "rate": "10",
      "helpful": "17 out of 20 found this helpful.",
      "title": "Really Outstanding",
      "content": "An absolute treat and fully deserving of the praise heaped upon it in other reviews. A wonderful cast with Haluk Bilginer giving a performance for the ages as the lead, but with many other terrific performances throughout the cast. A well-directed and nicely shot series with some very deep themes about Turkish society. It is a highly original and inventive story, which builds to a deeply affecting conclusion. This is ten hours well spent of anyone's time. Thoroughly recommended."
    },
    {
      "username": "senaoz",
      "userUrl": "https://www.imdb.com/user/ur68419936",
      "reviewLink": "https://www.imdb.com/review/rw4613747",
      "warningSpoilers": true,
      "date": "29 January 2019",
      "rate": "9",
      "helpful": "15 out of 19 found this helpful.",
      "title": "One of The Best Turkish Series",
      "content": "The story line of the series was beautifully directed. At least, this series tells us a meaningful and affective story besides other Turkish series.The last episode could be directed in three episodes separately. But the director tried to conclude everything in one episode. And also I didn't like the scene where Ates was killed by a bomb. This scene could be more touching and persuasive. These are the only negative critiques that I can say. Except these critiques, every part was totally flawless. I have finished this series in 3 days, it was so fast-moving. I definitely suggest everyone to watch it."
    },
    {
      "username": "Hawkeleven",
      "userUrl": "https://www.imdb.com/user/ur35686307",
      "reviewLink": "https://www.imdb.com/review/rw5272480",
      "warningSpoilers": false,
      "date": "22 November 2019",
      "rate": "8",
      "helpful": "37 out of 54 found this helpful.",
      "title": "I was expecting more",
      "content": "After seeing the 9.1 ranking of this series, I decided to watch it, and I like to watch it, very good main character and plot. The end is really great, but the majority of episodes until there needed more tension and breathtaking scenes, sometimes it gets boring, lacking emotional depth and touching strong subjects in a soft way. Overall it's worth watching but i get the feeling that the show had potential for way more."
    },
    {
      "username": "aannieukr",
      "userUrl": "https://www.imdb.com/user/ur127314081",
      "reviewLink": "https://www.imdb.com/review/rw6374795",
      "warningSpoilers": false,
      "date": "17 December 2020",
      "rate": "10",
      "helpful": "30 out of 33 found this helpful.",
      "title": "oh. my. fking. god!!!",
      "content": "I created an account here just to leave this comment! i would never expect series (especially turkish ones) to be SO great! everything is good! acting, shooting, TWIST PLOTS! i just applaud and bow to the whole crew! producers, directors, actors, everyone! thank you a lot to everyone who had created this! wow. wow! i am so amazed, guys! WOW!"
    },
    {
      "username": "aadarshstha-92565",
      "userUrl": "https://www.imdb.com/user/ur114433067",
      "reviewLink": "https://www.imdb.com/review/rw7102772",
      "warningSpoilers": false,
      "date": "8 July 2021",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "I MET A GIRL YESTERDAY. HER NAME WAS NEVRA ELMAS.",
      "content": "This is an excellent series. This is the first Turkish series I've ever watched and this is just awesome. From the very first episode till the last, it is one gripping series with the excellent writing. The writing in the series is phenomenal... one perfect crime drama with brilliant story, great screenplay, great direction, amazing cinematography, class soundtrack and top-notch acting by all the cast members. The framing, cuts end edits, the music, colours; all of them complement and support the setting beautifully. The performance from the whole cast is just flawless.In the whole series, I loved the character 'Nevra Elmas' perfectly portrayed by \"Cansu Dere\". She is one good person and a good cop; She's dedicated, intelligent, vulnerable and most importantly, a proper badass. Obviously, 'Agâh Beyoglu' portrayed by \"Haluk Bilginer\" is phenomenal. He is impeccable in his role. The regular cat and mouse chase is made really captivating with is brilliant writing. Sahsiyet is fresh and original. The motive of the series is just superb. The storytelling is brilliant and I really loved how the series unfolds the mystery that has been maintaining from the first episode. And the last episode does justice for the whole series. It is a highly original and inventive story, which builds to a deeply affecting conclusion.The series is filled with emotions and a fascinating storytelling from Hakan Günday directed by Onur Saylak. The character development is great, and very good reflection of the society. It has well deserved cinematography, appeal, timing, and pace. It is slow at times, and yet thoughtful and decisive. Above all, the last two episodes had a dreadful atmosphere, and i think, that was something which sums up to all the reasons the firsts ten episodes left an impression on me.9.5/10."
    },
    {
      "username": "cempecenek",
      "userUrl": "https://www.imdb.com/user/ur28402292",
      "reviewLink": "https://www.imdb.com/review/rw4160837",
      "warningSpoilers": false,
      "date": "10 May 2018",
      "rate": "9",
      "helpful": "28 out of 38 found this helpful.",
      "title": "Masterpiece",
      "content": "With unique story and character (Agah) one of the greatest TV show of Turkish television. Haluk Bilginer proved again he is one and only."
    },
    {
      "username": "bahare-mkhanloo",
      "userUrl": "https://www.imdb.com/user/ur45455863",
      "reviewLink": "https://www.imdb.com/review/rw4141270",
      "warningSpoilers": false,
      "date": "24 April 2018",
      "rate": "9",
      "helpful": "135 out of 161 found this helpful.",
      "title": "Best turkish series ever",
      "content": "\"Sahsiyet\" is the best Turkish series I've ever watched; it's awesome, exciting and very very different. I'm so excited to watch the next episodes."
    },
    {
      "username": "cagdas-21-315073",
      "userUrl": "https://www.imdb.com/user/ur53242067",
      "reviewLink": "https://www.imdb.com/review/rw5082544",
      "warningSpoilers": false,
      "date": "26 August 2019",
      "rate": "10",
      "helpful": "12 out of 17 found this helpful.",
      "title": "Excellent!!",
      "content": "Excellent show!! Especially Haluk Bilginer is phenomenal!!!"
    },
    {
      "username": "nurullahayberkbudak",
      "userUrl": "https://www.imdb.com/user/ur87438419",
      "reviewLink": "https://www.imdb.com/review/rw4130568",
      "warningSpoilers": false,
      "date": "15 April 2018",
      "rate": "10",
      "helpful": "100 out of 116 found this helpful.",
      "title": "Masterpiece",
      "content": "Another masterpiece from Haluk Bilginer and the full cast. Together they made one of the best TV series of Turkey. It is highly possible that this series become legend. I hope they continue like this."
    },
    {
      "username": "alliwantislifevetra",
      "userUrl": "https://www.imdb.com/user/ur64423701",
      "reviewLink": "https://www.imdb.com/review/rw4532241",
      "warningSpoilers": false,
      "date": "24 December 2018",
      "rate": "9",
      "helpful": "14 out of 21 found this helpful.",
      "title": "What I have been craved for a long time; Quality!",
      "content": "Just we were about to jump a level up with another series, Fi, Sahsiyet made all of us go multiple levels higher. For a quite a long time Turkish TV series have lacked good substance, good acting, music and originality. Until this one. Very very very congratulations for all who made this show for us. This is a show that gets our hopes up and proves we can do fantastic shows."
    },
    {
      "username": "nihal-asli",
      "userUrl": "https://www.imdb.com/user/ur40301903",
      "reviewLink": "https://www.imdb.com/review/rw4199385",
      "warningSpoilers": false,
      "date": "11 June 2018",
      "rate": "10",
      "helpful": "70 out of 88 found this helpful.",
      "title": "very proud of saying that Sahsiyet is very very fascinating Turkish TV serie!",
      "content": "Thanks to PuHu TV for the quality in the Turkish Series! It's getting a lot better. Not only actors and actresses but also director and soundtracks are very very successful. I am very proud of saying that Sahsiyet is a very very exciting and fascinating Turkish TV series, and I am looking forward to see next episodes.."
    },
    {
      "username": "elifnasitealaca",
      "userUrl": "https://www.imdb.com/user/ur106832942",
      "reviewLink": "https://www.imdb.com/review/rw5069691",
      "warningSpoilers": false,
      "date": "19 August 2019",
      "rate": "10",
      "helpful": "15 out of 21 found this helpful.",
      "title": "The absolute best",
      "content": "In my opinion this is the best Turkish serie you can watch, forget about those nonsense 2 hour long tv drama series. Although it could have a better ending, they nailed the characters, places and the beautiful views from Istanbul and ofcourse i can't forget about Haluk Bilginer a.k.a. Best Actor of Turkey"
    },
    {
      "username": "Moosty",
      "userUrl": "https://www.imdb.com/user/ur40054679",
      "reviewLink": "https://www.imdb.com/review/rw5310292",
      "warningSpoilers": false,
      "date": "9 December 2019",
      "rate": "10",
      "helpful": "8 out of 11 found this helpful.",
      "title": "A venerable uprising against harassment directed towards women all over the world.",
      "content": "I won't say it is one of the best Turkish TV series I have watched simply because it is one of the best TV series I have watched regardless of the country of origin; even better than most revered American TV serials, in my honest opinion. Seriously, I am not saying it just because I am Turkish, even though I am proud that this masterpiece is a Turkish product, I must admit . Casting, acting, the script, screenplay, the atmosphere and its social messages are all so great. It is a venerable uprising against harassment, violence, sexual abuse directed towards women all over the world.I just finished the last episode and i am literally shaking right now. I remember, the last time I felt this way was after watching Guillermo del Toro's El laberinto del Fauno (Pan's Labyrinth)Bravo!"
    },
    {
      "username": "hakan-akkurt",
      "userUrl": "https://www.imdb.com/user/ur35209688",
      "reviewLink": "https://www.imdb.com/review/rw4105155",
      "warningSpoilers": false,
      "date": "26 March 2018",
      "rate": "9",
      "helpful": "59 out of 76 found this helpful.",
      "title": "Fresh and original!",
      "content": "Not much of this subject has been done on turkish tv, generaly it is a lovestory between a rich boy and a poor girl and their impossible \"love story\". But a serial killer on the loose with alzheimer - well that is something brand new ! But Onur Saylak did it!! What a great show with great visuals and sound. The intro by it self is already something never done - and to add the brilliant acting and story, you got an istant HIT. Let's hope that every episode keeps this line steps up and does not fall back on typical turkish tv shows.Haluk bilginer sir, you already proven that you are a great actor. But boy o boy do you keep getting greater and better.From the first episode in I give this show a 9/10"
    },
    {
      "username": "redlightlessness",
      "userUrl": "https://www.imdb.com/user/ur4329092",
      "reviewLink": "https://www.imdb.com/review/rw6211488",
      "warningSpoilers": false,
      "date": "27 October 2020",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "It's a relief in the absence of Breaking Bad",
      "content": "It simply falls in the same niche genre... and executed brilliantly. Well OK perhaps i shouldn't keep the bar that high but it's really good..!"
    }
  ],
  "errorMessage": ""
}