{
  "imDbId": "tt4063800",
  "title": "The Bureau",
  "fullTitle": "The Bureau (TV Series 2015– )",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "robert-temple-1",
      "userUrl": "https://www.imdb.com/user/ur13035875",
      "reviewLink": "https://www.imdb.com/review/rw3767983",
      "warningSpoilers": false,
      "date": "30 July 2017",
      "rate": "10",
      "helpful": "146 out of 161 found this helpful.",
      "title": "The best of all spy series?",
      "content": "This French spy series is entitled in the original LE BUREAU DES LÉGENDES (THE BUREAU OF LEGENDS), a 'legend' being a carefully invented fictitious background and identity for a secret agent. In Britain and America the series is known by an English title as THE BUREAU. This is a review of all three seasons. I cannot think of any spy film or spy series which has approached this one in quality. It is simply the best. As everyone seems to know by now, American spy films and spy series are often funded by secret slush funds of the CIA, as PR efforts to make their spies look glamorous and patriotic, rather than sleazy and dubious. Who could fail to admire and love all CIA agents after being dazzled by the cute charm of the delightful Piper Perabo in the series COVERT AFFAIRS (2010-2014)? If they are all like that, as we are meant to believe, well then how do we get her phone number? She is irresistible. And when do we join up so that we can have the chance of being 'operatives' beside her? Although this French series appears to have had assistance from the French CIA known as DGSE (pronounced 'daygaysuh'), if only in being told how IMSI devices work, and other such intriguing technicalities, this series is certainly no propaganda fantasy to make people want to join. It has more than just a down side, it has a deeply tragic side. This series attempts to get to the bottom of just how great a cost betrayal, manipulation, and deceit have for its daily practitioners. They may be saving the world from ISIS, but they are not saving themselves or their loved ones. Nor are their own characters going uncorrupted. The acting is spectacularly good. This series is as good about spies as SPIRAL (aka ENGRENAGES, 2005-2016, see my review under 'E' for its French title) was about the Paris police. (And by the way, a surprise sixth season is belatedly appearing later this year for SPIRAL.) I have rarely seen any TV series with such impeccably perfect casting as this one. And all the roles are played with genuine depth. There are no cardboard characters in this series, they are all so well-rounded that we feel embarrassed sometimes at the intimacy with which we come to know them. The boldest, and one might say most outrageous, bit of casting for this series is Sara Giraudeau as the character Marian Loiseau. It could have failed disastrously, but in fact it works brilliantly. She is an apparently shy, lisping, wimpish, and babyish girl with a little girl's tentative voice who seems not only harmless but hopeless. But in fact she is a ruthless 'warrior' for DGSE (to use Henri Duflot's word for her). As courageous as she is, however, she does eventually suffer from terrible panic attacks while on missions. She is one of the most unexpected and spellbinding creatures in this amazing zoo of spies. Another bit of unexpectedly successful casting is the plump black agent of very few words, Irina Muluile, who plays the character known as 'the Mule' (strange coincidence with her real surname). She conveys more by saying nothing than many actors do by talking too much. The lead actor of the series is Mathieu Kassovitz, as the agent 'Malotru' (aka Paul Lefebvre and Guillaume Debailly). He delivers a magnificent performance, of enormous range. He has to play a character who is in so many wildly varying situations, including being an ISIS hostage, that he has to be ten people, not only one. This kind of challenging lead role is any actor's dream, and Kassovitz fulfils that dream admirably. The other lead actor is Jean-Pierre Darrousin, who plays Henri Duflot, the head of the operations section. He is an older man, nearing retirement, who is calm, quiet, concerned, conscientious, and thoroughly competent. He is like a father to his team. One of the lead actresses is Florence Loiret Caille ('quail'), who is subtle and superb as the deputy head. She says bitterly near the end: 'I never cry. My parents called me \"the stone\".' Whether she ends up finally crying or not I leave to the viewer's suspense. Zineb Triki (of whom there is almost no information on IMDb) is another female lead, playing the character Nadia El Mansour. She is astonishingly dignified and with a commanding presence, huge soft eyes, and limitless sadness in her gaze. She plays a Syrian, but the actress herself is of Moroccan origin, having left that country in 1995 at the age of 15, studied in France and Canada, obtained a degree in political science, became a journalist, and is now an actress. One could go on and on listing all these people who did so well, but that would involve naming the entire extensive cast of 30 episodes. All of this is the product of the 'creator', Eric Rochant. He originated the series and wrote the scripts, and he then produced and directed them all. (Clearly, he never sleeps but works 48 hours day.) It is all nothing short of a work of genius. Previously he wrote and directed the film MÖBIUS (2013). It is clear, then, that Eric Rochant is not merely a paragon but a marvel. It would be impossible to give even a cursory description of the many intense and parallel adventures of the characters in this series, as the plots are so complex and interweaving, and the stories so dramatic and powerful that they sweep one away. It is all profound, with both expressed and suppressed emotions, and thoughtful reflection amidst all the non-stop and heart-stopping action. The suspense and intensity never let up for one second for the entire series, and by the time it is over, one has worn out all the edges of all the seats, and one is a frazzled emotional wreck. Hold on tight, everyone."
    },
    {
      "username": "maria-ricci-1983",
      "userUrl": "https://www.imdb.com/user/ur53556132",
      "reviewLink": "https://www.imdb.com/review/rw4497504",
      "warningSpoilers": false,
      "date": "6 December 2018",
      "rate": "10",
      "helpful": "72 out of 76 found this helpful.",
      "title": "As brilliant as it gets. The best spy series ever, and it keeps getting better every season!",
      "content": "I cannot praise this show enough. I agree with other reviewers on the high bar this show sets for the genre. It is the French Homeland, but more credible, low-keyed and deeper.Everything distills quality here: a really, really superb script which is intelligent, sensible and gripping to the end; extraordinary characterisation and performances from the main to the last character; tremendous production and attention to detail; credible information about the metier; an impeccable direction which keeps extreme suspense and intrigue, only without the flamboyant, explosive special effects so inevitable in American series, but it is still very action- and field-oriented.Season 4 is really fantastic, it has not decayed in the least. The addition of Mathieu Amalric makes an extra bonus, with the talent he brings to fore in every performance. Marie-Jeanne acquires more weight in the show in the most positive sense. Florence Loiret Caille is such a superb, nuanced actress! And the priceless Kassowits recreates his complex Malotru, the antihero always full of surprises which you respect, admire and love as the seasons go by. He is the perfect spinal cord for the show.In short, this is the most exciting show in the year. I really hope it will maintain the high quality and the cast in years to come, to the delight of all the genre lovers. Kudos to everyone involved in the production!"
    },
    {
      "username": "ok_english_bt",
      "userUrl": "https://www.imdb.com/user/ur86898095",
      "reviewLink": "https://www.imdb.com/review/rw4228939",
      "warningSpoilers": false,
      "date": "7 July 2018",
      "rate": "9",
      "helpful": "33 out of 35 found this helpful.",
      "title": "Rewarding low-key approach ... compelling French spy drama",
      "content": "The reviews I've read here about Canal+'s 'Le Bureau Des Legendes' seem to cover it. I'd only add that its more nuanced non-sensationalist approach works better than many similar political-spy dramas I've seen recently. The apparently ordinary people working out of an office go about their everyday lives as extraordinary events unfold around them. Eric Rochant's series builds the tension gradually, which gives the big 'moments' greater impact. And at the heart of things is a beautiful love story, of course! Don't know how accurate 'Le Bureau' is as regards DGSE and the French intelligence network it portrays, but found it credible and gripping as a series. Still can't find it in myself to award it a '10' (think it would have to be in my native English so I could follow all the verbal stuff to do that), but I'm certainly looking forward to more of 'Le Bureau Des Legendes' (they're making a 4th season, right?)."
    },
    {
      "username": "boydpeters",
      "userUrl": "https://www.imdb.com/user/ur23991256",
      "reviewLink": "https://www.imdb.com/review/rw4362490",
      "warningSpoilers": false,
      "date": "26 September 2018",
      "rate": "10",
      "helpful": "30 out of 34 found this helpful.",
      "title": "Will hook you. French Homeland",
      "content": "Exceptional series. Cannot be faulted. Simple as that"
    },
    {
      "username": "rujoeking",
      "userUrl": "https://www.imdb.com/user/ur72863384",
      "reviewLink": "https://www.imdb.com/review/rw3656758",
      "warningSpoilers": false,
      "date": "7 March 2017",
      "rate": "10",
      "helpful": "122 out of 134 found this helpful.",
      "title": "A Review Like None Other I've Ever Composed",
      "content": "Short and sweet ... I've never done it before, but couldn't have held out for a more appropriate subject.Le Bureau des Légendes is, 'hand's down', the best television series I've ever had the joy of watching. If not for the pathetic feeling of loss knowing that i am 1 show away from the final show of the 2nd (and thus far last) season, I would have none but the most high and exalted of regards for the show. The writing, production values, acting, character development, all things of salience to excellent TV are super-abundantly present in The Bureau. Okay, already losing the 'short and sweet' struggle. Just one last comment: the best TV series ever.'"
    },
    {
      "username": "rs8282",
      "userUrl": "https://www.imdb.com/user/ur63892631",
      "reviewLink": "https://www.imdb.com/review/rw3823910",
      "warningSpoilers": false,
      "date": "6 October 2017",
      "rate": "9",
      "helpful": "47 out of 50 found this helpful.",
      "title": "don't miss this fantastic, realistic spy thriller.",
      "content": "the plot, characters, scenes, stories, side stories are fantastic, realistic and believable. Nothing over the top and nothing underwhelming. only thing i wanted when it was finished was another season. most foreign language shows don't keep me in the zone (binge worthy) due to having to read subs, but i couldn't stop loading episode after episode. i did wish there was a little more action but totally unnecessary. don't hesitate to watch this, you won't be let down."
    },
    {
      "username": "westsideschl",
      "userUrl": "https://www.imdb.com/user/ur18044142",
      "reviewLink": "https://www.imdb.com/review/rw5231178",
      "warningSpoilers": false,
      "date": "2 November 2019",
      "rate": "9",
      "helpful": "18 out of 21 found this helpful.",
      "title": "Season 4 - Spot On",
      "content": "Yes, the French are masters of spy movies/series. Of all in this genre this is the most enlightening/intelligent insight into espionage/cyber warfare that I've seen. Whether it's hacking, or on the ground ops, this script was spot on accurate.Very current in it's presentation, e.g. Russian recruiting of Trump associates; secret pacts w/Bashar el-Assad; ISIS leadership; French jihadists; even a Putin quote, \"Whoever leads in artificial intelligence will rule the world.\"; the involvement of female Kurdish fighters in Syria. Note: The Kurds are the most democratic, religiously tolerant ethnic group in the Turkey, Syrian, Iraqi, Iranian region thus the object of repression by those authoritarian governments."
    },
    {
      "username": "kickeeen",
      "userUrl": "https://www.imdb.com/user/ur65531436",
      "reviewLink": "https://www.imdb.com/review/rw3837615",
      "warningSpoilers": false,
      "date": "21 October 2017",
      "rate": "10",
      "helpful": "100 out of 109 found this helpful.",
      "title": "Among the best TV ever produced",
      "content": "As an avid watcher of films and TV series, I've been on IMDb for quite a while, but I've never written a review, even though I casually read reviews from other users. However, this is the first time I feel I need to urge everyone reading this to watch this TV series.There are loads and loads of TV series about different fields of the intelligence sector, but few of them succeed in being as smart as the agencies they are trying to depict. With Le Bureau des Légendes, it's the other way around. As a viewer, you are constantly being left to guess what everyone's next move is, knowing only little or nothing at all, just like intelligence work in real life. Agents constantly have to think at least three or four steps ahead and even if you succeed with your first move, there is no guarantee at all that the remaining moves will be successful. As all those actions are being taken on risk assumptions, it makes the series a gripping ride and makes you constantly feel like you're on the edge. The writers, actors and camera men pull this off brilliantly, much thanks to the outstanding writing which makes every single TV episode feel like a miniature movie. If you do some research about how the show was made, you'll notice that part of the production got never before authorized access (even though limited) to real life DGSE, which really shows off.However, it's not only down to the writing, but to the acting and filming as well. The casting crew has done an amazing job. You can feel the chemistry between the actors and especially from Mathieu Kassovitz and Jean-Pierre Darroussin who bless us with amazing performances.I don't want to make this review into a TL;DR piece, so I will shortly summarize by saying that Le Bureau des Légendes is one of the most intelligent, tense, gripping and brilliantly acted espionage dramas I've ever seen. The series, which just gets better with every season, is among the best TV ever produced. If you're reading this and you haven't decided if you'll watch it or not - don't wait, as it'll not wait for you."
    },
    {
      "username": "HaveWisdomWillTravel",
      "userUrl": "https://www.imdb.com/user/ur8094403",
      "reviewLink": "https://www.imdb.com/review/rw6503637",
      "warningSpoilers": false,
      "date": "19 January 2021",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "The Bureau Deserves 11 Stars (and 5 more Seasons)",
      "content": "For reference My top SCI-FI = Blade Runner, Battlestar (remake), The Expanse, and my favorite CRIME/ POLITICAL/ SPY dramas = The Killing (U.S.), Bodyguard, Berlin Station, Dexter, Black Mirror Season 1, Bron/Broen. I also love well-crafted stylized shows like The Boys, Killing Eve and Money Heist.I'm not European nor American, not a Francophile, no film/TV genre connoisseur nor a purist. But I'm super picky. I would dump a high production value show with my favorite actors in it, if the writing/ premise/ narrative flow fail my standards.To me, Le Bureau des Légendes is in a class of its own, the \"why didn't anyone tell me about this show the last few years?\" outlier. The amount of heart AND discipline that went into this show, speechless. I don't only \"like\" the people who created this show, I respect them, because they respect their audience. The sincerity, the passion to communicate nuanced hard truths, the depth of intelligence, the layers of human emotion versus reason... The Bureau's narrators make \"serious spy shows\" like Homeland look insultingly dumbed down, and technically meticulous The Americans feel fake and contrived. Even a 3 minute hackers' department scene has been researched and presented with zero compromise AND great economy, yet without the writers/ directors making a fuss about \"look we're so diligent\".Everything film gurus b*tched about French art films, all James Bond BS, all Bourne Identity excesses, turned upside down by The Bureau product, cast, and superb crew. Everything good about classic spy dramas, everything that truly matters in our world's ongoing geopolitical struggles, AND super demanding realistic technical details in the Middle East sets or Moscow spa or posh Baku Hilton or unglamorous crowded French intelligence offices or hacker scribble board, are delivered with seamless dexterity and conviction. No clunky exposition annoyance, no narrative hands-of-god wanking, no ADHD editing nor convoluted time jumping, no camera stunts, no needless pandering to baser instincts, no \"make muh-country great again\" preaching, yet one is made to care more about Tyranny vs Democracy and Humanity and War and Love and The State We Are In, more than ever.Even at the seemingly least humane moments, this show is conveying human decency, the most wanted world commodity this last few years.That, is why I can't call it a spy drama, the same way Blade Runner is not mere science fiction, but classical drama. Le Bureau des Légendes is a classical piece of work, without even trying to be one.I'm in the 4th season, and praying that this journey won't end.As a few other reviewers have said: this is the best TV series ever written."
    },
    {
      "username": "hamlet-16",
      "userUrl": "https://www.imdb.com/user/ur0210789",
      "reviewLink": "https://www.imdb.com/review/rw4154505",
      "warningSpoilers": true,
      "date": "5 May 2018",
      "rate": "9",
      "helpful": "20 out of 23 found this helpful.",
      "title": "French brilliance...",
      "content": "This a hard series to watch at times even though there is relatively little violence shown the dialogue bristles with threat and the lack of human warmth is chilling. The actual plots, because there are many concurrent stories in play are almost not important. Agents face death or worse in the field while their handlers in the main office plot tactics like a game of chess. Loyalties are tested ..strained to breaking point ... is the enemy ISIS or Iran or is it the Russians Israelis and Americans? The UK barely gets mentioned by the way.(For us in the South Pacific the DGSE is known for one thing .... the sinking of the Rainbow Warrior on the direct command of Pres. Mitterand. An act that cut deeply into the friendship between France and nations of the pacific.)However this a brilliant tv series on a par with the BBC's Tinker Tailor Soldier Spy or ITV's Callan from the early 70s. No wonder it is a hit in France.There is a sadness and hollowness to the lives of the characters. And they know it.It is brilliantly realised, gripping and not to be missed."
    },
    {
      "username": "aplulondon",
      "userUrl": "https://www.imdb.com/user/ur110765750",
      "reviewLink": "https://www.imdb.com/review/rw5308622",
      "warningSpoilers": false,
      "date": "8 December 2019",
      "rate": "9",
      "helpful": "30 out of 31 found this helpful.",
      "title": "The best spy series by far",
      "content": "When you know about the quality of the cast, the track record of the director/creator, and that the French intelligence services and former spooks contributed to the scenario, expectations run high for this series.When you realise that it is embedded in reality and about the work of intelligence services, namely gathering and analysing information, for which the tools are brains, psychology, assets, emotions, manipulation, trading, disinformation, treachery, cyber war-fare, and other skillsets, that it's not glamorous, and that it's far less about big weapons than being able to put 2 and 2 together and making sense of constantly shifting sands and highly fluid situations, based upon which political and military decisions are made, then you know that you are onto a treat.And, what a treat! Suspence, twists and turns, moving parts that don't always come together; all of this and plenty more are delivered, and keep you on the edge of your seat.This is not James Bond or Jason Bourne, far from it. This is about the fastidious and ungrateful, yet highly dangerous and stressful jobs of those people evolving in the murky waters of the intelligence world. Not all saints, not all sinners, often both, and always faced with difficult decisions and their ensuing consequences, not the least guilt and sadness.And, because intelligence officers and agents remain human after all, portraying their emotions and vulnerabilities so vividly by digging deep into their characters makes this series as real and raw as it gets.P.S.: Watching it in its original version with subtitles in your language will take you one step closer to the action."
    },
    {
      "username": "erikssonsens",
      "userUrl": "https://www.imdb.com/user/ur106935204",
      "reviewLink": "https://www.imdb.com/review/rw5808224",
      "warningSpoilers": false,
      "date": "8 June 2020",
      "rate": "9",
      "helpful": "20 out of 22 found this helpful.",
      "title": "This is top of the top.",
      "content": "Oh. My. Lord. This is good!! The happiness and joy I feel when series is so well done and acting of cast so totally flawless. Thank you France!!!"
    },
    {
      "username": "yooniverse",
      "userUrl": "https://www.imdb.com/user/ur33079525",
      "reviewLink": "https://www.imdb.com/review/rw6078968",
      "warningSpoilers": false,
      "date": "9 September 2020",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Incredible show, brilliant acting and writing",
      "content": "This is one of the best espionage dramas ever produced. There are no cliches, no contrived plots or unnecessary melodrama, in my opinion. Geopolitical issues are deftly handled, without the heavy-handedness that you would expect to see. The closest comparison would be perhaps Spooks (aka MI-5). This is not Mission Impossible or Jason Bourne.While it's still a TV show and likely very simplistic versus real life intelligence work, the drama is gripping and feels realistic, dealing with the balance between personal and professional lives of intelligence agents, loyalty and morality, about doing things right vs. doing the right thing. There are no over-the-top \"evil\" antagonists here, and even the protagonists are deeply flawed--these are just people serving the interests of their respective countries that have different notions of right and wrong, human rights, and their place in the world (though, obviously, the show is from the French perspective).The story makes the most of France's unique place in world politics--a western nation with diplomatic as well as cultural ties to Syria, Turkey, Iran and other nations in the Muslim world, that allows for stories that involve gathering intelligence, not just about SEAL teams or special forces dropping in and shooting/blowing up things.I truly appreciate shows like this that do not treat its audience like simpletons, boiling down everything to good vs. evil, right and wrong, black and white. This is a show worth investing your time into."
    },
    {
      "username": "robertemerald",
      "userUrl": "https://www.imdb.com/user/ur73668075",
      "reviewLink": "https://www.imdb.com/review/rw4798158",
      "warningSpoilers": false,
      "date": "23 April 2019",
      "rate": "9",
      "helpful": "15 out of 18 found this helpful.",
      "title": "Taunt, believable, intelligent and contemporary spy drama",
      "content": "This hasn't got the riveting excitement and hysteria of Homeland, and lacks the cinematography of Berlin Station. It is definitely in the same league however and sparkles with intellect and charisma. Lovers of the genre have been truly spoilt this year!"
    },
    {
      "username": "Cuscaden",
      "userUrl": "https://www.imdb.com/user/ur2414717",
      "reviewLink": "https://www.imdb.com/review/rw3552677",
      "warningSpoilers": false,
      "date": "29 September 2016",
      "rate": "10",
      "helpful": "233 out of 243 found this helpful.",
      "title": "Brilliant French TV Series",
      "content": "Unlike some of the other reviewers, I am British, the old enemy :)This TV Series is absolutely brilliant. It is a masterpiece spy thriller that delves deeply into the fascinating world of French espionage and counter espionage. The production values are excellent and all of the actors do a stunning job in their roles. Season one was already an amazing TV production, and the second Season is even better. I cannot recommend this French series enough, for viewers like myself whose French is not great there are options to view the series online with English subtitles. If you like spy dramas or TV series which delve deeply into the human experience then I believe you will love this.This is one of the best TV series I have watched. Absolutely fantastic."
    },
    {
      "username": "markmscott-1",
      "userUrl": "https://www.imdb.com/user/ur10001138",
      "reviewLink": "https://www.imdb.com/review/rw3620786",
      "warningSpoilers": false,
      "date": "14 January 2017",
      "rate": "",
      "helpful": "64 out of 69 found this helpful.",
      "title": "Excellent",
      "content": "This series, the second season especially, seems almost perfectly made. It is much in little in every scene, and it makes haste slowly. Intellectually and emotionally satisfying, the writing, the acting, and the filming rarely make a false move. Rarely, because the scenes of the prime spy's writing alone, shirtless, at his desk, in voice-over, strike me as unnecessary, and the American CIA chief, who was so good in \"Friday Night Lights,\" is made to play here as if he were an Anglophile precisian: it doesn't come off. The immediate superior of the main spy plays his part brilliantly, and there isn't a weak actor in the French cast and Middle Eastern cast. So many details are funny and telling at the same time, and yet never detract from the wide scope and long narrative of the series. Nor does the Syrian connection, seeming to come right out of the headlines or even ahead of them, hurt. This is yet another series that makes so many feature films seem a waste of time and money."
    },
    {
      "username": "BeneCumb",
      "userUrl": "https://www.imdb.com/user/ur32764997",
      "reviewLink": "https://www.imdb.com/review/rw3779193",
      "warningSpoilers": false,
      "date": "12 August 2017",
      "rate": "8",
      "helpful": "16 out of 20 found this helpful.",
      "title": "Another versatile French political thriller",
      "content": "/refers to Seasons 1 and 2/ In the era of heavy domination of English-speaking films and series, it is pleasant to enter the world of other language, other habits and comprehensions. An as I have good experiences with e.g. Braquo and Engrenages, then Le Bureau des Légendes was my another logical choice.True, its mood and approach is less violent and with less action, but with more suspicion and dubiety - so is the world of reconnoissance and espionage. In my opinion, the creators and actors have almost got the maximum out of it, thus the viewers are able to follow intertwined events on various levels, in various countries, with personal lives nicely complementing the story, not providing just \"filling-in\" as in some series, for the sake of duration. The characters are realistic, the performances elaborated, and as most of actors-actresses were rather unknown to me, I could fix my mind upon the script and cast in the whole, rather than on certain leading actors, sometimes disturbing to follow the integral course of events. Still, Sara Giraudeau as Marina Loiseau seemed the most interesting and versatile.Well, the story includes some questionable moments and apparent \"wrong\" moral dilemmas, but they do not deplete the opportunity to follow the course of events with tension and excitement. As the Series 2 ended up in an intriguing manner, I look forward to Season 3, soon to be ready.PS I watched Seasons 3-5 I in a row so I did not miss the lack of brief overview of previous season events so much... Despite the fact I could guess some fates of some characters and the number of storylines grew to multiple ones, they were still good to watch (the least interesting for me were the activities with Artus/Jonas as the main person). I wonder if other seasons would follow..."
    },
    {
      "username": "sas2014",
      "userUrl": "https://www.imdb.com/user/ur39799076",
      "reviewLink": "https://www.imdb.com/review/rw4912655",
      "warningSpoilers": false,
      "date": "4 June 2019",
      "rate": "9",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Tres magnific",
      "content": "Simply the best tv series I have ever watched. Got chronic insomnia due to watching episodes back to back sometimes 72 hrs none stop."
    },
    {
      "username": "searchanddestroy-1",
      "userUrl": "https://www.imdb.com/user/ur17559480",
      "reviewLink": "https://www.imdb.com/review/rw3348106",
      "warningSpoilers": true,
      "date": "3 November 2015",
      "rate": "6",
      "helpful": "32 out of 45 found this helpful.",
      "title": "If you have friends, then destroy them.",
      "content": "What a terrific, astounding French series about the cold, ruthless and fierce world - or may I say underworld - of the French intelligence services (the D.G.S.E), the equivalent of American C.I.A, Israeli Mossad or British M.I.6. You deal here with a deep dive into this obscure and so lethal jungle where predators of all kinds, cheaters and cold blooded killers, men and women, are on constant rampage to destroy you. The painting is so accurate, sharp as a knife, describing all the details, at least many of them - it' a secret world, after all - many tricks used by this shadow warriors to accomplish their duty and, most of all, survive. The true face of those men and women who fight for their country all over the world, in most cases totally undercover. Those men and women who lose their own identities because they have so many of them. Those men and women who are ready to cheat, kill, torture OUT OF ANY LAW in order to achieve their mission. Those men and women ready to accomplish the impossible to be the best among the best. You have already seen SECRET DEFENSE directed by Philip Haim, back in 2008, and AGENTS SECRETS that Frederic Schoenderffer gave us in 2004. Both were accurate portraits of what secret agents truly are. But this TV series is the most brilliant expose of what the \"Swimming Pool\" atmosphere is. Swimming Pool is the nick name given by the agents of the French Intelligence (DGSE) headquarters in Paris."
    },
    {
      "username": "annimack",
      "userUrl": "https://www.imdb.com/user/ur81245906",
      "reviewLink": "https://www.imdb.com/review/rw3829176",
      "warningSpoilers": false,
      "date": "11 October 2017",
      "rate": "10",
      "helpful": "49 out of 55 found this helpful.",
      "title": "Simply brilliant",
      "content": "This French spy thriller leaves the equivalent US shows for dead. US shows like Criminal Minds, etc. are just the same old drivel each season.This series was riveting right from the start, though slightly slower in the first couple of episodes as character profiles were established. Most characters are very likable and none became annoying like they do in the US shows.I only hope the creators make more seasons as I fear that a trilogy is all we are going to see.Absolutely brilliant series!! Magnifique!!"
    },
    {
      "username": "suripat",
      "userUrl": "https://www.imdb.com/user/ur84494044",
      "reviewLink": "https://www.imdb.com/review/rw6719137",
      "warningSpoilers": false,
      "date": "20 March 2021",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "I must give 10 to this series",
      "content": "Find a way and watch it. It is a story tellinf series about 'spies' but with a slight different angle, a more personal view inside the type of missions and situations a government tasked employee would go through. It is tense, well filmed, well directed, great cinematography, different from what you are used to watch, which is delightful. Many many different languages are spoken and many different cities and countries are shown. This one was responsible for me starting to learn French (seriously) , I am in the middle of the second semester of classes so, I'm glad I came across this. Think of a French 'Homeland', but much, much better! I hope there is a season 6, have no idea, have to research. Thanks, CANAL+!"
    },
    {
      "username": "destiny-311-545065",
      "userUrl": "https://www.imdb.com/user/ur32216146",
      "reviewLink": "https://www.imdb.com/review/rw6915580",
      "warningSpoilers": false,
      "date": "14 May 2021",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "The Best Spy/Espionage Show I have ever seen",
      "content": "I happened to come across some mentions of this show on review threads of other more popular spy shows and I'm honestly so glad I checked it out. I just finished S4 and honestly, I cannot find any flaws. Malotru and the rest of the DGSE team had me hooked right from the start. The acting, writing, execution - everything is done in such an expert way. As someone who has seen a lot of crime shows (Homeland/Criminal Minds/The Spy/The Americans/Jack Ryan/Mindhunters/24 etc) and without giving away any spoilers, I can honestly say that 'Le Bureau des Légendes' or 'The Bureau' is honestly the best spy show I have ever seen."
    },
    {
      "username": "asatornkvist",
      "userUrl": "https://www.imdb.com/user/ur60857943",
      "reviewLink": "https://www.imdb.com/review/rw5793410",
      "warningSpoilers": false,
      "date": "2 June 2020",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Best series, ever.",
      "content": "This is such a masterpiece. Script, actors, photo- everything is of such excellence. Shakespeare would have been envious. Watch it!"
    },
    {
      "username": "mlynch5187",
      "userUrl": "https://www.imdb.com/user/ur50353664",
      "reviewLink": "https://www.imdb.com/review/rw5907795",
      "warningSpoilers": false,
      "date": "15 July 2020",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Absolutely Masterful Spy Thriller",
      "content": "This show about the French secret service is as good as any show I've ever watched, and that includes shows like Breaking Bad, The Wire, and The Sopranos. The writing, acting, and everything else about it is absolutely perfect. The perfection runs through all five seasons, an achievement very few shows accomplish. I couldn't stop watching this and can't wait to recommend it to everyone I know!"
    },
    {
      "username": "ravivenkitaraman",
      "userUrl": "https://www.imdb.com/user/ur88654012",
      "reviewLink": "https://www.imdb.com/review/rw5639996",
      "warningSpoilers": false,
      "date": "14 April 2020",
      "rate": "10",
      "helpful": "21 out of 25 found this helpful.",
      "title": "Up there with The Americans",
      "content": "I just finished Season 3 and IMO this is the best offering on TV today in the spy genre. It's detailed, feels authentic, and the plots and scripts are tight with very little wasted screen time. Add to that great locales and solid acting, and that puts it at the very top of the category, along with The Americans, and significantly ahead of other genre offerings such as Homeland."
    }
  ],
  "errorMessage": ""
}