{
  "imDbId": "tt5687612",
  "title": "Fleabag",
  "fullTitle": "Fleabag (TV Series 2016–2019)",
  "type": "TVSeries",
  "year": "2016",
  "items": [
    {
      "username": "Clipster12",
      "userUrl": "https://www.imdb.com/user/ur65355067",
      "reviewLink": "https://www.imdb.com/review/rw4733916",
      "warningSpoilers": false,
      "date": "20 March 2019",
      "rate": "10",
      "helpful": "372 out of 436 found this helpful.",
      "title": ".............and you thought season 1 was funny.",
      "content": "Phoebe Waller-Bridge, I don't quite know how you do it dear but keep it up. As a 50 year old bloke this should be well off the mark for me but instead I find it by far the funniest, well observed and at times poignant thing on TV at the moment. Season 2 has hit the ground running and I am hanging on for every episode. Do yourselves a favour and binge this. Thanks to all involved with the production of this series."
    },
    {
      "username": "elbandito1250",
      "userUrl": "https://www.imdb.com/user/ur109279000",
      "reviewLink": "https://www.imdb.com/review/rw6029719",
      "warningSpoilers": false,
      "date": "26 August 2020",
      "rate": "10",
      "helpful": "87 out of 101 found this helpful.",
      "title": "Special sort of humor required!",
      "content": "I watched the first episode together with my wife and she hated it from the beginning, while I instantly loved it! This special sort of humor is always highly divisive. Either you love it or you hate it. In my experience for shows like Fleabag there's no such ratings like \"quite entertaining and funny at times\"! Phoebe Waller-Bridge is incredibly talented in so many ways, I can't tell what's more adorable about her work in Fleabag: the acting, the uncommon storytelling, the firework of weird gags...? Everything is fresh and unique. I really hope there's much more coming from her in the future, both as actress and as writer!"
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw7861736",
      "warningSpoilers": false,
      "date": "13 February 2022",
      "rate": "8",
      "helpful": "30 out of 38 found this helpful.",
      "title": "Very funny",
      "content": "After the death of her best friend, an event she is partly responsible for, a woman drowns her sorrows in one-night stands and other hedonistic behaviour. Her family compounds her problems: the uptight, corporate exec sister, the alcoholic, obnoxious brother-in-law, the well-meaning but clueless father, the scheming, domineering father's girlfriend who moved in very quickly once her mother died. From here the only way is up.Great comedy series. Created by and starring Phoebe Waller-Bridge the series pushes the envelope in terms of humour while having decent dramatic side to it too. A great device Waller-Bridge employs is voicing her thoughts directly to the camera in between dialogue. Very original and makes for some hilarious punchlines. Season 2 then takes this a step further...On that note, the series does improve from Season 1 to Season 2. Season 1 was a good introduction to the main character and her host of issues and was very funny but did rely a bit on shock value for some of the punchlines. It all seemed about problems (and wallowing in them) rather than solutions. I did enjoy the Boo (the deceased friend) sub-plot though. It was the most emotional part of the series, it revealed the downside to the main character's behaviour and the interactions between the two of them were always wonderfully engaging and funny.Season 2 evolves the dramatic side and feels more balanced. There are new challenges to be faced but things are a bit less outlandish.While the series has some aspirations as a drama its strongest suite is definitely as a comedy. A few loose ends in the dramatic sub-plots makes the dramatic side feel a bit clumsy at times.Can't fault the casting nor performances. Phoebe Waller-Bridge is excellent in the lead role and the other major characters are superbly played."
    },
    {
      "username": "yossarian100",
      "userUrl": "https://www.imdb.com/user/ur2102094",
      "reviewLink": "https://www.imdb.com/review/rw3540804",
      "warningSpoilers": false,
      "date": "9 September 2016",
      "rate": "10",
      "helpful": "169 out of 235 found this helpful.",
      "title": "Over the Top Funny",
      "content": "I've rarely seen anything this funny, and there it is....half an hour of non-stop laughter.Phoebe Waller-Bridge is hysterical as she constantly shares both her innermost and her totally superficial feelings with the audience, even while she's having sex. She is totally bizarre, as are the entire supporting cast, and they won't allow you to stop laughing.If they can keep up the energy levels of the first two episodes, they will have a major hit on their hands.I had such a good time watching this, and I can't wait for the next episode.Don't pass this by. It's one of the best shows TV has to offer.Enjoy!"
    },
    {
      "username": "southdavid",
      "userUrl": "https://www.imdb.com/user/ur0715971",
      "reviewLink": "https://www.imdb.com/review/rw5888213",
      "warningSpoilers": false,
      "date": "7 July 2020",
      "rate": "9",
      "helpful": "40 out of 53 found this helpful.",
      "title": "Godlike",
      "content": "I've written individual reviews for each season of \"Fleabag\" but as it's becoming apparent that any more is unlikely, I thought I'd post a composite of the two reviews here, to give an appraisal of the whole run.I'd been putting of \"Fleabag\" for a while, trying to let the weight of expectation die down a little, given how critically adored it is. However, the first season really lived up to its reputation as a clever, witty comedy.Fleabag (Phoebe Waller-Bridge) is a hedonistic young woman whose fractured relationships with her family have been caused by her inability to cope with the deaths of both her mother, and more recently her best friend. The café they co-owned is struggling and her relationship seems to have come to a permanent end. She struggles to make valid connections with anyone except us, the audience.What can I say other than the show lived up to its reputation. It's funny, clever and vulgar at the same time. Fleabag is a great character, wonderfully played by Waller-Bridge and the rest of the cast a similarly excellent too, particularly Bill Paterson as her father and Olivia Colman as her wicked god/stepmum. Even though I really liked the first run, I wasn't prepared for just how much of a step up the second season would be. It's genuinely, one of the funniest, most enjoyable seasons of comedy I've seen in a long while. There's one immediate and obvious reason for the season two improvement. In the first episodes, any love interest for Fleabag wasn't a match for her wit or temperament, they were a punchline. Here Andrew Scott's \"Hot Priest\" is a fully rounded character, with his own issues and can both punch back and enjoy sparring with her. . It's just funnier all round though, even better written, more moving and, as it appears at the moment that this is all we're ever going to get, tinged with a bittersweet sadness - particularly in the final moments.Just glorious, wonderful TV."
    },
    {
      "username": "djg32514",
      "userUrl": "https://www.imdb.com/user/ur60542591",
      "reviewLink": "https://www.imdb.com/review/rw4118275",
      "warningSpoilers": false,
      "date": "5 April 2018",
      "rate": "9",
      "helpful": "112 out of 151 found this helpful.",
      "title": "I am shocked! I really enjoyed it!",
      "content": "Not my typical cup of tea. Watched an episode with no intent and before I knew it I was smiling. Then laughing. Phoebe has amazing comedic talent. Even an old guy like me can recognize her talent. Quirky, irreverent, intelligent humor. Not something in abundance here in the states."
    },
    {
      "username": "cherold",
      "userUrl": "https://www.imdb.com/user/ur0011762",
      "reviewLink": "https://www.imdb.com/review/rw3627302",
      "warningSpoilers": false,
      "date": "26 January 2017",
      "rate": "10",
      "helpful": "57 out of 87 found this helpful.",
      "title": "Utterly brilliant performance and writing from Phoebe Waller-Bridge",
      "content": "When I watched the first episode of Fleabag, I thought it was very funny but at the same time thought the main character was a bit off putting. But don't worry, her awfulness is mainly show.When I got around to watching the second episode, which was even funnier, I was hooked, and binge-watched the rest.Phoebe Waller-Bridge gives an amazing performance. She has a wonderfully expressive face which she uses to communicate with the audience, who she treats as a friend she's sharing secrets with. She can say everything with just a wry look or a moment of surprise.While Fleabag can seem like a sex-obsessed sitcom, the series insistently adds complexity to its characters. The main character is funny and bawdy, but also haunted by the death of a friend and traumatized by her upbringing. Her sister at first seems like a stock antagonist, but their relationship turns out to be far more nuanced, and the actresses' chemistry is remarkable. Even a bit part early on is given a chance at redemption.This is the first I've heard of Waller-Bridge, but she is an incredible talent. I just learned she made another series this year called Crashing, so I know what I'm watching next! (Update: I watched it, it was great)"
    },
    {
      "username": "MovieFan-91319",
      "userUrl": "https://www.imdb.com/user/ur65315536",
      "reviewLink": "https://www.imdb.com/review/rw4702253",
      "warningSpoilers": false,
      "date": "6 March 2019",
      "rate": "10",
      "helpful": "279 out of 386 found this helpful.",
      "title": "An anarchistic breathe of fresh air.",
      "content": "I never give 10 stars, since I'm personally dubious of all 10 star reviews. But lately, American 'comedies' are so full of social justice and religious/political engineering, I almost forgot what it was like to laugh. Finding this show (just started season 2)--it's an anarchistic breathe of fresh air, compared to the group-think slop being shoveled into our troughs here in the US. It's been so long since I watched something designed to make me laugh, instead of control the way I think, I'm gonna give it the full 10 stars. Very excited to watch the rest of season 2!"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw3533674",
      "warningSpoilers": false,
      "date": "28 August 2016",
      "rate": "8",
      "helpful": "55 out of 85 found this helpful.",
      "title": "How good is this!!",
      "content": "I'm still so annoyed with BBC3 for switching to online only, I still enjoy watching the show on my lunch break at work, but it doesn't beat watching it on the box.Fleabag is one of the best shows to come from BBC3 since the likes of Gary Tank Commander and Cuckoo. I don't get why a show like this isn't given a more prime time viewing slot, it seemed to be lost in obscurity and just deserved more.Some of the situations obviously are a little unusual to say the least, but the writing is just so good.Phoebe Waller-Bridge is proving herself to be an actress and writer etc of huge talents, Fleabag is genuinely funny, just as good as the recent channel four series 'Crashing' a project of hers I also loved. Olivia Colman can do no wrong, but it's nice to see her cast in a very different role, so often playing a 'sweet' character, she shows her versatility. Bill Patterson great also,"
    },
    {
      "username": "hollyug",
      "userUrl": "https://www.imdb.com/user/ur68169876",
      "reviewLink": "https://www.imdb.com/review/rw3532974",
      "warningSpoilers": false,
      "date": "27 August 2016",
      "rate": "10",
      "helpful": "576 out of 661 found this helpful.",
      "title": "One of the best bits of TV storytelling I've ever seen, loved it.",
      "content": "I thought this show was so good I emailed BBC3 to thank them for airing it, and decided to write my first IMDb review. I thought it would be a comedy going in, and it did really make me laugh at times, but it turned out to be something very different. Some of, if not THE best storytelling i've ever seen in series format. I won't say anything else because I loved how it quietly surprised me. I suspect this show might not be for everyone (I struggle to elaborate on that) but give it a go, a couple of episodes in and I was completely absorbed in this dysfunctional human tale.Every part of this TV shows production was so well done. Fantastic acting, editing, photography if that's the right word. I really can't think of anything else like it off the top of my head.. so I would suggest watching it based on that alone and will be interested to see what the IMDb algorithm suggests people might also like in time. As it is I don't think any of the suggestions are remotely comparable. You really will miss out if you pass over this one, and at just two episodes you'll know what it's about. You won't be disappointed by the ending if you choose to keep going. It was SO well done. Everyone involved should be so proud."
    },
    {
      "username": "izabelab-08870",
      "userUrl": "https://www.imdb.com/user/ur121113256",
      "reviewLink": "https://www.imdb.com/review/rw6982548",
      "warningSpoilers": true,
      "date": "30 May 2021",
      "rate": "10",
      "helpful": "27 out of 32 found this helpful.",
      "title": "Quirky and heartbreaking",
      "content": "I don't remember when I last laughed so much at a series. I was hooked from the first episode and season 2 was the perfect amount of romantic and heartbreaking.Fleabag is all of us, so-called adults going through life blindfolded, struggling with mixed feelings and addictions and trying to find someone to tell us what to do, how to live.The series is perfect, the only thing that could make it better is more seasons."
    },
    {
      "username": "kyleecoyote79",
      "userUrl": "https://www.imdb.com/user/ur52966902",
      "reviewLink": "https://www.imdb.com/review/rw4881115",
      "warningSpoilers": false,
      "date": "23 May 2019",
      "rate": "10",
      "helpful": "78 out of 113 found this helpful.",
      "title": "I can't tell you how much I love this show.",
      "content": "I liked season 1. But season 2 has stolen my heart. I absolutely adore this show."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw4770327",
      "warningSpoilers": true,
      "date": "9 April 2019",
      "rate": "7",
      "helpful": "26 out of 44 found this helpful.",
      "title": "didn't like the character at first",
      "content": "Fleabag (Phoebe Waller-Bridge) is a struggling thirtysomething Londoner. Her \"guinea pig\" café is struggling after the tragic accidental suicide of her business partner Boo. Her sex life is a struggle with various hookups. She struggles with her uptight perfect older sister Claire (Sian Clifford) married to the inappropriate Martin (Brett Gelman) with inappropriate stepson Jake. She struggles with her evil godmother (Olivia Coleman) who has ensnared her father (Bill Paterson) after her mother's death from breast cancer. Fleabag is often breaking the 4th wall. In the second season, she has an inappropriate relationship with a priest (Andrew Scott). He's the only one who notices her breaking the 4th wall.I did not like Fleabag at the beginning, the character not the show. She does grow on me over time and mostly due to her relationship with her sister. The two siblings are hilarious together. For me, their relationship is the heart of the show more than any sexual encounter in the first season or even her relationship with the priest. It's not any of her craziness. It is the touching reality of the siblings' love and frustration. The father doesn't talk enough to have the same effect until the very last episode. The evil godmother is the evil godmother played very well by the brilliant Olivia Coleman. Martin is cringeworthy and Brett Gelman has that performance in his tool box. The first season also suffers from a lack of good romantic partner for Fleabag. That's solved by Andrew Scott in the second. He also helps in breaking the 4th wall. That technique can be overused but I really like his acknowledging of it. This is an interesting little show highlighting the skills of its creator."
    },
    {
      "username": "ozjosh03",
      "userUrl": "https://www.imdb.com/user/ur50105620",
      "reviewLink": "https://www.imdb.com/review/rw5058879",
      "warningSpoilers": false,
      "date": "14 August 2019",
      "rate": "7",
      "helpful": "90 out of 164 found this helpful.",
      "title": "Get a grip, people!",
      "content": "Fleabag is shaping up as the most over-praised, over-rated TV series of the decade - though it's a close race with Killing Eve. Yes, it's irreverent and, yes, it's funny. But 10 out of 10? C'mon! It rarely reaches the sublime heights of outrageousness of Absolutely Fabulous. In fact, it's more like a really dirty version of Miranda. Nothing wrong with that, but it's hardly hugely original. That reviewers are falling over themselves to lavish 10s and lavish praise on the series probably says more about them and their need for messy, chaotic, self-absorbed anti-heroines than at does about the series itself."
    },
    {
      "username": "TwittingOnTrender",
      "userUrl": "https://www.imdb.com/user/ur32263666",
      "reviewLink": "https://www.imdb.com/review/rw4802969",
      "warningSpoilers": true,
      "date": "25 April 2019",
      "rate": "4",
      "helpful": "117 out of 210 found this helpful.",
      "title": "Not My Bag",
      "content": "A tricky one to review. I hated, hated, hated it, but something made me watch every episode, one a day, till I finished it. There are a couple of laughs - not enough to justify the gushing praise and endless articles in the Guardian, however. I almost stopped watching after the first couple, but stuck with it. First, the grand conceit - the Peep Show style internal/external monologue and glances at the camera. The latter become incredibly irritating before the end of episode one. Like everything and everyone in this production, it smacks of some one unbearably pleased with themselves - I don't know how many people will relate to the problems suffered by the privileged people depicted here. She OWNS A CAFE - but, poor thing, it's not very successful! I wonder what she should do with that prime London real estate? The characters are not just one-dimensional, they're paper thin. You know, the stock stiff-upper lip Brit characters - they don't like to show their feelings, you know! The cruel stepmother, constantly smiling and meaning the opposite of what she says, played so many times by the likes of Judi Dench and Maggie Smith, here depicted by flavour of the month Olivia Colman - probably a lovely woman, and very good in some previous stuff she's done, but now part of that untouchable sacred-cow elite. The repressed sister - Friends' Monica turned up to 11. She's cold. She's pushing her feelings deep inside. WE GET IT. She has the honour of reciting the show's worst line (repeated several times in the \"Previously Ons...\") - \"Get your hands off my miscarriage!\" Wow, transgressive! I'm shocked! Talking about transgression, we come to the \"cool priest\". He swears! he smokes! He...he...does sex! Played by Andrew Scott, whose uncontrolled hammery ruined Sherlock for me, he's a quirkmeister supreme. He's scared of foxes! Oh my! The garden scene (with the fox revelation) reminded me of that excruciating hopping scene in the excruciating Truly, Madly Deeply - that's how bad it is (and TMD is a good reference point). Yet for all it's naughtiness and boundary pushing, it falls back on some good old traditional plot twists to tie things together. Like most iconoclasts, Phoebe would like nothing better than to present Saturday Night Takeaway. Why the four stars, as opposed to one, when I hate it so much? Well one star didn't seem right. SOMETHING kept me coming back - to see how things worked out in this chocolate box universe, the occasional chuckle, the London locations...I would never say \"Don't watch this\" - some people I love and respect went gaga for it. You may love it, you may, like me, love to hate it."
    },
    {
      "username": "bizzywiththefizzy",
      "userUrl": "https://www.imdb.com/user/ur26693144",
      "reviewLink": "https://www.imdb.com/review/rw4785412",
      "warningSpoilers": false,
      "date": "16 April 2019",
      "rate": "1",
      "helpful": "359 out of 691 found this helpful.",
      "title": "A Self Indulgent Celebration of Truly Awful, Awful People",
      "content": "Everyone seemed to be losing their minds over how awesome this is supposed to be, so I thought I'd give it a go.Essentially it's a Miranda-esque 'comedy' where the titular protagonist breaks the fourth wall via increasingly irritating smirks and asides while she bonks her way across the male population of London leaving a trail of devastation in her wake.After episode one, I thought 'well this chick clearly has borderline personality disorder so perhaps the rest of the episodes show her getting help, working through her bereavements and guilt and putting away her rampant promiscuity and generally horrible behaviour' - they did not.It might be because I lived in London for over a decade and encountered hundreds of people like Fleabag and her awful, awful family, but I hated every second of this - I watched both series, waiting for something to justify why people are harping on about how genius this is, but it never came.Seriously, don't waste your time - unless you're into spoiled rich brats (she's supposed to be struggling financially and runs a tiny cafe, yet she somehow lives in a beautiful huge house alone...in London) with zero redeeming features and a 13 year old boy's preoccupation with anything to do with sex.Watching this was like being trapped in Waitrose with its army of neurotic upper middle class customers.One star, because the guinea pig was cute and my guinea pig was squeaking whenever she was on screen."
    },
    {
      "username": "Hughmanity",
      "userUrl": "https://www.imdb.com/user/ur64477351",
      "reviewLink": "https://www.imdb.com/review/rw4922839",
      "warningSpoilers": false,
      "date": "9 June 2019",
      "rate": "7",
      "helpful": "31 out of 56 found this helpful.",
      "title": "Gets better as it goes along",
      "content": "I had a tough time with the first few episodes of this show. I almost gave up on it after one episode but it had such a high rating I decided to stick it out and I'm glad I did. What at first seems like a reprehensible, self-indulgent and overly smug main character does finally turn out to have more depth and be working through so issues of her own, though it's a long wait to find out even some of that. Season 2 was better than 1 with more depth of characterization, a male in her life that isn't a superficial idiot, and a great evolving story line around her sister and family. By the end of season 2 I genuinely liked the show and even rewatched some of it. So if you don't like it at first, maybe try to give it some time to find it's footing and depth."
    },
    {
      "username": "sumdyude",
      "userUrl": "https://www.imdb.com/user/ur28173316",
      "reviewLink": "https://www.imdb.com/review/rw5630121",
      "warningSpoilers": false,
      "date": "11 April 2020",
      "rate": "1",
      "helpful": "41 out of 65 found this helpful.",
      "title": "Terrible, not refreshing at all",
      "content": "After reading all the great, exciting reviews claiming the show was so \"refreshing\", I thought I'd give this a try. I have to admit this is not really my kinda tv show genre but I mostly like British shows, so I have to review it to counter all the positives. I couldn't get past the second episode. This is claustrophobic rantings of a narcissistic \"sexually liberated\" woman. One has to be small-minded and wrapped up in their sexually frustrated boring lives to enjoy something like this. There is constant useless gutter talk that has no higher purpose. I have no idea why this is so famous. Next.."
    },
    {
      "username": "thebricks",
      "userUrl": "https://www.imdb.com/user/ur37569728",
      "reviewLink": "https://www.imdb.com/review/rw4892682",
      "warningSpoilers": false,
      "date": "27 May 2019",
      "rate": "1",
      "helpful": "97 out of 200 found this helpful.",
      "title": "TV shows about mentally-ill spoiled brats are entertainment now?",
      "content": "Bizzywiththefizzy pretty much wrote the definitive review of this show on IMDB so that I and many others wouldn't have to. This is a show written by trashy rich kids whose parents were never around growing up. I spent four horrible years around these sorts of people. If you don't know them, you may like this show, even aspire to be like these people. When you do, you will want nothing to do with them or shows like this.There was like one scene where this drunk girl stumbles over at the bus stop and she helps them up, gets them into a cab, etc. That would never happen. She would leave them where they were and step right over them. What a farce.I mean, you're basically watching a show about a spoiled brat with severe mental problems. And it's made for our entertainment. It's revolting. And like most Hollywood shows, there is a subtle message that we should all aspire to be like this person.I have to be honest, I don't consider myself religious or morally uptight, but if I ran a country, I wouldn't allow TV shows like this to be made. This is lowest common denominator garbage. Thumbs way down.EDIT: Oh look, Phoebe Waller-Bridge's dad founded Tradepoint and apparently she is from a house of nobility. Shocker. Too much of this going on with British actors, lost all interest in her. Anyone really think she'd have a chance in show business with that birthmark if she was an average girl?"
    },
    {
      "username": "HollysDemoHell",
      "userUrl": "https://www.imdb.com/user/ur33765031",
      "reviewLink": "https://www.imdb.com/review/rw5754756",
      "warningSpoilers": false,
      "date": "20 May 2020",
      "rate": "1",
      "helpful": "38 out of 61 found this helpful.",
      "title": "can I unwatch this?",
      "content": "Toe curlingly self-conscious adolescent dreck masquerading as edgy comedy. Every scene lifted straight out of some hideous amateur dramatics improv class, and the frequent attempts at breaking the 4th wall were so uncomfortably executed that every time she glanced at the camera I wanted to chuck my sofa at the screen. Perhaps I'm just not the 'target audience', in which case I'm grateful I'm not... I lasted about 2 episodes, but I'd pay good money to have them erased from my mind."
    },
    {
      "username": "brendandax",
      "userUrl": "https://www.imdb.com/user/ur76396053",
      "reviewLink": "https://www.imdb.com/review/rw5250026",
      "warningSpoilers": false,
      "date": "11 November 2019",
      "rate": "10",
      "helpful": "46 out of 65 found this helpful.",
      "title": "Perfect show in a strange strange world",
      "content": "If you don't like it no one can help you. Watch it or be the poorer"
    },
    {
      "username": "ranwulfs",
      "userUrl": "https://www.imdb.com/user/ur24622804",
      "reviewLink": "https://www.imdb.com/review/rw7900896",
      "warningSpoilers": false,
      "date": "26 February 2022",
      "rate": "1",
      "helpful": "26 out of 45 found this helpful.",
      "title": "Really Unlikeable Characters",
      "content": "I've got through the first season, and well...meh. I'm not really sure what all the cheers & applause are about - and there are all kinds of cheers & applause over this show. It's won Emmys and Golden Globes and a veritable boatload of other accolades, and I don't know why. The writing is weak, and the whole breaking the fourth wall thing is done to death. An occasional \"aside\" is one thing, but we're hammered with them. The only way Phoebe Waller-Bridge can signal even the barest hint of humour or irony in any scene is to mug for the camera as if saying, \"Here comes the funny part! Do you see it!? Isn't it funny!?\" Or, \"Look! Look - it's ironic! Isn't this so ironic!?\" And, \"Now I'm looking at the audience - that's your cue to laugh!\" Every character is a creep and completely unlikeable - especially the lead. That in itself isn't a deal breaker - remember Seinfeld? Not a single character on that show you'd actually want to even *know* much less be pals with, but it was still a funny show. But \"Fleabag\" is just annoying. The \"Wacky Chick Who Screws Everyone But Is Crying On The Inside\" isn't a very original character. It's like those old after-school specials, but with a British accent and an R rating. After watching the first season/series, I'm mystified by its popularity. Maybe I'm just old. Meh."
    },
    {
      "username": "M0vieL0ver",
      "userUrl": "https://www.imdb.com/user/ur32239119",
      "reviewLink": "https://www.imdb.com/review/rw4897871",
      "warningSpoilers": true,
      "date": "29 May 2019",
      "rate": "1",
      "helpful": "142 out of 288 found this helpful.",
      "title": "Garbage from the first episode",
      "content": "The first episode: Anal sex and masturbating to Obama.What the heck is this garbage?The children were let out yet again to write the script. No thanks.Absolute garbage."
    },
    {
      "username": "stegasaurob",
      "userUrl": "https://www.imdb.com/user/ur107236398",
      "reviewLink": "https://www.imdb.com/review/rw5378700",
      "warningSpoilers": false,
      "date": "3 January 2020",
      "rate": "1",
      "helpful": "57 out of 106 found this helpful.",
      "title": "Nasty",
      "content": "This is a nasty little show about a nasty young woman who goes around being nasty. I didn't like it one bit.However, if you find the mere mention of anal sex to be hilariously transgressive and titillating then it could be right up your street."
    },
    {
      "username": "kager-69310",
      "userUrl": "https://www.imdb.com/user/ur112613007",
      "reviewLink": "https://www.imdb.com/review/rw5461609",
      "warningSpoilers": true,
      "date": "5 February 2020",
      "rate": "1",
      "helpful": "41 out of 70 found this helpful.",
      "title": "Distasteful, watch Miranda instead",
      "content": "This could have been great. They should have kept her best friend alive at least the two had chemistry and added something to the show. The sister is way too cold, same with the rest of the family. I don't actually get the point of the show; what is it actually about? Seems to depict a woman struggling in her personal life, no interesting plot lines. Too many unecessary r rated scenes, don't when shows starting thinking adding r rated scenes for the hell of it made them progressive.Mimics person talking to camera style also used in Miranda, I would recommend watching Miranda for some real laughs and original comedy."
    }
  ],
  "errorMessage": ""
}