{
  "imDbId": "tt4288182",
  "title": "Atlanta",
  "fullTitle": "Atlanta (TV Series 2016–2022)",
  "type": "TVSeries",
  "year": "2016",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw5945136",
      "warningSpoilers": false,
      "date": "27 July 2020",
      "rate": "9",
      "helpful": "93 out of 115 found this helpful.",
      "title": "Is there anything that Donald Glover can't do?",
      "content": "Atlanta is an incredible must see show! Donald Glover is such an amazing talent who seems to do no wrong and who leads an all-around amazing cast! I really can't say enough about this phenomenal show except to go watch it!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8584258",
      "warningSpoilers": false,
      "date": "2 October 2022",
      "rate": "8",
      "helpful": "46 out of 57 found this helpful.",
      "title": "Great!",
      "content": "Atlanta is such an incredible and must see show! Donald Glover is just an amazing talent who seems to do no wrong and who leads an all-around amazing cast! Donald Glover plays a character named Earn who's cousin Alfred (Brian Tyree Henry) is an up and coming rapper named Paperboy on Atlanta. Earn takes over as his manger as he grinds to make Paperboy one of the top hip-hop artists in the world. Those two along with their friend Darius (the underrated LaKeith Stanfield) get in all sorts of events. He also has a girlfriend Van (Zazie Beetz) who they have a child together. Some people didn't like season 3 as much because every other episode wa it's own story that didn't involve the stars of the show. It also took them away from Atlanta and over to Europe so it doesn't have the same feel. Even though it's not as good as the first two season I still liked it. I really can't say anymore about this phenomenal show except to go watch it!"
    },
    {
      "username": "jamesbettinson",
      "userUrl": "https://www.imdb.com/user/ur50058583",
      "reviewLink": "https://www.imdb.com/review/rw4668798",
      "warningSpoilers": false,
      "date": "18 February 2019",
      "rate": "9",
      "helpful": "147 out of 165 found this helpful.",
      "title": "A slice of life and surreal brilliance",
      "content": "There is a lot about this program that I shouldn't relate to. I don't live in America, I'm not black, I'm gaining a few years on the cast. But through impeccable writing, casting and acting Atlanta draws me in to a world that finds a strange yet utterly compelling way to tell a story. The comedy and tragedy mix as happens in real life. The often brutal reality of being young and black and poor in America fuses seamlessly with more existential themes of growth (personal and professional), family, race, power dynamics, legacy and much more. This work is beautiful in both a comedic and dramatic sense."
    },
    {
      "username": "chrisdmeads",
      "userUrl": "https://www.imdb.com/user/ur29388934",
      "reviewLink": "https://www.imdb.com/review/rw5805572",
      "warningSpoilers": false,
      "date": "7 June 2020",
      "rate": "10",
      "helpful": "58 out of 75 found this helpful.",
      "title": "Donald Glover is a Genius...",
      "content": "Season 1: 8/10 Season 2: 9/10 Season 3: 8/10Can't wait for more."
    },
    {
      "username": "ccorral419",
      "userUrl": "https://www.imdb.com/user/ur2341629",
      "reviewLink": "https://www.imdb.com/review/rw3544527",
      "warningSpoilers": false,
      "date": "15 September 2016",
      "rate": "10",
      "helpful": "54 out of 88 found this helpful.",
      "title": "Some guys don't get all the luck. Here it's funny and entertaining",
      "content": "Looks like FX has once again found another island in the rough with their new show \"Atlanta\". Creator, Writer and Actor Donald Glover (no relation to actor Danny Glover) is that guy who everything seems to happen to him and/or around him. Featuring a primarily cast of color, Brian Tyree Henry, Keith Stansfield and Zadie Beetz (each established actors) will surely become household names with this series. Like some of my other favorite FX shows (The Americans, AHS, FARGO, You're the Worst), \"Atlanta\" is gritty, in-your-face and realistically captures a slice of life rarely shown on TV. \"Atlanta\" is an adult show about climbing the ranks into the rap scene, and surviving the neighborhood, that shouldn't be missed."
    },
    {
      "username": "raypang",
      "userUrl": "https://www.imdb.com/user/ur80319568",
      "reviewLink": "https://www.imdb.com/review/rw8485789",
      "warningSpoilers": false,
      "date": "25 August 2022",
      "rate": "10",
      "helpful": "17 out of 21 found this helpful.",
      "title": "Best ever TV show",
      "content": "Easily the best show around now, and it's one of the best TV show of all time! Darius character is so good that he should have his own show. Never thought Glover would come this far after Community. Even though that was a very good show too."
    },
    {
      "username": "chocolatepopcorn",
      "userUrl": "https://www.imdb.com/user/ur123310965",
      "reviewLink": "https://www.imdb.com/review/rw8538564",
      "warningSpoilers": false,
      "date": "12 September 2022",
      "rate": "9",
      "helpful": "16 out of 21 found this helpful.",
      "title": "Groundbreaking And Immaculate",
      "content": "Season 1 & 2 could be slow but still broke some barriers that other shows couldn't, or at least got the ball rolling. Season 3 is just breaking boundaries every episode, though, as if the 4th wall doesn't even exist and it's just something for us to look at like a gallery of art. Donald Glover crafts each narrative and episode to where it feels like commentary and provides a change in the conversation among racism, segregation, equality and more. Season 3 really plays to all the characters' advantages though, we really start to see more of them in deeper ways than we have before & my personal favorite character is Lakeith Stanfield's. This show is one that challenges you but still makes things fun along the way, it'll have you thinking about what deeper meanings are in the show and if you caught them all. We truly need more than 4 season to this show. It's just too good to let go so soon."
    },
    {
      "username": "coles_notes",
      "userUrl": "https://www.imdb.com/user/ur105348721",
      "reviewLink": "https://www.imdb.com/review/rw8214090",
      "warningSpoilers": false,
      "date": "7 June 2022",
      "rate": "9",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Perfect",
      "content": "Finally finished up through season four and my review hasn't changed other than bumping the score, this show is perfect, I love it. Also further props to Hiro Murai's directing and Brian Tyree Henry, I hadn't appreciated his acting as Paper Boi enough. From the mind of Donald Glover and directed by Hiro Murai, Atlanta follows the early career of Earnest Marks as he tries to manage up and coming rapper, and his cousin, Paper Boi. I knew of Childish Gambino's Freaks and Geeks long before I knew of the show the song was named after or had ever seen Community, so this series has for a long time been high on my watchlist. And I have to say wow, this series is so well done, never really has a strong overarching plot other than the slow comeuppance of Paper Boi's career, each episode telling a new unique story about the wild and often unnerving world of Glover's Atlanta. Justin Bieber even shows up in this show too, wow he really is everywhere. I would highly recommend this show for anyone a fan of Glover, Zazie Beetz is a dream as always and I really liked LaKeith Stanfield's character Darius. If this seems like a show you'd like and haven't seen it please go watch it. It's incredible. I'm so excited to see what Glover comes up with next."
    },
    {
      "username": "Bubb_Merica",
      "userUrl": "https://www.imdb.com/user/ur121064918",
      "reviewLink": "https://www.imdb.com/review/rw5909354",
      "warningSpoilers": false,
      "date": "15 July 2020",
      "rate": "10",
      "helpful": "39 out of 50 found this helpful.",
      "title": "THIS Show...",
      "content": "This show was the first in years where I planned to watch it when it aired despite me setting the DVR to record it. The same way people geeked out on Game of Thrones, this show just struck my funny bone with the obvious situational humor and subded dark tones intertwined in it all. The basis of the show is about a upcoming rapper set in modern day Atlanta and his cousin who wants to be his manager. But what makes the show great is how the story is told. The storyline works like a drama but the perspective works like a comedy. This is much like the movie and show Parenthood; the storyline is not really a comedy but misery loving company can be funny. Atlanta works out the same way with the plot filtered through the lens of dark humor seen in Married with Children and Curb Your Enthusiasm. The show is well acted, well written, surprising, engaging, and most important it is funny."
    },
    {
      "username": "TheUglyCasanova",
      "userUrl": "https://www.imdb.com/user/ur15579011",
      "reviewLink": "https://www.imdb.com/review/rw3539713",
      "warningSpoilers": false,
      "date": "7 September 2016",
      "rate": "9",
      "helpful": "67 out of 105 found this helpful.",
      "title": "Very promising, great acting.",
      "content": "As a long time fan of Glover from Community, his stand up comedy, and even to his rapping (Childish Gambino), I was of course excited to see this show.As a pale white guy from Ohio, I still found the show to be very enjoyable and with the way they did the first episode, it has a monumental chance to be successful. Darius cracks me up with how he thinks, he's exactly the type of quirky person you need in this type of show (assuming I know how it's going to continue), but he is basically the Daryl of Walking Dead. Everyone will love him and if he ever dies the show may go downhill without him.Since I've been a fan of Donald since Community I may be a tiny bit biased, but he yet again seems to be a superb actor and I already felt connected to him and wanting him to 'win'.It's no surprise Donald will turn this into an amazing series because he is a great actor and writer.Just please don't kill Darius. How will we ever have rat phones if he dies?"
    },
    {
      "username": "kylebrown0209",
      "userUrl": "https://www.imdb.com/user/ur22249556",
      "reviewLink": "https://www.imdb.com/review/rw8504102",
      "warningSpoilers": false,
      "date": "1 September 2022",
      "rate": "8",
      "helpful": "11 out of 16 found this helpful.",
      "title": "Interesting show",
      "content": "As someone who is new to this series I can say wow this TV series is really cool and awesome and really goes for it for it This show perfectly Shows racism And what it's like and it does a very good job by thatI I also think that this series this is funny and I can't wait to watch more of it and it's interesting interesting and if you like Danny Glover then you will like the series Highly recommend this series. It also can be funny and realistic and relatible at times but that's thekind of series I am interested in And it's also just a very funny show. And Danny Glover and the cast are great You totally buy him as this character."
    },
    {
      "username": "nicegirlinla-45690",
      "userUrl": "https://www.imdb.com/user/ur69098608",
      "reviewLink": "https://www.imdb.com/review/rw3555863",
      "warningSpoilers": false,
      "date": "1 October 2016",
      "rate": "10",
      "helpful": "123 out of 156 found this helpful.",
      "title": "Cant get enough...",
      "content": "The dialogue, the script, the chemistry of the characters. Amazing. The dynamic of the characters is broad. I feel invested. I actually feel like it's true life. I'm from Baltimore and it reminds me of conversations with friends when I was younger. Darius is seriously my favorite character... everything about the guy. I'm still laughing about the gun shop scene. (dont think that's considered a spoiler)That was my review but they are making me fill more space. Just know that this is my FIRST review.. I think they deserve it.Not many words here but I rave about this show to everyone.Here's my 10th line."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw8682000",
      "warningSpoilers": false,
      "date": "18 November 2022",
      "rate": "9",
      "helpful": "4 out of 5 found this helpful.",
      "title": "unique voice",
      "content": "In Atlanta, Earnest 'Earn' Marks (Donald Glover) struggles to make money to pay the rent. Even his parents are tired of him looking to borrow. He's back with Van (Zazie Beetz) and their daughter Lottie. When his cousin Alfred Miles aka rapper Paper Boi (Brian Tyree Henry) gets a small hit, he decides to work as his manager. Darius (Lakeith Stanfield) is Paper Boi's hanger-on.This is a unique quirky take on the Black-American experience. It's surreal at times. It's never safe. It is ambitious. Sometimes, it goes down some fresh paths that have never been traveled. These are compelling characters. All four leads are amazing. I love Brian Tyree Henry. Donald Glover has such confidence in his ideas. It's great TV."
    },
    {
      "username": "slider9499",
      "userUrl": "https://www.imdb.com/user/ur31869722",
      "reviewLink": "https://www.imdb.com/review/rw8159169",
      "warningSpoilers": false,
      "date": "20 May 2022",
      "rate": "5",
      "helpful": "39 out of 67 found this helpful.",
      "title": "Worst Season Ever",
      "content": "This season is the worst yet. The stories make absolutely no sense. They meander endlessly without any cohesive narrative or character arc and their is simply no payoff in the end. Several of the shows I actually stopped watching after about 30 minutes or so because of these reasons. There is pushing the envelope, but when one pushes the envelope just for the sake of shock or buzz - then they've gone too far. I'll give one more episode and if it continues in this manner, then it is time to bail on Atlanta and go to another city."
    },
    {
      "username": "essamgouda",
      "userUrl": "https://www.imdb.com/user/ur79291087",
      "reviewLink": "https://www.imdb.com/review/rw8560002",
      "warningSpoilers": false,
      "date": "22 September 2022",
      "rate": "10",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Dark Comedy",
      "content": "Atlanta is the definition of dark comedy, the joke is too funny but after a couple of seconds it turns out to be a sad reflection of reality...Drama aside, the direction/sound production/visuals/acting/costumes and overall vibe is immaculate ! One of my fav of all time, I highly recommend it.I am glad that Donald Glover decided to stop at 4 seasons when something is that magical an end date is always a smart move.I love all the characters but Darius (LaKeith) is out of this world, his looks alone kills me !Overall 10/10 show highly recommended s3 and s4 are straight 10s for me and s1 and s2 are as good too !"
    },
    {
      "username": "Hazu29",
      "userUrl": "https://www.imdb.com/user/ur24712037",
      "reviewLink": "https://www.imdb.com/review/rw8078013",
      "warningSpoilers": false,
      "date": "21 April 2022",
      "rate": "4",
      "helpful": "36 out of 66 found this helpful.",
      "title": "1st season was great",
      "content": "1st season was great, 2nd was okay. Now is time to stop. Can't watch the 3rd season, it's just the same lazy modern writing from 2017-2022 all over again. It's a shame, 1st season writing and direction was amazing."
    },
    {
      "username": "asc85",
      "userUrl": "https://www.imdb.com/user/ur1147015",
      "reviewLink": "https://www.imdb.com/review/rw8144525",
      "warningSpoilers": false,
      "date": "15 May 2022",
      "rate": "1",
      "helpful": "57 out of 126 found this helpful.",
      "title": "The Pitch For Season 3",
      "content": "I have this great idea for Season 3. For our first 10 episodes of Season 3, we will have not one, not two, not three, but four episodes that have absolutely nothing to do with the show that we've been doing for the last two seasons. We'll just hire a whole new set of actors and actresses to do one-off episodes on issues that I have very strong feelings about. And since everyone considers me a genius, you're going to go along with it. I mean, when you watch \"The Marvelous Mrs. Maisel,\" all the shows are about that. Same thing with a show like \"Stranger Things.\" That's boring. Let's do it my way. Trust me. It'll kill."
    },
    {
      "username": "max-p-m-reznik",
      "userUrl": "https://www.imdb.com/user/ur50143336",
      "reviewLink": "https://www.imdb.com/review/rw8388284",
      "warningSpoilers": true,
      "date": "31 July 2022",
      "rate": "9",
      "helpful": "15 out of 21 found this helpful.",
      "title": "Would not watch season 3",
      "content": "The first two seasons of this show are great, probably some of the most original stuff I've ever seen, no other show seems to match the vibe of this one. Season 3 has a pretty different format with a lot of episodes that are unrelated to the characters, the first episode was great as it still felt like it took place in Glover's Atlanta but none of the others weren't great. Additionally season 3 had a terrible finale with nearly no setup for the next season and none of the main characters."
    },
    {
      "username": "interestingstuff",
      "userUrl": "https://www.imdb.com/user/ur61866820",
      "reviewLink": "https://www.imdb.com/review/rw8072747",
      "warningSpoilers": false,
      "date": "19 April 2022",
      "rate": "",
      "helpful": "23 out of 48 found this helpful.",
      "title": "So many fake 10/10 reviews don't make this a great show",
      "content": "I really tried to like this show because I like Donald Glover as an actor and I fell for all these fake reviews posted giving it 10/10s calling it an excellent show but after watching the first 5 episodes, I had to stop watching or I'd die from boredom. I've never seen anything so boring in my life and I've watched grass grow before. Literally NOTHING happens. The entire episode is Donald Glover walking around in slow motion, staring at the camera all sad and saying maybe 2-3 sentences at most and before anything happens the episode is already finished.It looks like they wanted to make a show but didn't have any ideas but they decided to film anyways and ended up spending all their money on advertisement and posting fake reviews instead of coming up with an interesting story. This also explains why the show has a 8.7 average rating but the average drops to 7.0 if you look at Top 1000 reviewers.Seinfeld: \"A show about nothing.\" Atlanta: \"A show where nothing interesting happens.\""
    },
    {
      "username": "latinfineart",
      "userUrl": "https://www.imdb.com/user/ur48961864",
      "reviewLink": "https://www.imdb.com/review/rw8293026",
      "warningSpoilers": false,
      "date": "2 July 2022",
      "rate": "6",
      "helpful": "8 out of 14 found this helpful.",
      "title": "Very, very good",
      "content": "The first season was absolutely brilliant. Some of the most clever satire I have seen in a long time. Season two has lost me. Not funny, not clever, and not entertaining. What happened? Have not seen season 3 yet, but I hear it is not as good as the very mediocre season 2? Huh?"
    },
    {
      "username": "ozmartian77",
      "userUrl": "https://www.imdb.com/user/ur99147533",
      "reviewLink": "https://www.imdb.com/review/rw8103580",
      "warningSpoilers": false,
      "date": "30 April 2022",
      "rate": "8",
      "helpful": "16 out of 26 found this helpful.",
      "title": "Season 3 is meh with a capital MEH",
      "content": "Loved this show but Season 3 is a snorefest. The \"message\" is obvious and laid bare within 5 mins, its all about white vs black racial stereotypes etc. Yeh, we get it. Its been done.Now, add to all that, side story episodes without any main characters. These would be fine if profound enough but they are not. They are boring duds, going for surreal art over what the heck is currently going on, which is often nothing. Or, spend 10 mins alone to push a simple point home re racial stuff.I'm done."
    },
    {
      "username": "harrylosborne",
      "userUrl": "https://www.imdb.com/user/ur56820537",
      "reviewLink": "https://www.imdb.com/review/rw6697113",
      "warningSpoilers": false,
      "date": "15 March 2021",
      "rate": "8",
      "helpful": "11 out of 20 found this helpful.",
      "title": "This is America",
      "content": "Atlanta is so strange: whilst it is fundamentally from a world I have no real experience or knowledge of, the comedic and emotional links draw similarities from the lives of people every day.Yes, there are elements unique to only the neighbourhoods of Atlanta and other diversified American cities, but Donald Glover's writing is strong enough that nobody is left behind. Inadvertently, this show will have tackled racism, poverty, relationship issues and fame in the space of half an hour, whilst you're still under the impression you are watching an irreverent comedy.By taking its source material from real-life but utilising heightened reality, each episode can stand alone (examples: black Justin Bieber), giving them unique identities and rewatchability.Backed by Glover's intimate knowledge of hip-hop and rap (I mean the man is literally a Grammy winner) and some refreshingly excellent cinematography around Georgia, the story progresses and weaves deep character stories.Atlanta is also blessed cast-wise: all of the main players (Bryan Tyree Henry, LaKeith Stanfield, Zazie Beetz) have gone on since to act at new heights, and Stanfield is at his comedic and quirky best here.Atlanta might not be a show you would click on normally, but as someone in the same boat, you would be missing out not to give Atlanta a shot."
    },
    {
      "username": "callumganderson",
      "userUrl": "https://www.imdb.com/user/ur96080733",
      "reviewLink": "https://www.imdb.com/review/rw8254402",
      "warningSpoilers": false,
      "date": "19 June 2022",
      "rate": "9",
      "helpful": "10 out of 14 found this helpful.",
      "title": "This show is funny as hell",
      "content": "Great comedy and interesting as well. Never get bored watching this show like the office. Recommend as a light watch, something you don't invest to much into and can watch while doing something else."
    },
    {
      "username": "thePopcornExplorer",
      "userUrl": "https://www.imdb.com/user/ur36922988",
      "reviewLink": "https://www.imdb.com/review/rw8798866",
      "warningSpoilers": false,
      "date": "14 January 2023",
      "rate": "7",
      "helpful": "2 out of 2 found this helpful.",
      "title": "The art of the surreal",
      "content": "Atlanta is without any doubt a masterfully crafted piece of television, it's original, bold and most importantly it depicts and raises relevant critical topics in today's society most obvious one being racism. With that being said I can't say I thoroughly enjoyed the entire show.I do have a few issues with it but I would say that they more on a personal level rather than the fault of the actual show, for starters I am not the biggest of fan of the surrealism approach on movies and TV shows, the earlier seasons did manage to find great balance between \"reality\" and the surreal events that almost served as the humoristic aspect of the show, however in later seasons this becomes less subtle and the show dives way more into straight out weird episodes that seem to serve no greater purpose.I could still be all right with the weird episodes since there are many others that do find a way of mixing several genres like suspense, horror, comedy and drama all packed into the same and actually working, but there is another critical aspect that doesn't allow me to connect to the show which is the target audience. Of course this sounds ridiculous and I know the most well known movies and TV shows come for the most part from America (even though we are seeing a change in this trend fortunately) but there are some like Atlanta which without a doubt will have way more impact so a subtract of the spectators and I feel that as someone who is not American there were tons and tons of moments, references and even entire episodes that went straight through my head.Of course if it was just small references you can check them and look for their meaning, but the show already has layers of meaningful messages through surrealism adding this just makes even less engaging for me, the best example I can give is the barber shop episode, I read afterward several analysis and interpretations and it became clear that if you have had specific experiences in the American context you would get the episode easily and that was not at all the case for me.Donald Glover still shows he has some amazing writing / directing skills so hats off to that!"
    },
    {
      "username": "runamokprods",
      "userUrl": "https://www.imdb.com/user/ur6981752",
      "reviewLink": "https://www.imdb.com/review/rw3773963",
      "warningSpoilers": false,
      "date": "6 August 2017",
      "rate": "",
      "helpful": "10 out of 20 found this helpful.",
      "title": "I liked it, and I'm open to coming to love it",
      "content": "Created by and starring Donald Glover (who also directed 2 episodes) I wasn't quite as blown away as most of the critics were. (I think I was over-hyped by the time I watched) but I certainly liked it. For me, the 1st season was pretty uneven from episode to episode, but the stronger episodes are terrific. It's got more of an old style sitcom approach in terms of structure (not at all tone!); the focus week to week isn't on a big serialized overall story. Each episode has it's own self contained tale within the larger basic set up. Personally, I generally like longer story arcs better even in dramady (e.g. Transparent, etc), but the show is so fresh, odd and creative in other ways that it helps balance out that drawback. Often very funny and sometimes much larger than life, it also has moments of real emotion and subtlety. The acting is strong all around, and it's a world we haven't seen much before – struggling working class African-Americans friends in their mid/late 20s who are not the tough street kids and dealers from the hood we've seen so many times, but who certainly aren't safe and middle-class either. There are guns and drugs but also jobs and kids and record deals. There's real violence but a lot more threatened violence and posturing. And all the characters and relationships are complicated and multi-leveled. Glover in particular creates a wonderful protagonist in Earnest. Super smart, open hearted, extremely witty, dead-pan, ambitious but also vulnerable, emotionally confused and a little lost. He's hard not to love and to occasionally be frustrated by (in a good way). When the story of the week gives the show enough meat to build 30 minutes on, it can be great. When the story is thin, more of a one line joke, the episode tends to feel thin too, sometimes starting to feel padded and/or straining for humor. But it's an impressive start, when it works it successfully combines social satire and comedy with real feelings and surreal story touches, and feels like one of those shows that has room to grow and deepen in future seasons."
    }
  ],
  "errorMessage": ""
}