{
  "imDbId": "tt3920596",
  "title": "Big Little Lies",
  "fullTitle": "Big Little Lies (TV Series 2017–2019)",
  "type": "TVSeries",
  "year": "2017",
  "items": [
    {
      "username": "ReganRebecca",
      "userUrl": "https://www.imdb.com/user/ur2257003",
      "reviewLink": "https://www.imdb.com/review/rw3677741",
      "warningSpoilers": true,
      "date": "4 April 2017",
      "rate": "8",
      "helpful": "120 out of 143 found this helpful.",
      "title": "Big Little Show",
      "content": "This really is the golden age of TV as proved by the fact that this mini-series stars three incredible actresses (two of them Oscar winners) giving some of their career best performances). Big Little Lies takes a hard look at the lives of women in the wealthy mostly white suburb of Monterey, where you're no one if you don't have a beach front property and where everyone hides their secrets so that they don't risk anyone seeing that their lives are a facade. The three women at the centre of the story are Madeleine Mackenzie an A-type mostly stay at home mom on her second husband (Reese Witherspoon), her beautiful best friend Celeste (Nicole Kidman) and the town newcomer that Mackenzie adopts into their life, Jane Chapman (Shailene Woodley), a 20-something young mom who moved to the town for the schools and doesn't really fit in. Each woman is hiding a huge secret, but eventually the secrets come out and the women find solace and comfort leaning on each other for support. There is a lot more than that (the show opens with the bold claim that there was a murder, and most of the show is a flash backward showing how that murder came to be), but a lot of the central mysteries aren't mysteries at all. The editing, costuming and acting choices deeply hint at the answers to every mystery, so by the time the finale rolls around and everything is revealed it's not so much an \"Ah ha!\" moment as an \"Ahhhhh\" moment as you realize with satisfaction that the build up was good and everything makes sense. The best part of this is seeing all the actors doing amazing work. Nicole Kidman walks away with the show giving a devastating performance. Laura Dern provides levity and Robin Weigert, as Celeste's therapist, may not be a \"name\" actress, but she brings so much to her scenes. A wonderful show."
    },
    {
      "username": "DukeEman",
      "userUrl": "https://www.imdb.com/user/ur0179443",
      "reviewLink": "https://www.imdb.com/review/rw3642749",
      "warningSpoilers": false,
      "date": "20 February 2017",
      "rate": "9",
      "helpful": "166 out of 206 found this helpful.",
      "title": "Very creative with a sinister wit and some intelligence...",
      "content": "I almost gave up on it after the lacklustre and uncreative beginning, but then the clever structure and intricate story-line kicked-in, followed by the interesting characters who are slowly taking form. Their purpose and meaning to the unfolding mystery is becoming evident and damn fascinating. All thanks to the performers who have already got this perfectly down-pat in the first episode, and that allows the story to take shape and meaning for the remainder of the series.So far this series is more than about fighting mums and a \"who-done-it\". What is so prevalent in the first episode is the underlying themes of parenthood, marital relationships and school-mom politics. I'm sure the writers will have more juice to add as the series progresses.For now, it's the mystery that has got me hooked. And to heighten my viewing pleasure, it is the development of the characters and the conflicts surrounding them, and also within, that makes me want to watch it that little bit longer, hopefully right to the very end of the series that is slowly peeling away the hypocrisy and the nastiness of an affluent suburb/town!"
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw3850808",
      "warningSpoilers": true,
      "date": "5 November 2017",
      "rate": "8",
      "helpful": "28 out of 34 found this helpful.",
      "title": "there's something wrong with our lives",
      "content": "The main thing that I took from \"Big Little Lies\" is that we lead screwed-up existences. The protagonists have what look like the ideal lives, but it becomes clear that something is amiss. Whether it's a lack of fulfillment or something worse, all three are living a lie. The story gets told as a series of interviews to let the viewer know that the action is building up to something big.I wouldn't call this the best miniseries that HBO has made (remember, this is the channel that gave us \"The Sopranos\" and \"Game of Thrones\"), but serves as a good look at the problems that arise when we try to ignore the simmering tensions amid a supposedly perfect world. The morally complex characters make this a series for the ages. Not to mention that it's a treat to see Reese Witherspoon play a role markedly different from the ones with which she's usually associated. And as someone who went to grad school in Monterey, it was neat to see some of my old haunts.I recommend it, and I hope to read the book, and that Jean-Marc Vallée (of \"Dallas Buyers Club\" and \"Wild\") keeps turning out work like this."
    },
    {
      "username": "korereviews",
      "userUrl": "https://www.imdb.com/user/ur53364452",
      "reviewLink": "https://www.imdb.com/review/rw4028780",
      "warningSpoilers": true,
      "date": "10 January 2018",
      "rate": "9",
      "helpful": "106 out of 132 found this helpful.",
      "title": "Big payoff at the end",
      "content": "Like a lot of viewers, there were moments when I thought I'd had enough of this show: bitchy rich women who never seem to notice how privileged they all are - for the first few episodes, you just want them all to die. But there is always something to keep you just intrigued enough to watch another episode. And then you start to see what's really going on behind the scenes of their perfect lives, and it all starts to make sense. You realize that that feeling of annoyance at all the characters was actually a clever ploy: you're meant to hate them all at the start. But by the end, you actually really like them all, and that's some clever writing, I must say. Trust me, the last few episodes fly by, and the ending is everything you'd want it to be. Clever, genuinely touching, and very satisfying without ever feeling predictable. This is a well-crafted and very well told story. Plus the cinematography and music are hypnotically beautiful. Definitely worth your time."
    },
    {
      "username": "mrocco-1",
      "userUrl": "https://www.imdb.com/user/ur8567550",
      "reviewLink": "https://www.imdb.com/review/rw3676823",
      "warningSpoilers": false,
      "date": "2 April 2017",
      "rate": "10",
      "helpful": "155 out of 197 found this helpful.",
      "title": "Wow, just wow!",
      "content": "I have HBO and NEVER watch it. I'm not a big fan of what apparently many other people like to watch. But when I saw the commercial for this I was intrigued. I never heard of the book, but highly respect many of the lead actors so I figured if they were involved it couldn't totally suck. Speaking of suck, I was completely sucked in on the first episode. I don't know why but I found this show completely and utterly mesmerizing, all the way down to the music and cinematography. Everyone involved in this from top to bottom hit it out of the park. I've never experienced this kind of life-style (ie mommy, daddy and school politics) but one of my clients who watches the show and lives in the general area said they nailed her experience when her kids were in school. To put in perspective, I usually work when I watch TV, don't really even 'watch' it, just background noise. Not only did I stop working to watch this, I ran the last few minutes in slow motion to fully absorb what happened. I can't give a show much more praise than that! You'll understand the scene I'm talking about when you see it."
    },
    {
      "username": "Imme-van-Gorp",
      "userUrl": "https://www.imdb.com/user/ur76725747",
      "reviewLink": "https://www.imdb.com/review/rw8778909",
      "warningSpoilers": false,
      "date": "4 January 2023",
      "rate": "10",
      "helpful": "13 out of 14 found this helpful.",
      "title": "Amazing story with exceptional execution!",
      "content": "Season One: 9.5/10Themes: Drama, Crime, Mystery, Mothers, Spousal Abuse, Bullying, Murder, Sexual Assault, Sisterhood, Marriage, Childcare, Cheating & Gossip.Review: Honestly, this was absolutely brilliant. Not only was the acting superb, the plot, suspense-building and pacing were also phenomenal. I would say this whole thing was very close to perfection. The characters were all extremely interesting and intriguing as well; they each have their own story to tell, and none fail to deliver in telling them. Another thing I really liked was the bond these women formed with each other: it was so natural and impactful. I loved everything about this series. It was so good.Top five characters: 1) Madeline Martha Mackenzie, 2) Renata Klein, 3) Jane Chapman, 4) Ed Mackenzie and 5) Ziggy Chapman."
    },
    {
      "username": "gradyharp",
      "userUrl": "https://www.imdb.com/user/ur3223254",
      "reviewLink": "https://www.imdb.com/review/rw3681390",
      "warningSpoilers": true,
      "date": "9 April 2017",
      "rate": "10",
      "helpful": "25 out of 32 found this helpful.",
      "title": "The wonder and brilliance of a female acting ensemble",
      "content": "The wonder of brilliance of a female acting ensemble David E Kelley, in adapting Liane Moriarty's novel). Has written another stunning series - a seven episode series for television that among other attributes pulls together four of our most brilliant contemporary actresses in a story that is one of the better explorations and defenses of feminism. Reese Witherspoon, Nicole Kidman, Shailene Woodley and Laura Dern remind us of how powerful artists can create both a polished performance and a raw statement about the feminine side of living, especially under the very keen direction of Jean-Marc Vallée.While Madeline (Resse Witherspoon) and Celeste (Nicole Kidman) take in Monterrey single mom Jane (Shailene Woodley) none of them realizes how the arrival of Jane and her inscrutable little boy Ziggy (Iain Armitage) will affect them all. The story is complex, told in flashbacks, but concentrates on the role of parents and the role of women frustrated by their pasts and their confinement to being stay at home moms. Previous affairs, the initial accusation that Ziggy abused the fellow first grade daughter of the wealth Renata Klein (Laura Dern), the gossip of a small town and the escalating tensions of a murder in the background - a death that is unknown until the final episode, make this a gripping proscenium arch for some of the finest acting on television. The husbands/men are well portrayed by Alexander Skarsgård (brilliant) James Tupper, Jeffrey Nordling, Adam Scott, and Santiago Cabrera, and the young actors who portray the first graders are all excellent as is Abigail (Kathryn Newton) the teenage daughter of Madeline, and the important role of Bonnie (Zoë Kravitz). It is all about the dangerous little lies we tell ourselves in all aspects of life just to survive. Brilliant!"
    },
    {
      "username": "sambucaaaa",
      "userUrl": "https://www.imdb.com/user/ur57629641",
      "reviewLink": "https://www.imdb.com/review/rw5959183",
      "warningSpoilers": false,
      "date": "1 August 2020",
      "rate": "8",
      "helpful": "28 out of 32 found this helpful.",
      "title": "Loved season 1...",
      "content": "... but didn't understand the purpose of season 2 at all.I was on the edge of my seat for a great part of season 1, yet was on my phone for most of season 2. The whole Zoe Kravitz storyline is so slow and, frankly, uninteresting. I was glad to know, going into season 2, that we would see more of her but I just couldn't get attached to her character. It's just doom and gloom, nothing happens. I could not get to care about Laura Dern and Reese Witherspoon's issues either. Nicole Kidman's performance remains my favorite, as in season 1. She's magnificent. Meryl Streep is great in her role but again, the storyline just falls flat in my opinion.The 8 stars are for season 1, I binged it all in ONE day. The performances were ourstanding. I really wish they would have stopped there. I genuinely don't understand the purpose of season 2."
    },
    {
      "username": "vladimir-janic",
      "userUrl": "https://www.imdb.com/user/ur27223086",
      "reviewLink": "https://www.imdb.com/review/rw3649582",
      "warningSpoilers": false,
      "date": "27 February 2017",
      "rate": "10",
      "helpful": "319 out of 378 found this helpful.",
      "title": "Exquisite",
      "content": "Exquisite. 'Big Little Lies' takes us to an incredible journey with its emotional and intriguing storyline. The characters are so thoroughly and thoughtfully developed. Nicole Kidman, Reese Witherspoon, Shailene Woodley, Laura Dern gave breathtaking performances. Directing, screenplay, photography, everything is brilliantly done. I would deeply recommend it."
    },
    {
      "username": "phd_travel",
      "userUrl": "https://www.imdb.com/user/ur22484170",
      "reviewLink": "https://www.imdb.com/review/rw3744036",
      "warningSpoilers": true,
      "date": "2 July 2017",
      "rate": "10",
      "helpful": "25 out of 34 found this helpful.",
      "title": "A MUST WATCH. Hands down the best mini series for a long time",
      "content": "Haven't been so caught up and involved in a series for a long time. It grips you from episode 1 and will keep you enthralled till the nail biting party - the most exciting party I've ever seen on TV. This is not just a more edgy Desperate Housewives, it's in another class. The complex story is amazingly well crafted. It starts of with an accusation by a first grade girl against a boy for choking her. Things then spiral from there. The injustice keeps you riled up. But it isn't just a story about helicopter parenting and the insanity of modern parents. It's also about marriage remarriage rape abuse and infidelity. Every theme is so well handled one feels like you haven't seen it better done before. The characters are complex. It's not just serious issues all the way, there are some unexpectedly funny moments too with the auctioning of the virginity and the broken penis. Right decision not to reveal who died till the end. Could have had a few less flashes of the interviews of secondary cast with police. Cleverly, the various mysteries keep you guessing till the end who dies who is the killer and who is the bully.Casting is spot on. Shailene Woodley is so convincing as down trodden rape victim single mom that I don't even think of her as acting, she is just that person. Reese Witherspoon builds on the hyper Election and Legally Blonde manic busybody that she is good at. Perfect person for the role. Nicole Kidman is also ideally cast - beautiful and a victim of abuse at the same time. Her scenes with the therapist are some of the best on screen and are worthy of at least a nomination at the Emmys. But it's her scenes of abuse with the Jekyll and Hyde husband played by Alexander Skarsgard that are shocking and terrifying. He is so scary. Laura Dern deserves kudos for playing the most hateful character on TV since Anna Gunn's Skylar on Breaking Bad. She made me jump up with anger at her character. Zoe Kravitz plays a second wife quite refreshingly. This is not just a woman's show. The male characters are critical to the story and quite sympathetically portrayed. Reese's husbands are played by Adam Scott as a long suffering good guy and he is spot on as is James Tupper as husband number one. The little boy playing Shailene's kid is so angelic looking that the unfair accusation at him makes one's blood boil. By casting such good actresses as the leads the viewer very quickly identifies and roots for the characters.The houses of the characters are quite stunning and so is the Big Sur coastline and the Monterey area scenery. The ending is satisfying and complete and feel good - it's the perfect finish to a perfect mini series. Brilliant."
    },
    {
      "username": "StregaAsuka",
      "userUrl": "https://www.imdb.com/user/ur24596530",
      "reviewLink": "https://www.imdb.com/review/rw3692531",
      "warningSpoilers": true,
      "date": "24 April 2017",
      "rate": "8",
      "helpful": "26 out of 33 found this helpful.",
      "title": "Big Little Masterpiece",
      "content": "The main lure for this show is its casting. Big names as Kidman, Witherspoon, Woodley, Dern All of them brilliant actresses that we have the opportunity to work together in this show and where they succeed in their portrayals of mothers living the so perfect life, or so it seems.Considering that the show is based on a novel, and said novel was not a novel to forget, we are lucky to enjoy a good plot. Through all seven episodes we follow the lives of these women. At the beginning of episode 1 we know that somebody died. But that's it. We don't know who, where and when. It's as the episodes flow, that we learn things about each one of the characters, and that their lives are not as perfect as they seem to an outsider.For some, the pace might seem a bit slow. As the story seems to not advance at some point, but please keep watching it, as it is indeed advancing, but maybe not at the speed that you were expecting too. Everything has a reason to be and a place to happen and in order to know the real truth you need to watch it until the end.As said, the female cast is amazing. Not always are we given the chance to witness so much good work together and such good actresses together that are given a good story to tell. This is it. And not only are the female on the leading roles simply wonderful, but as are also their male counterparts in a more supporting role. Because we mustn't forget, the women are the focus of this show.If you want to enjoy a real drama which you could feel related too (minus the death part, that's it), don't think twice and binge watch it because you won't regret it and you will be left wondering if there is going to be a season two.."
    },
    {
      "username": "padawanmovies",
      "userUrl": "https://www.imdb.com/user/ur71028976",
      "reviewLink": "https://www.imdb.com/review/rw3734471",
      "warningSpoilers": true,
      "date": "19 June 2017",
      "rate": "8",
      "helpful": "19 out of 24 found this helpful.",
      "title": "Wowza!",
      "content": "HBO is probably one of my favorite networks, Sunday is one of the best nites of TV in my opinion (GoT, VEEP, Silicon Valley). I saw a few previews of this show and didn't think much of it. Boy was I mistaken! I'm a fan of Whitherspoon, Skaarsgard, and a few other of the actors. Prior to this I wasn't a fan of Kidman(changed my mind after seeing To Die For for the 1st time recently, one of the best roles of her career) and my verdict's still out on Kravitz & Woodley but again I have to say everyone brought there A game to this project... I really enjoy the premise of \"everyone has baggage & problems\" regardless of social status or $. My few critiques of the show would be the pace of the finale, Laura Dern's angry white woman thing was a little annoying but she did a good job, what the heck did Jane do to afford a decent looking house & car on a part time income, and y did Whitherspoon's 6 yr old have the musical library and attitude of someone ten times her age?? Other than those minute criticisms again I gotta say this is a show worth watching with a final twists that blew my socks off! ANOTHER GREAT ONE HBO"
    },
    {
      "username": "Nightmarelogic",
      "userUrl": "https://www.imdb.com/user/ur49080270",
      "reviewLink": "https://www.imdb.com/review/rw3716079",
      "warningSpoilers": false,
      "date": "25 May 2017",
      "rate": "9",
      "helpful": "30 out of 41 found this helpful.",
      "title": "Amazing show about women",
      "content": "I don't usually like HBO shows. I am one of the few people who doesn't care for Game of Thrones. However I found this HBO short series incredibly compelling. Nichole Kidman in breathtaking playing an abused wife. Some of the best scenes of the show are when her character Celeste is talking to the psychiatrist who bluntly removes the vale of naivety from her eyes. Also giving incredible performances are Reese Witherspoon and Laura Dern playing very similar women who took very different paths snipping at each other for minor trivialities. Finally there is Shailene Woodley who plays the young single mother who arrives in town which sets off a string of events that forces her to defend a son she isn't sure is innocent and confront her own dark past.This is a show that might seem like it is made for women but I would recommend it to anyone who likes a good drama and this is a very good drama."
    },
    {
      "username": "Reno-Rangan",
      "userUrl": "https://www.imdb.com/user/ur20327151",
      "reviewLink": "https://www.imdb.com/review/rw3762888",
      "warningSpoilers": true,
      "date": "24 July 2017",
      "rate": "",
      "helpful": "14 out of 18 found this helpful.",
      "title": "A BIG mystery surrounding LITTLE kids and their LIES.",
      "content": "I neither read the book nor I knew the story. So this was a surprise mini-series. As far I've heard, this one was the finest adaptation. The best ever cast and the episodes were well split with each one had a great opening and the ending. The suspense kept me alive till the final episode, final scene. Meanwhile, I made some guesses, but most of them did not happen. In my opinion, it should have been a feature film duology. Then it would have been considered one of the best film series, as well as mystery film. And the Oscars, Golden Globes would have poured in. Now it got record 14 Emmy nods and I'm waiting for the result.Well, it all started as a normal drama about the mothers whose children are in the same school, same class. The real story kick starts when a boy who recently moved into the town with his single mother was accused of bullying a classmate girl. So the mothers gang splits up on that issue, but it seems not much affecting the children, particularly those are involved in the it. As the story progresses and episodes to come, lots of mysteries revealed about those mothers and their personal life, as well as the recent past secrets. But how it all comes to end truck with a sudden and powerful twist.All the big screen stars foraying into the small screen were the big advantage. That's why I said it should have been a big screen film. Each one had scope for their roles. It was well balanced characters, that makes hard to predict any one direction where the story could head. From the director of 'Dallas Buyers Club' and many awesome flicks. I hope it returns for the second season, which has a very slim chance. From the locations to the musics, I loved it. A perfect mystery-drama. Everyone should see this, even if those are not into the television series. I almost gave it out of out.9.5/10."
    },
    {
      "username": "kate-911-98899",
      "userUrl": "https://www.imdb.com/user/ur50303219",
      "reviewLink": "https://www.imdb.com/review/rw3723580",
      "warningSpoilers": true,
      "date": "4 June 2017",
      "rate": "10",
      "helpful": "38 out of 50 found this helpful.",
      "title": "This personally impacted me, and I thank you",
      "content": "Wow. Way to execute an original murder mystery! There is so much more than meets the eye with this mini series, and it impacted me personally.Each actress brought so much to the table, but I will say that Nicole Kidman's character Celeste was the one that I personally was drawn to the most.Kidman is in a toxic and abusive relationship with her husband Perry. Every time the show cut to their relationship, I was totally riveted.For the first episode, you're sort of just like, yeah, we get it, they have a perfect looking relationship. They're both incredibly good looking and rich people who have sex all the time in this perfect city. They have perfect little twin boys.Then, you find out what's happening behind closed doors: In the first episode, Perry, the husband, grabs Kidman's arm in a violent manner. I was so shocked I literally gasped and shouted something at the screen. It scared my dog, lol.Their relationship feels so real though, because it's not just some stupid \"cookie cutter\" abusive relationship. They have passionate sex after he hurts her, and he seems like a wonderful father. He's not always mean, which makes it hard for her to be honest with herself about what's going on.Having been in a similarly toxic relationship, this is very accurate. It's incredibly confusing and hard to recognize abuse, which is what Celeste went through. I really appreciate the care they put into the writing and portrayal of this particular story line, as I think it could be very helpful for people to see.The rest of the story lines were incredibly well done too. Although the women gossip and plot and scheme to win over whatever opponent she personally is facing, that's not really what this is about, especially the ending.Although you wouldn't personally do a great deal of things the characters do, especially if you're a rational human being, you can understand the women's plights to protect and care for their children and survive in this crazy social environment.Even Madeline, Reese Witherspoon's character, was hilariously unhinged and competitive at times, but I could still sort of root for her. We all know women exactly like Madeline! The ending isn't about women hurting each though, and it was beautiful. I was so excited to find out who was killed and why! I couldn't wait! I honestly had no idea who it was going to be and why, and I honestly didn't see it coming.For what it's worth, I left the toxic relationship I was in, and have been much happier with my stable and non violent boyfriend, so it's possible to find love after someone convinces you it's not possible."
    },
    {
      "username": "FlorisV",
      "userUrl": "https://www.imdb.com/user/ur2388003",
      "reviewLink": "https://www.imdb.com/review/rw3838942",
      "warningSpoilers": false,
      "date": "23 October 2017",
      "rate": "8",
      "helpful": "18 out of 23 found this helpful.",
      "title": "Sharp, funny, highly entertaining motherly crises",
      "content": "This was an an excellent show, I don't normally watch this type of show (except Desperate Housewives back in the day) but with this type of wit I can't put it down. I kept watching the whole series within one weekend, it was very addictive. If you like to watch a well written satirical view on the lies underneath the seemingly picture perfect lives in Suburbia, like in American Beauty and Desperate Housewives, you just may like this. It's not a pure comedy but there's plenty of hilarious dialog and situations. Some may feel women are being ridiculed and parodied too much, not portrayed realistically and yes the show exaggerates, but it wouldn't be so painfully funny if there wasn't at least some truth to the daily war zone these mothers create for each other (and then there's of course the marital problems as well).The show is not too predictable and keeps you guessing who got killed in the end. It features accomplished Hollywood actresses that have all earned their stripes: Witherspoon, Kidman, Woodley. They don't let down here. The male actors are less known but equally excellent.The way of filming and structuring is also fresh. HBO drama at it's finest."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw6265402",
      "warningSpoilers": true,
      "date": "13 November 2020",
      "rate": "10",
      "helpful": "18 out of 25 found this helpful.",
      "title": "The acting is simply brilliant...and you cannot top watching.",
      "content": "I must warn you a bit about \"Big Little Lies\". This HBO series is very violent, with vivid depictions of domestic violence. It also has a lot of nudity. In addition, the show is one that EASILY could overwhelm viewers...especially those who have been through domestic violence and rape. A tough show....but an amazing one. So, if you're inviting over Father O'Malley or your mother, you might just want to think twice about seeing this one with them.The series is about three women in Monterey, California....a very expensive and swank town to live in, though not quite as swank as nearby Carmel. Regardless, the story centers on these women as well as the men and children in their lives...as well as their 'friends' who are mostly social climbing back-biters and jerks. I could say so much more about the plot....suffice to say it's exquisitely written and has some of the best acting you could ever hope to see. Considering there are tons of reviews about the series already, I'll just end it here with an admonition to watch the show...it's sensational.By the way, as a trained therapist and ex-social worker, I really appreciated the writing of this show. Their portrayal of domestic violence as well as how a therapist works were both spot on and I appreciate this."
    },
    {
      "username": "KathleenK22",
      "userUrl": "https://www.imdb.com/user/ur64257146",
      "reviewLink": "https://www.imdb.com/review/rw3655862",
      "warningSpoilers": false,
      "date": "7 March 2017",
      "rate": "10",
      "helpful": "35 out of 50 found this helpful.",
      "title": "Beautiful views, magnificent acting and intriguing story",
      "content": "The view was the first thing that captured me. Reece Witherspoon's acting was the next to wow me. The characters are not one dimensional but complicated and unfolding as each episode progresses. I have watched three now so think I have a good handle on why this show is attracting such good scores. Issues such as marriage and relationships are depicted and they are not always innocent or good. Who has been murdered? It is fun guessing! Families are also complicated and parents struggle with children whether they are small or teenagers. The topics and themes are ones that everyone can relate to. There is not one example of poor acting! If you like mysteries this one is for you but also for people who like romances or breathtaking scenery and well acted stories. Everything is not spelled out for you which is refreshing from an American production. Later....after watching the whole series....loved this show! Female power wins the day! That is what I took away from this show. It contained surprises and twists to satisfy the viewer. It built the tension gradually each episode and I was waiting each week to see where it was taking me. The characters were amazing and the storyline was gripping! When women support and care for each other life is good."
    },
    {
      "username": "lisajoy1960",
      "userUrl": "https://www.imdb.com/user/ur17358854",
      "reviewLink": "https://www.imdb.com/review/rw3656017",
      "warningSpoilers": false,
      "date": "7 March 2017",
      "rate": "10",
      "helpful": "182 out of 223 found this helpful.",
      "title": "Just Watch It - It's The Show You've Been Waiting For...",
      "content": "HBO's new limited series, Big Little Lies, is simply outstanding in every way. The casting is perfect - Reese Witherspoon as Madeline, Shailene Woodley as Jane and the always fabulous Nicole Kidman as Celeste - three very different mothers residing in the ultra wealthy enclave of Monterey, California. The show also focuses on Renata (a tense, edgy performance by Laura Dern and the families of the four main characters. James Tupper, Adam Scott, James Nordling turn in great performances, but Alexander Skaarsgard really shines as Perry, Celeste's troubled, volatile husband. Without giving away the plot, the show is part is Desperate Housewives part Knots Landing and part Secrets and Lies in that it's a drama, a soap and a mystery, all rolled into one delicious package. Beautiful cinematography and an amazing soundtrack add to the enjoyment. I just binge-watched the first three episodes and they left me wanting more. Just watch it - it's the show you've been waiting for..."
    },
    {
      "username": "dilarakarakuzu",
      "userUrl": "https://www.imdb.com/user/ur17362445",
      "reviewLink": "https://www.imdb.com/review/rw3742389",
      "warningSpoilers": false,
      "date": "30 June 2017",
      "rate": "9",
      "helpful": "178 out of 214 found this helpful.",
      "title": "Amazing soundtrack",
      "content": "What attracted me to this TV series was the cast, however even after watching the first episode i was fascinated by its soundtrack. I feel lucky to discover some great piece of music. The acting was also impressive as one can guess. I would highly recommend it, you won't regret it :)"
    },
    {
      "username": "bjarias",
      "userUrl": "https://www.imdb.com/user/ur48560127",
      "reviewLink": "https://www.imdb.com/review/rw3645196",
      "warningSpoilers": false,
      "date": "21 February 2017",
      "rate": "10",
      "helpful": "57 out of 92 found this helpful.",
      "title": "...not to get ahead of ourselves.. but this could be very, very good..",
      "content": ".. it's only one episode in, but it has all the makings of a really great series.. irregardless of all the big names involved on the acting side (and there are quite a few).. the writing and script is so strong that you loose sight of all their very familiar faces.. when scripts are weak then you're looking at the actors and all you get caught up in are the Hollywood personalities.. this one is different, and it's a credit to all involved.. it's sooo early and anything can happen but it feels as if it has the potential to be one the more outstanding TV series productions in quite some time.. keeping them all together for multiple seasons not an issue right now, but you've already got to be thinking (as the plot is clear).. who's first to go.. Have now watched all seven episodes... In June Nicole Kidman will be fifty years old... and one of the most gorgeous half-century old women on the planet.. (and one of the best actors). In this production she is just absolutely amazing, and I'm looking forward to watching it all again sometime. If you are only going to be doing one season.. this production is a benchmark. There are no flaws.. every detail down to the background music is exemplary..(and all the children are incredible). The leads were executive producers and they should most definitely reunite their production companies again very soon.. if they have not already. Don't even think about passing on this outstanding miniseries.. you'll be highly rewarded."
    },
    {
      "username": "danew13",
      "userUrl": "https://www.imdb.com/user/ur3443744",
      "reviewLink": "https://www.imdb.com/review/rw3689754",
      "warningSpoilers": true,
      "date": "21 April 2017",
      "rate": "6",
      "helpful": "76 out of 123 found this helpful.",
      "title": "See the First Episode and the Last and that's about it",
      "content": "Big Little Lies has a stellar cast in domestic drama mainly about affluent parents living in ultra wealthy and liberal Monterey, Ca. Yet it plays out in seven episodes a bit like the old and much longer Twin Peaks series...beginning with a possible murder. So if you don't have the time you just have to see the first episode and the last one to see who did it and you really won't miss much.You see for a cast including Reese Witherspoon, Shailene Woodley,Laura Dern, Nicole Kidman and Adam Scott, there really isn't that much for such a group to work with scriptwise. They are bored homemakers with strained marriages and manic kids. Even though the are only seven episodes,it really rather boring after three...the most disturbing aspect of the show is amount of physical abuse handed out to Kidman by her screen husband. I can't see why the great scores here on IMDb."
    },
    {
      "username": "Alexander_Blanchett",
      "userUrl": "https://www.imdb.com/user/ur1296280",
      "reviewLink": "https://www.imdb.com/review/rw3680821",
      "warningSpoilers": false,
      "date": "8 April 2017",
      "rate": "9",
      "helpful": "20 out of 29 found this helpful.",
      "title": "Oh those desperate, desperate housewives",
      "content": "What a blast. I treat this film like a feature film, which is the way director Jean-Marc Vallée shot it anyway. This is one of the best \"Films\" to explore he superficial rich community housewives / moms in a very deep and honest way. It gives them a certain background. All this mixed with a nice murder mystery which is kind of original because you do not only not know who is the murderer but also you don't know who is the victim until the very last act. While that final twist becomes more and more obvious during the course of the \"film\" it still leaves you with a certain satisfaction. The acting is tremendous. And if that truly would be a feature film it would be a frontrunner for next years Oscars. Reese Witherspoon gives the performance of her career. I have never been a fan of her but after this I very well could become one. She did some great work on \"Wild\" and some reasonably good jobs in \"Election\", \"Walk the Line\" and even \"Legally Blonde\" but what she did here tops everything she did before. And she was so perfect for that role. The rest of the cast stands out as well. Nicole Kidman was tremendous and really adopts her character in such a smooth way. Shailene Woodley stands out once again and has many scene stealing moments. Laura Dern was good, although overacted at times but just like Witherspoon she was born to play that role. I loved Zoe Kravitz and Adam Scott was convincing in a for him unusual role. Alexander Skarsgard had his moments as well and from the kids Iain Armitage really delivers in a for a child difficult role. Fantastic soundtrack and many nice little twists in-between. Highly recommend it to watch all 7 episodes in a row if you got the time."
    },
    {
      "username": "matthijsalexander",
      "userUrl": "https://www.imdb.com/user/ur64604296",
      "reviewLink": "https://www.imdb.com/review/rw3666329",
      "warningSpoilers": true,
      "date": "20 March 2017",
      "rate": "8",
      "helpful": "30 out of 45 found this helpful.",
      "title": "Absolutely one of the best",
      "content": "Without too many spoilers, this is absolutely one of the best series this year 16/17.Next to This is Us, extremely high quality acting, an intriguing story that captivates. I love how they mix it all up, and how they keep on twisting left and right, confusing you ever so gently and politely.It seems very well thought through and well written. Each character has a distinct personality, or more. Dept is acted out very well. Personalities diverse and just the right mix. Its great to see that it is still possible to produce a great show. 8 All the way. Equal quality as The Night Of and This Is Us.Highly recommended!"
    },
    {
      "username": "raycliff_review",
      "userUrl": "https://www.imdb.com/user/ur30567772",
      "reviewLink": "https://www.imdb.com/review/rw3655782",
      "warningSpoilers": false,
      "date": "6 March 2017",
      "rate": "10",
      "helpful": "58 out of 79 found this helpful.",
      "title": "High marks 3 episode in",
      "content": "The first episode established the potential here right from the start. Writing, casting and acting is on point. Great to see the cast of actors that were pulled together for the project. I hope to see more of this type of 7 episode story telling where you can get such a deep cast of actors to commit to a project that they might not otherwise be able to do if it were a typical ongoing series. In my opinion some great flawed and complex characters that aren't always what they seem on the surface (who is). In particular Reese, Nicole and Dern. In addition, the child actors, who's characters really need to support the story line, really bring it as well. Check it out."
    }
  ],
  "errorMessage": ""
}