{
  "imDbId": "tt3920596",
  "title": "Big Little Lies",
  "fullTitle": "Big Little Lies (TV Series 2017–2019)",
  "type": "TVSeries",
  "year": "2017",
  "language": "en",
  "titleInLanguage": "Big Little Lies (TV series)",
  "url": "https://en.wikipedia.org/wiki/Big_Little_Lies_(TV_series)",
  "plotShort": {
    "plainText": "Big Little Lies is an American drama television series based on the 2014 novel of the same name by Liane Moriarty. Created and written by David E. Kelley, it aired on HBO from February 19, 2017, to July 21, 2019, encompassing 14 episodes and two seasons. Originally billed as a miniseries, Jean-Marc Vallée directed the first season, while Andrea Arnold directed the second season.\r\nBig Little Lies stars Reese Witherspoon, Nicole Kidman, Shailene Woodley, Laura Dern, and Zoë Kravitz as five women in Monterey, California, who become embroiled in a murder investigation. Alexander Skarsgård, Adam Scott, James Tupper and Jeffrey Nordling also feature in supporting roles. For the second season, Meryl Streep joined the main cast while Kathryn Newton and Iain Armitage were upgraded following their appearances in recurring capacities.\r\nThe series has received critical acclaim, particularly for its writing, directing, acting, production values, cinematography and soundtrack. The first season received 16 Primetime Emmy Award nominations and won eight, including Outstanding Limited Series, a directing award for Vallée, and acting awards for Kidman, Skarsgård, and Dern. The trio also won Golden Globe Awards in addition to a Best Miniseries or Television Film win for the series. Kidman and Skarsgård also received Screen Actors Guild Awards for their performances.",
    "html": "<p>Big Little Lies is an American drama television series based on the 2014 novel of the same name by Liane Moriarty. Created and written by David E. Kelley, it aired on HBO from February 19, 2017, to July 21, 2019, encompassing 14 episodes and two seasons. Originally billed as a miniseries, Jean-Marc Vallée directed the first season, while Andrea Arnold directed the second season.</p><p>Big Little Lies stars Reese Witherspoon, Nicole Kidman, Shailene Woodley, Laura Dern, and Zoë Kravitz as five women in Monterey, California, who become embroiled in a murder investigation. Alexander Skarsgård, Adam Scott, James Tupper and Jeffrey Nordling also feature in supporting roles. For the second season, Meryl Streep joined the main cast while Kathryn Newton and Iain Armitage were upgraded following their appearances in recurring capacities.</p><p>The series has received critical acclaim, particularly for its writing, directing, acting, production values, cinematography and soundtrack. The first season received 16 Primetime Emmy Award nominations and won eight, including Outstanding Limited Series, a directing award for Vallée, and acting awards for Kidman, Skarsgård, and Dern. The trio also won Golden Globe Awards in addition to a Best Miniseries or Television Film win for the series. Kidman and Skarsgård also received Screen Actors Guild Awards for their performances.</p>"
  },
  "plotFull": {
    "plainText": "Big Little Lies is an American drama television series based on the 2014 novel of the same name by Liane Moriarty. Created and written by David E. Kelley, it aired on HBO from February 19, 2017, to July 21, 2019, encompassing 14 episodes and two seasons. Originally billed as a miniseries, Jean-Marc Vallée directed the first season, while Andrea Arnold directed the second season.\r\nBig Little Lies stars Reese Witherspoon, Nicole Kidman, Shailene Woodley, Laura Dern, and Zoë Kravitz as five women in Monterey, California, who become embroiled in a murder investigation. Alexander Skarsgård, Adam Scott, James Tupper and Jeffrey Nordling also feature in supporting roles. For the second season, Meryl Streep joined the main cast while Kathryn Newton and Iain Armitage were upgraded following their appearances in recurring capacities.\r\nThe series has received critical acclaim, particularly for its writing, directing, acting, production values, cinematography and soundtrack. The first season received 16 Primetime Emmy Award nominations and won eight, including Outstanding Limited Series, a directing award for Vallée, and acting awards for Kidman, Skarsgård, and Dern. The trio also won Golden Globe Awards in addition to a Best Miniseries or Television Film win for the series. Kidman and Skarsgård also received Screen Actors Guild Awards for their performances.\r\nCast and characters\r\nMain\r\nReese Witherspoon as Madeline Mackenzie\r\nNicole Kidman as Celeste Wright\r\nShailene Woodley as Jane Chapman\r\nAlexander Skarsgård as Perry Wright, Celeste's husband\r\nAdam Scott as Ed Mackenzie, Madeline's husband\r\nZoë Kravitz as Bonnie Carlson, Nathan's wife\r\nJames Tupper as Nathan Carlson, Madeline's ex-husband and Bonnie's husband\r\nJeffrey Nordling as Gordon Klein, Renata's husband\r\nLaura Dern as Renata Klein\r\nKathryn Newton as Abigail Carlson, Madeline and Nathan's daughter (season 2; recurring, season 1)\r\nIain Armitage as Ziggy Chapman, Jane's son (season 2; recurring, season 1)\r\nMeryl Streep as Mary Louise Wright, Perry's mother (season 2)\r\nRecurring\r\nIntroduced in season 1\r\nDarby Camp as Chloe Adaline Mackenzie, Madeline and Ed's daughter\r\nCameron and Nicholas Crovetti as Josh and Max Wright, Celeste and Perry's sons\r\nChloe Coleman as Skye Carlson, Bonnie and Nathan's daughter\r\nIvy George as Amabella Klein, Renata and Gordon's daughter\r\nLarry Sullivan as Oren Berg, Bernard's husband\r\nMerrin Dungey as Detective Adrienne Quinlan\r\nSantiago Cabrera as Joseph Bachman, a theater director\r\nKelen Coleman as Harper Stimson, an Otter Bay Elementary mother\r\nP. J. Byrne as Warren Nippal, the principal of Otter Bay Elementary\r\nGia Carides as Melissa, an Otter Bay Elementary mother\r\nRobin Weigert as Dr. Amanda Reisman, Perry and Celeste's therapist\r\nLarry Bates as Stu, an Otter Bay Elementary father\r\nNelly Buchet as Juliette, Renata and Gordon's nanny\r\nSarah Sokolovic as Tori Bachman, Joseph's wife\r\nKathreen Khavari as Samantha, an Otter Bay Elementary mother (season 1)\r\nDavid Monahan as Bernard, Oren's husband (season 1)\r\nSarah Baker as Thea Cunningham, an Otter Bay Elementary mother (season 1)\r\nSarah Burns as Gabrielle, an Otter Bay Elementary mother (season 1)\r\nHong Chau as Jackie, an Otter Bay Elementary mother (season 1)\r\nJoseph Cross as Tom, Madeline and Celeste's favorite café owner (season 1)\r\nVirginia Kull as Emily Barnes, the children's elementary-school teacher (season 1)\r\nIntroduced in season 2\r\nDouglas Smith as Corey Brockfield, Jane's love interest and co-worker at Monterey Bay Aquarium\r\nCrystal R. Fox as Elizabeth Howard, Bonnie's mother\r\nMartin Donovan as Martin Howard, Bonnie's father\r\nDenis O'Hare as Ira Farber, Mary Louise's lawyer\r\nBecky Ann Baker as Marylin Cipriani, the judge in Celeste and Mary Louise's custody case\r\nMo McRae as Michael Perkins, a new second-grade teacher at Otter Bay Elementary\r\nPoorna Jagannathan as Katie Richmond, Celeste's lawyer\r\nEpisodes\r\nSeason 1 (2017)\r\nSeason 2 (2019)\r\nProduction\r\nDevelopment\r\nActresses and producers Nicole Kidman and Reese Witherspoon were announced to have optioned the screen rights to Liane Moriarty's novel Big Little Lies on August 6, 2014, less than a month after the book's publication. The two of them were expected to develop the project as a film in which they would star and act as executive producers, sharing the latter duty with Bruna Papandrea and Per Saari; Moriarty was also expected to produce. In November of that year, the actresses announced the format's shift into that of a limited-run television series written by David E. Kelley. In May 2015, HBO gave the series a production order and Kelley was announced to join the team of executive producers. That October, Jean-Marc Vallée was reportedly in talks with the project's team to handle directing of the first episode and potentially others. His involvement with all seven episodes was confirmed almost two months later. The series' release date of February 19, 2017, was unveiled in November 2016.\r\nOriginally conceived and billed as a miniseries, a potential new season of Big Little Lies was discussed by the series' audience and the media. In July 2017, two weeks after the project and its cast and crew received several nominations for the 69th ceremony of the Primetime Emmy Awards, Witherspoon stated: \"As of right now, I think it's pretty whole. I feel really good about where it is, and if this is all it ever was, it's a beautiful thing we all accomplished together\". However, in the wake of the nominations, HBO revealed that a second season was possible, and that Moriarty had been asked to write a story for it. During a April 2017 interview, Vallée came out strongly against the idea of producing a second season: \"There's no reason to make a season two. That was meant to be a one-time deal, and it's finishing in a way where it's for the audience to imagine what can happen. If we do a season two, we'll break that beautiful thing and spoil it.\" When he and the series won several accolades at the 69th ceremony of the Primetime Emmy Awards, the director changed his mind: \"It'd be great to reunite the team and to do it. Are we going to be able to do it, altogether? I wish.\"\r\nIn December 2017, HBO officially renewed the series for a seven-episode second season to be written by Kelley, directed by Andrea Arnold, based on a new novella by Moriarty, and with Vallée remaining an executive producer. The announcement of the second season, and specifically its timing, enraged producers of rival shows that were competing for award nominations in the limited series categories, particularly since it was made after voting for the Critics' Choice Television Award and Golden Globe Award were over. Due to this, the Producers Guild of America restarted voting for the 2018 ceremony of their award show, reclassifying the show from a limited series to a drama series. The second season premiered on June 9, 2019.\r\nControversy\r\nIn July 2019, it was reported by IndieWire that director Andrea Arnold lost creative control after filming had completed, and it was given to season 1 director Jean-Marc Vallée in an attempt to unify the style between the seasons. Arnold was initially promised by HBO that the show would be done in her vision, including post-production, and was unaware that Vallée would edit the footage she had shot. Once Vallée completed his work on Sharp Objects, he took over the editing process along with his own editorial team in Montreal. HBO also ordered 17 more days of additional photography, to be filmed by Arnold, but overseen by Vallée. Significant reworking of the episodes also took place, where episodes were shortened. In response, HBO programming president Casey Bloys stated, \"There's a lot of misinformation around that subject\" and \"the director typically does not have final creative control\". Bloys clarified that Vallée came back to \"hone the episodes\" after being asked by the entire producing team, including Reese Witherspoon and Nicole Kidman, and that they were clear with Arnold about how the process would work from the start.\r\nCasting\r\nAlongside the initial announcement of the production's development, Kidman and Witherspoon were reported to also star in the adaptation. In December 2015, Shailene Woodley, Adam Scott, Laura Dern, and Zoë Kravitz were announced to have been cast in lead roles, with Kathryn Newton in a recurring one. The following month, Alexander Skarsgård, James Tupper, and Jeffrey Nordling joined the starring cast, while Santiago Cabrera, P. J. Byrne, Kelen Coleman, Sarah Burns, Darby Camp, Cameron and Nicholas Crovetti, Ivy George, Chloe Coleman, Virginia Kull, Sarah Baker, Kathreen Khavari, Larry Bates, Hong Chau, Gia Carides, Merrin Dungey, Larry Sullivan, David Monahan, and Iain Armitage landed supporting roles. The latter one was cast in the role of Woodley's character's son.\r\nFollowing the confirmation of a sophomore season, Meryl Streep was announced in January 2018 to have joined the starring cast in the role of Skarsgård's character's mother. In February, Woodley, Dern, Kravitz, Scott, Tupper, Nordling and Armitage were confirmed to be returning. That March, Douglas Smith was cast in a recurring role. In April, it was reported that Crystal Fox joined the main cast alongside returners Newton and Sokolovic, while Mo McRae and Martin Donovan joined the recurring cast alongside returners Weigert and Dungey. However, only Newton received main billing; Fox and Sokolovic's appearances were credited as recurring. Byrne was announced alongside newcomer Poorna Jagannathan in May, followed by Denis O'Hare in June.\r\nFilming\r\nFor the first season, Vallée shot the series with an Arri Alexa digital camera and preferred using natural lighting and handheld shooting style to allow actors to move freely around the set. Several scenes were filmed on location in the Monterey Peninsula, Big Sur, Pacific Grove, and Carmel Highlands.\r\nSoundtrack\r\nABKCO Records released soundtracks for the first and second seasons on March 31, 2017, and July 19, 2019, respectively.\r\nRelease\r\nBroadcast\r\nOn February 7, 2017, the series held its official premiere at the TCL Chinese Theatre in Los Angeles, California. Internationally, the series premiered on February 20, 2017, in Australia on Showcase, and on March 13, 2017, in the United Kingdom and Ireland on Sky Atlantic.\r\nMarketing\r\nOn October 16, 2016, HBO released the first teaser trailer for the series. On December 5, 2016, HBO released a full length trailer for the series.\r\nHome media\r\nThe first season was released on Blu-ray and DVD on August 1, 2017. The second season was released on January 7, 2020, on DVD and manufacture-on-demand Blu-ray by Warner Home Entertainment and Warner Archive Collection respectively.\r\nReception\r\nCritical response\r\nOn the review aggregation website Rotten Tomatoes, the first season holds a 93% \"certified fresh\" rating with an average rating of 8 out of 10 based on 199 reviews. The website's critical consensus reads, \"Bitingly funny and highly addictive, Big Little Lies is a twisty, thrilling, enlightening ride led by a first-rate cast.\" Metacritic, which uses a weighted average, assigned the first season a score of 75 out of 100, based on 42 critics, indicating \"generally favorable reviews\". Time magazine listed Big Little Lies as one of its top ten television shows of 2017.\r\nOn Rotten Tomatoes, the second season holds an 86% \"certified fresh\" rating with an average rating of 7.7 out of 10 based on 265 reviews. The website's critical consensus reads, \"Gorgeous and gripping, Big Little Lies' second season doubles down on the dark humor and gives its impressive cast even more juicy drama to chew on – especially an excellent Meryl Streep.\" On Metacritic, the season has a score of 82 out of 100, based on 36 critics, indicating \"universal acclaim\". Ben Travers of IndieWire wrote a positive review giving it a \"B+\" grade, concluding that Season 2 is a \"wholly different beast\" and \"doesn't feel like a necessary addition so much as an enjoyable epilogue\", yet it is \"still very, very good\".\r\nRatings\r\nSeason 1\r\nSeason 2\r\nAccolades\r\nFuture\r\nHBO president Casey Bloys said a third season of the show was \"not realistic\" due to scheduling the show's actors, but mentioned that the network is more than willing to greenlight it if the cast is able to work out their schedules. In October 2020, Nicole Kidman revealed during a press interview for The Undoing that author Liane Moriarty is writing the plot for a potential third season and that the cast and crew are excited to reunite for it. In a November 2022 interview with GQ, Zoë Kravitz confirmed the series would not return for a third season because of the death of director Jean-Marc Vallée.",
    "html": "<p>Big Little Lies is an American drama television series based on the 2014 novel of the same name by Liane Moriarty. Created and written by David E. Kelley, it aired on HBO from February 19, 2017, to July 21, 2019, encompassing 14 episodes and two seasons. Originally billed as a miniseries, Jean-Marc Vallée directed the first season, while Andrea Arnold directed the second season.</p><p>Big Little Lies stars Reese Witherspoon, Nicole Kidman, Shailene Woodley, Laura Dern, and Zoë Kravitz as five women in Monterey, California, who become embroiled in a murder investigation. Alexander Skarsgård, Adam Scott, James Tupper and Jeffrey Nordling also feature in supporting roles. For the second season, Meryl Streep joined the main cast while Kathryn Newton and Iain Armitage were upgraded following their appearances in recurring capacities.</p><p>The series has received critical acclaim, particularly for its writing, directing, acting, production values, cinematography and soundtrack. The first season received 16 Primetime Emmy Award nominations and won eight, including Outstanding Limited Series, a directing award for Vallée, and acting awards for Kidman, Skarsgård, and Dern. The trio also won Golden Globe Awards in addition to a Best Miniseries or Television Film win for the series. Kidman and Skarsgård also received Screen Actors Guild Awards for their performances.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Reese Witherspoon as Madeline Mackenzie</li><li>Nicole Kidman as Celeste Wright</li><li>Shailene Woodley as Jane Chapman</li><li>Alexander Skarsgård as Perry Wright, Celeste's husband</li><li>Adam Scott as Ed Mackenzie, Madeline's husband</li><li>Zoë Kravitz as Bonnie Carlson, Nathan's wife</li><li>James Tupper as Nathan Carlson, Madeline's ex-husband and Bonnie's husband</li><li>Jeffrey Nordling as Gordon Klein, Renata's husband</li><li>Laura Dern as Renata Klein</li><li>Kathryn Newton as Abigail Carlson, Madeline and Nathan's daughter (season 2; recurring, season 1)</li><li>Iain Armitage as Ziggy Chapman, Jane's son (season 2; recurring, season 1)</li><li>Meryl Streep as Mary Louise Wright, Perry's mother (season 2)</li></ul><h4>Recurring</h4><h4>Introduced in season 1</h4><ul><li>Darby Camp as Chloe Adaline Mackenzie, Madeline and Ed's daughter</li><li>Cameron and Nicholas Crovetti as Josh and Max Wright, Celeste and Perry's sons</li><li>Chloe Coleman as Skye Carlson, Bonnie and Nathan's daughter</li><li>Ivy George as Amabella Klein, Renata and Gordon's daughter</li><li>Larry Sullivan as Oren Berg, Bernard's husband</li><li>Merrin Dungey as Detective Adrienne Quinlan</li><li>Santiago Cabrera as Joseph Bachman, a theater director</li><li>Kelen Coleman as Harper Stimson, an Otter Bay Elementary mother</li><li>P. J. Byrne as Warren Nippal, the principal of Otter Bay Elementary</li><li>Gia Carides as Melissa, an Otter Bay Elementary mother</li><li>Robin Weigert as Dr. Amanda Reisman, Perry and Celeste's therapist</li><li>Larry Bates as Stu, an Otter Bay Elementary father</li><li>Nelly Buchet as Juliette, Renata and Gordon's nanny</li><li>Sarah Sokolovic as Tori Bachman, Joseph's wife</li><li>Kathreen Khavari as Samantha, an Otter Bay Elementary mother (season 1)</li><li>David Monahan as Bernard, Oren's husband (season 1)</li><li>Sarah Baker as Thea Cunningham, an Otter Bay Elementary mother (season 1)</li><li>Sarah Burns as Gabrielle, an Otter Bay Elementary mother (season 1)</li><li>Hong Chau as Jackie, an Otter Bay Elementary mother (season 1)</li><li>Joseph Cross as Tom, Madeline and Celeste's favorite café owner (season 1)</li><li>Virginia Kull as Emily Barnes, the children's elementary-school teacher (season 1)</li></ul><h4>Introduced in season 2</h4><ul><li>Douglas Smith as Corey Brockfield, Jane's love interest and co-worker at Monterey Bay Aquarium</li><li>Crystal R. Fox as Elizabeth Howard, Bonnie's mother</li><li>Martin Donovan as Martin Howard, Bonnie's father</li><li>Denis O'Hare as Ira Farber, Mary Louise's lawyer</li><li>Becky Ann Baker as Marylin Cipriani, the judge in Celeste and Mary Louise's custody case</li><li>Mo McRae as Michael Perkins, a new second-grade teacher at Otter Bay Elementary</li><li>Poorna Jagannathan as Katie Richmond, Celeste's lawyer</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><style data-mw-deduplicate=\"TemplateStyles:r1152813436\">.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);clip-path:polygon(0px 0px,0px 0px,0px 0px);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px;white-space:nowrap}</style><span class=\"sr-only\">Overview of <i>Big Little Lies</i></span></caption><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 19, 2017</td><td style=\"padding:0 8px\">April 2, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 9, 2019</td><td style=\"padding:0 8px\">July 21, 2019</td></tr></tbody></table><h4>Season 1 (2017)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\"><i>Big Little Lies</i> season 1 episodes</span></caption><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#F1659B;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#F1659B;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#F1659B;width:23%\">Title</th><th scope=\"col\" style=\"background:#F1659B;width:14%\">Directed by</th><th scope=\"col\" style=\"background:#F1659B;width:28%\">Written by</th><th scope=\"col\" style=\"background:#F1659B;width:14%\">Original air date</th><th scope=\"col\" style=\"background:#F1659B;width:11%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Somebody's Dead\"</td><td style=\"text-align:center\"><span>Jean-Marc Vallée</span></td><td style=\"text-align:center\"><span>David E. Kelley</span></td><td style=\"text-align:center\">February 19, 2017</td><td style=\"text-align:center\">1.13</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #F1659B\">At an elementary school in <span>Monterey, California</span>, a murder occurs at a school fundraiser, but neither the victim nor the murderer is revealed. Flashing back to the first day of school, the families of five first-graders are introduced. Madeline Martha Mackenzie is a strong-willed and wealthy <span class=\"mw-redirect\">alpha female</span> in town who is struggling to cope with her ex-husband Nathan's marriage to a yoga instructor named Bonnie while also trying to build a relationship with her older daughter, Abigail. Madeline's friend, Celeste Wright, is a retired lawyer and the mother of twin sons, who are also beginning at the same school. Madeline and Celeste befriend Jane Chapman, a young single mother who moved to Monterey hoping to provide her son, Ziggy, with a better life. Amabella, the daughter of the equally wealthy and volatile Renata Klein, accuses Ziggy of attempting to choke her at school, which he denies. Celeste appears to have a very happy life with her husband Perry, but he is privately violent towards her.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Serious Mothering\"</td><td style=\"text-align:center\">Jean-Marc Vallée</td><td style=\"text-align:center\">David E. Kelley</td><td style=\"text-align:center\">February 26, 2017</td><td style=\"text-align:center\">0.56</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #F1659B\">Perry lashes out at Celeste when he discovers he missed orientation at the school, but she lets it slide. Jane looks for work with little success. Madeline goes on the warpath against Renata upon learning Ziggy was not invited to Amabella's birthday party. Madeline's husband, Ed, questions her devotion to him when she continues to complain about seeing Nathan with Bonnie all the time, and Madeline is further disturbed when Bonnie takes Abigail to <span>Planned Parenthood</span>. Nathan tries to come to a peaceful resolution with Ed about their parenting of Abigail, but Ed senses Nathan is trying to intimidate him, and stands firm. Madeline's younger daughter, Chloe, and Bonnie's daughter, Skye, attempt to mend the wounds between Ziggy and Amabella, but it leads to Ziggy kissing Amabella and causing an incident. The parents of the four children are called into the principal's office, leading Jane to have a flashback of an unwanted sexual encounter.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Living the Dream\"</td><td style=\"text-align:center\">Jean-Marc Vallée</td><td style=\"text-align:center\">David E. Kelley</td><td style=\"text-align:center\">March 5, 2017</td><td style=\"text-align:center\">1.04</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #F1659B\">Perry chokes Celeste when he believes she deliberately left him out of a family gathering; Celeste threatens to leave him. Renata's party for Amabella is a success, but she is ultimately upset when Madeline invited Amabella's closest friends and Ziggy to <span>Disney on Ice</span> on the same day. At therapy, Perry claims his outbursts are out of fear that Celeste does not love him, which Celeste attempts to deny. When Abigail's academic performance begins to decline, her guidance counselor suggests it is being caused by stress at home, so she decides to live with Nathan, much to Madeline's dismay. Jane gets Ziggy involved with more extracurricular activities and helps him construct a family tree for school with Madeline's help. However, Jane opposes Ziggy's insistence on putting his father's name on the tree, and she ultimately confides to Madeline that Ziggy was the result of rape by a man named \"Saxon Banks\", whom she has not seen since.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Push Comes to Shove\"</td><td style=\"text-align:center\">Jean-Marc Vallée</td><td style=\"text-align:center\">David E. Kelley</td><td style=\"text-align:center\">March 12, 2017</td><td style=\"text-align:center\">1.04</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #F1659B\">Abigail moves in with Nathan and Bonnie. Celeste legally represents Madeline and theater director Joseph Bachman in a meeting with the mayor regarding the controversial <i><span>Avenue Q</span></i>, and successfully persuades the Mayor to allow the play to proceed. In the process, Celeste realizes her desire to return to work. She asks her therapist Dr. Reisman how to best convince Perry, but Dr. Reisman is more concerned with why she is afraid to do so. At home, Perry tells Celeste not to attend any future meetings. When she refuses, he grabs her by the throat, but quickly relinquishes when one of their boys enters the room. Joseph and Madeline kiss, and they are revealed to have had an affair a year ago. Madeline locates a man online whom she believes to be Jane's rapist; she informs Jane and Celeste, and they plan to travel to <span class=\"mw-redirect\">San Luis Obispo</span> to confront him. Ms. Barnes, the kids' teacher, suspects Amabella is still being bullied. Despite Amabella's assertions that she and Ziggy are friends, Ms. Barnes convinces Jane to have Ziggy psychologically evaluated. The psychologist believes that Ziggy is innocent and may in fact be being bullied himself.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Once Bitten\"</td><td style=\"text-align:center\">Jean-Marc Vallée</td><td style=\"text-align:center\">David E. Kelley</td><td style=\"text-align:center\">March 19, 2017</td><td style=\"text-align:center\">1.17</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #F1659B\">Nathan spots Jane at the gun range and tells Madeline. Although Jane reassures Madeline that she carries a gun solely for its psychological benefits, Madeline begins to regret tracking down Saxon Baker, the man whom she believes to be Saxon Banks. Renata discovers a bite mark on Amabella's arm, but Amabella refuses to disclose the perpetrator. Renata assumes Ziggy is culpable, leading to a meeting between Jane and the school principal. Joseph is convinced Madeline still has feelings for him, but she maintains that their affair is over. While they argue, a teenage distracted driver crashes into their car; Madeline is uninjured while Joseph is hospitalized. The incident raises suspicion from both Ed and Joseph's wife, Tori. After one of Perry's violent episodes with Celeste again ends with aggressive sex, Dr. Reisman confronts Celeste with the belief that she is being abused. Celeste eventually reveals that she has previously feared for her life and had considered leaving Perry; Dr. Reisman urges her to do so. Jane secretly travels to San Luis Obispo to confront Saxon Baker, taking her gun with her.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Burning Love\"</td><td style=\"text-align:center\">Jean-Marc Vallée</td><td style=\"text-align:center\">David E. Kelley</td><td style=\"text-align:center\">March 26, 2017</td><td style=\"text-align:center\">1.39</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #F1659B\">Jane reveals to Madeline that she went to confront Saxon Baker, who turned out to be the wrong man; Madeline attempts to convince Jane to give up the search. Ms. Barnes relays to Jane that a petition has begun to have Ziggy suspended. Although Renata did not start it, Jane confronts her and accidentally gouges her eye. She later apologizes, realizing that they both want to protect their children; Renata forgives her. Celeste's therapist advises her to prepare to leave Perry by renting an apartment and disclosing the abuse to friends. Perry later tries to forcefully initiate sex with Celeste, who defensively fractures his penis with a tennis racket. Returning from the hospital, Perry tells Celeste that she is \"lucky\" that he did not kill her. The following day, Celeste begins looking for an apartment. At the opening night of <i>Avenue Q</i>, Tori confronts Madeline about having an affair with Joseph. Bonnie tells Nathan that Abigail is secretly planning on <span>auctioning her virginity</span> to raise money for <span>Amnesty International</span>. At their couples' dinner, the two reluctantly tell Madeline and Ed; Madeline furiously confronts Abigail, disclosing her affair in the process.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"You Get What You Need\"</td><td style=\"text-align:center\">Jean-Marc Vallée</td><td style=\"text-align:center\">David E. Kelley</td><td style=\"text-align:center\">April 2, 2017</td><td style=\"text-align:center\">1.86</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #F1659B\">Following another beating, Celeste decides to leave Perry the day after trivia night. Ziggy confesses to Jane that Max, one of Celeste's sons, was the student who choked Amabella. Jane woefully tells Celeste that her son is the bully; Celeste realizes that Max was emulating Perry's abuse. When preparing to leave for trivia night, Perry sees a text message on Celeste's phone from the landlady of her new apartment. He confronts her on the way to the party, but is interrupted by Renata. At the party, Celeste tells Renata that Max is Amabella's bully. Meanwhile, a drunken Madeline runs away during Ed's singing performance out of guilt about her affair. Jane goes after her and finds her atop stairs at the back of the venue, where Madeline tells Jane that she cheated on Ed. Renata also goes after them and apologizes to Jane for having targeted Ziggy. Celeste joins the women, followed by Perry. Bonnie follows them, having noticed Perry hurt Celeste, and watches the group from afar. Jane sees Perry and recognizes him as her rapist. Perry pleads with Celeste to come back home with him, and when she declines, he viciously attacks her. The group unsuccessfully fights Perry off until Bonnie rushes in and pushes him down the stairs, killing him. In police interviews, the women confirm that a fight with Perry happened, but claim he fell accidentally. Later, the five women and their children lounge at the beach, where Detective Quinlan continues to watch them.</td></tr></tbody></table><h4>Season 2 (2019)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\"><i>Big Little Lies</i> season 2 episodes</span></caption><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#94C1B7;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#94C1B7;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#94C1B7;width:23%\">Title</th><th scope=\"col\" style=\"background:#94C1B7;width:14%\">Directed by</th><th scope=\"col\" style=\"background:#94C1B7;width:28%\">Written by</th><th scope=\"col\" style=\"background:#94C1B7;width:14%\">Original air date</th><th scope=\"col\" style=\"background:#94C1B7;width:11%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"What Have They Done?\"</td><td style=\"text-align:center\"><span>Andrea Arnold</span></td><td style=\"text-align:center\"><i>Teleplay by</i> : <span>David E. Kelley</span><br><i>Story by</i> : David E. Kelley and <span>Liane Moriarty</span></td><td style=\"text-align:center\">June 9, 2019</td><td style=\"text-align:center\">1.42</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #94C1B7\">In the aftermath of Perry's death, Celeste, Madeline, Jane, and Renata try to move on with their lives, while Bonnie considers turning herself in to the police. It is the first day of second grade for the children and the five women reunite. Perry's mother, Mary Louise, who is staying with Celeste, begins asking questions about her son's death, and clashes with Madeline. Nathan worries about how distant Bonnie has been with him and asks Ed for help. Abigail decides she will not go to college, to Madeline's disapproval. At the beach, Corey, a co-worker of Jane's, asks her if she is one of the \"Monterey Five\". Jane tells the other women (apart from Bonnie) about this, and Renata assures them that the police have nothing. Celeste has nightmares about Perry and Mary Louise questions her about them.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Tell-Tale Hearts\"</td><td style=\"text-align:center\">Andrea Arnold</td><td style=\"text-align:center\"><i>Teleplay by</i> : David E. Kelley<br><i>Story by</i> : David E. Kelley and Liane Moriarty</td><td style=\"text-align:center\">June 16, 2019</td><td style=\"text-align:center\">1.47</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #94C1B7\">Celeste crashes her car while on <span class=\"mw-redirect\">Ambien</span>, with no recollection of what happened. A worried Nathan calls Bonnie's parents to town. Gordon is arrested for <span>insider trading</span> and <span class=\"mw-redirect\">stock fraud</span> by the <span class=\"mw-redirect\">FBI</span>. Mary Louise finds out that Perry has another son aside from Max and Josh. She refuses to believe that Perry raped Jane by <span>victim blaming</span> her. Madeline grounds Chloe after finding out that she told Max, Josh, and Ziggy that the three boys share the same father. Jane reluctantly tells Ziggy about how he is the product of a rape. Ed discovers Madeline's infidelity.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The End of the World\"</td><td style=\"text-align:center\">Andrea Arnold</td><td style=\"text-align:center\"><i>Teleplay by</i> : David E. Kelley<br><i>Story by</i> : David E. Kelley and Liane Moriarty</td><td style=\"text-align:center\">June 23, 2019</td><td style=\"text-align:center\">1.62</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #94C1B7\">Bonnie clashes with her mother and remembers traumatic incidents from her childhood. Amabella has an anxiety attack during a lesson about <span>climate change</span>. Renata hires a child psychologist and finds out Amabella is worried about the planet dying, her father going to jail, and Renata's mental state. Renata blames Gordon for it and confronts Principal Nippal and Mr. Perkins about teaching second graders about climate change. She also tells her husband to sell his expensive train set since they have lost all of their money. Mary Louise approaches Jane at work and requests for a paternity test be done, which Jane refuses. Mary Louise then lurks in the parking lot of Jane's apartment to take a look at Ziggy. She finds similarities between Ziggy and Perry's twin brother, who died as a child, but refuses to accept the fact that Perry was abusive and a rapist. To save their marriage, Madeline and Ed visit Celeste's therapist. During a parents meeting at Otter Bay Elementary, Madeline breaks down while speaking. Jane and Corey go on a date, but she is unable to be intimate with him.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"She Knows\"</td><td style=\"text-align:center\">Andrea Arnold</td><td style=\"text-align:center\"><i>Teleplay by</i> : David E. Kelley<br><i>Story by</i> : David E. Kelley and Liane Moriarty</td><td style=\"text-align:center\">June 30, 2019</td><td style=\"text-align:center\">1.61</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #94C1B7\">During a pumpkin-carving party at Madeline's house, Mary Louise turns up uninvited. Mary Louise gets an apartment in the same building as Jane, which Celeste deems overstepping her boundaries. When Mary Louise subtly insinuates that Perry was womanizing to seek refuge from Celeste, Celeste slaps her. The next day, over coffee with Celeste, Mary Louise admits her husband left her after the death of Perry's brother and that she deserved the blame. Mary Louise approaches lawyer Ira Farber to gain custody of her grandchildren, citing negligence by Celeste. Madeline and Ed's marriage continues to deteriorate. Renata and Gordon have a disastrous bankruptcy hearing when she refuses to co-operate. At Amabella's birthday party, Jane tells Corey about her rape, and Bonnie's mother has a stroke after seeing a vision of Bonnie drowning.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Kill Me\"</td><td style=\"text-align:center\">Andrea Arnold</td><td style=\"text-align:center\"><i>Teleplay by</i> : David E. Kelley<br><i>Story by</i> : David E. Kelley and Liane Moriarty</td><td style=\"text-align:center\">July 7, 2019</td><td style=\"text-align:center\">1.77</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #94C1B7\">Celeste refuses a settlement offer from Mary Louise's lawyer for joint custody of the boys, and the case goes to trial. Renata tries to get Mary Louise to drop the case, who in turn taunts her for being bankrupt. A bully calls Ziggy a mistake and that his father is a rapist; the twins defend him and the three of them beat up the bully, leading to their suspension. Jane tries to be intimate with Corey, but the trauma causes her to break down. Celeste, Jane, Corey, and the three boys go on a kayak trip during their suspension, while Renata and Amabella make use of this opportunity to bond as mother and daughter at the pool. Ed and Madeline go to couples therapy, where Madeline promises that she will not make the same mistakes again. Later, Tori hits on Ed at a bar, with Joseph staring at them from a nearby table. At the hospital, Bonnie's mother asks her to kill her. A distraught Bonnie once again considers turning herself in to the police, but on her way to a police station, she spots Corey leaving it.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Bad Mother\"</td><td style=\"text-align:center\">Andrea Arnold</td><td style=\"text-align:center\"><i>Teleplay by</i> : David E. Kelley<br><i>Story by</i> : David E. Kelley and Liane Moriarty</td><td style=\"text-align:center\">July 14, 2019</td><td style=\"text-align:center\">1.63</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #94C1B7\">Celeste and Mary Louise go to trial to battle for the custody of Max and Josh. Celeste is completely shocked and hurt when Mary Louise's lawyer asks her a wide array of personal questions. Celeste explains that she is coping with grief and intends to improve herself and get better. Just before the judge announces the verdict, Celeste interrupts to say that Mary Louise never took the stand and that is not fair. Celeste herself wants to question Mary Louise, and the judge agrees. Ed meets with Tori, who comes on to him and tells him that she has fantasized about him. Madeline approaches Ed again, and says that she wants to try to work it out. Jane questions Corey about his presence at the police station, and he tells her that he was just called in for questioning by the detective, who asked him if Jane has ever talked with him about the night Perry died. Corey claims that he told the detective nothing. Though mildly reassured, Jane stops answering his calls and texts because she says she is not ready for something new just yet. Bonnie confesses everything (including pushing Perry and her resentment toward her mother) to her mom while she is in a coma since she thinks her mother is going to die soon and that this may be her last chance to say anything.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"I Want to Know\"</td><td style=\"text-align:center\">Andrea Arnold</td><td style=\"text-align:center\"><i>Teleplay by</i> : David E. Kelley<br><i>Story by</i> : David E. Kelley and Liane Moriarty</td><td style=\"text-align:center\">July 21, 2019</td><td style=\"text-align:center\">1.98</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #94C1B7\">Celeste questions Mary Louise in court about Perry's brother's death and how he coped and how she treated him. Later, Celeste shows a video that her son took of Perry physically abusing her, and claims that Mary Louise would raise her own sons to be similar abusers. Celeste ends up with full custody, and Mary Louise leaves Monterey Bay. Bonnie tells her mother she loves her just before she dies and tells Nathan she does not love him. Ed and Madeline renew their vows. Jane and Corey progress in their relationship with Ziggy's approval. Gordon arranges to keep his train set despite the repossession of their other property, to the disapproval of Renata, who furiously destroys it and leaves him. Finally, Bonnie texts the rest of the Monterey Five that she is going to confess, in response to which all four women accompany her to the police station.</td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>Actresses and producers Nicole Kidman and Reese Witherspoon were announced to have optioned the screen rights to Liane Moriarty's novel Big Little Lies on August 6, 2014, less than a month after the book's publication. The two of them were expected to develop the project as a film in which they would star and act as executive producers, sharing the latter duty with Bruna Papandrea and Per Saari; Moriarty was also expected to produce. In November of that year, the actresses announced the format's shift into that of a limited-run television series written by David E. Kelley. In May 2015, HBO gave the series a production order and Kelley was announced to join the team of executive producers. That October, Jean-Marc Vallée was reportedly in talks with the project's team to handle directing of the first episode and potentially others. His involvement with all seven episodes was confirmed almost two months later. The series' release date of February 19, 2017, was unveiled in November 2016.</p><p>Originally conceived and billed as a miniseries, a potential new season of Big Little Lies was discussed by the series' audience and the media. In July 2017, two weeks after the project and its cast and crew received several nominations for the 69th ceremony of the Primetime Emmy Awards, Witherspoon stated: \"As of right now, I think it's pretty whole. I feel really good about where it is, and if this is all it ever was, it's a beautiful thing we all accomplished together\". However, in the wake of the nominations, HBO revealed that a second season was possible, and that Moriarty had been asked to write a story for it. During a April 2017 interview, Vallée came out strongly against the idea of producing a second season: \"There's no reason to make a season two. That was meant to be a one-time deal, and it's finishing in a way where it's for the audience to imagine what can happen. If we do a season two, we'll break that beautiful thing and spoil it.\" When he and the series won several accolades at the 69th ceremony of the Primetime Emmy Awards, the director changed his mind: \"It'd be great to reunite the team and to do it. Are we going to be able to do it, altogether? I wish.\"</p><p>In December 2017, HBO officially renewed the series for a seven-episode second season to be written by Kelley, directed by Andrea Arnold, based on a new novella by Moriarty, and with Vallée remaining an executive producer. The announcement of the second season, and specifically its timing, enraged producers of rival shows that were competing for award nominations in the limited series categories, particularly since it was made after voting for the Critics' Choice Television Award and Golden Globe Award were over. Due to this, the Producers Guild of America restarted voting for the 2018 ceremony of their award show, reclassifying the show from a limited series to a drama series. The second season premiered on June 9, 2019.</p><h4>Controversy</h4><p>In July 2019, it was reported by IndieWire that director Andrea Arnold lost creative control after filming had completed, and it was given to season 1 director Jean-Marc Vallée in an attempt to unify the style between the seasons. Arnold was initially promised by HBO that the show would be done in her vision, including post-production, and was unaware that Vallée would edit the footage she had shot. Once Vallée completed his work on Sharp Objects, he took over the editing process along with his own editorial team in Montreal. HBO also ordered 17 more days of additional photography, to be filmed by Arnold, but overseen by Vallée. Significant reworking of the episodes also took place, where episodes were shortened. In response, HBO programming president Casey Bloys stated, \"There's a lot of misinformation around that subject\" and \"the director typically does not have final creative control\". Bloys clarified that Vallée came back to \"hone the episodes\" after being asked by the entire producing team, including Reese Witherspoon and Nicole Kidman, and that they were clear with Arnold about how the process would work from the start.</p><h4>Casting</h4><p>Alongside the initial announcement of the production's development, Kidman and Witherspoon were reported to also star in the adaptation. In December 2015, Shailene Woodley, Adam Scott, Laura Dern, and Zoë Kravitz were announced to have been cast in lead roles, with Kathryn Newton in a recurring one. The following month, Alexander Skarsgård, James Tupper, and Jeffrey Nordling joined the starring cast, while Santiago Cabrera, P. J. Byrne, Kelen Coleman, Sarah Burns, Darby Camp, Cameron and Nicholas Crovetti, Ivy George, Chloe Coleman, Virginia Kull, Sarah Baker, Kathreen Khavari, Larry Bates, Hong Chau, Gia Carides, Merrin Dungey, Larry Sullivan, David Monahan, and Iain Armitage landed supporting roles. The latter one was cast in the role of Woodley's character's son.</p><p>Following the confirmation of a sophomore season, Meryl Streep was announced in January 2018 to have joined the starring cast in the role of Skarsgård's character's mother. In February, Woodley, Dern, Kravitz, Scott, Tupper, Nordling and Armitage were confirmed to be returning. That March, Douglas Smith was cast in a recurring role. In April, it was reported that Crystal Fox joined the main cast alongside returners Newton and Sokolovic, while Mo McRae and Martin Donovan joined the recurring cast alongside returners Weigert and Dungey. However, only Newton received main billing; Fox and Sokolovic's appearances were credited as recurring. Byrne was announced alongside newcomer Poorna Jagannathan in May, followed by Denis O'Hare in June.</p><h4>Filming</h4><p>For the first season, Vallée shot the series with an Arri Alexa digital camera and preferred using natural lighting and handheld shooting style to allow actors to move freely around the set. Several scenes were filmed on location in the Monterey Peninsula, Big Sur, Pacific Grove, and Carmel Highlands.</p><h4>Soundtrack</h4><p>ABKCO Records released soundtracks for the first and second seasons on March 31, 2017, and July 19, 2019, respectively.</p><br/><h3>Release</h3><h4>Broadcast</h4><p>On February 7, 2017, the series held its official premiere at the TCL Chinese Theatre in Los Angeles, California. Internationally, the series premiered on February 20, 2017, in Australia on Showcase, and on March 13, 2017, in the United Kingdom and Ireland on Sky Atlantic.</p><h4>Marketing</h4><p>On October 16, 2016, HBO released the first teaser trailer for the series. On December 5, 2016, HBO released a full length trailer for the series.</p><h4>Home media</h4><p>The first season was released on Blu-ray and DVD on August 1, 2017. The second season was released on January 7, 2020, on DVD and manufacture-on-demand Blu-ray by Warner Home Entertainment and Warner Archive Collection respectively.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>On the review aggregation website Rotten Tomatoes, the first season holds a 93% \"certified fresh\" rating with an average rating of 8 out of 10 based on 199 reviews. The website's critical consensus reads, \"Bitingly funny and highly addictive, Big Little Lies is a twisty, thrilling, enlightening ride led by a first-rate cast.\" Metacritic, which uses a weighted average, assigned the first season a score of 75 out of 100, based on 42 critics, indicating \"generally favorable reviews\". Time magazine listed Big Little Lies as one of its top ten television shows of 2017.</p><p>On Rotten Tomatoes, the second season holds an 86% \"certified fresh\" rating with an average rating of 7.7 out of 10 based on 265 reviews. The website's critical consensus reads, \"Gorgeous and gripping, Big Little Lies' second season doubles down on the dark humor and gives its impressive cast even more juicy drama to chew on – especially an excellent Meryl Streep.\" On Metacritic, the season has a score of 82 out of 100, based on 36 critics, indicating \"universal acclaim\". Ben Travers of IndieWire wrote a positive review giving it a \"B+\" grade, concluding that Season 2 is a \"wholly different beast\" and \"doesn't feel like a necessary addition so much as an enjoyable epilogue\", yet it is \"still very, very good\".</p><h4>Ratings</h4><h4>Season 1</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per episode of <i>Big Little Lies</i></span></caption><tbody><tr><th scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\">Title</th><th scope=\"col\">Air date</th><th scope=\"col\" data-sort-type=\"number\"><span class=\"mw-redirect\">Rating</span><br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">DVR<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">DVR viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">Total<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Total viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\">1</th><td style=\"text-align:left\">\"<span>Somebody's Dead</span>\"</td><td style=\"text-align:left\">February 19, 2017</td><td>0.3</td><td>1.13</td><td>0.3</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>0.6</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">2</th><td style=\"text-align:left\">\"<span>Serious Mothering</span>\"</td><td style=\"text-align:left\">February 26, 2017</td><td>0.2</td><td>0.56</td><td>0.3</td><td>0.84</td><td>0.5</td><td>1.39</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">3</th><td style=\"text-align:left\">\"<span>Living the Dream</span>\"</td><td style=\"text-align:left\">March 5, 2017</td><td>0.4</td><td>1.04</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">4</th><td style=\"text-align:left\">\"<span>Push Comes to Shove</span>\"</td><td style=\"text-align:left\">March 12, 2017</td><td>0.4</td><td>1.04</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">5</th><td style=\"text-align:left\">\"<span>Once Bitten</span>\"</td><td style=\"text-align:left\">March 19, 2017</td><td>0.4</td><td>1.17</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">6</th><td style=\"text-align:left\">\"<span>Burning Love</span>\"</td><td style=\"text-align:left\">March 26, 2017</td><td>0.5</td><td>1.39</td><td>0.3</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>0.8</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">7</th><td style=\"text-align:left\">\"<span>You Get What You Need</span>\"</td><td style=\"text-align:left\">April 2, 2017</td><td>0.7</td><td>1.86</td><td>0.3</td><td>0.93</td><td>1.0</td><td>2.79</td></tr></tbody></table><h4>Season 2</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per episode of <i>Big Little Lies</i></span></caption><tbody><tr><th scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\">Title</th><th scope=\"col\">Air date</th><th scope=\"col\" data-sort-type=\"number\"><span class=\"mw-redirect\">Rating</span><br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">DVR<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">DVR viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">Total<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Total viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\">1</th><td style=\"text-align:left\">\"<span>What Have They Done?</span>\"</td><td style=\"text-align:left\">June 9, 2019</td><td>0.4</td><td>1.42</td><td>0.3</td><td>1.12</td><td>0.7</td><td>2.54</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">2</th><td style=\"text-align:left\">\"<span>Tell-Tale Hearts</span>\"</td><td style=\"text-align:left\">June 16, 2019</td><td>0.5</td><td>1.47</td><td>0.4</td><td>1.34</td><td>0.9</td><td>2.81</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">3</th><td style=\"text-align:left\">\"<span>The End of the World</span>\"</td><td style=\"text-align:left\">June 23, 2019</td><td>0.4</td><td>1.62</td><td>0.4</td><td>1.19</td><td>0.8</td><td>2.81</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">4</th><td style=\"text-align:left\">\"<span>She Knows</span>\"</td><td style=\"text-align:left\">June 30, 2019</td><td>0.4</td><td>1.61</td><td>0.4</td><td>1.17</td><td>0.8</td><td>2.77</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">5</th><td style=\"text-align:left\">\"<span>Kill Me</span>\"</td><td style=\"text-align:left\">July 7, 2019</td><td>0.5</td><td>1.77</td><td>0.4</td><td>1.23</td><td>0.9</td><td>3.00</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">6</th><td style=\"text-align:left\">\"<span>The Bad Mother</span>\"</td><td style=\"text-align:left\">July 14, 2019</td><td>0.4</td><td>1.63</td><td>0.4</td><td>1.20</td><td>0.8</td><td>2.84</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">7</th><td style=\"text-align:left\">\"<span>I Want to Know</span>\"</td><td style=\"text-align:left\">July 21, 2019</td><td>0.5</td><td>1.98</td><td>0.4</td><td>1.18</td><td>0.9</td><td>3.17</td></tr></tbody></table><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Accolades for <i>Big Little Lies</i></caption><tbody><tr><th scope=\"col\" width=\"5%\">Year</th><th scope=\"col\" width=\"22%\">Award</th><th scope=\"col\" width=\"28%\">Category</th><th scope=\"col\" width=\"35%\">Nominee(s)</th><th scope=\"col\" width=\"7%\">Result</th><th scope=\"col\" class=\"unsortable\" width=\"3%\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><th colspan=\"6\" style=\"background-color:#ccccff;\">Season 1</th></tr><tr><td align=\"center\" rowspan=\"26\">2017</td><td><span class=\"mw-redirect\">American Film Institute Awards</span></td><td>Top 10 TV Programs of the Year</td><td><i>Big Little Lies</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"6\"><span>Golden Globe Awards</span></td><td><span class=\"mw-redirect\">Best Miniseries or Television Film</span></td><td><i>Big Little Lies</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"6\" align=\"center\"></td></tr><tr><td rowspan=\"2\"><span>Best Actress – Miniseries or Television Film</span></td><td><span>Nicole Kidman</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Reese Witherspoon</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor – Series, Miniseries or Television Film</span></td><td><span>Alexander Skarsgård</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Best Supporting Actress – Series, Miniseries or Television Film</span></td><td><span>Laura Dern</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Shailene Woodley</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"8\"><span>Primetime Emmy Awards</span></td><td><span class=\"mw-redirect\">Outstanding Limited Series</span></td><td><span>David E. Kelley</span>, <span>Jean-Marc Vallée</span>, <span>Reese Witherspoon</span>, <span>Bruna Papandrea</span>, <span>Nicole Kidman</span>, Per Saari, <span>Gregg Fienberg</span>, <span>Nathan Ross</span> and Barbara A. Hall</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"8\" style=\"text-align: center;\"></td></tr><tr><td><span class=\"mw-redirect\">Outstanding Directing for a Limited Series, Movie or Dramatic Special</span></td><td><span>Jean-Marc Vallée</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Outstanding Lead Actress in a Limited Series or Movie</span></td><td>Nicole Kidman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Reese Witherspoon</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Supporting Actor in a Limited Series or Movie</span></td><td>Alexander Skarsgård</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Outstanding Supporting Actress in a Limited Series or Movie</span></td><td>Laura Dern</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Shailene Woodley</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Writing for a Limited Series, Movie or Dramatic Special</span></td><td><span>David E. Kelley</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"8\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span class=\"mw-redirect\">Outstanding Casting for a Limited Series, Movie or Special</span></td><td>David Rubin</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"8\" style=\"text-align: center;\"></td></tr><tr><td><span class=\"mw-redirect\">Outstanding Cinematography for a Limited Series or Movie</span></td><td><span>Yves Bélanger</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Contemporary Costumes for a Series, Limited Series or Movie</span></td><td>Alix Friedberg, Risa Garcia and Patricia McLaughlin</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Hairstyling for a Limited Series or Movie</span></td><td>Michelle Ceglia, Nickole C. Jones, Lona Vigi, Frances Mathias and Jocelyn Mulhern</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Makeup for a Limited Series or Movie (Non-Prosthetic)</span></td><td>Steve Artmont, Nicole Artmont, Angela Levin, Molly R Stern and Claudia Humburg</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Music Supervision</span></td><td>Susan Jacobs</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Single-Camera Picture Editing for a Limited Series or Movie</span></td><td>Veronique Barbe, David Berman, Justin LaChance, Maxime Lahaie, Sylvain Lebel and Jim Vega</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Sound Mixing for a Limited Series or Movie</span></td><td>Gavin Fernandes, Louis Gignac and Brendan Beebe</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>TCA Awards</span></td><td><span>Program of the Year</span></td><td><i>Big Little Lies</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" align=\"center\"></td></tr><tr><td><span>Outstanding Achievement in Movies, Miniseries and Specials</span></td><td><i>Big Little Lies</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Individual Achievement in Drama</span></td><td>Nicole Kidman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\" rowspan=\"23\">2018</td><td><span>ACE Eddie Awards</span></td><td>Best Edited Drama Series for Non-Commercial Television</td><td>David Berman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Art Directors Guild Awards</span></td><td>Television Movie or Limited Series</td><td>John Paino <small>(for \"Somebody's Dead\", \"Living the Dream\", \"You Get What You Need\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>British Academy Television Awards</span></td><td><span>Best International Programme</span></td><td><i>Big Little Lies</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Cinema Audio Society Awards</span></td><td>Outstanding Achievement in Sound Mixing for a Television Movie or Mini-Series</td><td>Brendan Beebe, Gavin Fernandes and Louis Gignac <small>(for \"You Get What You Need\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Costume Designers Guild Awards</span></td><td>Excellence in Contemporary Television Series</td><td>Alix Friedberg</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"5\"><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td><span>Best Limited Series</span></td><td><i>Big Little Lies</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"5\" style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\"><span>Best Actress in a Movie Made for TV or Limited Series</span></td><td>Nicole Kidman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Reese Witherspoon</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor in a Movie Made for TV or Limited Series</span></td><td>Alexander Skarsgård</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress in a Movie Made for TV or Limited Series</span></td><td>Laura Dern</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Location Managers Guild Awards</span></td><td>Outstanding Locations in Contemporary Television</td><td>Greg Alpert</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span class=\"mw-redirect\">Producers Guild of America Awards</span></td><td><span>Norman Felton Award for Outstanding Producer of Episodic Television, Drama</span></td><td><i>Big Little Lies</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"5\"><span>Satellite Awards</span></td><td><span>Best Miniseries</span></td><td><i>Big Little Lies</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"5\" style=\"text-align:center;\"></td></tr><tr><td><span>Best Actress – Miniseries or Television Film</span></td><td>Nicole Kidman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor – Series, Miniseries or Television Film</span></td><td>Alexander Skarsgård</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Best Supporting Actress – Series, Miniseries or Television Film</span></td><td>Laura Dern</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Shailene Woodley</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by a Male Actor in a Television Movie or Limited Series</span></td><td>Alexander Skarsgård</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"4\" style=\"text-align:center;\"></td></tr><tr><td rowspan=\"3\"><span>Outstanding Performance by a Female Actor in a Television Movie or Limited Series</span></td><td>Laura Dern</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Nicole Kidman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Reese Witherspoon</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Writers Guild of America Awards</span></td><td><span>Long Form – Adapted</span></td><td>David E. Kelley</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td scope=\"row\"><span class=\"mw-redirect\">USC Scripter Awards</span></td><td>Best Adapted TV Screenplay</td><td>David E. Kelley and <span>Liane Moriarty</span> <span style=\"font-size:85%;\">(for \"You Get What You Need\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><th colspan=\"6\" style=\"background-color:#ccccff;\">Season 2</th></tr><tr><td align=\"center\">2019</td><td><span>Satellite Awards</span></td><td><span>Best Supporting Actress – Series, Miniseries or TV Film</span></td><td>Meryl Streep</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"18\">2020</td><td><span class=\"mw-redirect\">Art Directors Guild Awards</span></td><td><span>One-Hour Contemporary Single-Camera Series</span></td><td>John Paino <small>(for \"What Have They Done?\", \"The Bad Mother\" &amp; \"I Want to Know\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Black Reel Television Awards</span></td><td><span>Outstanding Supporting Actress, Drama Series</span></td><td>Zoë Kravitz</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Costume Designers Guild Awards</span></td><td><span>Excellence in Contemporary Television</span></td><td>Alix Friedberg <small>(for \"She Knows\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"3\"><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td><span>Best Actress in a Drama Series</span></td><td>Nicole Kidman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td rowspan=\"2\"><span>Best Supporting Actress in a Drama Series</span></td><td>Laura Dern</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Meryl Streep</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Golden Globe Awards</span></td><td><span>Best Television Series – Drama</span></td><td><i>Big Little Lies</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" align=\"center\"></td></tr><tr><td><span>Best Actress – Television Series Drama</span></td><td>Nicole Kidman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress – Series, Miniseries or Television Film</span></td><td>Meryl Streep</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Make-Up Artists and Hair Stylists Guilds</span></td><td><span class=\"mw-redirect\">Best Television Series, Mini-Series or New Media Series – Best Contemporary Make-Up</span></td><td>Michelle Radow and Erin Good-Rosenmann</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td><span>Best Television Series, Mini-Series or New Media Series – Contemporary Hair Styling</span></td><td>Jose Zamora, Lorena Zamora and Lona Vigi</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Primetime Emmy Awards</span></td><td rowspan=\"2\"><span>Outstanding Supporting Actress in a Drama Series</span></td><td>Laura Dern <small>(for \"Tell-Tale Hearts\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td>Meryl Streep <small>(for \"I Want to Know\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Casting for a Drama Series</span></td><td>David Rubin</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td><span>Outstanding Contemporary Makeup (Non-Prosthetic)</span></td><td>Michelle Radow, Erin Rosenmann, Karen Rentrop, Molly R. Stern, Angela Levin, Simone Almekias-Siegl, Miho Suzuki and Claudia Humburg <small>(for \"She Knows\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Production Design for a Narrative Contemporary Program (One Hour or More)</span></td><td>John Paino, Austin Gorg and Amy Wells <small>(for \"What Have They Done?\", \"The Bad Mother\", \"I Want to Know\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Producers Guild of America Awards</span></td><td>Norman Felton Award for Outstanding Producer of Episodic Television, Drama</td><td><i>Big Little Lies</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by an Ensemble in a Drama Series</span></td><td><span>Iain Armitage</span>, <span>Darby Camp</span>, <span>Chloe Coleman</span>, Cameron Crovetti, Nicholas Crovetti, Laura Dern, <span>Martin Donovan</span>, <span>Merrin Dungey</span>, Crystal Fox, <span>Ivy George</span>, Nicole Kidman, <span>Zoë Kravitz</span>, <span>Kathryn Newton</span>, <span>Jeffrey Nordling</span>, <span>Denis O'Hare</span>, <span>Adam Scott</span>, Alexander Skarsgård, <span>Douglas Smith</span>, Meryl Streep, <span>James Tupper</span>, <span>Robin Weigert</span>, Reese Witherspoon and Shailene Woodley</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr></tbody></table><br/><h3>Future</h3><p>HBO president Casey Bloys said a third season of the show was \"not realistic\" due to scheduling the show's actors, but mentioned that the network is more than willing to greenlight it if the cast is able to work out their schedules. In October 2020, Nicole Kidman revealed during a press interview for The Undoing that author Liane Moriarty is writing the plot for a potential third season and that the cast and crew are excited to reunite for it. In a November 2022 interview with GQ, Zoë Kravitz confirmed the series would not return for a third season because of the death of director Jean-Marc Vallée.</p><br/>"
  },
  "errorMessage": ""
}