{
  "imDbId": "tt6108262",
  "title": "Black Sun",
  "fullTitle": "Black Sun (TV Series 2017– )",
  "type": "TVSeries",
  "year": "2017",
  "items": [
    {
      "username": "bosko_kv_91",
      "userUrl": "https://www.imdb.com/user/ur27261835",
      "reviewLink": "https://www.imdb.com/review/rw3850401",
      "warningSpoilers": false,
      "date": "5 November 2017",
      "rate": "10",
      "helpful": "122 out of 146 found this helpful.",
      "title": "Maybe, something that we could sell to the world!!!",
      "content": "First of all, this is something completely different than anything else that was released in Serbia in a past decade. It's too exciting and pilot was great. Bjela did a great job like with Montevideo. There is a murder, twists, suspects, there are Cozacs from Russia, VMRO from Macedonia, there are Germans, Serbs and a few more interesting groups. If I can compare this one with something famous it will be Peaky Blinders for sure. My recommendations to everyone."
    },
    {
      "username": "brettcockrell",
      "userUrl": "https://www.imdb.com/user/ur107638698",
      "reviewLink": "https://www.imdb.com/review/rw5770452",
      "warningSpoilers": false,
      "date": "25 May 2020",
      "rate": "10",
      "helpful": "25 out of 25 found this helpful.",
      "title": "Classy and Totally Unexpected",
      "content": "Just finished watching the first series and was totally captivated by the plot and characters. Amazon get your finger out I want to see the Second Series. I regularly watch Foreign language TV through Walter Presents on Channel 4, Netflix and Amazon Prime and this rates as one of the best series I have seen. Central European politics of the 1920s is totally unknown to English speaking audiences so the storyline is fresh and the world of the Belgrade underworld unknown. Itis reminiscent of Peaky Blinders and fans of that will enjoy this fix as like there the actions and experiences of the First World War motivate the actions of many of the characters and unfinished business fuels the plotline. Well worth a box set binge"
    },
    {
      "username": "mywordsdidglow",
      "userUrl": "https://www.imdb.com/user/ur120373343",
      "reviewLink": "https://www.imdb.com/review/rw5867246",
      "warningSpoilers": false,
      "date": "29 June 2020",
      "rate": "10",
      "helpful": "16 out of 20 found this helpful.",
      "title": "Love this show",
      "content": "This incredible show is definitely for adults only. Having a little historical background helps (the fraternal connection between Tsarist Russia and Serbia for example) but is not required. Violence, international intrigue. street level gangs, soldiers still dealing with the aftermath of WW1, new forensic science, independence fighters/terrorists, opium fueled hedonism/social decay all come together to make an amazingly enjoyable binge watch. The acting is great. A must watch for fans of The Wire and Peaky Blinders. It is hard at first to keep some of the characters straight in your head, but it gets easier as the show progresses."
    },
    {
      "username": "dragokin",
      "userUrl": "https://www.imdb.com/user/ur15462771",
      "reviewLink": "https://www.imdb.com/review/rw6617582",
      "warningSpoilers": false,
      "date": "20 February 2021",
      "rate": "7",
      "helpful": "8 out of 9 found this helpful.",
      "title": "most accomplished Serbian TV show in well over a decade",
      "content": "If you're looking for a historically accurate depiction of Yugoslavia between world wars, you're in a wrong place. However, if you're looking for a crime thriller in which actual historical figures play important roles, then this might be interesting.In terms of story and production values (\"look and feel\") this is the most accomplished TV show from Serbia in well over a decade. It has an ambitious plot playing on several levels.The only thing that bothered me was the choice of language, which seems to be a conscious decision in Serbian cinema and, for that matter, in the whole former Yugoslavia. At a certain point I've realized that the F-word and it's derivatives constitute a good part of the script. The Serbian language is particularly creative in this area, but even that didn't help in the long run.To be clear, I'm not complaining that a wealthy socialite in the show might use the vocabulary of the lowest social strata. Although i find it highly unlikely, my thoughts on the topic have been covered in my comment above that this is not a documentary. What I mean is that there are scenes where, instead of writing a generic dialogue, the writer(s) opted for profanities. This I can attribute solely to lazy script writing..."
    },
    {
      "username": "nikdjikic",
      "userUrl": "https://www.imdb.com/user/ur62830916",
      "reviewLink": "https://www.imdb.com/review/rw3874472",
      "warningSpoilers": false,
      "date": "4 December 2017",
      "rate": "10",
      "helpful": "72 out of 91 found this helpful.",
      "title": "This is how world-class level TV Series should look like",
      "content": "I am very demanding as audience about Movies and especially TV Series, because they last longer and take more of viewers time. What I always hated in TV Series is the pace, plot is usually unfolding slower than it should, and there are always numerous filler characters and subplots that are only there to prolong series run-time. After watching 7 episodes of \"Senke nad Balkanom\", I can be sure that this wasn't just lucky shot with the pilot episode, the series is expanding, developing and becoming even better and better. Each episode brings us new plot twists and complications that are not forced, they emerge from character relations and events that have happened in previous episodes. They are somehow logical, natural and fluid with the main story-line, yet they are unexpected. Nothing is predictable in the series and that is absolutely amazing. Those screenwriters done their job right this time. Characters - there are no \"filler\" characters. Whoever takes screen time, it will have it's importance and impact on the plot, sooner or later. Sex scenes and secret love affairs - those are not there only for nudity. Every affair has its own impact on the story. I am absolutely amazed how every character is a piece of a puzzle that is coming together in such a perfect way. Every subplot is interesting on its own, but how subplots are intertwined is what is fascinating (perfection of that can be compared with Westworld series, season 1). And all of that put together in a historical frame. This is what historical fiction is all about, this is how historical fiction should look like. I can only hope that Dragan Bjelogrlic will keep up the good work. This is his Magnum opus and I hope that this series can become international hit, can pay off and enable Dragan Bjelogrlic to finish all planned 3 seasons at this quality level."
    },
    {
      "username": "branislavnovakovic",
      "userUrl": "https://www.imdb.com/user/ur117976477",
      "reviewLink": "https://www.imdb.com/review/rw5721689",
      "warningSpoilers": false,
      "date": "9 May 2020",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Excellent",
      "content": "Amazing story from forgotten history of Serbia with thrilling events that occurred after World War I !!!"
    },
    {
      "username": "vuko2002",
      "userUrl": "https://www.imdb.com/user/ur53427249",
      "reviewLink": "https://www.imdb.com/review/rw6021730",
      "warningSpoilers": false,
      "date": "23 August 2020",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Best show on Balkan for sure.",
      "content": "This is amazing show. I was amazed that something from serbia can be so good. In my opinion its better than all world-popular series like breaking bad, wire, sherlock. My favorite show. Story so dark and misterious, best actors from serbia and good charachterization."
    },
    {
      "username": "soranus",
      "userUrl": "https://www.imdb.com/user/ur7682307",
      "reviewLink": "https://www.imdb.com/review/rw3869017",
      "warningSpoilers": true,
      "date": "27 November 2017",
      "rate": "10",
      "helpful": "56 out of 71 found this helpful.",
      "title": "Excellent",
      "content": "I could not believe that somebody was able to make such a series in today's Serbia or any country that came out of Yugoslavia. As any top product of this type, it is based on rock-solid writing and characters you cannot forget. If I was Netflix, I would shower Bjelogrlic with money for some future production. He is really worth it!"
    },
    {
      "username": "minamiletic",
      "userUrl": "https://www.imdb.com/user/ur65542728",
      "reviewLink": "https://www.imdb.com/review/rw5683726",
      "warningSpoilers": false,
      "date": "27 April 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Amazing",
      "content": "You need to see this show! Great story, great actors, great production. Can't wait for the next season. Must watch!"
    },
    {
      "username": "koolest_smile",
      "userUrl": "https://www.imdb.com/user/ur61391772",
      "reviewLink": "https://www.imdb.com/review/rw5603736",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "Wow",
      "content": "I couldn't stop watching it! I watched episodes one after the other!"
    },
    {
      "username": "miljkovicmilorad",
      "userUrl": "https://www.imdb.com/user/ur118596308",
      "reviewLink": "https://www.imdb.com/review/rw5749314",
      "warningSpoilers": false,
      "date": "18 May 2020",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "lOVED IT!",
      "content": "Maybe the best at the moment. It doesn't disappoint with any aspect of the show. Hope there will be the 3th season!"
    },
    {
      "username": "zoki_19",
      "userUrl": "https://www.imdb.com/user/ur22034799",
      "reviewLink": "https://www.imdb.com/review/rw5424919",
      "warningSpoilers": false,
      "date": "21 January 2020",
      "rate": "10",
      "helpful": "15 out of 20 found this helpful.",
      "title": "HBO level production!",
      "content": "Cast, story, real events, fictional events, everything blended into one perfect project. It's not Balkan made series, this is on another level. Hats off to Dragan Bjelogrlic, Golden globe for Gordan Kicic."
    },
    {
      "username": "cipiosvajac",
      "userUrl": "https://www.imdb.com/user/ur129698548",
      "reviewLink": "https://www.imdb.com/review/rw7056636",
      "warningSpoilers": false,
      "date": "23 June 2021",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A right turn on the crossroads for Serbian production",
      "content": "Before this show came along, Serbian production was mostly centered on family dramedies in the form of telenovelas. Bjelogrlic did something special when he came up with Black Sun. Not only did he raise the bar, he also fueled the production of other awesome Serbian production tv shows( Beleznica profesora Miskovica and Kalkanski Krugovi being a prime example). As for the show itself, it focuses on political games and underground of post-WWI Belgrade and Yugoslavia. It's not historically accurate but it's interesting take on the history of Balkan Peninsula. Show is full of awesome, believable plot-twists, interesting characters(the main trio is just superb) and the production values are equal to HBO, Netflix... Some of these big corps should give a lot of money to Bjelogrlic because he showed here that he can make a captivating, interesting, quality tv-show with not that much money. Just imagine what he can do with a true big budget."
    },
    {
      "username": "mitrovicdanka",
      "userUrl": "https://www.imdb.com/user/ur111194665",
      "reviewLink": "https://www.imdb.com/review/rw5327052",
      "warningSpoilers": false,
      "date": "17 December 2019",
      "rate": "7",
      "helpful": "21 out of 31 found this helpful.",
      "title": "second season",
      "content": "I just finished watching second season. Very good! But first is the best!"
    },
    {
      "username": "riseofeagle",
      "userUrl": "https://www.imdb.com/user/ur77200900",
      "reviewLink": "https://www.imdb.com/review/rw5722923",
      "warningSpoilers": false,
      "date": "9 May 2020",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Possibly the best TV Show produced in Serbia ever",
      "content": "Dragan Bjelogrlic did remarkable thing! Almost all characters really lived in those times and had huge influence on historical course of Yugoslavia and Europe as well. From watching the show you can really see that He had put Serbian production on totaly another level. I recommend this to anyone!"
    },
    {
      "username": "aleblok70",
      "userUrl": "https://www.imdb.com/user/ur26402433",
      "reviewLink": "https://www.imdb.com/review/rw4013455",
      "warningSpoilers": false,
      "date": "25 December 2017",
      "rate": "8",
      "helpful": "26 out of 40 found this helpful.",
      "title": "Very Interesting New Serbian Show",
      "content": "I must say that I am positively surprised by this show as it is something very new to this region. Unlike Pavic's or Sotra's predictable, unrealistic and boring series \"Senke nad Balkanom\" is a very good show. Storyline is interesting and pushes you into further thinking about what's really going on and what is going to happen next. I was also happy to see very good special effects. There were some nudity, and other explicit scenes, so this show reminds of the Game of Thrones series in a way, of course it's not recommended for children even though it has been broadcast in the prime time of the national television. I would only complain on not-so-witty jokes and poor acting by some of the cast. Overall, I give this show 8/10."
    },
    {
      "username": "ifrancetic",
      "userUrl": "https://www.imdb.com/user/ur50020483",
      "reviewLink": "https://www.imdb.com/review/rw5234175",
      "warningSpoilers": false,
      "date": "3 November 2019",
      "rate": "7",
      "helpful": "22 out of 38 found this helpful.",
      "title": "Serbian version of Babilon Berlin",
      "content": "Decent historical series depicting the period in ex-Yugoslavia between two wars. Hard not to draw a line between this and Babilon Berlin, although not quite as great. Worth watching this Balkan version for the history buffs, however a lot will be lost in translation, and understanding the politics/names of the era."
    },
    {
      "username": "ivo95",
      "userUrl": "https://www.imdb.com/user/ur34122859",
      "reviewLink": "https://www.imdb.com/review/rw3862981",
      "warningSpoilers": false,
      "date": "20 November 2017",
      "rate": "10",
      "helpful": "72 out of 93 found this helpful.",
      "title": "Something truly incredible.",
      "content": "I won't tell much. I'll just say: This show is so good that I've decided to voluntarily translate it to English. The translation of the first episode has already been uploaded. Players that auto-download subtitles will instantly get it for you, while you can also just search for it. See it, and you'll realize why someone would go to that extent to show it to you."
    },
    {
      "username": "SerJigsaw",
      "userUrl": "https://www.imdb.com/user/ur61006197",
      "reviewLink": "https://www.imdb.com/review/rw4752807",
      "warningSpoilers": false,
      "date": "30 March 2019",
      "rate": "10",
      "helpful": "18 out of 29 found this helpful.",
      "title": "Impressed",
      "content": "Finnaly some powerful and worthy TV Show from Balkan. Reminds me a bit of Peaky Blinders. I highly recommend this. (10 out of 10 )"
    },
    {
      "username": "learnvicpa",
      "userUrl": "https://www.imdb.com/user/ur132182634",
      "reviewLink": "https://www.imdb.com/review/rw6935498",
      "warningSpoilers": false,
      "date": "17 May 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "10/10 OMG This is a masterpiece! A must see for all of the world",
      "content": "I think this is my first review and I was overwelmhed! The writing, sound, production, locations, make-up storyline, dark, but in moments funny, historical the portrayal of that time in some scenes I was Whoa, they managed to...produce the series at the HBO, Netflix,..level. This should be one of the best show in the world...hope the 3. Season come soonSome of those actors were in theaters mostly Cro/Serb/Monten/NewMaced/Slov/Bosnians....and all others were at the top, Dragan Bjelogrlic and crew seems to have an abillity to extract the best of them and they did a great job. Leona Paraminski, Nebojsa Dugalic suprised me in a great way cause i haven't saw her much, German, French language speaking, Maja Bergam also and not just that but changing accents were perfect because I know it's not easy to do that I was working a job where I was all around the Balkan so I learned and maybe had in in me but my friends can't shift accents how hard they tried so I'm not he POINT the point is Leona, Bojan Navojec, Nebojsa Dugalic with foreign language speaking! Gordan Kicic was a psycho for an Emmy, Golden Globe and which statue is in play.....Andrija Kuzmanovic also! All of them were best in their role not one of them sticks out wrongly!"
    },
    {
      "username": "toufiq-enam",
      "userUrl": "https://www.imdb.com/user/ur44216872",
      "reviewLink": "https://www.imdb.com/review/rw6530660",
      "warningSpoilers": false,
      "date": "26 January 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "World needs to see this masterpiece",
      "content": "One of the best series I could say after watching many foreign and english language tv series. Totally mind-blowing story, outstanding acting and twist. Cheers to the background music director and players!!"
    },
    {
      "username": "urossarma",
      "userUrl": "https://www.imdb.com/user/ur70435428",
      "reviewLink": "https://www.imdb.com/review/rw4038720",
      "warningSpoilers": false,
      "date": "20 January 2018",
      "rate": "10",
      "helpful": "66 out of 83 found this helpful.",
      "title": "Amazing!",
      "content": "While watching this I couldn't believe that it is Serbian production. This is a world class series! Every major project like this should be given to Bjelogrlic to direct! My recommendations for everyone!"
    },
    {
      "username": "Nik_Smerkolj",
      "userUrl": "https://www.imdb.com/user/ur114723587",
      "reviewLink": "https://www.imdb.com/review/rw5551330",
      "warningSpoilers": false,
      "date": "14 March 2020",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "A Serbian classics that should become an international success",
      "content": "Black Sun (Serbian: Senke nad Balkanom) is a unique series - based on the historical background of Balkan region, this criminal series is enriched with Balkan character, mindset and language. From this perspective, Black Sun is not just a normal TV Series, but a documentary set of episodes that bring a valuable content to all viewers, regardless of the reason for choosing this series. The historical background is precise and made easy to comprehend, however, some knowledge is mandatory in order to cope with the episodes. Viewers from the former Yugoslav republic will find series even more interesting, due to easier understanding of topic and language, that brings plentiful of meaningful proverbs, advice and also quite some curse words."
    },
    {
      "username": "playstrong",
      "userUrl": "https://www.imdb.com/user/ur53164859",
      "reviewLink": "https://www.imdb.com/review/rw5251686",
      "warningSpoilers": false,
      "date": "12 November 2019",
      "rate": "10",
      "helpful": "12 out of 24 found this helpful.",
      "title": "Astonishing performance, great composition!",
      "content": "There is not much to say, while watching you become speechless! I finished season 2, just as fantastic as the first one! This is also Kicic Gordan's best performance in acting in whole life!!! Absolutely amazing, I would recommend this series to everyone Rarely does anyone talk about this topic and the period between 2 world wars, thus, on such a specific way, nothing generic and already seen! 10/10"
    },
    {
      "username": "steamroller_91",
      "userUrl": "https://www.imdb.com/user/ur38023554",
      "reviewLink": "https://www.imdb.com/review/rw6862341",
      "warningSpoilers": false,
      "date": "29 April 2021",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "By far the best Serbian/exYu tv show ever made",
      "content": "Nothing like this was ever made by domestic cinematography. This tv show deserves to be among the best and most popular tv shows worldwide. There is a language barrier and it is reasonable, but for those who are not repelled by non-english speaking shows this is a 'must watch'. The storyline, the drama, the plot and the perfect cast make watching every episode with high tension and antitipation of the next one.Hope to see at least 2-3 seasons more :)Hoping for."
    }
  ],
  "errorMessage": ""
}