{
  "imDbId": "tt6108262",
  "title": "Black Sun",
  "fullTitle": "Black Sun (TV Series 2017– )",
  "type": "TVSeries",
  "year": "2017",
  "language": "en",
  "titleInLanguage": "Balkan Shadows",
  "url": "https://en.wikipedia.org/wiki/Balkan_Shadows",
  "plotShort": {
    "plainText": "Shadows over Balkan (Serbian: Сенке над Балканом, romanized: Senke nad Balkanom), also known as Balkan Shadows, is a Serbian period crime television series created by Dragan Bjelogrlić. In addition to Bjelogrlić, contributors to the screenplay include Danica Pajović, Dejan Stojiljković and Vladimir Kecmanović. The screenplay is based on a story by Stevan Koprivica. The series is a co-production involving Cobra Film, Radio Television of Serbia, Skopje Film Studio, Iskra, Radio Television of the Republic of Srpska, Macedonian Radio Television and The Film Agency of North Macedonia.\r\nThe series is set in the Kingdom of Serbs, Croats and Slovenes during the Interwar period and follows the story of two Belgrade police department inspectors. The first season is set during the period just before the 6 January Dictatorship and follows attempts by the couple to solve a string of sacrificial murders shaking Belgrade.\r\nDragan Bjelogrlić, Andrija Kuzmanović, Marija Bergam, Goran Bogdan, Aleksandr Galibin, Nenad Jezdić, Gordan Kičić, Nebojša Dugalić, Branimir Brstina, Srđan Todorović, Dragan Petrović, Nikola Đuričko, Bogdan Diklić, Voja Brajović, Sebastian Cavazza and Toni Mihajlovski are in the lead roles. The first season ran from 22 October 2017 to 24 December 2017 on the RTS1 channel, as well as on many other television channels in the former Yugoslav countries.\r\nThe filming of the first season took place between October 2016 and June 2017. The second was filmed during 2018, with all ten episodes airing on 8 November 2019. The first season was received very well by audience and critics alike, some controversy notwithstanding. The production, acting, editing and costume design have all received praise, as have the themes the series deals with.",
    "html": "<p>Shadows over Balkan (Serbian: Сенке над Балканом, romanized: Senke nad Balkanom), also known as Balkan Shadows, is a Serbian period crime television series created by Dragan Bjelogrlić. In addition to Bjelogrlić, contributors to the screenplay include Danica Pajović, Dejan Stojiljković and Vladimir Kecmanović. The screenplay is based on a story by Stevan Koprivica. The series is a co-production involving Cobra Film, Radio Television of Serbia, Skopje Film Studio, Iskra, Radio Television of the Republic of Srpska, Macedonian Radio Television and The Film Agency of North Macedonia.</p><p>The series is set in the Kingdom of Serbs, Croats and Slovenes during the Interwar period and follows the story of two Belgrade police department inspectors. The first season is set during the period just before the 6 January Dictatorship and follows attempts by the couple to solve a string of sacrificial murders shaking Belgrade.</p><p>Dragan Bjelogrlić, Andrija Kuzmanović, Marija Bergam, Goran Bogdan, Aleksandr Galibin, Nenad Jezdić, Gordan Kičić, Nebojša Dugalić, Branimir Brstina, Srđan Todorović, Dragan Petrović, Nikola Đuričko, Bogdan Diklić, Voja Brajović, Sebastian Cavazza and Toni Mihajlovski are in the lead roles. The first season ran from 22 October 2017 to 24 December 2017 on the RTS1 channel, as well as on many other television channels in the former Yugoslav countries.</p><p>The filming of the first season took place between October 2016 and June 2017. The second was filmed during 2018, with all ten episodes airing on 8 November 2019. The first season was received very well by audience and critics alike, some controversy notwithstanding. The production, acting, editing and costume design have all received praise, as have the themes the series deals with.</p>"
  },
  "plotFull": {
    "plainText": "Shadows over Balkan (Serbian: Сенке над Балканом, romanized: Senke nad Balkanom), also known as Balkan Shadows, is a Serbian period crime television series created by Dragan Bjelogrlić. In addition to Bjelogrlić, contributors to the screenplay include Danica Pajović, Dejan Stojiljković and Vladimir Kecmanović. The screenplay is based on a story by Stevan Koprivica. The series is a co-production involving Cobra Film, Radio Television of Serbia, Skopje Film Studio, Iskra, Radio Television of the Republic of Srpska, Macedonian Radio Television and The Film Agency of North Macedonia.\r\nThe series is set in the Kingdom of Serbs, Croats and Slovenes during the Interwar period and follows the story of two Belgrade police department inspectors. The first season is set during the period just before the 6 January Dictatorship and follows attempts by the couple to solve a string of sacrificial murders shaking Belgrade.\r\nDragan Bjelogrlić, Andrija Kuzmanović, Marija Bergam, Goran Bogdan, Aleksandr Galibin, Nenad Jezdić, Gordan Kičić, Nebojša Dugalić, Branimir Brstina, Srđan Todorović, Dragan Petrović, Nikola Đuričko, Bogdan Diklić, Voja Brajović, Sebastian Cavazza and Toni Mihajlovski are in the lead roles. The first season ran from 22 October 2017 to 24 December 2017 on the RTS1 channel, as well as on many other television channels in the former Yugoslav countries.\r\nThe filming of the first season took place between October 2016 and June 2017. The second was filmed during 2018, with all ten episodes airing on 8 November 2019. The first season was received very well by audience and critics alike, some controversy notwithstanding. The production, acting, editing and costume design have all received praise, as have the themes the series deals with.\r\nPremise\r\nThe series is divided into three seasons and encompasses the period between 1928 and 1940. The first season covers the period just before the assassination of the Croatian Member of the National Assembly Stjepan Radić at the National Assembly of the Serbs, Croatians and Slovenians and the subsequent establishment of the dictatorship.\r\nThe main setting for the series is Belgrade in between the two world wars. Lead characters are fifty-year-old police inspector Andra Tanasijević “Tane“ and his new associate, a young forensic by the name of Stanko Pletikosić. Belgrade is portrayed as a place where crime consists of classic robberies and murders, but whose biggest problems are wars between opium cartels, which use the city as a route for smuggling the drug further into Europe and the United States. The plot of the first season starts with a peculiar and brutal murder occurring at a costume ball at which most of the Belgrade social elite is gathered. Inspector Tanasijević soon discovers that the cause of the eerie events, which multiply by the day, is an ancient relic: namely, the Holy Lance Jesus was pierced with on the cross, which seems to possess mystical power. The Inspector discovers there are people ready to do anything to acquire the Lance, and is sucked into a tangled web of crime involving a range of interest groups: the Russian White army under General Vrangel, the Soviet Union Secret Police (OGPU and NKVD), the Serbian Black Hand movement, IMRO, the Yugoslav communists, elements of the Belgrade underbelly and, not least, a secret society going under the name of Thule. Hot on the crime trail, the Inspector looks for the relic with one aim in mind: to transport it out of Belgrade and thereby prevent further deaths.\r\nThe series is set to run over three seasons. The first season consists of ten episodes and is set in the run-up to the 6 January dictatorship. The second season also has ten episodes, and deals with the period before the assassination of King Alexander I of Yugoslavia in Marseilles. The third season is due to be set just before start of World War II in Yugoslavia.\r\nCast\r\nDragan Bjelogrlić as Andra Tanasijević \"Tane\", the Great War veteran, turned police inspector, relies on his intuition and traditional police methods to solve the murders, his knowledge of the city and people mentality in combination with the more modern methods of younger Inspector Pletikosic bring success in solving the cases. Bjelogrlić was also the producer and director of the series.\r\nAndrija Kuzmanović as Inspector Stanko Pletikosić, a young forensic scientist, returning to Belgrade after studying in Switzerland, bringing modern methods and techniques that will help him during the investigation of a series of mysterious murders that are happening in the city. The role of Pletikosić was supposed to be played by Miloš Biković, with whom Bjelogrlić already collaborated on Montevideo, God Bless You!, but he gave up because of obligations he had in Russia.\r\nMarija Bergam as Maja Davidović, wealthy owner of an influential bank, with a mysterious background and part of the Belgrade's High Society, associated with most of the victims of monstrous ritual killings and with the compromising controversy surrounding General Zivkovic.\r\nGordan Kičić as Alimpije Mirić, an unscrupulous businessman, close to the authorities of the Kingdom, mysterious head of the Belgrade criminal underworld, known by the alias of \"Kaluđer\" (the Monk).\r\nNenad Jezdić as Krojač (the \"Tailor\"), the Great War veteran, turned criminal and leader of the infamous Jatagan Mala gang, working for the Kaluđer's criminal organization in the first season.\r\nNebojsa Dugalić as General Živković, head of the Yugoslav secret services, a gray eminence figure and one of the most powerful persons in the Kingdom of Yugoslavia, at time.\r\nSebastian Cavazza as Gabriel Maht, a mysterious German nobleman and businessman, just arrived in Belgrade, secretly one of the high-ranked members of the \"Thule\" cult.\r\nBranimir Brstina as Dimitrijević, senior Belgrade police department captain, unquestioningly subordinate to the authorities, between serving the law and serving the powerful, he chooses what is best for his survival in the office. Tanasijević's longtime superior and friend.\r\nDragan Petrović, as dr. Konstantin Avakumović, a reputable Belgrade psychiatrist, with a mysterious and dark background, housband of Maja Davidović's friend Krista Avakumović.\r\nGoran Bogdan as Mustafa Golubić, Bosnian-born Soviet assassin and communist revolutionary, the Great War veteran turned Soviet intelligence agent send to Belgrade, known as a \"man with a hundred faces\". Krista Avakumović's lover.\r\nAleksandr Galibin as Pyotr Wrangel, one of the White Movement generals, exiled in Belgrade with parts of his Army, backed by the Yugoslav authorities. Galibin remarked that he was delighted to play such an important historical figure: \"It is such a precious thing to me to be playing such an important historical figure as general Wrangel was. I am particularly glad that we are filming in this church, where his body rests. That is especially touching.\"\r\nToni Mihajlovski as Damjan Hadži Arsov, a fictitious leader of terrorist Internal Macedonian Revolutionary Organization (IMRO) and Tane's comrade from the Great War. Dejan Stojiljković, who is one of the screenwriters, said that his character is not based on Vanča Mihailov, but \"has more similarities with the revolutionary Dame Gruev\".\r\nJana Stojanovska as Jovana, a Macedonian revolutionary and Damjan Hadži Arsov's sister. Her character was based on Mara Buneva, also the member of Internal Macedonian Revolutionary Organization.\r\nNikola Ristanovski as Dr. Archibald Reiss, a Swiss forensic scientist and Stanko Pletikosić's mentor. In the series, he assists two inspectors in solving the mystery surrounding the Necklace and Lance of Longinus.\r\nSrđan Žika Todorović as Dr. Babić, pathologist, a grouchy medical examiner at the Belgrade police department, Tanasijević's longtime friend.\r\nJovana Stojiljković as Bojana Antić, assistant medical examiner at the Belgrade police department, Pletikosić's love interests and lover of Mustafa Golubić. Member of the banned Communist Party.\r\nMiloš Timotijević as Vojin Đukić, State prosecutor, Maja Davidović's lover, and housband of Violeta Đukić, the first victim of series of ritual murders in Belgrade.\r\nNikola Đuričko as Đolović, Colonel of the secret police, one of General Zivkovic's closest associates, ready for any deal, mixing personal and state interests.\r\nBojan Navojec as Ante Pavelić, controversial lawyer and Croatian nationalist leader, founding Ustase, a fascist terrorist organization, planning assassination of King Alexander of Yugoslavia, maintaining close cooperation with IMRO, as well with their benefactors in Vienna and in the Fascist Italy.\r\nŽarko Laušević as Đorđe P. Karađorđević, mentally unstable abdicated-Crown Prince, imprisoned in an isolated mental institution, headed by Avakumović, for which he blames his younger brother King Alexander I.\r\nRadovan Vujović as Prince Paul the younger brother of King Alexander and a powerful political figure in the country. A passionate art collector, during the second series he manages construction of Ivan Meštrović's monumental Monument to the Unknown Hero at Mount Avala. After the assassination of his brother, he becomes prince regent for his nephew.\r\nVlado Novák as Anton Korošec, imprisoned former minister of internal affairs, in conflict with Belgrade authorities. The role was supposed to be played by Jernej Šugman, Slovenian actor who passed away in December 2017.\r\nBogdan Diklić as Obrad Savković, an influential and powerful Nazi-backed magnate and owner of the \"New era\" pro-Axis political journal, pursues its agenda by resorting to intrigue and blackmail.\r\nEpisodes\r\nScreenings\r\nPre-premiere in Serbia was on 17 October 2017 at Yugoslav Film Archive. The series had a premiere in Serbia on RTS on 12 October 2017 and had a time slot at 8 pm, which has long been the default time slot for all Serbian and Yugoslav TV series. The first episode in Serbia was watched by more than 2.123.000 viewers and was the most watched media on that channel. The premiere in Bosnia and Herzegovina was at the 23rd Sarajevo Film Festival, where two episodes which received ovations were shown. The first season was airing on RTRS. In Montenegro the series is aired on RTCG 1, and in Macedonia on MRT 1. The series debuted in Macedonia at the 38. Manaki Brothers Film Festival in Bitola on 25 September 2017, and Dragan Bjelogrlić, Tomi Salkovski (co-producer), Igor Ivanov Izi (director on one of the episodes) as well as the actors Marija Bergam, Jana Stojanovska, Pero Arsovski and Petar Atanovski addressed the audience.\r\nThere was a great controversy in Croatian media for not airing the first season, and the reasons cited were that it was due to the character of Ante Pavelić and also that Dragan Bjelogrlić himself forbade it. Bjelogrlić dismissed these claims and said that the main reason for the series not airing in Croatia was because no channel acquired the rights to air.\r\nBjelogrlić gave 2019 as the year in which the second season will be airing. The name of the series was translated into English as \"Black Sun\" in reference to the eponymous symbol frequently seen in the series, as well as the more literal \"Balkan Shadows\".\r\nSet that served as a marketplace in Baranda near Belgrade.\r\nMiloš Samolov (left) and Dragan Bjelogrlić (right) on set of TV Series.\r\nScreenwriter Stojiljković, with Aleksandr Galibin on the set, hotel Moskva in Belgrade.\r\nSlivnica Monastery in North Macedonia, another series set location.\r\nProduction and inspiration\r\nDragan Bjelogrlić first got interested in the time period in which the series is set while filming the TV series as well as the movie version of Montevideo, God Bless You! He got interested in this period because he knew very little of it and he also thought that the Serbian public in general isn't well informed about it: \"Our destiny was such that we never learned much about that time period, it was almost never talked about. And those were important and in a way intense times, especially in Yugoslavia.\" The fact that Yugoslavia was called \"Colombia of Europe\" between the two Wars also served as an inspiration to him.\r\nIn his article for Blic he wrote that he didn't want to compromise on any part of the show's creation: \"Shadows over Balkan is a piece for which I tried to make no compromises. There were no compromises on any level and in any phase of the show's production. From the screenplay, story, themes, national divisions, aesthetics, direction to the budget and cost. I didn't want to concern myself with the acquired taste of the RTS audience, ratings, political correctness, puritan moral principles, conservative historians, \"first\" and \"second Serbia\", and the like...\" He seriously doubted in the success of the show, because \"in aesthetic, dramaturgic and narrative aspects it was different than everything else he worked on in the past.\" He was inspired by a number of American, German, Italian, Scandinavian and Eastern European TV series, and as the main source of inspiration he cited Boardwalk Empire. He was also inspired by the connection between crime and corruption saying how \"when he put some things in order, he came to the conclusion that there exists a historic constant which affects this region, because it is of utmost importance that when you are working on a piece of art which deals with the past, it is important to focus on the moment from which you are doing it.\"\r\nThe filming of the first season took place between 1 October 2016 and end of July 2017. The series was shot on many different locations in Belgrade, Macedonia and Bosnia and Herzegovina, and a new film studio was also built in Baranda. It is here that the sets of the contemporary impoverished parts of Belgrade, Jatagan Mala along with fictive kafanas named \"Kod Nišliju\" (At Niški's) and \"Savsko bure\" (Sava barrel), Pištoljmala and Savamala), as well as the richer part of the city with a marketplace, candy shop, quilt shop, and a barber shop were constructed. According to Bjelogrlić, 30% of the filming took place in Baranda. Some particular scenes were shot on Zrenjanin streets as well as in its City Hall. Some scenes were supposed to be filmed in Slovenia as well, RTV Slovenija was in support of this, but it was later abandoned due to financial reasons.\r\nTogether with Bjelogrlić, the screenplay was worked on by screenwriters Danica Pajović, Dejan Stojiljković and Vladimir Kecmanović adapted to a film story by Stevan Koprivica. Koprivica worked on some of the early episodes, and according to Danica Pajović, \"the story was a Conan-Doyle type mystical drama about two inspectors who are working on resolving a series of sacrificial murders in Belgrade set between the two Wars. Bjelogrlić then expanded the theme to the Belgrade underbelly and opium trade in Yugoslavia and convoluted the story to such an extent that Dejan Stojiljković and I had to join the screenwriters team, with Vladimir Kecmanović also joining us later.\" According to his own words, this was the first time Dejan Stojiljković wrote a screenplay for a movie or a TV series.\r\nRobert Pešut \"Magnifico\", with whom Bjelogrlić already collaborated on Montevideo , worked on the soundtrack for the series. Ognjen \"Ogi\" Radivojević sang the song in the title sequence, and he was chosen by Magnifico and Bjelogrlić \"because of his specific tone of voice and emotions which emerge from his vocal range.\" Other notable musicians took part in series, such as Nikola Pejaković, Ksenija Kuljača etc.",
    "html": "<p>Shadows over Balkan (Serbian: Сенке над Балканом, romanized: Senke nad Balkanom), also known as Balkan Shadows, is a Serbian period crime television series created by Dragan Bjelogrlić. In addition to Bjelogrlić, contributors to the screenplay include Danica Pajović, Dejan Stojiljković and Vladimir Kecmanović. The screenplay is based on a story by Stevan Koprivica. The series is a co-production involving Cobra Film, Radio Television of Serbia, Skopje Film Studio, Iskra, Radio Television of the Republic of Srpska, Macedonian Radio Television and The Film Agency of North Macedonia.</p><p>The series is set in the Kingdom of Serbs, Croats and Slovenes during the Interwar period and follows the story of two Belgrade police department inspectors. The first season is set during the period just before the 6 January Dictatorship and follows attempts by the couple to solve a string of sacrificial murders shaking Belgrade.</p><p>Dragan Bjelogrlić, Andrija Kuzmanović, Marija Bergam, Goran Bogdan, Aleksandr Galibin, Nenad Jezdić, Gordan Kičić, Nebojša Dugalić, Branimir Brstina, Srđan Todorović, Dragan Petrović, Nikola Đuričko, Bogdan Diklić, Voja Brajović, Sebastian Cavazza and Toni Mihajlovski are in the lead roles. The first season ran from 22 October 2017 to 24 December 2017 on the RTS1 channel, as well as on many other television channels in the former Yugoslav countries.</p><p>The filming of the first season took place between October 2016 and June 2017. The second was filmed during 2018, with all ten episodes airing on 8 November 2019. The first season was received very well by audience and critics alike, some controversy notwithstanding. The production, acting, editing and costume design have all received praise, as have the themes the series deals with.</p><br/><h3>Premise</h3><p>The series is divided into three seasons and encompasses the period between 1928 and 1940. The first season covers the period just before the assassination of the Croatian Member of the National Assembly Stjepan Radić at the National Assembly of the Serbs, Croatians and Slovenians and the subsequent establishment of the dictatorship.</p><p>The main setting for the series is Belgrade in between the two world wars. Lead characters are fifty-year-old police inspector Andra Tanasijević “Tane“ and his new associate, a young forensic by the name of Stanko Pletikosić. Belgrade is portrayed as a place where crime consists of classic robberies and murders, but whose biggest problems are wars between opium cartels, which use the city as a route for smuggling the drug further into Europe and the United States. The plot of the first season starts with a peculiar and brutal murder occurring at a costume ball at which most of the Belgrade social elite is gathered. Inspector Tanasijević soon discovers that the cause of the eerie events, which multiply by the day, is an ancient relic: namely, the Holy Lance Jesus was pierced with on the cross, which seems to possess mystical power. The Inspector discovers there are people ready to do anything to acquire the Lance, and is sucked into a tangled web of crime involving a range of interest groups: the Russian White army under General Vrangel, the Soviet Union Secret Police (OGPU and NKVD), the Serbian Black Hand movement, IMRO, the Yugoslav communists, elements of the Belgrade underbelly and, not least, a secret society going under the name of Thule. Hot on the crime trail, the Inspector looks for the relic with one aim in mind: to transport it out of Belgrade and thereby prevent further deaths.</p><p>The series is set to run over three seasons. The first season consists of ten episodes and is set in the run-up to the 6 January dictatorship. The second season also has ten episodes, and deals with the period before the assassination of King Alexander I of Yugoslavia in Marseilles. The third season is due to be set just before start of World War II in Yugoslavia.</p><br/><h3>Cast</h3><ul><li>Dragan Bjelogrlić as Andra Tanasijević \"Tane\", the Great War veteran, turned police inspector, relies on his intuition and traditional police methods to solve the murders, his knowledge of the city and people mentality in combination with the more modern methods of younger Inspector Pletikosic bring success in solving the cases. Bjelogrlić was also the producer and director of the series.</li><li>Andrija Kuzmanović as Inspector Stanko Pletikosić, a young forensic scientist, returning to Belgrade after studying in Switzerland, bringing modern methods and techniques that will help him during the investigation of a series of mysterious murders that are happening in the city. The role of Pletikosić was supposed to be played by Miloš Biković, with whom Bjelogrlić already collaborated on Montevideo, God Bless You!, but he gave up because of obligations he had in Russia.</li><li>Marija Bergam as Maja Davidović, wealthy owner of an influential bank, with a mysterious background and part of the Belgrade's High Society, associated with most of the victims of monstrous ritual killings and with the compromising controversy surrounding General Zivkovic.</li><li>Gordan Kičić as Alimpije Mirić, an unscrupulous businessman, close to the authorities of the Kingdom, mysterious head of the Belgrade criminal underworld, known by the alias of \"Kaluđer\" (the Monk).</li><li>Nenad Jezdić as Krojač (the \"Tailor\"), the Great War veteran, turned criminal and leader of the infamous Jatagan Mala gang, working for the Kaluđer's criminal organization in the first season.</li><li>Nebojsa Dugalić as General Živković, head of the Yugoslav secret services, a gray eminence figure and one of the most powerful persons in the Kingdom of Yugoslavia, at time.</li><li>Sebastian Cavazza as Gabriel Maht, a mysterious German nobleman and businessman, just arrived in Belgrade, secretly one of the high-ranked members of the \"Thule\" cult.</li><li>Branimir Brstina as Dimitrijević, senior Belgrade police department captain, unquestioningly subordinate to the authorities, between serving the law and serving the powerful, he chooses what is best for his survival in the office. Tanasijević's longtime superior and friend.</li><li>Dragan Petrović, as dr. Konstantin Avakumović, a reputable Belgrade psychiatrist, with a mysterious and dark background, housband of Maja Davidović's friend Krista Avakumović.</li><li>Goran Bogdan as Mustafa Golubić, Bosnian-born Soviet assassin and communist revolutionary, the Great War veteran turned Soviet intelligence agent send to Belgrade, known as a \"man with a hundred faces\". Krista Avakumović's lover.</li><li>Aleksandr Galibin as Pyotr Wrangel, one of the White Movement generals, exiled in Belgrade with parts of his Army, backed by the Yugoslav authorities. Galibin remarked that he was delighted to play such an important historical figure: \"It is such a precious thing to me to be playing such an important historical figure as general Wrangel was. I am particularly glad that we are filming in this church, where his body rests. That is especially touching.\"</li><li>Toni Mihajlovski as Damjan Hadži Arsov, a fictitious leader of terrorist Internal Macedonian Revolutionary Organization (IMRO) and Tane's comrade from the Great War. Dejan Stojiljković, who is one of the screenwriters, said that his character is not based on Vanča Mihailov, but \"has more similarities with the revolutionary Dame Gruev\".</li><li>Jana Stojanovska as Jovana, a Macedonian revolutionary and Damjan Hadži Arsov's sister. Her character was based on Mara Buneva, also the member of Internal Macedonian Revolutionary Organization.</li><li>Nikola Ristanovski as Dr. Archibald Reiss, a Swiss forensic scientist and Stanko Pletikosić's mentor. In the series, he assists two inspectors in solving the mystery surrounding the Necklace and Lance of Longinus.</li><li>Srđan Žika Todorović as Dr. Babić, pathologist, a grouchy medical examiner at the Belgrade police department, Tanasijević's longtime friend.</li><li>Jovana Stojiljković as Bojana Antić, assistant medical examiner at the Belgrade police department, Pletikosić's love interests and lover of Mustafa Golubić. Member of the banned Communist Party.</li><li>Miloš Timotijević as Vojin Đukić, State prosecutor, Maja Davidović's lover, and housband of Violeta Đukić, the first victim of series of ritual murders in Belgrade.</li><li>Nikola Đuričko as Đolović, Colonel of the secret police, one of General Zivkovic's closest associates, ready for any deal, mixing personal and state interests.</li><li>Bojan Navojec as Ante Pavelić, controversial lawyer and Croatian nationalist leader, founding Ustase, a fascist terrorist organization, planning assassination of King Alexander of Yugoslavia, maintaining close cooperation with IMRO, as well with their benefactors in Vienna and in the Fascist Italy.</li><li>Žarko Laušević as Đorđe P. Karađorđević, mentally unstable abdicated-Crown Prince, imprisoned in an isolated mental institution, headed by Avakumović, for which he blames his younger brother King Alexander I.</li><li>Radovan Vujović as Prince Paul the younger brother of King Alexander and a powerful political figure in the country. A passionate art collector, during the second series he manages construction of Ivan Meštrović's monumental Monument to the Unknown Hero at Mount Avala. After the assassination of his brother, he becomes prince regent for his nephew.</li><li>Vlado Novák as Anton Korošec, imprisoned former minister of internal affairs, in conflict with Belgrade authorities. The role was supposed to be played by Jernej Šugman, Slovenian actor who passed away in December 2017.</li><li>Bogdan Diklić as Obrad Savković, an influential and powerful Nazi-backed magnate and owner of the \"New era\" pro-Axis political journal, pursues its agenda by resorting to intrigue and blackmail.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Series</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">22 October 2017</td><td style=\"padding:0 8px\">24 December 2017</td><td rowspan=\"1\"><span class=\"mw-redirect\">RTS 1</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">11 November 2019</td><td style=\"padding:0 8px\">13 January 2020</td><td rowspan=\"1\"><span class=\"mw-redirect\">Nova S</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">2023</td><td data-sort-value=\"\" class=\"table-na\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center; ;padding:0 8px\">TBA</td><td rowspan=\"1\"><span class=\"mw-redirect\">Nova S</span></td></tr></tbody></table><br/><h3>Screenings</h3><p>Pre-premiere in Serbia was on 17 October 2017 at Yugoslav Film Archive. The series had a premiere in Serbia on RTS on 12 October 2017 and had a time slot at 8 pm, which has long been the default time slot for all Serbian and Yugoslav TV series. The first episode in Serbia was watched by more than 2.123.000 viewers and was the most watched media on that channel. The premiere in Bosnia and Herzegovina was at the 23rd Sarajevo Film Festival, where two episodes which received ovations were shown. The first season was airing on RTRS. In Montenegro the series is aired on RTCG 1, and in Macedonia on MRT 1. The series debuted in Macedonia at the 38. Manaki Brothers Film Festival in Bitola on 25 September 2017, and Dragan Bjelogrlić, Tomi Salkovski (co-producer), Igor Ivanov Izi (director on one of the episodes) as well as the actors Marija Bergam, Jana Stojanovska, Pero Arsovski and Petar Atanovski addressed the audience.</p><p>There was a great controversy in Croatian media for not airing the first season, and the reasons cited were that it was due to the character of Ante Pavelić and also that Dragan Bjelogrlić himself forbade it. Bjelogrlić dismissed these claims and said that the main reason for the series not airing in Croatia was because no channel acquired the rights to air.</p><p>Bjelogrlić gave 2019 as the year in which the second season will be airing. The name of the series was translated into English as \"Black Sun\" in reference to the eponymous symbol frequently seen in the series, as well as the more literal \"Balkan Shadows\".</p><ul><li>Set that served as a marketplace in Baranda near Belgrade.</li><li>Miloš Samolov (left) and Dragan Bjelogrlić (right) on set of TV Series.</li><li>Screenwriter Stojiljković, with Aleksandr Galibin on the set, hotel Moskva in Belgrade.</li><li>Slivnica Monastery in North Macedonia, another series set location.</li></ul><br/><h3>Production and inspiration</h3><p>Dragan Bjelogrlić first got interested in the time period in which the series is set while filming the TV series as well as the movie version of Montevideo, God Bless You! He got interested in this period because he knew very little of it and he also thought that the Serbian public in general isn't well informed about it: \"Our destiny was such that we never learned much about that time period, it was almost never talked about. And those were important and in a way intense times, especially in Yugoslavia.\" The fact that Yugoslavia was called \"Colombia of Europe\" between the two Wars also served as an inspiration to him.</p><p>In his article for Blic he wrote that he didn't want to compromise on any part of the show's creation: \"Shadows over Balkan is a piece for which I tried to make no compromises. There were no compromises on any level and in any phase of the show's production. From the screenplay, story, themes, national divisions, aesthetics, direction to the budget and cost. I didn't want to concern myself with the acquired taste of the RTS audience, ratings, political correctness, puritan moral principles, conservative historians, \"first\" and \"second Serbia\", and the like...\" He seriously doubted in the success of the show, because \"in aesthetic, dramaturgic and narrative aspects it was different than everything else he worked on in the past.\" He was inspired by a number of American, German, Italian, Scandinavian and Eastern European TV series, and as the main source of inspiration he cited Boardwalk Empire. He was also inspired by the connection between crime and corruption saying how \"when he put some things in order, he came to the conclusion that there exists a historic constant which affects this region, because it is of utmost importance that when you are working on a piece of art which deals with the past, it is important to focus on the moment from which you are doing it.\"</p><p>The filming of the first season took place between 1 October 2016 and end of July 2017. The series was shot on many different locations in Belgrade, Macedonia and Bosnia and Herzegovina, and a new film studio was also built in Baranda. It is here that the sets of the contemporary impoverished parts of Belgrade, Jatagan Mala along with fictive kafanas named \"Kod Nišliju\" (At Niški's) and \"Savsko bure\" (Sava barrel), Pištoljmala and Savamala), as well as the richer part of the city with a marketplace, candy shop, quilt shop, and a barber shop were constructed. According to Bjelogrlić, 30% of the filming took place in Baranda. Some particular scenes were shot on Zrenjanin streets as well as in its City Hall. Some scenes were supposed to be filmed in Slovenia as well, RTV Slovenija was in support of this, but it was later abandoned due to financial reasons.</p><p>Together with Bjelogrlić, the screenplay was worked on by screenwriters Danica Pajović, Dejan Stojiljković and Vladimir Kecmanović adapted to a film story by Stevan Koprivica. Koprivica worked on some of the early episodes, and according to Danica Pajović, \"the story was a Conan-Doyle type mystical drama about two inspectors who are working on resolving a series of sacrificial murders in Belgrade set between the two Wars. Bjelogrlić then expanded the theme to the Belgrade underbelly and opium trade in Yugoslavia and convoluted the story to such an extent that Dejan Stojiljković and I had to join the screenwriters team, with Vladimir Kecmanović also joining us later.\" According to his own words, this was the first time Dejan Stojiljković wrote a screenplay for a movie or a TV series.</p><p>Robert Pešut \"Magnifico\", with whom Bjelogrlić already collaborated on Montevideo , worked on the soundtrack for the series. Ognjen \"Ogi\" Radivojević sang the song in the title sequence, and he was chosen by Magnifico and Bjelogrlić \"because of his specific tone of voice and emotions which emerge from his vocal range.\" Other notable musicians took part in series, such as Nikola Pejaković, Ksenija Kuljača etc.</p><br/>"
  },
  "errorMessage": ""
}