{
  "imDbId": "tt3398540",
  "title": "Haikyu!!",
  "fullTitle": "Haikyu!! (TV Series 2014–2020)",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "mayank09876",
      "userUrl": "https://www.imdb.com/user/ur44661012",
      "reviewLink": "https://www.imdb.com/review/rw4027079",
      "warningSpoilers": false,
      "date": "8 January 2018",
      "rate": "8",
      "helpful": "27 out of 30 found this helpful.",
      "title": "Excellent Sports Anime",
      "content": "Really enjoyed this well-made anime on Volleyball, I didn't know much about the sports and its rules, didn't realize so much strategy went into it and how important team play is. The plot is your typical shounen sports stereotype, an underdog who excels with determination, along the way he makes friends and each one in the team is a standout specialist. The anime is well-paced and keeps things exciting all throughout, there is lots of humor to give you big laughs. The storytelling utilizes the full spectrum of emotions from losses to win, from giving up to never giving in, from timidity to overconfident, from solo play to teamwork, it covers each aspect of the gameplay with relevant emotions. Another good side to the anime is the realistic gameplay, no over the board plays, and super moves. The characters are all likable, one of the few anime without having any evil guy in it.The anime itself is really good, got great art and colors. Did feel the music could have been better, nothing of it stands out in mind after a week of watching the anime.It was enjoyable enough for Binge-watch, so hopefully, you get the idea. Season 1 & 2 both were great, after a break of 2 years, I have binged watched Season 3 & Part 1 of Season 4 also, again they were really good."
    },
    {
      "username": "jasminn_tan",
      "userUrl": "https://www.imdb.com/user/ur102222939",
      "reviewLink": "https://www.imdb.com/review/rw5836963",
      "warningSpoilers": false,
      "date": "19 June 2020",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Inspiring!",
      "content": "Wow. I really did not expect to fall down the rabbit hole that is Haikyuu!! I thought that the art style isn't one that I usually gravitate to but I was quickly won over by the story and characters. I loved all of the characters and their relationships and friendships with each other and it was inspiring to see the underdog climb to the top, that even though it seems as if one is disadvantaged, they can still succeed through sheer willpower and by working together with like-minded passionate people. Honestly, watching this made me regret not taking volleyball seriously during PE in high school."
    },
    {
      "username": "angeloavendano",
      "userUrl": "https://www.imdb.com/user/ur20087512",
      "reviewLink": "https://www.imdb.com/review/rw4382714",
      "warningSpoilers": false,
      "date": "7 October 2018",
      "rate": "10",
      "helpful": "38 out of 39 found this helpful.",
      "title": "Best in Character Development!",
      "content": "Excellent characters incomparable to other anime or other tv series for that matter. You connect with each one in a deep way that and you just want to be rooting for all of them, even the opponents. PS I've learned a lot about volleyball also thanks to this and it just makes me want to play!"
    },
    {
      "username": "liamfuller-34875",
      "userUrl": "https://www.imdb.com/user/ur86163625",
      "reviewLink": "https://www.imdb.com/review/rw5639642",
      "warningSpoilers": false,
      "date": "14 April 2020",
      "rate": "9",
      "helpful": "18 out of 19 found this helpful.",
      "title": "REALLY GOOD AND IT GOT ME HOOKED",
      "content": "Haiykuu is by farrrr the best sport anime and I say that without a doubt. This show is easy to get into (I mean- it got me hooked from the first 5 mins!!). The characters are amazing and interesting. The matches are so exciting and got me on the edge of my seat. And yet this show is soooo simple. It's brilliant. Its the fattest recommendation I can give you!"
    },
    {
      "username": "Irishchatter",
      "userUrl": "https://www.imdb.com/user/ur23577930",
      "reviewLink": "https://www.imdb.com/review/rw4256308",
      "warningSpoilers": true,
      "date": "28 July 2018",
      "rate": "8",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Pretty good anime about volleyball!",
      "content": "I hated volleyball in school so this anime actually brought bad memories of it in a sorta good way lol. I really liked the enthusiasm and high confidience of Hinata. That kind of character really does lighten the anime's mood up and would really make you watch much more of it!It even acknowledges friendship as well, Hinata really brought in his old enemy's and his own pals to work together in order to win tournaments with such great amount of victory!Definitely recommend this to anyone who likes the volleyball sport or just wants to watch a different type of anime!"
    },
    {
      "username": "akarunkumar-48613",
      "userUrl": "https://www.imdb.com/user/ur98786654",
      "reviewLink": "https://www.imdb.com/review/rw7093978",
      "warningSpoilers": false,
      "date": "5 July 2021",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "One of the best",
      "content": "Man this sports anime give you exact the same feeling as you were playing the match. Must watch. The curiosity and excitement of what happens next ...the feeling is awesome."
    },
    {
      "username": "bigzube8936789256789256012308926",
      "userUrl": "https://www.imdb.com/user/ur70146991",
      "reviewLink": "https://www.imdb.com/review/rw3594625",
      "warningSpoilers": false,
      "date": "7 December 2016",
      "rate": "10",
      "helpful": "30 out of 32 found this helpful.",
      "title": "super exciting and easy to watch!",
      "content": "Can I just say that I freaking LOVE Haikyu.The show itself is pretty simple. It follows the adventures of a boys' high school volleyball team, and it is a bit overdramatic at times, but it's so much fun!! It's hilarious, the characters are so easy to fall in love with, there's no constant peril or evil overlord or magical powers, it's just volleyball. It sounds pretty boring and stupid at first, but trust me, watch the first episode. You'll be blown away.The production quality is super as well. They never get lazy with the animation. The funny bits are perfectly worked into the show without ruining the intense bits. Every single episode is completely and totally worth it.I just don't really have much else to say. It's an amazing show all around."
    },
    {
      "username": "gritz-01569",
      "userUrl": "https://www.imdb.com/user/ur78754030",
      "reviewLink": "https://www.imdb.com/review/rw4020307",
      "warningSpoilers": false,
      "date": "1 January 2018",
      "rate": "10",
      "helpful": "24 out of 27 found this helpful.",
      "title": "Makes you love the game itself",
      "content": "This anime is very brilliantly crafted. Compelling characters, beautiful and strong openings, natural comedy and superb animation makes this anime a must watch. 10/10"
    },
    {
      "username": "callumandjordan",
      "userUrl": "https://www.imdb.com/user/ur53912873",
      "reviewLink": "https://www.imdb.com/review/rw3064929",
      "warningSpoilers": false,
      "date": "3 August 2014",
      "rate": "10",
      "helpful": "119 out of 128 found this helpful.",
      "title": "Every episode of this anime is perfect.",
      "content": "This is anime leaves me speechless, seriously. It's just so brilliantly done. Some episodes pass by really quickly because you enjoy them that much and some episode feel twice as long because of the shows brilliant pacing. This anime has brilliant comedy, I swear I've laughed so many times. I've also cried too. If this anime was more popular I swear it has the quality to be a top anime. Imagine an Anime that makes you laugh when you're sad and makes you cheerful when you're bored, just imagine an anime that makes reading this review totally worth every word. If you decide not to watch this show then you are seriously missing out. This is the only show I would call perfect. 10/10"
    },
    {
      "username": "horrorelitis",
      "userUrl": "https://www.imdb.com/user/ur59672555",
      "reviewLink": "https://www.imdb.com/review/rw3551791",
      "warningSpoilers": false,
      "date": "27 September 2016",
      "rate": "10",
      "helpful": "25 out of 31 found this helpful.",
      "title": "Blew me away!",
      "content": "This is my first ever anime series and I'm happy I got to catch up on this gem of a show! Though I hardly play sports nowadays but it revived my interest in athletics. It has all the emotions, great story and likable characters. It shows how to have passion for something you love and how it can take you to great heights! It's all about doing what you love and have a burning desire to excel in it.It inspired me that failure can be a stepping stone to success, importance of teamwork, believing in your abilities and ignoring your imperfections at the same time.PS Eagerly waiting for another season!"
    },
    {
      "username": "chrisbrooks-19259",
      "userUrl": "https://www.imdb.com/user/ur63878031",
      "reviewLink": "https://www.imdb.com/review/rw5955603",
      "warningSpoilers": false,
      "date": "31 July 2020",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Wow! Just Wow!",
      "content": "I saw the great reviews and thought, how good can a volleyball manga be, the answer is a 11 out of 10! High flying action, great characters, excitement all the way through..... I could not stop watching! Exceeded every expectation I had about this show! I strongly advise you to stop reading this and go watch Haiku right now!"
    },
    {
      "username": "rajaramautt",
      "userUrl": "https://www.imdb.com/user/ur83402191",
      "reviewLink": "https://www.imdb.com/review/rw5880799",
      "warningSpoilers": false,
      "date": "4 July 2020",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Beat series I ever seen",
      "content": "I don't know nothing about volleyball but after this series I love with it. Best series , must watch and never miss it."
    },
    {
      "username": "lionranger",
      "userUrl": "https://www.imdb.com/user/ur91715423",
      "reviewLink": "https://www.imdb.com/review/rw5375267",
      "warningSpoilers": false,
      "date": "2 January 2020",
      "rate": "10",
      "helpful": "10 out of 13 found this helpful.",
      "title": "Awwwwesommee",
      "content": "This anime must be watched by anyone who loves any kind of sports.It will make you laugh it will make yo wanna never give up It'll make u love every character even the opponents It'll make u wanna play volleyball no doubt It'll make you wanting to win any game.Im not good at words soo.U Gotta Watch This cause\"We Haven't Lost Yet\""
    },
    {
      "username": "adriano-40012",
      "userUrl": "https://www.imdb.com/user/ur69368647",
      "reviewLink": "https://www.imdb.com/review/rw5294491",
      "warningSpoilers": false,
      "date": "2 December 2019",
      "rate": "10",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Overwhelmed with joy",
      "content": "Haikyuu deserves a 10/10. The show is made up brilliantly and there's no filler episode were I spend my time on the phone. The pace of the show and the typical Anime serious moments in this are perfect, not to exaggerated. I swear I like Volleyball as a Sport, but never thought I'd watch an Anime about it. Haikyuu stays for team spirit, development, goals, nice humor, lovely and sad scenes. I found this masterpiece on Netflix and I'm not surprised this hasn't an equal hype like other sport Anime's ( Captain Tsubasa ), cause it's just Volleyball. Well then I tell you if you think like that you'll 100% miss an amazing and entertaining show. I'm super excited for next years season."
    },
    {
      "username": "nh3_ammonia",
      "userUrl": "https://www.imdb.com/user/ur93820964",
      "reviewLink": "https://www.imdb.com/review/rw6213054",
      "warningSpoilers": false,
      "date": "28 October 2020",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Karasu notatakai",
      "content": "Damn it's a pure masterpiece. I've just finished season 4 and I can't wait for season 5. This anime is one of the best anime I have ever watched and it leaves me shook whenever Karasuno enters the court. Watch this series. If this is your first time watching anime don't worry it'll be one of your best one. This has all sorts of emotions and it'll take you to a roller coaster ride. It is so motivational and breathtaking. It feels like you are watching a real match and words can't describe how much I am in love with this show. All I can say is \"woah\" whenever I watch this.. I personally can't binge anime for too long but this was my first show where I've binged it real hard. I would definitely recommend this show. What are you waiting for man? Go watch this show :). Ooo by the way Kageyama, Tsukishima and Tetsuro are my fav characters. I guess it'll be your fav too. :O :)))"
    },
    {
      "username": "hridayvikasbilla",
      "userUrl": "https://www.imdb.com/user/ur63497518",
      "reviewLink": "https://www.imdb.com/review/rw5538367",
      "warningSpoilers": false,
      "date": "9 March 2020",
      "rate": "9",
      "helpful": "9 out of 12 found this helpful.",
      "title": "BEST SPORTS ANIME!!",
      "content": "Had doubts watching this because I wasn't that much into voleyball but man oh man it's so entertaining now I am totally into it. You would like every character in this series even antagonists are hella nice, certainly a show to watch for sports lovers."
    },
    {
      "username": "TreeFiddy53",
      "userUrl": "https://www.imdb.com/user/ur118562022",
      "reviewLink": "https://www.imdb.com/review/rw6597136",
      "warningSpoilers": false,
      "date": "14 February 2021",
      "rate": "8",
      "helpful": "5 out of 7 found this helpful.",
      "title": "If you like Volleyball/Anime/Sports, you should totally check this out!",
      "content": "One of the challenges of a sports story, IMO, is that it's the same game, and there are only so many different things you can show in each game without making it seem repetitive. Easier to do in a movie in which the entire sports content may last for 30-40 mins from a 2 hour movie, therefore tougher to pull this off in a tv show.This complexity is taken to a whole new level when you show a Volleyball match over 1.5 to 2.5 episodes/30-60 mins (60-90 mins in real life?) you have to be as detailed as possible. So how do you show as many details as you can without losing the intensity, keeping in mind that there are several other matches to follow in the entire tournament? I think the writers did an amazing job in dealing with this challenge.As the case is with all sports stories - self/over confidence, ambition, determination, winning/losing, teamwork, conflicts etc. are explored and are not overdone. I've only finished Season 1 for now, but will be watching the other 3 seasons as well. So far, the storytelling and the sports action has been amazing! There're a decent amount of humor and emotions too. If you don't know anything about the sport, that's fine, they do a good job of explaining everything.If you like Volleyball/Anime/Sports, you should totally check this out!"
    },
    {
      "username": "iamnayeem",
      "userUrl": "https://www.imdb.com/user/ur111732669",
      "reviewLink": "https://www.imdb.com/review/rw5553674",
      "warningSpoilers": false,
      "date": "15 March 2020",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "One of the best anime series in the world.",
      "content": "Everybody's reactions, feelings, actions, sounds, directions perfectly doing. I love this anime. This is motivating also. I get goosebumps many time😊😚. I recommend to watch this anime series."
    },
    {
      "username": "ayanraktim",
      "userUrl": "https://www.imdb.com/user/ur101471385",
      "reviewLink": "https://www.imdb.com/review/rw5753275",
      "warningSpoilers": false,
      "date": "19 May 2020",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "A masterpeice",
      "content": "I watched tons of tv series but trust me, It is the one which gives me goosebumps. The reason is, it carries the emotion of friendship, trust, and most importantly immense determination to surpass one's limit and reach another peak. I am simply grateful for such a beautiful script and a series of emotions.😍"
    },
    {
      "username": "aimee_gervais",
      "userUrl": "https://www.imdb.com/user/ur74168939",
      "reviewLink": "https://www.imdb.com/review/rw5523980",
      "warningSpoilers": false,
      "date": "3 March 2020",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "I love it!",
      "content": "I never watch sports anime's but I loved this one! I really wish there were more seasons, because I want to see how far they go! My review is a must watch!!"
    },
    {
      "username": "naderxdsae",
      "userUrl": "https://www.imdb.com/user/ur106521073",
      "reviewLink": "https://www.imdb.com/review/rw5054158",
      "warningSpoilers": false,
      "date": "11 August 2019",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Amazing",
      "content": "Amazing fighting beautiful characters Gemla also and the story is good and manga is also wonderful and do not forget the hero of the strong story, which you will love despite you"
    },
    {
      "username": "bdnahian",
      "userUrl": "https://www.imdb.com/user/ur126911477",
      "reviewLink": "https://www.imdb.com/review/rw7040874",
      "warningSpoilers": false,
      "date": "18 June 2021",
      "rate": "9",
      "helpful": "4 out of 6 found this helpful.",
      "title": "Awesome",
      "content": "This is the second best Sports anime I've ever watched. The first one is inazuma eleven. I was so thrilled to watch this. The mc was super cool. I actually not into volleyball that's why I didn't want to watch it at first but a friend insisted so I gave it a go and here I am. Waiting for season 5. If you want advice then Don't hesitate start to watch it. I assure you Won't regret."
    },
    {
      "username": "louisagongz",
      "userUrl": "https://www.imdb.com/user/ur118812661",
      "reviewLink": "https://www.imdb.com/review/rw5766433",
      "warningSpoilers": false,
      "date": "24 May 2020",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Every episode is addicting:)",
      "content": "Haikyuu is very addicting. It's magnificent, glorious and entertaining. It is flawless in almost every way possible so it has to be one of the greatest anime series in the world. It has brilliant comedy in every episode, I even cried so badly that I couldn't even breathe! The characters are inspirational and beautifully presented. Overall one of the best anime of all time, it's worth watching. I enjoyed every second of it and I don't hate anything about it. It makes so many people motivated to start or continue playing volleyball. It's also a great opportunity to learn some strategies and techniques if you want to improve your volleyball. It's pure perfection. 11/10"
    },
    {
      "username": "zimi_jd",
      "userUrl": "https://www.imdb.com/user/ur19799171",
      "reviewLink": "https://www.imdb.com/review/rw5486773",
      "warningSpoilers": false,
      "date": "15 February 2020",
      "rate": "10",
      "helpful": "5 out of 7 found this helpful.",
      "title": "AMAZING: If I reviewed it, must be something good here",
      "content": "All, I barely come here to review. But I thought this show deserved it. Those animations, those reactions, those twists, that story, those engaging characters (Oikawa OMG I love him, hope they show him more), not done yet.....those comical instances, those Feel GOOD moments makes this show AMAZING. Highly recommend everyone to watch it. I started watching this show randomly coz I had nothing else to watch, I swear....but I ended up binging the whole thing on Netflix. And guess what, it did inspire the F out of me and makes you want to improve yourself as a whole. Watch 1st 3-4 episodes and look for yourself. I bet you'd finish the whole thing too haha. TC"
    }
  ],
  "errorMessage": ""
}