{
  "imDbId": "tt7120662",
  "title": "Derry Girls",
  "fullTitle": "Derry Girls (TV Series 2018–2022)",
  "type": "TVSeries",
  "year": "2018",
  "items": [
    {
      "username": "tr91",
      "userUrl": "https://www.imdb.com/user/ur41569276",
      "reviewLink": "https://www.imdb.com/review/rw4057827",
      "warningSpoilers": false,
      "date": "9 February 2018",
      "rate": "9",
      "helpful": "189 out of 201 found this helpful.",
      "title": "Derry Girls",
      "content": "Derry Girls is one of the best new comedies I have seen on TV in recent times. There's great chemistry between the lead characters who are all likable and have their own hilarious personal traits. The supporting cast are also excellent, Grandad Joe in particular I thought was very funny. I laughed a lot throughout the series and it also handled some sensitive subjects very well. I am glad that it's already been confirmed we will have a series 2!"
    },
    {
      "username": "Lejink",
      "userUrl": "https://www.imdb.com/user/ur15298231",
      "reviewLink": "https://www.imdb.com/review/rw4734113",
      "warningSpoilers": false,
      "date": "20 March 2019",
      "rate": "8",
      "helpful": "62 out of 69 found this helpful.",
      "title": "Derry funny indeed",
      "content": "I'd almost given up on TV sit-coms, in fact the last one I really enjoyed was \"The I.T. Guys\" and how many years ago was that? Anyway, it was my wife who alerted me to this series and a quick look at the first two episodes of the second series found me looking up series one which she'd already watched and I have to say she wasn't wrong, as I found it absolutely hilarious.It reminded me of so many of my favourite sit-coms, like \"Father Ted\", naturally, \"Press Gang\" and yes, \"The I.T. Guys\", but it still has its own identity. Set in early 1990's Derry in Northern Ireland before the Good Friday Agreement came into place, it concerns the misadventures of a group of five young friends, four female and Irish, one male and English and by extension their eccentric families.It makes clever use of the political and religious backdrop for the comedy, the families in question being Roman Catholics living in the predominantly Protestant town of Derry, so that one episode has the hapless family attempting to head for a weekend in the country while an Orange Walk is in full swing, while another sees the young gang claim to have had holy visions in a chapel, with a statue of the Virgin Mary apparently \"smirking\" at them.The situations are amusingly set up, but it's the rapid-fire gags, often near-the-knuckle, which had me creasing myself as well as the individual characterisations themselves. I don't know who my favourite is amongst them but the central character of Erin, with her teenage crushes, literary pretensions and down-to-earth sensibilities probably shades it, although the hormonally imbalanced Michelle, uber-enthusiastic Clare and ditzy Orla and doormat James run her close and all get their share of the good lines on offer, not to mention their dysfunctional parents and grandparents too.All the episodes I've watched were of the same high standard with the only difficulty sometimes being the machine-gun-like Northern Irish delivery which can be a bit hard to pick up sometimes. That said I'm getting more than enough laughs from what I can see and hear so I'm not complaining too much. To all those many millions more people currently watching the appallingly bad \"Mrs Brown's Boys\" do yourself a favour and switch to this immediately."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw6341802",
      "warningSpoilers": false,
      "date": "6 December 2020",
      "rate": "10",
      "helpful": "48 out of 55 found this helpful.",
      "title": "I love seeing the girls....and James.",
      "content": "\"Derry Girls\" is a very clever comedy set at a girls school in Northern Ireland during 'the troubles'...the era when the IRA and the British Army were still at war with each other. Yet despite this situation, the show manages to be very light, funny and original....and is a treat worth seeing. My big complaint, however, is that the show is too good...to well written and with too likable characters. This is because the show was interrupted by COVID and I was left chomping on the bit waiting for MORE!!! In other words, the show really leaves you wanting more....and it's currently very frustrating as I want MORE!"
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw4057579",
      "warningSpoilers": true,
      "date": "9 February 2018",
      "rate": "9",
      "helpful": "77 out of 92 found this helpful.",
      "title": "Very funny but not for the easily offended",
      "content": "One might not think that a city so divided that what you call it identifies which side of the divide you are would be the first choice of where to locate a comedy; especially if it was set at a time when there were troops on the streets and the threat of sectarian violence was very real but somehow 'Derry Girls' works. As anybody in the UK or Ireland would guess this follows a group of Catholic girls in the city of Derry in Northern Ireland (had they been protestant it would no doubt have been called 'Londonderry Girls). The humour is such that people of whatever persuasion are likely to find it equally funny/offensive.The girls who attend an all-girls school are Erin, Orla, Clare and Michelle; in the first episode they are joined by Michelle's English cousin James who ends up going to the girls' school as it is feared he wouldn't survive at a boys' school. Over the course of the six episodes of the first season they get up to various amusing situations; James trying to find somewhere to go to the toilet in a girls' school; witnessing a possible miracle, which one of them knows was far from miraculous, getting stuck in the middle of an Orange Parade, and looking after visiting teenagers from Chernobyl amongst others.I feel this may be a very Marmite series; viewers will either love it or hate it and few are likely to be merely indifferent. Yes, it is puerile at times but it was done in a way that I found hilarious. The characters, both young and old, are all pretty funny with the cast doing a great job making them believable even when the situation gets comically exaggerated. While we do see evidence of The Troubles for the most part it remains in the background as the characters get on with their lives as though such things were perfectly normal. Overall I'd say that this certainly won't be for everybody but if you want a good laugh and aren't easily offend it I'd recommend giving it a go... I can't wait for the promised series two."
    },
    {
      "username": "Saiph90",
      "userUrl": "https://www.imdb.com/user/ur10327852",
      "reviewLink": "https://www.imdb.com/review/rw4051041",
      "warningSpoilers": true,
      "date": "2 February 2018",
      "rate": "10",
      "helpful": "53 out of 61 found this helpful.",
      "title": "One of the best comedies I have watched in a long time",
      "content": "Last night was brilliant loved the line \"they are practising\" \"you would think after three hundred years of playing the same song the would have learnt it by now\" might not be word perfect but that is the gist, excellent writing, acting and really funny. Look forward to it every week."
    },
    {
      "username": "bjbsf",
      "userUrl": "https://www.imdb.com/user/ur75791303",
      "reviewLink": "https://www.imdb.com/review/rw4558931",
      "warningSpoilers": false,
      "date": "3 January 2019",
      "rate": "9",
      "helpful": "109 out of 116 found this helpful.",
      "title": "Brilliantly Conceived and Written",
      "content": "Hilarious, quick, quirky and brilliantly written. Funniest thing on Netflix. Set in Northern Ireland during the troubles, the jokes come from all directions-family, growing up, fitting in, Catholic schools, the folly of religious conflicts, and on and on. Lisa McGee has created a phenomenal show populated with engagingly funny characters everywhere you turn."
    },
    {
      "username": "Robwiener",
      "userUrl": "https://www.imdb.com/user/ur5459646",
      "reviewLink": "https://www.imdb.com/review/rw5042763",
      "warningSpoilers": false,
      "date": "6 August 2019",
      "rate": "10",
      "helpful": "147 out of 155 found this helpful.",
      "title": "You Don't. Have To Be Irish To Love This Show",
      "content": "One of the top 10 funniest shows I have ever seen and I am a 65 yr. old American. I just binged Season 2 and happy to report Season 3 has been confirmed. I don't often laugh out loud in my home when viewing comedy yet every episode has made me do so. Every cast member is brilliant and so is the writing. I was utteriy amazed that Clare and Michelle are in their 30's. The other 2 girls are 25. It is a testament to their acting ability that they portray teenagers so convincingly. I hope Season 3 has about 10 episodes instead of 6."
    },
    {
      "username": "Lee-107",
      "userUrl": "https://www.imdb.com/user/ur0332248",
      "reviewLink": "https://www.imdb.com/review/rw4599540",
      "warningSpoilers": false,
      "date": "22 January 2019",
      "rate": "10",
      "helpful": "38 out of 44 found this helpful.",
      "title": "Hilarious!",
      "content": "I haven't laughed so much for any how of late as I have for this one. Saw this on Netflix and can't recommend it highly enough. I thought all the actors did a fantastic job. I especially liked Siobhan McSweeney who plays Sister Micheal. She's an absolute hoot and a real scene-stealer. Her deadpan dialogue delivery left me in splits. The script of this show is extremely witty. It really captures the angst and the indignation that the characters feel in the funniest way possible. I found myself remembering my \"rebel without a cause\" teenage days while watching this show. The principal cast - the four girls and James - share great chemistry and have done a fantastic job making sure the funny lines from the script really land. It's a pity this show only has 6 episodes. I liked it so much, I've seen it twice and really want more!"
    },
    {
      "username": "cherold",
      "userUrl": "https://www.imdb.com/user/ur0011762",
      "reviewLink": "https://www.imdb.com/review/rw4853669",
      "warningSpoilers": false,
      "date": "14 May 2019",
      "rate": "9",
      "helpful": "28 out of 35 found this helpful.",
      "title": "hilarious when I can tell what they're saying",
      "content": "As an American, I find the accents in Derry Girls fairly impenetrable. I can't make out half of what they say. And yet the other half is so hysterically funny that's it's worth the struggle.The series centers around 4 female high school friends living in Northern Ireland in the '80s. It's a strange setting for a broad comedy, yet it works, and it's fascinating to see how normal life is most of the time in a place famous for violence. Life goes on (as we're discovering in an increasingly dangerous America in 2019).The acting is wonderful, particularly Saoirse-Monica Jackson, who has the most expressive and rubbery face since Red Skelton, and an utterly hilarious Siobhan McSweeney as a snarky nun.I feel really sad that I can't make out so many of the jokes; I suspect if you're Irish you'd barely be able to breathe for laughing. Everyone should check this out."
    },
    {
      "username": "maccas-56367",
      "userUrl": "https://www.imdb.com/user/ur98002597",
      "reviewLink": "https://www.imdb.com/review/rw4911179",
      "warningSpoilers": false,
      "date": "4 June 2019",
      "rate": "10",
      "helpful": "23 out of 28 found this helpful.",
      "title": "A breath of fresh air",
      "content": "Imagine if \"The Inbetweeners\" were predominantly girls in 1990s Northern Ireland - that is basically the feel of Derry Girls, though it has an identity all of its own.Every actor and actress here have their own shining moments and fair share of laughs. It's superbly written and the episodes are the perfect, easy-to-digest length. If they were any longer, I'd probably pass out from laughing too much.There are so many quotable lines in this show. The backdrop of the Troubles adds an interesting, somewhat dark element to the show which sets it apart from other comedies of its type.I was bored one night and figured I would give this show a go for 5-10 minutes on Netflix. Well I was instantly hooked. I'm so glad they're now in production of Season 3. Somehow the thick Northern Irish accents make the comedy even funnier.Smart, hilarious and absolutely addictive. Give me more!"
    },
    {
      "username": "Calicodreamin",
      "userUrl": "https://www.imdb.com/user/ur29385135",
      "reviewLink": "https://www.imdb.com/review/rw5877263",
      "warningSpoilers": false,
      "date": "3 July 2020",
      "rate": "9",
      "helpful": "19 out of 23 found this helpful.",
      "title": "Cracker",
      "content": "Some truly hilarious moments, wacky storylines, and an abundance of fun. The cast has great chemistry and comedic timing. The episode storylines are original with a bit of history, which is enjoyable. A real class show."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw5026892",
      "warningSpoilers": false,
      "date": "29 July 2019",
      "rate": "10",
      "helpful": "23 out of 29 found this helpful.",
      "title": "whether funny or serious, there's always a story to tell from an unpleasant part of history",
      "content": "Lisa McGee's \"Derry Girls\" focuses on some teenage girls in Derry, Northern Ireland, in the 1990s, showing their friendship, education, and antics, all in the context of the Troubles.The show always has something good in store. It just goes to show that despite all the horror that's transpired in Northern Ireland over the years, there are plenty of good stories from there.I hope that the show continues."
    },
    {
      "username": "co-99106",
      "userUrl": "https://www.imdb.com/user/ur100443709",
      "reviewLink": "https://www.imdb.com/review/rw4782790",
      "warningSpoilers": false,
      "date": "15 April 2019",
      "rate": "10",
      "helpful": "73 out of 81 found this helpful.",
      "title": "Best comedy show I've seen in a long time",
      "content": "This show is a heartwarming and hilarious Brilliant writing and how it's set in Ireland during the troubles in the 90s is just very clever and brilliant"
    },
    {
      "username": "deepfatfriedoreos",
      "userUrl": "https://www.imdb.com/user/ur61610357",
      "reviewLink": "https://www.imdb.com/review/rw4062416",
      "warningSpoilers": false,
      "date": "14 February 2018",
      "rate": "10",
      "helpful": "101 out of 115 found this helpful.",
      "title": "Class.",
      "content": "A thoroughly enjoyable and hilarious addition to channel 4's comedic offerings. The extreme success of 'Derry Girls' lies deeply rooted in the effective well-rounded development of the main and recurring characters. With all four of the Derry Girls being totally antithetical to each other, the show seemingly appeals to a wide and diverse audience without losing sight of its purpose as a comedy. Set in 1990s Derry, McGee intricately intertwines the treacherous and realistic political undertones as an effective backdrop to successfully juxtapose the comedic on-goings in the lives of the core characters. It should win lots of awards."
    },
    {
      "username": "Kethina",
      "userUrl": "https://www.imdb.com/user/ur42835536",
      "reviewLink": "https://www.imdb.com/review/rw4530783",
      "warningSpoilers": false,
      "date": "24 December 2018",
      "rate": "8",
      "helpful": "45 out of 54 found this helpful.",
      "title": "A little nutty but still brilliant",
      "content": "This was an absolute TREAT. I did not know what to expect when I started watching this but after 2 or 3 scenes, I knew I was gonna binge watch this. I dont feel like The Troubles is a historical event that has been touched on very often in popular culture. That´s why I found it so refreshing to see it in a comedic way through the eyes of Derry teenagers.The writing was spot on, you could never tell what was going to happen or what someone was going to say. Everything was just surprisingly hilarious all the time. If you can overlook the fact that the actors who are playing the teenagers are around ten years older than they should be, then you´ll find their performances convincing. Some of them overacted sometimes (Erin´s character is a little unnatural) but since the whole show is a bit nutty it kind of works."
    },
    {
      "username": "shanayneigh",
      "userUrl": "https://www.imdb.com/user/ur1738956",
      "reviewLink": "https://www.imdb.com/review/rw6893851",
      "warningSpoilers": false,
      "date": "8 May 2021",
      "rate": "8",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Pleasantly surprised",
      "content": "Being a non-Irish man in my 40s I'm clearly not in the key demographic, but I really enjoyed this show. It felt a bit too broad and farcical for my tastes in the beginning, but it got better. The acting is solid throughout. I watched the whole thing in two days and am looking forward to season 3."
    },
    {
      "username": "dpoland-76589",
      "userUrl": "https://www.imdb.com/user/ur89661682",
      "reviewLink": "https://www.imdb.com/review/rw4536895",
      "warningSpoilers": false,
      "date": "26 December 2018",
      "rate": "10",
      "helpful": "23 out of 30 found this helpful.",
      "title": "Hysterical",
      "content": "So many laughs and much heart, set in an otherwise depressing time in Northern Irish recent history. The last 20 seconds of episode 6 really tied it together as a production. Can't wait for more."
    },
    {
      "username": "dhop-44683",
      "userUrl": "https://www.imdb.com/user/ur70272565",
      "reviewLink": "https://www.imdb.com/review/rw5561630",
      "warningSpoilers": false,
      "date": "19 March 2020",
      "rate": "10",
      "helpful": "23 out of 27 found this helpful.",
      "title": "Brilliant",
      "content": "I'm a 52 yo Australian bloke and this is only the third review I've ever written. Initially I was scepticalabout a show about teenage girls from Derry, but a mate highly recommended it. To put it simply, this is one of the best series I've seen. The comedy is interlaced with some truly poignant observations and social commentary. Brilliant. Kudos to the Lady who wrote and created this masterpiece.Did I mention Brilliant?!"
    },
    {
      "username": "PsychoBeard666",
      "userUrl": "https://www.imdb.com/user/ur103498042",
      "reviewLink": "https://www.imdb.com/review/rw4993516",
      "warningSpoilers": false,
      "date": "13 July 2019",
      "rate": "10",
      "helpful": "14 out of 19 found this helpful.",
      "title": "Flawless comedy",
      "content": "I'm not prattling on, just watch it. Practically a historically relevant piece of TV."
    },
    {
      "username": "begob",
      "userUrl": "https://www.imdb.com/user/ur24593235",
      "reviewLink": "https://www.imdb.com/review/rw4041884",
      "warningSpoilers": false,
      "date": "23 January 2018",
      "rate": "8",
      "helpful": "39 out of 62 found this helpful.",
      "title": "Can I be Jim?",
      "content": "Gang of idiot schoolgirls and a dumb boy get everything wrong, every time. In Derry. During war.Plenty of laughs, and it felt like a synergy of Father Ted and Two Packets Of Crisps. Really liked all the characters, and lovely performances from the chubby anxious girl and the drawling diary reader. Pace keeps chopping along, and the music is peppy.The writer has great instincts, but I guess it's one of those gems that could be polished or tarnished with extra creative input."
    },
    {
      "username": "themwallace",
      "userUrl": "https://www.imdb.com/user/ur70281509",
      "reviewLink": "https://www.imdb.com/review/rw4035765",
      "warningSpoilers": false,
      "date": "17 January 2018",
      "rate": "10",
      "helpful": "70 out of 84 found this helpful.",
      "title": "Plankies and other blasted colonials need not apply...",
      "content": "But this is #@%&* hilarious! It's rare for any TV writing to surprise me with originality, and far rarer still for a \"comedy\" show to exhibit enough originality to catch me off guard, but this is a piece of abso-frecking-lute genius! If you're from the UK of GB & NI, watch it; you'll laugh your @rse off. If not, give it a try, and google lots. to try to get where these absolutely brilliant characterisations come from. I'm actually jealous that someone else wrote this brilliant work!"
    },
    {
      "username": "generationofswine",
      "userUrl": "https://www.imdb.com/user/ur14520497",
      "reviewLink": "https://www.imdb.com/review/rw4547597",
      "warningSpoilers": false,
      "date": "30 December 2018",
      "rate": "10",
      "helpful": "20 out of 32 found this helpful.",
      "title": "An Honest Review",
      "content": "Unlike my fiance, I've spent enough time there to easily understand the accent. She struggled a little, and unfortunately that meant that I had to translate a lot......and unfortunately that meant it wasn't exactly as hysterical for here as it clearly is for everyone else.But to be fair, unless you're speaking Spanish she is horrible with accents, for everyone else it should just take an episode.Point is I'm from Chicago, she's from Guatemala, we both laughed ourselves to tears. This isn't regional, literally anyone will understand it's comedic genius out the door.Don't avoid it because some of the reviews are claiming UK only, it's accessible and brilliantly hysterical for all"
    },
    {
      "username": "jbencker",
      "userUrl": "https://www.imdb.com/user/ur65204070",
      "reviewLink": "https://www.imdb.com/review/rw4677862",
      "warningSpoilers": false,
      "date": "21 February 2019",
      "rate": "9",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Funny and original",
      "content": "I usually stay away from shows and films about teenagers because I always get annoyed by the lame teenage drama, but the trailer of Derry Girls made the impression this would not be the usual teenage comedy and I can only agree after watching the show. There's no endless relationship drama or age-old clichés but instead the show is about the idiotic things a group of friends gets up to. The characters are original and fresh, each funny in their own way, working very well together. Standing out for me was Siobhan McSweeney as Sister Michael who is just so done with her students; her facial expressions are hilarious. But what really makes the show special is its setting. Set in the 90s in Northern Ireland it draws on a very specific historical situation (the Northern Ireland conflict) and transforms it brilliantly for comedy."
    },
    {
      "username": "CurtisWall",
      "userUrl": "https://www.imdb.com/user/ur26249311",
      "reviewLink": "https://www.imdb.com/review/rw4546818",
      "warningSpoilers": true,
      "date": "30 December 2018",
      "rate": "9",
      "helpful": "18 out of 23 found this helpful.",
      "title": "Nine stars wont be enough, we need ten!",
      "content": "It's always a gamble watching the first episode of a new show, especially one that haven't been watched by barly anyone else and very few reviews are in. I however was hooked from the first scene with Erins(Saoirse-Monica Jackson)diary monologue(read impermissibly by her cousin Orla played by Louisa Harland) over the current situation in Derry,northern Ireland. I find it refreshing that the series creators centeres a comedic story around a event in history know as the troubles, it's dark humor at its finest. I love the chemistry between the characters, especially the rivarly between Joe(Erins grandfather, played by Ian McElhinnely who recently starred in Game of thrones as Barristan Selmy) and Gerry(Erins father played byTommy Tiernan). There argument about the amount of chips-bags the family should buy for dinner is alone worth a watch. That is only one of many scenes absolutely hystericaly written and well-acted. The girls(aswell as their relatives) have there own gimmicks and they work really well with eachother throughout the episodes. Although the episodes are just over 20 minutes each they manage to tell a really good story with a defined beginning and ending. The reason why this haven't received ten stars from me is because I feel there is still alot more left to tell from the story about the girls in Derry. Hopefully something we will se more off in the future.I highly recommend these serie for anyone that likes these type off drama-comedies with some dark humor. For my own part I look forward to new episodes!"
    },
    {
      "username": "jamesmylercook",
      "userUrl": "https://www.imdb.com/user/ur84279912",
      "reviewLink": "https://www.imdb.com/review/rw4030055",
      "warningSpoilers": false,
      "date": "11 January 2018",
      "rate": "10",
      "helpful": "115 out of 134 found this helpful.",
      "title": "Very funny",
      "content": "I do not normally watch shows like this, but I found it to be laugh-out-loud funny."
    }
  ],
  "errorMessage": ""
}