{
  "imDbId": "tt7120662",
  "title": "Derry Girls",
  "fullTitle": "Derry Girls (TV Series 2018–2022)",
  "type": "TVSeries",
  "year": "2018",
  "language": "en",
  "titleInLanguage": "Derry Girls",
  "url": "https://en.wikipedia.org/wiki/Derry_Girls",
  "plotShort": {
    "plainText": "Derry Girls is a British teen sitcom, created and written by Lisa McGee, that premiered on 4 January 2018 on Channel 4 and ran for three series. The channel's most successful comedy since Father Ted, the series was inspired by McGee's own experiences growing up in Derry, Northern Ireland, in the 1990s, during the final years of the Troubles. It stars Saoirse-Monica Jackson, Louisa Harland, Nicola Coughlan, Jamie-Lee O'Donnell, and Dylan Llewellyn as five teenagers living in mid-1990s Derry while attending Our Lady Immaculate College, a fictional girls' Catholic secondary school based on the real-life Thornhill College, where McGee herself studied. Produced by British production company Hat Trick Productions, Derry Girls is filmed in Northern Ireland, with most scenes shot on location in Derry and some in Belfast.\r\nAlthough the plot lines of Derry Girls are fictional, the series frequently references actual events of the Troubles and the Northern Ireland peace process, including the 1994 IRA ceasefire announcement, the 1995 visit to Northern Ireland of President Bill Clinton and First Lady Hillary Clinton, and the Good Friday referendum of 1998. Archival footage relating to key political figures such as Ian Paisley, Gerry Adams, Martin McGuinness, John Hume and Mo Mowlam is shown via TV and radio broadcasts in family homes. The soundtrack features popular music of the era, by acts including Ace of Base, Blur, Cypress Hill, Salt-N-Pepa, Enya, the Corrs, Boyzone, and the Cranberries.\r\nThe first series, broadcast on Channel 4 in January and February 2018, became the most-watched series in Northern Ireland since modern records began in 2002. The series was renewed shortly after the pilot episode aired, and the second series was broadcast in March and April 2019. A third and final series set in 1996 and 1997 was commissioned for 2020, although filming was delayed due to the COVID-19 pandemic impact on television production, and premiered in April 2022. A final special extended 45-minute episode titled \"The Agreement\", set in 1998 during the signing of the Good Friday Agreement, aired on 18 May 2022.\r\nDerry Girls has inspired a mural of its main characters painted on the side of Badgers Bar and Restaurant at 18 Orchard Street, Derry, which has become a popular tourist attraction.",
    "html": "<p>Derry Girls is a British teen sitcom, created and written by Lisa McGee, that premiered on 4 January 2018 on Channel 4 and ran for three series. The channel's most successful comedy since Father Ted, the series was inspired by McGee's own experiences growing up in Derry, Northern Ireland, in the 1990s, during the final years of the Troubles. It stars Saoirse-Monica Jackson, Louisa Harland, Nicola Coughlan, Jamie-Lee O'Donnell, and Dylan Llewellyn as five teenagers living in mid-1990s Derry while attending Our Lady Immaculate College, a fictional girls' Catholic secondary school based on the real-life Thornhill College, where McGee herself studied. Produced by British production company Hat Trick Productions, Derry Girls is filmed in Northern Ireland, with most scenes shot on location in Derry and some in Belfast.</p><p>Although the plot lines of Derry Girls are fictional, the series frequently references actual events of the Troubles and the Northern Ireland peace process, including the 1994 IRA ceasefire announcement, the 1995 visit to Northern Ireland of President Bill Clinton and First Lady Hillary Clinton, and the Good Friday referendum of 1998. Archival footage relating to key political figures such as Ian Paisley, Gerry Adams, Martin McGuinness, John Hume and Mo Mowlam is shown via TV and radio broadcasts in family homes. The soundtrack features popular music of the era, by acts including Ace of Base, Blur, Cypress Hill, Salt-N-Pepa, Enya, the Corrs, Boyzone, and the Cranberries.</p><p>The first series, broadcast on Channel 4 in January and February 2018, became the most-watched series in Northern Ireland since modern records began in 2002. The series was renewed shortly after the pilot episode aired, and the second series was broadcast in March and April 2019. A third and final series set in 1996 and 1997 was commissioned for 2020, although filming was delayed due to the COVID-19 pandemic impact on television production, and premiered in April 2022. A final special extended 45-minute episode titled \"The Agreement\", set in 1998 during the signing of the Good Friday Agreement, aired on 18 May 2022.</p><p>Derry Girls has inspired a mural of its main characters painted on the side of Badgers Bar and Restaurant at 18 Orchard Street, Derry, which has become a popular tourist attraction.</p>"
  },
  "plotFull": {
    "plainText": "Derry Girls is a British teen sitcom, created and written by Lisa McGee, that premiered on 4 January 2018 on Channel 4 and ran for three series. The channel's most successful comedy since Father Ted, the series was inspired by McGee's own experiences growing up in Derry, Northern Ireland, in the 1990s, during the final years of the Troubles. It stars Saoirse-Monica Jackson, Louisa Harland, Nicola Coughlan, Jamie-Lee O'Donnell, and Dylan Llewellyn as five teenagers living in mid-1990s Derry while attending Our Lady Immaculate College, a fictional girls' Catholic secondary school based on the real-life Thornhill College, where McGee herself studied. Produced by British production company Hat Trick Productions, Derry Girls is filmed in Northern Ireland, with most scenes shot on location in Derry and some in Belfast.\r\nAlthough the plot lines of Derry Girls are fictional, the series frequently references actual events of the Troubles and the Northern Ireland peace process, including the 1994 IRA ceasefire announcement, the 1995 visit to Northern Ireland of President Bill Clinton and First Lady Hillary Clinton, and the Good Friday referendum of 1998. Archival footage relating to key political figures such as Ian Paisley, Gerry Adams, Martin McGuinness, John Hume and Mo Mowlam is shown via TV and radio broadcasts in family homes. The soundtrack features popular music of the era, by acts including Ace of Base, Blur, Cypress Hill, Salt-N-Pepa, Enya, the Corrs, Boyzone, and the Cranberries.\r\nThe first series, broadcast on Channel 4 in January and February 2018, became the most-watched series in Northern Ireland since modern records began in 2002. The series was renewed shortly after the pilot episode aired, and the second series was broadcast in March and April 2019. A third and final series set in 1996 and 1997 was commissioned for 2020, although filming was delayed due to the COVID-19 pandemic impact on television production, and premiered in April 2022. A final special extended 45-minute episode titled \"The Agreement\", set in 1998 during the signing of the Good Friday Agreement, aired on 18 May 2022.\r\nDerry Girls has inspired a mural of its main characters painted on the side of Badgers Bar and Restaurant at 18 Orchard Street, Derry, which has become a popular tourist attraction.\r\nSynopsis\r\nThe series follows Erin Quinn (Saoirse-Monica Jackson), her cousin Orla (Louisa Harland), their friends Clare (Nicola Coughlan), Michelle (Jamie-Lee O'Donnell), and Michelle's English cousin James (Dylan Llewellyn) as they navigate their teenage years during the end of the Troubles in Derry, where they all attend a Catholic girls' secondary school. The friends frequently find themselves in absurd situations amid the political unrest and cultural divides of the times.\r\nCast and characters\r\nMain\r\nSaoirse-Monica Jackson as Erin Quinn. Aged 16 at the start of the series, she is passionate and ambitious, with literary aspirations, but is at times either vain or overly concerned with how she is regarded by others.\r\nLouisa Harland as Orla McCool. Aged 15 at the start of the series, she is Erin's detached and eccentric maternal cousin. She takes many things literally and sometimes misses social cues. She often remains quiet and absent within group situations.\r\nNicola Coughlan as Clare Devlin. Intelligent and studious, and often the voice of reason in the gang, she is more intimidated than her friends by authority figures. At the end of series one, she comes out as a lesbian. Between the end of series three and the finale special, she and her mother Geraldine move to Strabane after her father's death (since Derry reminded her mother too much of Sean's death).\r\nJamie-Lee O'Donnell as Michelle Mallon. The wild child of the group, she often gets her friends into trouble through her keen interest in sex, drugs, and alcohol.\r\nDylan Llewellyn as James Maguire. Michelle's maternal cousin, he has grown up in London but comes to live with his aunt in Derry just before the start of the series. Out of concern for an English boy's safety at the local Christian Brothers school, James becomes the first male pupil at Our Lady Immaculate College. Although the girls make fun of James, they care about him and eventually accept him as a member of the group. Everyone in Derry assumes he is gay, despite his protestations.\r\nTara Lynne O'Neill as Mary Quinn. Erin's mother and the matriarch of the Quinn family, she has been married to Gerry for 17 years at the start of the series.\r\nTommy Tiernan as Gerry Quinn. Mary's husband and Erin's father, he is from Navan and works as a delivery driver. He has a strained relationship with his father-in-law.\r\nKathy Kiera Clarke as Sarah McCool. Orla's mother and Mary's younger sister, she is sweet but dim-witted, heavily focused on her own and other people's appearances. She is an inattentive mother and takes little responsibility for raising Orla.\r\nIan McElhinney as Joe McCool. Mary and Sarah's father, and Erin and Orla's maternal grandfather, he moved in with the Quinns after his wife died. Joe shows nothing but contempt for Gerry, constantly criticising him and encouraging Mary to leave him.\r\nSiobhán McSweeney as Sister George Michael, a Catholic nun. The headmistress of Our Lady Immaculate College, she rules the school with an iron fist. She views being a nun as a job rather than a calling, treating priests with indifference or even contempt and joking that she became a nun for the free accommodation.\r\nLeah O'Rourke as Jenny Joyce, a prefect and a suck-up despised by the friends. She is from a wealthy family (Jenny's father, a surgeon at Altnagelvin Hospital, once removed Orla's tonsils) and lives in a large house. Her mother Janette used to be friends with Mary, Sarah, Geraldine and Deirdre when they were teenagers back in 1977, but she drifted apart from them.\r\nRecurring\r\nAva Grace McAleese and Mya Rose McAleese as Anna Quinn, Erin's toddler sister. She is often seen, but is only referenced in dialogue once in the first episode where Gerry states that he and Mary have two children.\r\nBeccy Henderson as Aisling, Jenny's best friend and sidekick.\r\nClaire Rafferty as Miss Mooney, Sister Michael's deputy.\r\nAmelia Crowley as Deirdre Mallon, Michelle's mother and James' maternal aunt, who is a nurse.\r\nKevin McAleer as Colm McCool, Joe's brother and Mary and Sarah's paternal uncle, known for telling stories in a slow, ponderous style, with numerous digressions. His family avoids him whenever possible.\r\nPaul Mallon as Dennis, the aggressive proprietor of the corner shop the friends frequent.\r\nPhilippa Dunne as Geraldine Devlin, Clare's mother.\r\nPeter Campion as Father Peter Conway, a young priest on whom most of the girls (and James) have a crush.\r\nJamie Beamish as Ciaran, Sarah's love interest who works at a photography chain store.\r\nRobert Calvert as Jim-across-the-road, the Quinns' neighbour.\r\nMaria Laird as Tina O'Connell, a younger schoolmate of James and the girls, whom they once failed to intimidate and who now despises them.\r\nArdal O'Hanlon as Eamonn, Mary and Sarah's maternal first cousin.\r\nDavid Ireland as Sean Devlin, Clare's father. He makes his final appearance at the end of series 3, when he suffers from an aneurysm and dies after Clare visits him at his hospital bed.\r\nJulia Dearden as Maureen Malarkey, an elderly neighbour of the Quinns.\r\nAnthony Boyle as David Donnelly, a boy who Erin has a crush on.\r\nProduction\r\nFilming took place in Northern Ireland, with most scenes being shot in Derry and Belfast. The scenes onboard the train in S3 E3 took place at the Downpatrick and County Down Railway in Downpatrick, with the end of the episode being shot at the then-recently-closed Barry's Amusements in Portrush.\r\nThe show was renewed for a second series shortly after the airing of the pilot episode of the first series. Production of the second series began on 8 October 2018. The second series began airing on 5 March 2019. On 9 April 2019, immediately after the second series finale, it was confirmed by Channel 4 that Derry Girls would return for a third series. Production of the third series was due to commence in the spring of 2020, but was suspended following the announcement of the COVID-19 lockdown. On 21 July 2021, Nicola Coughlan confirmed that filming for the third series was set to commence in late 2021, with a premiere in early 2022. On 23 September 2021, series creator and writer Lisa McGee confirmed Derry Girls would end with its third series, stating \"it was always the plan to say goodbye after three series.\" On 21 December 2021, McGee and Coughlan announced on social media that filming of the final series had completed.\r\nBroadcast\r\nThe first series premiered on Channel 4 in the United Kingdom on Thursday nights at 10:00 pm, while the second series was moved to Tuesday nights at 9:15 pm, with the exception of the sixth episode, which was aired at 9:00 pm. The entire series is available to stream in the UK on All 4.\r\nThe series was picked up by Netflix internationally, with series 1 being released on 21 December 2018. Series 2 was released on 2 August 2019. The international version of the first series is now available to stream on Netflix in the UK and Ireland. The second series was added on 9 July 2020, but was temporarily removed from the service as it was mistakenly released a year early. The third and final series was released on 7 October 2022.\r\nEpisodes\r\nSeries 1 (2018)\r\nSeries 2 (2019)\r\nSeries 3 (2022)\r\nReception\r\nDerry Girls has become Channel 4's most successful comedy since Father Ted.\r\nDerry Girls mural\r\nLocated at 18 Orchard Street in Derry, a mural of the main cast of characters can be seen on the side of Badger's Bar. This popular tourist attraction was created by UV Arts and is one of many murals across the city. Derry is known for politically charged art, and the famed mural speaks to the popularity of the television programme and its relation to cultural change in the area.\r\nCritical reception\r\nDerry Girls has received critical acclaim. On Rotten Tomatoes, the first series holds an approval rating of 100% based on reviews from 24 critics with an average rating of 7.9/10. The website's critics consensus states: \"A perfectly curated cast and raw writing drive Derry Girls's dark humor as creator Lisa McGee makes frenetic light of teen life in 1990s Northern Ireland\".\r\nThe second series has an approval rating of 97%, based on reviews from 33 critics with an average rating of 8.3/10. The website's critics consensus states: \"The sophomore season of Derry Girls doesn't lose any of its irreverent charms thanks to its predictably unpredictable romps and canny characterizations\".\r\nThe third series holds a \"Certified Fresh\" approval rating of 100%, based on reviews from 21 critics with an average rating of 8.9/10. The website's critics consensus states: \"Parting is such sweet sorrow, but Derry Girls' final season promises to milk as many laughs as it can before viewers say a fond farewell to this lovable band of miscreants.\" On Metacritic, which uses a weighted average, it received a score of 86 out of 100 based on five critic reviews, indicating \"universal acclaim\".\r\nDerry Girls was the most watched series in Northern Ireland since modern records began in 2002, with an average audience of 519,000 viewers and a 64.2 per cent share of the audience. Una Mullally of The Irish Times praised the series: \"The writing in Derry Girls is sublime, the performances perfect, the casting is brilliant.\" On 11 January 2018, after the first episode had aired, the programme was renewed for a second series. Each episode was watched by over two million people. At the conclusion of the first series, Barbara Ellen of The Guardian wrote that Derry Girls evoked such programmes as The Inbetweeners, Father Ted and Bad Education.\r\nPublic reception\r\nAs there are slight political undertones to the show, responses have highlighted the comedic nature as keeping the material lighthearted enough to enjoy. Certain writers from various online articles have noted that their own Northern Irish family appreciated the way the show gave an honest portrayal of how life was for teens in the Troubles, and how much was endured by families during that time. The way it portrayed the events and circumstances with a sense of normality echoed the real lives of both Protestants and Catholics in that area.\r\nLisa McGee based events in the programme on her own life, such as writing a letter to the Clintons' daughter, Chelsea. Adding real stories such as this to the episodes grounded the show in a way that allowed viewers to connect with the teenage attitudes of the characters, and served as a stark contrast to the events around them. The juxtaposition of the Troubles violence and teenage life resonated with many viewers and critics alike, making it one of the features of the show that made it so successful.\r\nPopular culture\r\nThe Simpsons episode \"You Won't Believe What This Episode Is About – Act Three Will Shock You!\", which aired on 13 March 2022, features an ice cream parlour called Dairy Girls Ice Cream. Simpsons writer Matt Selman confirmed in a Tweet that it was a reference to Derry Girls, adding it was \"the least we could do\".\r\nRatings\r\nAccolades\r\nMerchandise\r\nA Derry Girls book, titled Erin's Diary: An Official Derry Girls Book, was released on 12 November 2020 by Trapeze Books.\r\nIn April 2022, a relaunch of the now-defunct British magazine Smash Hits, which ceased publication in 2006, issued a special, one-off edition, featuring Derry Girls, in promotion for its third series.\r\nIn other media\r\nThe Crystal Maze special\r\nCast members Saoirse-Monica Jackson, Jamie-Lee O'Donnell, Louisa Harland, Nicola Coughlan and Dylan Llewellyn appeared in a 2018 special episode of the British game show The Crystal Maze. The episode raised money for Stand Up to Cancer UK and was well received by viewers and fans of the show.\r\nGreat British Bake Off holiday episode\r\nFor the 2020 New Year holiday, the cast competed on a special episode of The Great British Bake Off. Cast members Coughlan, O'Donnell, Llewellyn, Siobhán McSweeney, and Jackson all appeared for the special.\r\nIn GBBO fashion, there were three challenges to be completed and tasted by judges Paul Hollywood and Prue Leith. The first challenge was a trifle, then blinis in the technical round, finishing with a showstopper tiered cake that each member had to design in a decades theme. At the end of the competition, Jackson was declared the winner.",
    "html": "<p>Derry Girls is a British teen sitcom, created and written by Lisa McGee, that premiered on 4 January 2018 on Channel 4 and ran for three series. The channel's most successful comedy since Father Ted, the series was inspired by McGee's own experiences growing up in Derry, Northern Ireland, in the 1990s, during the final years of the Troubles. It stars Saoirse-Monica Jackson, Louisa Harland, Nicola Coughlan, Jamie-Lee O'Donnell, and Dylan Llewellyn as five teenagers living in mid-1990s Derry while attending Our Lady Immaculate College, a fictional girls' Catholic secondary school based on the real-life Thornhill College, where McGee herself studied. Produced by British production company Hat Trick Productions, Derry Girls is filmed in Northern Ireland, with most scenes shot on location in Derry and some in Belfast.</p><p>Although the plot lines of Derry Girls are fictional, the series frequently references actual events of the Troubles and the Northern Ireland peace process, including the 1994 IRA ceasefire announcement, the 1995 visit to Northern Ireland of President Bill Clinton and First Lady Hillary Clinton, and the Good Friday referendum of 1998. Archival footage relating to key political figures such as Ian Paisley, Gerry Adams, Martin McGuinness, John Hume and Mo Mowlam is shown via TV and radio broadcasts in family homes. The soundtrack features popular music of the era, by acts including Ace of Base, Blur, Cypress Hill, Salt-N-Pepa, Enya, the Corrs, Boyzone, and the Cranberries.</p><p>The first series, broadcast on Channel 4 in January and February 2018, became the most-watched series in Northern Ireland since modern records began in 2002. The series was renewed shortly after the pilot episode aired, and the second series was broadcast in March and April 2019. A third and final series set in 1996 and 1997 was commissioned for 2020, although filming was delayed due to the COVID-19 pandemic impact on television production, and premiered in April 2022. A final special extended 45-minute episode titled \"The Agreement\", set in 1998 during the signing of the Good Friday Agreement, aired on 18 May 2022.</p><p>Derry Girls has inspired a mural of its main characters painted on the side of Badgers Bar and Restaurant at 18 Orchard Street, Derry, which has become a popular tourist attraction.</p><br/><h3>Synopsis</h3><p>The series follows Erin Quinn (Saoirse-Monica Jackson), her cousin Orla (Louisa Harland), their friends Clare (Nicola Coughlan), Michelle (Jamie-Lee O'Donnell), and Michelle's English cousin James (Dylan Llewellyn) as they navigate their teenage years during the end of the Troubles in Derry, where they all attend a Catholic girls' secondary school. The friends frequently find themselves in absurd situations amid the political unrest and cultural divides of the times.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Saoirse-Monica Jackson as Erin Quinn. Aged 16 at the start of the series, she is passionate and ambitious, with literary aspirations, but is at times either vain or overly concerned with how she is regarded by others.</li><li>Louisa Harland as Orla McCool. Aged 15 at the start of the series, she is Erin's detached and eccentric maternal cousin. She takes many things literally and sometimes misses social cues. She often remains quiet and absent within group situations.</li><li>Nicola Coughlan as Clare Devlin. Intelligent and studious, and often the voice of reason in the gang, she is more intimidated than her friends by authority figures. At the end of series one, she comes out as a lesbian. Between the end of series three and the finale special, she and her mother Geraldine move to Strabane after her father's death (since Derry reminded her mother too much of Sean's death).</li><li>Jamie-Lee O'Donnell as Michelle Mallon. The wild child of the group, she often gets her friends into trouble through her keen interest in sex, drugs, and alcohol.</li><li>Dylan Llewellyn as James Maguire. Michelle's maternal cousin, he has grown up in London but comes to live with his aunt in Derry just before the start of the series. Out of concern for an English boy's safety at the local Christian Brothers school, James becomes the first male pupil at Our Lady Immaculate College. Although the girls make fun of James, they care about him and eventually accept him as a member of the group. Everyone in Derry assumes he is gay, despite his protestations.</li><li>Tara Lynne O'Neill as Mary Quinn. Erin's mother and the matriarch of the Quinn family, she has been married to Gerry for 17 years at the start of the series.</li><li>Tommy Tiernan as Gerry Quinn. Mary's husband and Erin's father, he is from Navan and works as a delivery driver. He has a strained relationship with his father-in-law.</li><li>Kathy Kiera Clarke as Sarah McCool. Orla's mother and Mary's younger sister, she is sweet but dim-witted, heavily focused on her own and other people's appearances. She is an inattentive mother and takes little responsibility for raising Orla.</li><li>Ian McElhinney as Joe McCool. Mary and Sarah's father, and Erin and Orla's maternal grandfather, he moved in with the Quinns after his wife died. Joe shows nothing but contempt for Gerry, constantly criticising him and encouraging Mary to leave him.</li><li>Siobhán McSweeney as Sister George Michael, a Catholic nun. The headmistress of Our Lady Immaculate College, she rules the school with an iron fist. She views being a nun as a job rather than a calling, treating priests with indifference or even contempt and joking that she became a nun for the free accommodation.</li><li>Leah O'Rourke as Jenny Joyce, a prefect and a suck-up despised by the friends. She is from a wealthy family (Jenny's father, a surgeon at Altnagelvin Hospital, once removed Orla's tonsils) and lives in a large house. Her mother Janette used to be friends with Mary, Sarah, Geraldine and Deirdre when they were teenagers back in 1977, but she drifted apart from them.</li></ul><h4>Recurring</h4><ul><li>Ava Grace McAleese and Mya Rose McAleese as Anna Quinn, Erin's toddler sister. She is often seen, but is only referenced in dialogue once in the first episode where Gerry states that he and Mary have two children.</li><li>Beccy Henderson as Aisling, Jenny's best friend and sidekick.</li><li>Claire Rafferty as Miss Mooney, Sister Michael's deputy.</li><li>Amelia Crowley as Deirdre Mallon, Michelle's mother and James' maternal aunt, who is a nurse.</li><li>Kevin McAleer as Colm McCool, Joe's brother and Mary and Sarah's paternal uncle, known for telling stories in a slow, ponderous style, with numerous digressions. His family avoids him whenever possible.</li><li>Paul Mallon as Dennis, the aggressive proprietor of the corner shop the friends frequent.</li><li>Philippa Dunne as Geraldine Devlin, Clare's mother.</li><li>Peter Campion as Father Peter Conway, a young priest on whom most of the girls (and James) have a crush.</li><li>Jamie Beamish as Ciaran, Sarah's love interest who works at a photography chain store.</li><li>Robert Calvert as Jim-across-the-road, the Quinns' neighbour.</li><li>Maria Laird as Tina O'Connell, a younger schoolmate of James and the girls, whom they once failed to intimidate and who now despises them.</li><li>Ardal O'Hanlon as Eamonn, Mary and Sarah's maternal first cousin.</li><li>David Ireland as Sean Devlin, Clare's father. He makes his final appearance at the end of series 3, when he suffers from an aneurysm and dies after Clare visits him at his hospital bed.</li><li>Julia Dearden as Maureen Malarkey, an elderly neighbour of the Quinns.</li><li>Anthony Boyle as David Donnelly, a boy who Erin has a crush on.</li></ul><br/><h3>Production</h3><p>Filming took place in Northern Ireland, with most scenes being shot in Derry and Belfast. The scenes onboard the train in S3 E3 took place at the Downpatrick and County Down Railway in Downpatrick, with the end of the episode being shot at the then-recently-closed Barry's Amusements in Portrush.</p><p>The show was renewed for a second series shortly after the airing of the pilot episode of the first series. Production of the second series began on 8 October 2018. The second series began airing on 5 March 2019. On 9 April 2019, immediately after the second series finale, it was confirmed by Channel 4 that Derry Girls would return for a third series. Production of the third series was due to commence in the spring of 2020, but was suspended following the announcement of the COVID-19 lockdown. On 21 July 2021, Nicola Coughlan confirmed that filming for the third series was set to commence in late 2021, with a premiere in early 2022. On 23 September 2021, series creator and writer Lisa McGee confirmed Derry Girls would end with its third series, stating \"it was always the plan to say goodbye after three series.\" On 21 December 2021, McGee and Coughlan announced on social media that filming of the final series had completed.</p><br/><h3>Broadcast</h3><p>The first series premiered on Channel 4 in the United Kingdom on Thursday nights at 10:00 pm, while the second series was moved to Tuesday nights at 9:15 pm, with the exception of the sixth episode, which was aired at 9:00 pm. The entire series is available to stream in the UK on All 4.</p><p>The series was picked up by Netflix internationally, with series 1 being released on 21 December 2018. Series 2 was released on 2 August 2019. The international version of the first series is now available to stream on Netflix in the UK and Ireland. The second series was added on 9 July 2020, but was temporarily removed from the service as it was mistakenly released a year early. The third and final series was released on 7 October 2022.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Series</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th><th scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\">Ave. UK viewers<br>(millions)</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">4 January 2018</td><td style=\"padding:0 8px\">8 February 2018</td><td>2.84</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">5 March 2019</td><td style=\"padding:0 8px\">9 April 2019</td><td>3.10</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">12 April 2022</td><td style=\"padding:0 8px\">18 May 2022</td><td>3.17</td></tr></tbody></table><h4>Series 1 (2018)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#23434E;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#23434E;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>series</th><th scope=\"col\" style=\"background:#23434E\">Title</th><th scope=\"col\" style=\"background:#23434E\">Directed by</th><th scope=\"col\" style=\"background:#23434E\">Written by</th><th scope=\"col\" style=\"background:#23434E\">Original air date</th><th scope=\"col\" style=\"background:#23434E;width:10%\">UK viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 1\"</td><td style=\"text-align:center\"><span>Michael Lennox</span></td><td style=\"text-align:center\"><span>Lisa McGee</span></td><td style=\"text-align:center\">4 January 2018</td><td style=\"text-align:center\">3.28</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #23434E\">On the first day of the 1994 school year, Erin awakes to find Orla reading her diary and then clashes with her mother over teenagers' rights to privacy and individuality. Erin's crush David Donnelly invites her to his band's gig that evening. Michelle introduces her English cousin James to Erin, Clare, and Orla. A fight on the school bus lands the group in detention. The almost 98-year-old Sister Declan confiscates Michelle's lipstick and Erin's diary while supervising them, but then suddenly dies. Sister Michael enters to find Michelle retrieving her lipstick, Erin climbing out a window in an effort to get to David's gig, Clare (on a 24-hour fast to raise money for an African charity) devouring the remains of Sister Declan's sandwich, and James (barred from the female-only toilets) urinating into a bin. The friends' parents are summoned, and James discovers that his mother has gone back to London without him.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 2\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">11 January 2018</td><td style=\"text-align:center\">3.02</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #23434E\">The friends are eager to join a school trip to Paris until they discover the cost is <span>£</span>375. At the chip shop, they see a noticeboard advertising part-time jobs, and decide to earn the money to fund their trip. Joe's brother Colm, notorious for his monotonous stories, visits Erin's family to recount how two IRA terrorists tied him to his radiator by his shoelaces and stole his van to transport weapons across the <span class=\"mw-redirect\">border</span>. Sarah and Colm are later interviewed by <span>UTV</span>. Michelle steals the chip shop noticeboard so the friends will be the only job applicants. The intimidating owner Fionnula discovers the theft after Clare tells her mother. To make amends, the friends clean her shop while she attends a yoga class, but Michelle accidentally sets fire to the flat above the shop with <span>flaming shots</span>. The teens call Mary and Sarah, who tie them by their shoelaces to the radiators, intending to pretend that IRA terrorists tried to steal Fionnula's van. Returning early, Fionnula catches them in the act, and Erin's family is banned from the chip shop.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 3\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">18 January 2018</td><td style=\"text-align:center\">2.78</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #23434E\">After cramming all night for a history exam, the friends see a dog resembling Erin's recently deceased pet, Toto. They pursue it into a church where it flees to the upper levels and urinates. The urine drips down onto a statue of the <span>Virgin Mary</span>, which Clare, overcome by sleep deprivation and caffeine, imagines is <span>weeping</span>. Michelle plays along, believing the friends will not have to sit their exam if they are witnesses to a miracle. A handsome young priest, Father Peter, investigates. He suggests that Toto was resurrected to lead Erin to the church, which appears to be confirmed when Toto's grave in the <span>back garden</span> is discovered to be empty. Overhearing her mother on the phone, Erin finds out that Mary faked Toto's death and gave the dog to their elderly neighbour. The friends maintain the hoax until Peter reveals to Erin that he was close to abandoning the priesthood to pursue a relationship. Believing he is attracted to her, Erin tells him the truth. On the front page of the <i><span>Derry Journal</span></i>, the friends are branded liars who pranked the <span>Catholic Church</span> and have to take their exam after all.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 4\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">25 January 2018</td><td style=\"text-align:center\">2.55</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #23434E\">In an <span>international exchange</span> to help victims of the <span>Chernobyl disaster</span>, several Ukrainian teenagers come to stay in Derry. The Quinn family hosts the <span>deadpan</span> Katya, who is uninterested in Erin and Orla's lives but immediately attracted to James. Mary and Sarah are horrified to discover their father Joe is dating a new woman, 62-year-old Maeve. Michelle is attracted to Artem, the Ukrainian staying with Jenny, and encourages her friends to attend Jenny's party. James plans to lose his virginity with Katya at the party, but Erin is determined to prevent him. After Erin finds condoms in Katya's bag, and several Ukrainian boys ask Erin to give Katya money they owe her, Erin accuses Katya in front of the entire party of being a prostitute. Katya explains she was collecting money from the other Ukrainians to buy Jenny a thank-you gift. Michelle discovers 'Artem' is actually Clive, a <span>Protestant</span> from East <span>Belfast</span> who took a wrong turn leaving <span class=\"mw-redirect\">Aldergrove Airport</span>; terrified of the <span>Catholics</span>, he pretended to be one of the Ukrainians. Katya decides to stay with Jenny's family for the remainder of her time in Derry.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 5\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">1 February 2018</td><td style=\"text-align:center\">2.63</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #23434E\">On <span>12 July</span>, Erin's family and friends attempt to avoid the <span>Orange walks</span> by taking a holiday to <span>County Donegal</span> in the <span>Republic</span>. The group departs in two cars, with Joe insisting on navigating, only to lead the group into the middle of a hostile Orange parade. Sarah tells Michelle's <span>fortune</span>, predicting she will soon meet her future husband. After the group finally leaves Derry and drives toward the border, they discover an <span>Irish Republican Army</span> (IRA) terrorist hiding in their <span>boot</span>. Using the false name Emmett, he tells them he urgently needs to cross the border. Gerry and Joe argue over whether to risk arrest by transporting Emmett, while Michelle believes Emmett to be her future husband. As Gerry and Joe continue to disagree, Emmett flees the restaurant where they stopped for lunch, steals their tent—borrowed from their neighbour Jim—and departs in the boot of another car as the group watches.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 6\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">8 February 2018</td><td style=\"text-align:center\">2.76</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #23434E\">Gerry cannot collect Mary's birthday photos without the red docket that proves ownership. Mary accidentally puts the docket in the washing machine, dyeing the white clothes pink, including the friends' school shirts. Erin is appointed editor of the school magazine. Needing a lead story, she finds an anonymous entry by a lesbian pupil in the school's \"Searching for Myself\" writing contest. She prints it under the headline \"The Secret Life of a Lesbian!\" Sister Michael assumes the friends are wearing pink shirts to support <span>gay rights</span>, and bans the issue. The friends distribute it regardless, creating a sensation within the school. Clare <span>comes out</span> to Erin, confiding that she wrote the story, but Erin reacts negatively and the two fall out. At the school talent show, Orla performs a <span>step aerobics</span> routine to \"<span>Like a Prayer</span>\" (\"<span>Pray</span>\" in the international <span>Netflix</span> broadcast), eliciting ridicule. Coming to her defence, Erin, Clare, Michelle, and James join her onstage, ending Erin and Clare's feud. As the friends dance joyfully at school, Mary, Gerry, Sarah, and Joe watch sombrely at home as news reports of a fatal bombing filter through.</td></tr></tbody></table><h4>Series 2 (2019)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#000000;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#000000;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>series</th><th scope=\"col\" style=\"background:#000000\">Title</th><th scope=\"col\" style=\"background:#000000\">Directed by</th><th scope=\"col\" style=\"background:#000000\">Written by</th><th scope=\"col\" style=\"background:#000000\">Original air date</th><th scope=\"col\" style=\"background:#000000;width:10%\">UK viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Across the Barricade\"</td><td style=\"text-align:center\"><span>Michael Lennox</span></td><td style=\"text-align:center\"><span>Lisa McGee</span></td><td style=\"text-align:center\">5 March 2019</td><td style=\"text-align:center\">3.68</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #000000\">Students from Our Lady Immaculate attend a weekend-long Friends Across the Barricade peace initiative with pupils from a Protestant boys' school. An exercise to demonstrate how alike the two communities are fails when none of the pupils can name anything that Protestant and Catholics have in common. Each teen is paired with a \"buddy\" from the other school; Erin and Michelle hope to gain sexual experience with the Protestant boys, whom they imagine to be free of <span>Catholic guilt</span> and other hang-ups. After the friends sneak into the Protestant boys' dormitory for a late-night party, Michelle is disappointed to find her buddy wearing a <span>purity bracelet</span>, while Erin's buddy is unnerved by her advances. Deaf in one ear, Clare's buddy mishears the word \"Catholics\" as \"athletes\" and tells her he hates them, shocking her. The following day, the group are <span class=\"mw-redirect\">abseiling</span>. Forced to go first, and terrified that her \"Catholic-hating\" buddy will let her fall, Clare screams \"Don't let the Jaffa bastard hurt me!\" Her outburst triggers a mass brawl. All parents are called in, and their resulting lectures to their children inspire Erin to write \"Parents\" on the blackboard as something all the pupils have in common.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Ms De Brún and the Child of Prague\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">12 March 2019</td><td style=\"text-align:center\">3.35</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #000000\">Sister Michael takes a liking to a <span class=\"mw-redirect\">Child of Prague</span> statue. A charismatic new <span>English</span> teacher, Ms De Brún, inspires Erin and her friends. Mary and Gerry plan a date at the cinema, but Sarah, Ciaran, Joe, and Colm all tag along. They miss the end of <i><span>The Usual Suspects</span></i> when the cinema is evacuated due to a security alert, and Mary is tormented by not knowing the identity of <span>Keyser Söze</span>. The friends are invited to Ms De Brún's house, where she offers them wine. The next day, they learn Ms De Brún has left; thinking she has been fired, they steal the statue as leverage to force the school to retain her. Accidentally breaking off the statue's head, they glue it on upside down as Sister Michael walks in. The girls' parents are summoned, soon followed by Ms De Brún, who reveals she resigned for a better position elsewhere, contrary to her lessons of \"spontaneity\". The families are told to replace the statue, and the teens receive a week's suspension. Sister Michael tells Mary the plot twist of <i>The Usual Suspects</i>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Concert\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">19 March 2019</td><td style=\"text-align:center\">3.05</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #000000\">The friends are looking forward to a <span>Take That</span> concert in <span>Belfast</span>, but their parents forbid them to go after seeing news reports about a <span>polar bear</span> escaped from <span>Belfast Zoo</span>. The group sneak out and board a bus to Belfast, with Michelle bringing a suitcase of <span>vodka</span>. After Sister Michael also boards, the friends claim to be visiting the <span>Ulster Museum</span> for a history project and deny the suitcase is theirs. Sister Michael raises the alarm about unattended baggage, and the <span>British Army</span> uses a <span>remote control vehicle</span> to detonate the suitcase. Fleeing the scene, the friends accept a lift from a passing driver, Rita, who intends to sell knock-off merchandise at the concert. Drunk and distracted by opera, Rita collides with a sheep, which the girls are forced to move off the road. Back home, the adults learn that the polar bear was recaptured by firefighters near the <span>A6</span> whilst eating a sheep carcass. Michelle's and Clare's mothers arrive, expecting to find Michelle, James, and Clare there. The adults realise the teens lied to go to the concert, though they cannot prove it. Watching the concert on TV, Gerry laughs when he sees them in the audience, but does not tell the girls' mothers.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Curse\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">26 March 2019</td><td style=\"text-align:center\">3.08</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #000000\">At a family wedding, Sarah upsets the guests by wearing a white dress and upstaging the bride's entrance. Clare, Michelle, and James attend the wedding reception as Erin's guests. To Clare's horror, Michelle announces plans to obtain drugs from a shady connection called \"Macca\". After Mary and Sarah's maternal aunt Bridie insults Mary, Sarah, and Joe, Mary responds by telling Bridie to \"drop dead\"; seconds later, Bridie dies. Mary is perturbed by speculation that she has the power to curse people. At Bridie's <span>wake</span>, Michelle produces <span>hash</span> <span>scones</span>, which are inadvertently distributed to the other mourners. After retrieving most of the scones, the friends try to flush them down the toilet, blocking it and causing a flood. Recognising Bridie's earrings as having been stolen from their mother, Mary and Sarah take them off Bridie's corpse but are caught by Bridie's son Eamonn. Back home, to Erin's horror, Joe offers the family several scones saved from the wake.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Prom\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">2 April 2019</td><td style=\"text-align:center\">2.88</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #000000\">Jenny organises a 1950s-style prom. Erin invites John Paul, the subject of her unrequited affection. Mae, a new pupil of <span>East Asian</span> descent from <span>County Donegal</span>, asks Clare to go with her. Michelle steals her mother's credit card and the girls buy new prom dresses, planning to return them the following day as unworn. Mae vows revenge on Jenny for reserving the dress she wanted. Erin is crushed on the night of the prom when John Paul fails to show up, but Mary calls James, who skips his <i><span>Doctor Who</span></i> convention to take Erin to the dance. The friends realise that Mae is planning to humiliate Jenny as she is crowned <span class=\"mw-redirect\">prom queen</span>; noticing buckets suspended above the stage, James quickly explains the plot of <i><span>Carrie</span></i>. Clare tries to stop Mae as the others try to move Jenny offstage, but Jenny, Aisling, James, Erin, and Michelle end up drenched in what turns out to be tomato juice. The adults watch a TV news report of the <span class=\"mw-redirect\">IRA's ceasefire on 31 August 1994</span>, and join their neighbours celebrating in the street.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The President\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">9 April 2019</td><td style=\"text-align:center\">2.57</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #000000\">Derry awaits the visit of <span>President</span> <span>Bill Clinton</span> on 30 November 1995. Although Sister Michael insists that Our Lady Immaculate will remain open, all pupils besides Jenny and Aisling play <span class=\"mw-redirect\">truant</span> for the occasion. Having written to <span>Chelsea Clinton</span>, the friends naïvely hope to spend the day with her. Meanwhile, James's self-absorbed mother Cathy returns to Derry. James tells the others that he is going back to London with his mother that same day, and bids them goodbye. Michelle angrily confronts him, warning that his mother will let him down again. She tells him that despite his gender and English accent, he is a true Derry girl who belongs with them. Regardless, he departs for the airport. As Clinton is introduced, Orla spots James on the city walls shouting \"I am a Derry girl!\" Realising that he has decided to stay in Derry, the girls run to him and embrace him. The friends then walk arm-in-arm past a TV rental shop broadcasting Clinton's speech as he speaks of a peaceful and prosperous future for the city's young people.</td></tr></tbody></table><h4>Series 3 (2022)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#27346F;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#27346F;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>series</th><th scope=\"col\" style=\"background:#27346F\">Title</th><th scope=\"col\" style=\"background:#27346F\">Directed by</th><th scope=\"col\" style=\"background:#27346F\">Written by</th><th scope=\"col\" style=\"background:#27346F\">Original air date</th><th scope=\"col\" style=\"background:#27346F;width:10%\">UK viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Night Before\"</td><td style=\"text-align:center\"><span>Michael Lennox</span></td><td style=\"text-align:center\"><span>Lisa McGee</span></td><td style=\"text-align:center\">12 April 2022</td><td style=\"text-align:center\">3.60</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #27346F\">The girls and James are worrying about their <span class=\"mw-redirect\">GCSE</span> results, which are to be distributed the following morning. Joe's new cat, Seamus, is causing issues within the Quinn household when he continues to hunt and kill other animals in the area, while Joe refuses to put a collar bell on him. The friends run into Sister Michael, who implies that their exam results are poor, and mentions that the school has already received them. They decide to break into the school to find out their results. Inside, they encounter two men who claim to be clearing out old computer equipment, and they naïvely agree to help them. When the men drive away, the friends are arrested and interrogated at the police station by Chief Inspector Byers (<span>Liam Neeson</span>). In trying to prove their innocence, Erin enlists the help of her great-uncle, Colm. They are soon released when the culprits are captured on <span>CCTV</span>. Meanwhile, Joe and Gerry return home after burying a neighbour's pet rabbit, which Seamus had killed, while the friends decided to keep their \"uneventful\" night at the police station a secret. The next morning, they are all pleased to discover they have passed their exams.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Affair\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">19 April 2022</td><td style=\"text-align:center\">3.08</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #27346F\">During a hectic morning in the Quinn household, Mary finally snaps upon discovering there is no hot water along with the fact that she is always responsible for everything in the house. The school is holding a <i><span>Children in Need</span></i> event, and Father Peter informs the students that they are to compete in a \"<span>Stars in Their Eyes</span>\" competition, which is to be broadcast on television. Mary becomes smitten with the plumber, Gabriel, whom Gerry has hired to fix the heating system, and they find that they share a common interest in literature. Clare overhears Mary and Gabriel talking and jumps to the conclusion that they are having an affair. The friends become suspicious when Mary heads out for the evening, and borrowing Gerry's car, they trail her to a home in Pump Street where they see her with Gabriel. At the school concert, the friends are performing \"<span> Who Do You Think You Are</span>\" by the <span>Spice Girls</span>, before Erin runs off stage upon spotting Mary and Gabriel in the audience. It is revealed that Mary has a desire to go to university to study <span>English literature</span> and that Gabriel persuaded her to see a tutor.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep15\" style=\"text-align:center\">15</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Stranger on a Train\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">26 April 2022</td><td style=\"text-align:center\">3.05</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #27346F\">A train journey to an amusement park in <span>Portrush</span> becomes fraught with jeopardy and danger when it stalls in the middle of nowhere. Erin, Orla, Michelle and James discover that his bag has been accidentally switched with another passenger's—and it contains some rather suspicious equipment—and enter a debacle over how to switch them back. Meanwhile, Mary and Sarah are approached by a woman who apparently knows them but they do not remember, try and navigate the situation through vague conversation, and flee when they feel they are about to get caught out. Meanwhile, Clare is accidentally left behind at the railway station, and the situation is compounded by the coincidental appearance of Sister Michael as she waits for the next train, and made even more awkward by the prurient telephone conversation of the woman in the ticket office.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep16\" style=\"text-align:center\">16</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Haunting\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">3 May 2022</td><td style=\"text-align:center\">3.16</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #27346F\">The gang are roped into clearing the house of a distant relative of Sister Michael who has just died. James is accidentally knocked out by the school van after its handbrake is left off. A storm sets in, and the girls try to cope with what they believe to be the previous inhabitants of the house haunting them and trying to force them out. In the morning, James, who believes that he had a <span>near-death experience</span> while unconscious, tells Erin that he has liked her for a long time. The two kiss, much to the unhappiness of Michelle, who witnesses their private moment. At home, it is ten years since Mary's mother died, and she attempts to contact her in the afterlife with the help of a local medium. Joe hopes the medium will allow his late wife to tell him where his favourite razor is. The medium appears to be fraudulent, but Joe finds the razor soon after.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep17\" style=\"text-align:center\">17</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Reunion\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">10 May 2022</td><td style=\"text-align:center\">2.84</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #27346F\"><p>Mary and Sarah are preparing for their school reunion. They talk about meeting their former friend and classmate Janette Joyce (mother of the gang's nemesis Jenny Joyce), referring to an event that occurred during their school leavers' dance in 1977. At the reunion, Janette introduces them to her husband Richard, a surgeon who does not speak. Janette is reluctant to discuss the events of the dance in 1977, which are subsequently retold through <span>flashbacks</span>. During that night, Mary, Sarah, Geraldine and Janette had all tattooed themselves with skull-and-crossbones, photographs of which had been taken on a Polaroid camera by Michelle's mother's cousin Rob, who was visiting from Canada, while the students were held at the school during the night as a result of a nearby bomb scare. Despite Janette's protestations, they dig up these photos (which had been buried in a tin under a tree) and eventually reminisce, only to realise that the photos which they had dug up were not the ones taken by them and conclude that they had dug under the wrong tree.</p><i>Series main characters Clare, Michelle and James do not appear during this episode. Erin and Orla appear briefly during the first scene.</i></td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep18\" style=\"text-align:center\">18</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Halloween\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">17 May 2022</td><td style=\"text-align:center\">3.29</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #27346F\"><span>Fatboy Slim</span> is performing in Derry on Halloween night, and the group go to buy tickets. The ticket seller, Laurie, makes a date with Clare, saying that she will be at the concert dressed as a clown. The group purchase the last five tickets to the concert, only for a man in the shop to claim that they jumped the queue. He offers to fight James for the tickets; James panics and rips them up so that nobody can have them. Michelle obtains free VIP tickets to the show by falsely claiming that James lost his tickets in a mugging. At the concert, James uses a crutch to feign injury from the supposed attack. Clare is unable to find Laurie amongst all the people dressed as clowns. While the group remove people's clown masks to try to find her, James encounters the man he was supposed to fight for the tickets. He flees, revealing that his injury was fake. As the group are escorted out by security, Clare meets Laurie and they kiss. Outside the venue, a solemn Gerry informs Clare that her father Sean has suffered an aneurysm. The gang later are at the hospital. A tearful Clare emerges from seeing her father pass away; and the group embrace. The episode ends with Sean's funeral procession.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep19\" style=\"text-align:center\">19</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Agreement\"</td><td style=\"text-align:center\">Michael Lennox</td><td style=\"text-align:center\">Lisa McGee</td><td style=\"text-align:center\">18 May 2022</td><td style=\"text-align:center\">3.14</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #27346F\"><p>In 1998, a year after the events of the season 3 finale, Northern Ireland prepares to <span>vote on the Good Friday Agreement</span>. Erin and Orla are looking forward to their joint 18th birthday party. Clare has moved to <span>Strabane</span> with her mother after her father's death. Erin and Orla's party clashes with a much more lavish event organised by Jenny Joyce; they eventually abandon their own poorly-attended party (which is overshadowed by the <span>First Communion</span> party) to attend the rival event. They later meet Clare, who had come from Strabane to attend their party, only to be told that everyone had gone to Jenny's party. Clare caused a blackout at Jenny's house, causing all the attendees to go to the parish hall where Erin and Orla's party was taking place, and all celebrate. Later, the referendum on the Good Friday Agreement takes place and all of the characters cast their votes. The referendum passes with a 70% majority.</p>A present-day epilogue in <span>New York City</span> shows <span>Chelsea Clinton</span> receiving mail sent to her at the <span>White House in 1995</span>—the letter written in the season 2 finale.</td></tr></tbody></table><br/><h3>Reception</h3><p>Derry Girls has become Channel 4's most successful comedy since Father Ted.</p><h4>Derry Girls mural</h4><p>Located at 18 Orchard Street in Derry, a mural of the main cast of characters can be seen on the side of Badger's Bar. This popular tourist attraction was created by UV Arts and is one of many murals across the city. Derry is known for politically charged art, and the famed mural speaks to the popularity of the television programme and its relation to cultural change in the area.</p><h4>Critical reception</h4><p>Derry Girls has received critical acclaim. On Rotten Tomatoes, the first series holds an approval rating of 100% based on reviews from 24 critics with an average rating of 7.9/10. The website's critics consensus states: \"A perfectly curated cast and raw writing drive Derry Girls's dark humor as creator Lisa McGee makes frenetic light of teen life in 1990s Northern Ireland\".</p><p>The second series has an approval rating of 97%, based on reviews from 33 critics with an average rating of 8.3/10. The website's critics consensus states: \"The sophomore season of Derry Girls doesn't lose any of its irreverent charms thanks to its predictably unpredictable romps and canny characterizations\".</p><p>The third series holds a \"Certified Fresh\" approval rating of 100%, based on reviews from 21 critics with an average rating of 8.9/10. The website's critics consensus states: \"Parting is such sweet sorrow, but Derry Girls' final season promises to milk as many laughs as it can before viewers say a fond farewell to this lovable band of miscreants.\" On Metacritic, which uses a weighted average, it received a score of 86 out of 100 based on five critic reviews, indicating \"universal acclaim\".</p><p>Derry Girls was the most watched series in Northern Ireland since modern records began in 2002, with an average audience of 519,000 viewers and a 64.2 per cent share of the audience. Una Mullally of The Irish Times praised the series: \"The writing in Derry Girls is sublime, the performances perfect, the casting is brilliant.\" On 11 January 2018, after the first episode had aired, the programme was renewed for a second series. Each episode was watched by over two million people. At the conclusion of the first series, Barbara Ellen of The Guardian wrote that Derry Girls evoked such programmes as The Inbetweeners, Father Ted and Bad Education.</p><h4>Public reception</h4><p>As there are slight political undertones to the show, responses have highlighted the comedic nature as keeping the material lighthearted enough to enjoy. Certain writers from various online articles have noted that their own Northern Irish family appreciated the way the show gave an honest portrayal of how life was for teens in the Troubles, and how much was endured by families during that time. The way it portrayed the events and circumstances with a sense of normality echoed the real lives of both Protestants and Catholics in that area.</p><p>Lisa McGee based events in the programme on her own life, such as writing a letter to the Clintons' daughter, Chelsea. Adding real stories such as this to the episodes grounded the show in a way that allowed viewers to connect with the teenage attitudes of the characters, and served as a stark contrast to the events around them. The juxtaposition of the Troubles violence and teenage life resonated with many viewers and critics alike, making it one of the features of the show that made it so successful.</p><h4>Popular culture</h4><p>The Simpsons episode \"You Won't Believe What This Episode Is About – Act Three Will Shock You!\", which aired on 13 March 2022, features an ice cream parlour called Dairy Girls Ice Cream. Simpsons writer Matt Selman confirmed in a Tweet that it was a reference to Derry Girls, adding it was \"the least we could do\".</p><h4>Ratings</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">Series</th><th rowspan=\"2\">Timeslot</th><th rowspan=\"2\">Episodes</th><th colspan=\"2\">First aired</th><th colspan=\"2\">Last aired</th><th rowspan=\"2\" style=\"background:#ffdead;\">Rank</th><th rowspan=\"2\" style=\"background:#ffdead;\">Avg. <br> viewers <br> (millions)</th></tr><tr><th><small><b>Date</b></small></th><th><small><b>Viewers</b> <br> <b>(millions)</b></small></th><th><small><b>Date</b></small></th><th><small><b>Viewers</b> <br> <b>(millions)</b></small></th></tr><tr><td align=\"center\"><span class=\"mw-redirect\">1</span></td><th style=\"background:#F9F9F9;font-size:11px;font-weight:normal;text-align:left;line-height:110%;text-align:center;\">Thursday 10:00 pm</th><td align=\"center\">6</td><td align=\"center\">4 January 2018</td><td align=\"center\">3.28</td><td align=\"center\">8 February 2018</td><td align=\"center\">2.76</td><td style=\"background:#fc9; text-align:center;\"><b>4</b></td><td style=\"background:#fc9; text-align:center;\"><b>2.84</b></td></tr><tr><td align=\"center\"><span class=\"mw-redirect\">2</span></td><th style=\"background:#F9F9F9;font-size:11px;font-weight:normal;text-align:left;line-height:110%;text-align: center;\">Tuesday 9:15 pm <small>(episodes 1–5)</small><br>9:00 pm <small>(episode 6)</small></th><td align=\"center\">6</td><td align=\"center\">5 March 2019</td><td align=\"center\">3.68</td><td align=\"center\">9 April 2019</td><td align=\"center\">2.57</td><td style=\"background:#fc9; text-align:center;\"><b>4</b></td><td style=\"background:#fc9; text-align:center;\"><b>3.10</b></td></tr><tr><td align=\"center\"><span class=\"mw-redirect\">3</span></td><th style=\"background:#F9F9F9;font-size:11px;font-weight:normal;text-align:left;line-height:110%;text-align:center;\">Tuesday 9:15 pm <small>(episodes 1–2)</small><br>9:00 pm <small>(episodes 3–6)</small><br>Wednesday 9:00 pm <small>(episode 7)</small></th><td align=\"center\">7</td><td align=\"center\">12 April 2022</td><td align=\"center\">3.60</td><td align=\"center\">18 May 2022</td><td align=\"center\">TBA</td><td style=\"background:#fc9; text-align:center;\">TBA</td><td style=\"background:#fc9; text-align:center;\">TBA</td></tr></tbody></table><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th width=\"4%\">Year</th><th width=\"29%\">Award</th><th width=\"31%\">Category</th><th width=\"23%\">Nominee(s)</th><th width=\"9%\">Result</th><th scope=\"col\" class=\"unsortable\" width=\"4%\"><abbr title=\"Reference\">Ref.</abbr></th></tr><tr><td rowspan=\"7\">2018</td><td colspan=\"2\"><i><span>Radio Times</span></i> Comedy Champion Award</td><td><i>Derry Girls</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"4\"><span>IFTA</span> Gala Television Awards</td><td>Best Female Performance</td><td>Saoirse-Monica Jackson</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Best Male Performance</td><td><span>Tommy Tiernan</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Comedy</td><td><i>Derry Girls</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td>Best Writer in a Comedy or Soap</td><td rowspan=\"2\"><span>Lisa McGee</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">British Screenwriters' Awards</span></td><td>Best Comedy Writing on Television</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>British Comedy Guide Awards</span></td><td>Best New TV Sitcom</td><td rowspan=\"2\"><i>Derry Girls</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"5\">2019</td><td rowspan=\"2\"><span>Royal Television Society Awards</span></td><td>Best Scripted Comedy</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td>Best Writer (Comedy)</td><td>Lisa McGee</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Royal Television Society Craft &amp; Design Awards</span></td><td>Director - Comedy Drama/Situation Comedy</td><td><span>Michael Lennox</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td>Editing - Entertainment and Comedy</td><td>Lucien Clayton</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>British Academy Television Awards</span></td><td><span>Best Scripted Comedy</span></td><td rowspan=\"2\"><i>Derry Girls</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"3\">2020</td><td rowspan=\"2\"><span>Royal Television Society Awards</span></td><td>Best Scripted Comedy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Best Comedy Performance (Female)</td><td>Saoirse-Monica Jackson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>British Academy Television Awards</span></td><td><span>Best Scripted Comedy</span></td><td><i>Derry Girls</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"4\">2022</td><td><span>National Television Awards</span></td><td>Comedy</td><td><i>Derry Girls</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>TV Choice Awards</span></td><td>Best Comedy Performance</td><td><span>Siobhán McSweeney</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"2\"><span>Royal Television Society Craft &amp; Design Awards</span></td><td>Editing – Drama</td><td>Lucien Clayton</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Production Design – Drama</td><td>Nicola Moroney</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\">2023</td><td><span>GLAAD Media Awards</span></td><td><span>Outstanding Comedy Series</span></td><td rowspan=\"2\"><i>Derry Girls</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\"><span>British Academy Television Awards</span></td><td><span>Best Scripted Comedy</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td><span>Best Female Comedy Performance</span></td><td><span>Siobhán McSweeney</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Irish Film &amp; Television Awards</span></td><td>Television Drama</td><td><i>Derry Girls</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Script – Television Drama</td><td>Lisa McGee</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Merchandise</h3><p>A Derry Girls book, titled Erin's Diary: An Official Derry Girls Book, was released on 12 November 2020 by Trapeze Books.</p><p>In April 2022, a relaunch of the now-defunct British magazine Smash Hits, which ceased publication in 2006, issued a special, one-off edition, featuring Derry Girls, in promotion for its third series.</p><br/><h3>In other media</h3><h4>The Crystal Maze special</h4><p>Cast members Saoirse-Monica Jackson, Jamie-Lee O'Donnell, Louisa Harland, Nicola Coughlan and Dylan Llewellyn appeared in a 2018 special episode of the British game show The Crystal Maze. The episode raised money for Stand Up to Cancer UK and was well received by viewers and fans of the show.</p><h4>Great British Bake Off holiday episode</h4><p>For the 2020 New Year holiday, the cast competed on a special episode of The Great British Bake Off. Cast members Coughlan, O'Donnell, Llewellyn, Siobhán McSweeney, and Jackson all appeared for the special.</p><p>In GBBO fashion, there were three challenges to be completed and tasted by judges Paul Hollywood and Prue Leith. The first challenge was a trifle, then blinis in the technical round, finishing with a showstopper tiered cake that each member had to design in a decades theme. At the end of the competition, Jackson was declared the winner.</p><br/>"
  },
  "errorMessage": ""
}