{
  "imDbId": "tt3895150",
  "title": "Your Lie in April",
  "fullTitle": "Your Lie in April (TV Series 2014–2018)",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw3209138",
      "warningSpoilers": true,
      "date": "27 March 2015",
      "rate": "9",
      "helpful": "33 out of 39 found this helpful.",
      "title": "Your Lie in April",
      "content": "Protagonist Kousei Arima is a piano playing progeny; as he grew up is mother pressured him to play every note perfectly. This led him to be dubbed the 'human metronome'. When he is eleven his mother dies and he suffers a breakdown; no longer able to hear the notes he plays he stops playing the piano. Then, a couple of years later he meets Kaori Miyazono; a free spirited girl who plays the violin and she brings him back to music. Their styles are totally different; he plays every note exactly as it is written while she plays pieces as she wants to her deviations might not please competition judges but the audiences admire her passionate renditions. Over the course of the series Kousei must come to terms with his past as he accompanies Kaori then deal with her absence when it becomes apparent that she is seriously ill and if her operation is unsuccessful she could even die.Every new season there will be several anime series that are full of clichés and interchangeable characters this is not one of those. This is one of those series that feels quite different and keeps anime so interesting. The use of classical music seems a little surprising at first but here it works so perfectly it seems obvious. The performance scenes are beautifully animated; capturing both the sound and emotion of the performance. The bitter sweet story is told in a way that the end is not obvious before the final episode. The characters are interesting; one can't help caring about Kousei, with his tragic past, and Kaori is an utter delight whose personality lights up the screen; especially when she is performing. While these two characters dominate the series they are supported by a good selection of secondary characters who also contribute nicely. The character designs are pretty good and the animation is stunning; especially during the musical scenes. Overall I'd certainly recommend this emotional series.These comments are based on watching the series in Japanese with English subtitles."
    },
    {
      "username": "Derache",
      "userUrl": "https://www.imdb.com/user/ur83083910",
      "reviewLink": "https://www.imdb.com/review/rw4542180",
      "warningSpoilers": true,
      "date": "28 December 2018",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "The best romance",
      "content": "Depression, PTSD, and death are all topics that everyone has been affected by in one regard or another. Your lie in April shows what it is like to have PTSD and depression whilst trying to fall in love. It also shows some of the thoughts behind obsession with a certain art, such as music, in comparison to a normal persons perspective. This show has some of the best musical scenes I have ever seen in a TV Series. I loved this show, and I don't think I will ever be able to forget it.I highly recommend this show."
    },
    {
      "username": "akarunkumar-48613",
      "userUrl": "https://www.imdb.com/user/ur98786654",
      "reviewLink": "https://www.imdb.com/review/rw7342933",
      "warningSpoilers": false,
      "date": "14 September 2021",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Relatable anime",
      "content": "It's a music anime. The MC is a prodigy whose music inspired many individuals to become a musician. He is a pianist. But his childhood was a bit bad. He couldn't overcome that. A girl helps him from overcoming the trauma. It's a beautiful anime."
    },
    {
      "username": "chrisbrooks-19259",
      "userUrl": "https://www.imdb.com/user/ur63878031",
      "reviewLink": "https://www.imdb.com/review/rw6164839",
      "warningSpoilers": false,
      "date": "10 October 2020",
      "rate": "10",
      "helpful": "13 out of 14 found this helpful.",
      "title": "I Almost Didn't Watch It",
      "content": "I almost didn'the watch this series as I thought it might be borning. And now, I am writing a review early for the first time as this is clearly a masterpiece! Don't miss this one!"
    },
    {
      "username": "Mantislord000",
      "userUrl": "https://www.imdb.com/user/ur56389596",
      "reviewLink": "https://www.imdb.com/review/rw3516165",
      "warningSpoilers": false,
      "date": "26 July 2016",
      "rate": "10",
      "helpful": "41 out of 47 found this helpful.",
      "title": "One of the most beautiful shows I've ever seen.",
      "content": "The animation, characters, humor, themes, music, plot, everything was so wonderfully woven together. Such an emotionally impactful show in so many ways. The way music is used as the driving force for so many relationships is outstanding.The show took off like it would end up as a very typical romance/coming of age series, but as it progressed that became less and less the case. The way the characters interacted was at times very comical and over-the-top, but that just makes the more somber and soft moments stand out even more.You get to see the multiple layers of the characters, from the silliness to the internal struggles they faced, with music being the connecting force throughout. Music wasn't only shown as a force of good, but also bad in how it had an affect and was used by the characters.The romance aspect is even more hard-hitting as you get to the end. It feels so hopeless yet beautiful and endearing at the same time. A romance at a much deeper level than one would commonly expect from a show with the beginning aesthetics of this one. The characters become much more powerful as a result in the way they impact the viewer and the profound impact of music is made all the more potent.It isn't the fastest moving plot, and at times one could feel impatient, yet I felt as if that was a necessary approach for what it was trying to say. The quotes from this show are mesmerizing and the dilemmas presented are indeed thought-provoking and emotionally heart-wrenching.This is one of the greatest romances I've seen, and one of my favorite anime series no doubt. I wouldn't have tried it out otherwise, but seeing so much buzz about it got me curious and I'm truly glad I was able to be moved by it."
    },
    {
      "username": "Mysterygeneration",
      "userUrl": "https://www.imdb.com/user/ur104853183",
      "reviewLink": "https://www.imdb.com/review/rw7790696",
      "warningSpoilers": false,
      "date": "23 January 2022",
      "rate": "9",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Sad but classic.",
      "content": "\"Your Lie in April\" is a deceptively masterful series. It's not just a first love adventure, but delves into the reality of PTSD, childhood abuse, and chronic diseases. This is a series about learning to heal, move on, accept parts of ourselves we'd rather pretend are missing. The animation is beautiful with bright, vibrant colors that bring the characters to life. The sound is perfectly timed and the soundtrack cleverly combines the emotions meant to be portrayed in each scene. Structurally, it's a solid early life story that dramatizes certain aspects but never detracts from intended message."
    },
    {
      "username": "aveejain",
      "userUrl": "https://www.imdb.com/user/ur89716751",
      "reviewLink": "https://www.imdb.com/review/rw5141533",
      "warningSpoilers": true,
      "date": "25 September 2019",
      "rate": "10",
      "helpful": "32 out of 35 found this helpful.",
      "title": "Awesome Show",
      "content": "It is so good that I will never ever watch it again😭"
    },
    {
      "username": "kerikclarke",
      "userUrl": "https://www.imdb.com/user/ur71226458",
      "reviewLink": "https://www.imdb.com/review/rw3617068",
      "warningSpoilers": false,
      "date": "10 January 2017",
      "rate": "10",
      "helpful": "39 out of 42 found this helpful.",
      "title": "The Anime that breaks and mends your heart over and over again.",
      "content": "This anime is a piece of art. It makes me wish that I saw life so beautifully and with so much emotion. The classical music and intense descriptions of what the characters Kousei, Tsubaki, and Kaori experience throughout their musical pieces ran me for quite a journey. If I were to rate the situations that the characters go through on a scale of realism, I think that such experiences in real life can only really happen to certain people with real perceptions of what life should be. Then again I could be just strange. It's only my opinion.This anime, unfortunately wont be as enjoyed by those who aren't seeking in their life what this anime offers emotionally (Particularly the good parts.) (Again my opinion)."
    },
    {
      "username": "annagrachev",
      "userUrl": "https://www.imdb.com/user/ur57075970",
      "reviewLink": "https://www.imdb.com/review/rw3157219",
      "warningSpoilers": false,
      "date": "5 January 2015",
      "rate": "9",
      "helpful": "160 out of 166 found this helpful.",
      "title": "a heart touching story",
      "content": "Shigatsu wa kimi no uso is an anime to what nobody stays indifferent. I started watching it because i was bored and liked the style of the cover. At first i thought that the anime was going to be good but inevitably full of clichés: a guy who plays the piano, a girl with who he falls in love,.. but as the characters were presented i realized it was nothing like that. The main character has a deep personal and sad story beneath it, the girl he meets is nothing like the typical girl either. The anime avoids the clichés that naturally come with a love story, there's something like a love triangle there too, or should i say, a love square? The sound track is perfect , the performances of the musicians breathtaking and with some suspense because you never know how it will go. If you're sensitive like me it will even make you tear up..even the secondary characters are interisting and well developed. I have no flaws to this beautiful anime which moral is that we all have the courage to overcome our fears despite our past and follow our passion"
    },
    {
      "username": "ja_kitty_71",
      "userUrl": "https://www.imdb.com/user/ur10774147",
      "reviewLink": "https://www.imdb.com/review/rw3871109",
      "warningSpoilers": false,
      "date": "30 November 2017",
      "rate": "10",
      "helpful": "18 out of 23 found this helpful.",
      "title": "A lovely yet sad anime series for lovers of classical music",
      "content": "As a lover of classical music, I was quite curious about this series. One doubt I had was that I would have to buy the original manga. But I didn't care after I had watched this romantic anime, for I thought it had a lovely yet sad story.For the story, former musical prodigy Kousei Arima had not played the piano in years due to trauma from an abused childhood. Until one spring day, he encounters a beautiful yet eccentric-acting girl, Kaori Miyazono, who plays the violin. After a competition, Kaori asks Kousei to be her accompanist, but now he has to face his past to play on stage again. That's all I am tellin' you folks. You will have to see for yourself.My favorite character is Kaori. I just love her adorable, happy-go-lucky, free-spirited personality. I think her and Kousei would have made a good couple. So despite a couple of other characters I really hate (which I don't want to talk about), I love every bit of this series with its superb animation. Also, I wish the series were on North American DVD."
    },
    {
      "username": "sudhanshaggarwal",
      "userUrl": "https://www.imdb.com/user/ur65292486",
      "reviewLink": "https://www.imdb.com/review/rw3409006",
      "warningSpoilers": false,
      "date": "5 February 2016",
      "rate": "10",
      "helpful": "108 out of 113 found this helpful.",
      "title": "No review can do justice to the show. Enthralling. Amazing. Must Watch.",
      "content": "Most of the popular anime are based on action (Fullmetal Alchemist) or suspense(Psycho Pass). This, I started watching it because of its name. The name was really different.I'm really glad that I saw it. It is a beautiful anime, that expresses a lot of feelings most of us can't express in words. All emotions, whether happy or sad, have been expressed really beautifully.There are a lot of things that I feel and I never knew how I could express them. I'm sure there will be a lot of you who feel the same, but you won't know because I still can't express them in words. But knowing that they can be expressed in other forms really makes me feel better.If you watch it with subtitles, do keep your speakers on. There is a lot of music in the show that makes the show extremely special.Do watch."
    },
    {
      "username": "saikatsamanta",
      "userUrl": "https://www.imdb.com/user/ur64557457",
      "reviewLink": "https://www.imdb.com/review/rw7049064",
      "warningSpoilers": false,
      "date": "20 June 2021",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Dealing with Loss has never been So Beautiful...",
      "content": "A Piano Prodigy, Kousei Arima loses his ability to play after a tragic incident but suddenly a girl appears in his life who completely changes his perspective on life & inspires him to play again. Teenage Romance Dramas are usually not my cup of tea because of its frivolous & unreal nature, but animes surely know how to make masterpieces out of it. I can't remember the last time a series or film moved me so emotionally that by the end of the show I was crying so hard that my body was shaking. The story is predictable but the amount of character depth that this series has, you genuinely feel their emotions, their joys & heartbreaks. The dialogues are poetic gems & Kousei & Kaoris' conversations is the heart of the series. Its exceptionally directed & the visuals and musical performances add so much to the story. Its a Masterpiece of Human Relations Storytelling.P. S- Kaori Miyazono, You will always live inside my heart..."
    },
    {
      "username": "hitanshshah",
      "userUrl": "https://www.imdb.com/user/ur70234440",
      "reviewLink": "https://www.imdb.com/review/rw3601026",
      "warningSpoilers": false,
      "date": "18 December 2016",
      "rate": "9",
      "helpful": "39 out of 44 found this helpful.",
      "title": "One of the Best ROMANCE Anime Ever",
      "content": "Your Lie In April is really a very interesting anime which will make you imagine with anxiety of what would happen next.It revolves around the life of piano prodigy Arima Kousei whose life takes a turn after his mother's death who is not able to play piano any further.But his life takes another Topsy turvy turn after he meets a brilliant violinist Kaori Miyavano who helps Arima in overcoming his dark past and the way through which he does it is really amazing.The emotions and the friendship,love as well as the quotes which they both share is really amazing and a pleasure to watch.While Kaori helps Arima in overcoming his past, she is also suffering from her own problems and for sure this anime will make your eyes teary. Along with the great plot and story, this anime also has great music in it and the character development of Arima is surely amazing and very very mature. Hence guys i would surely recommend this anime if you are interested in romantic as well as school anime,as people you are surely missing an amazing story and a wonderful yet sad journey."
    },
    {
      "username": "JCon046",
      "userUrl": "https://www.imdb.com/user/ur72668674",
      "reviewLink": "https://www.imdb.com/review/rw3654451",
      "warningSpoilers": true,
      "date": "5 March 2017",
      "rate": "9",
      "helpful": "17 out of 19 found this helpful.",
      "title": "One of my favorite sad anime...",
      "content": "The reason for my 9/10 instead of a 10/10 is because this was spoiled slightly for me, I urge you if you haven't seen this series, GO WATCH IT IMMEDIATELY BEFORE READING ANYTHING ABOUT IT, TRUST ME!!! you have been warnedWow, just, wow. How can something so completely awesome exist? I mean, its the only show with lips!!! Anyway, this show is a near masterpiece, it would be one if i hadn't been spoiled on it. The characters were developed beautifully, and the shows external message got across just fine. The music, OH GAWD THE MUSIC. It is chalk full of classical remixes, originals, and classics. Just figures when you make a show ABOUT music, you have great music. The story is one of the best points of this show, aiming to make you cry within its first arc! I swear, if you didn't come near to tearing up, you have no soul. Coming from A- 1 pictures, you know its going to be beautiful, they ARE the ones behind Kill la Kill and Anohana. OVERALL: One of the best anime from the 2000's - 2010's."
    },
    {
      "username": "TwiZone",
      "userUrl": "https://www.imdb.com/user/ur24414112",
      "reviewLink": "https://www.imdb.com/review/rw4152438",
      "warningSpoilers": false,
      "date": "3 May 2018",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "An absolutely beautiful Anime, in terms of its animation, music and storyline.",
      "content": "Your Lie in April, as of right now, is my 2nd favourite Anime series (right behind Steins;Gate). It's simply amazing on an emotional level and in entertainment value. The animation is easily some of the best I have ever laid eyes on. Not only is the art style so bright and colourful, but the music performances are animated to an exceptional level of detail and artistry; the final performance (Episode 22), in particular, is the definition of beauty and art.The music itself is also great. It's a series based on classical music and the soundtrack the creators used for this Anime was spot on. The music itself feels like a character on its own. Whenever you see Kousei, Kaori, Emi or Takeshi perform on stage, it's simply mesmerising to watch and listen to.The storyline here is simply wonderful. The main character, Kousei Arima, used to be a professional pianist at a young age, with his mother forcing him to go through many trials and tribulations to get to where he was. Tragically, his mother passed away and soon after, he could no longer hear his own notes, so his days of playing the piano were finished, but he is still clinging onto it two years later. However, once he meets a violinist named Kaori Miyazono, his life turns upside down and his role as a pianist becomes revitalised.I don't want to get into too much detail as to why the storyline is so beautiful and touching as I would be giving away major spoilers, but I will say that the story itself takes a very emotional turn as the series progresses and the development for Kousei's character is great, as you really see him grow as a person and a pianist, especially in the last episode. Each character in the show really feels essential to his development.Overall, Your Lie in April is an excellent Anime that I absolutely adore. It has quite possibly my favourite final episode to any Anime I've seen so far. If you love good music or want to see an emotional story that will tug at your heartstrings, then this is one I highly recommend you watch. It even has a lot of comedy to balance out the drama, so this show can get very funny too. 10/10"
    },
    {
      "username": "waka_logan",
      "userUrl": "https://www.imdb.com/user/ur58789104",
      "reviewLink": "https://www.imdb.com/review/rw3188425",
      "warningSpoilers": false,
      "date": "21 February 2015",
      "rate": "10",
      "helpful": "116 out of 126 found this helpful.",
      "title": "Awesome Anime",
      "content": "Hey guys, this is the first time I have written a review for anything, but I just felt like it was necessary for this anime which in my opinion is very underrated. OK, so don't let the genre of the anime shy you away, even if you aren't into music it will definitely drag you into its world of hardship laughter and sorrow. The main character, an ex celebrity pianist losses his way and goes on a journey of a life time to re light a withered fire, but has has unexpected hardships along the way. This anime will keep you guessing, leaving you wanting more. It's not your typical love story \" he falls in love with girl, happy ending\" It portrays a very real life love triangle, depth and situation that its set in. I have no flaws with this anime, it's near perfect, Sound track, visuals and plot deserve 9.9/10. You will not be disappointed."
    },
    {
      "username": "mercfma",
      "userUrl": "https://www.imdb.com/user/ur52251585",
      "reviewLink": "https://www.imdb.com/review/rw3495029",
      "warningSpoilers": true,
      "date": "24 June 2016",
      "rate": "10",
      "helpful": "12 out of 15 found this helpful.",
      "title": "Practically Perfection....",
      "content": "What an amazing show.... This show touched me like none before it. Theirs so much I want to say & can't without spoilers. So in that regard, the show revolves around music. Don't let that discourage you, I personally think if you have some background with music this will touch you even deeper than those who don't but this is something everyone will enjoy, musician or not. The story is of this boy who was a child prodigy(basically) pianist & something happens & he winds up quitting piano altogether until 2 years later he meets this young violinist and she changes his life completely. The animation is amazing, top notch for something that doesn't have any action, fighting or powers. Its really breath taking when you watch just what animation can potentially be, they out did themselves. The character designs & background artwork are absolutely beautiful you'll remember all of the characters for years to come and the artwork will be painted into your memories.. The music is stunning..simply amazing through and through, every single bit of this show is just an absolute pleasure to listen to. The op & ed songs are great and will echo in your heart for the rest of your life i'm sure. The story is a bit of a love story but far from typical, its something you don't wanna pass up. (I watched the entire 22 episodes in 2 sittings so i'll let that speak for me..) The only problems I have with this show is when they show the characters in the past, in nearly every flashback its only 2 years previous from the current (where they are 14yrs old) and in the flashbacks where they are apparently only 12 they look like 5-6yrs old. And then in the very few where you see some of the characters at actually 5yr they look EXACTLY the same as \"apparently 12\". So basically from 12-14 they went from toddler>nearly full grown teenager style, that's the only thing that genuinely irritated me every time I saw it. Also I felt like in the first half it repeats itself just a bit to much, this is minor but I had to point it out. If your a lover of quality anime then you need to check this out.4.8/5 Why? Its just so close to perfection in every area. Biggest complaint, terrible at differentiating the character design of 5yr old characters to their 12yr old characters and then from 12>14 they just went to to nearly grown teenaged style. You wont regret watching this, or maybe you will. Enjoy."
    },
    {
      "username": "arcaashif",
      "userUrl": "https://www.imdb.com/user/ur87372220",
      "reviewLink": "https://www.imdb.com/review/rw4127990",
      "warningSpoilers": false,
      "date": "13 April 2018",
      "rate": "9",
      "helpful": "58 out of 60 found this helpful.",
      "title": "Will it reach you ? It definitely will !",
      "content": "What an experience it was watching this anime. This is something every one should watch regardless of the specific interest. How will it get you ? with Pain, Love and Music ! Not a fan of music based movie/series and i was avoiding this anime for a while for it but finally boredom and \"don't have anything interesting to watch\" made me watch it and i don't regret it ! First, lets talk about the character developement, its amazing, it unveils the true nature, what they feel and the past of each character at the right time. Characters are unique and well thought out.They really give the time on The Main protagonist (Kousei Arima) but he won't be your favourite. The Plot seems cliche, 'Pianist Boy Falls in Love with Violinist girl' but its not. This anime is very different from what it seems like and if not way better. The animation is great and the soundtrack is better, with classical music being the highlight of the anime. Although this anime, in my pov don't make a great 'empowered by music' show, Maybe because i'm not interested in classical Piano music. The one part i don't really like about it is its overly dramatic background monologues. It doesn't occur often (Only when he plays the piano) and some of them are AMAZING and actually leaves a big 'on point' notes and the rest is just too long. But it didnt matter to me at all because this anime is such a emotional roller coaster and the Ending makes it a worth while ride. Don't wanna give too much out but the end (what's supposed to be a very depressed ending to the story) will leave you with this heart warming and heart wrenching feeling that takes quite a while to forget. Some would want it to end differently but personally it couldn't be any better. PS: giving this a 9/10 simply because there isn't such a thing called perfect and it's the flaws that makes it what it is."
    },
    {
      "username": "cameronjames-86959",
      "userUrl": "https://www.imdb.com/user/ur91764806",
      "reviewLink": "https://www.imdb.com/review/rw5763285",
      "warningSpoilers": false,
      "date": "23 May 2020",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "A masterpiece from start to finish",
      "content": "Your lie in April is probably one of the most beautiful thing I have watched in a long long time. This amine honestly took me on a musical journey with some emotional scenes that truly pull on the heart strings and by the end of this journey had me bawling my eyes out, that is how powerful this series is and even if your not a fan of anime I can't highly recommend this series Enough because of how beautiful it is. The animation in this movie is true breathtaking and had me in wonder through the whole 22 episode journey. The voice cast all do a fantastic job playing there respected characters. The characters oh my goodness the characters in this series are all great there isn't a character that I didn't like or love and each character has fantastic character development and by the end of the series Your attached to these fantastically developed characters. This show is also surprisingly funny and had me laughing almost episode especially when a certain character is on screen who honestly stole the show each time there on screen. This music in this show is beautiful from the original music, to the opening and outro music but the real standout is the piano and violin covers of some famous classical music pieces. Overall, I didn't expect to love your lie in April as much as I did, this probably has to be one of if not my favorite anime's I have ever seen and I'm glad I got to go on this amazing journey."
    },
    {
      "username": "saharnazshaheen-36146",
      "userUrl": "https://www.imdb.com/user/ur64503965",
      "reviewLink": "https://www.imdb.com/review/rw3393971",
      "warningSpoilers": false,
      "date": "12 January 2016",
      "rate": "10",
      "helpful": "72 out of 79 found this helpful.",
      "title": "The best Anime ever",
      "content": "I as well, have never written any review for anything. But I think this anime was a real masterpiece, so I have to do it justice! I can't even begin to explain how it touched my heart. Even if you're not into romance anime, or you're not into music, or even you're not into anime at all, you really have to watch it. The story is simple and not very new or inventive, but yet, the storytelling, the amazing art (Oh my God, the art and animation was ammazing!!!) , the fantastic music, the lighting, montage and direction, had made a simple plot into the best series I have ever seen in my life. everything is in place in this anime, and even when I felt a character or event was out of place at first, it would beautifully come into place and contribute to the whole plot and it's main purpose. I truly felt \"This is Art\" in the last episode. If you watch this anime (which you definitely should!) be sure to watch it till the end, because the last episode is unbelievable, a true true masterpiece."
    },
    {
      "username": "jaysshukla",
      "userUrl": "https://www.imdb.com/user/ur125934623",
      "reviewLink": "https://www.imdb.com/review/rw7362689",
      "warningSpoilers": false,
      "date": "20 September 2021",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Beautiful",
      "content": "The anime does a good job in building up the romance between the main characters but the ending has been done in a typical classic way. Despite this, the narration has been so beautifully done that you could literally feel what the characters are going through. The narration is the proof of this show's creativity. That's why I believe it deserves the kind of a popularity it has. You would find hell number of people saying the anime is 'sad.' They may be right in their own way but to me, sad is a very strong word. The characters do manage to resolve things in a proper way and despite its ending, the main character Kosei Arima is as positive as ever. He successfully manages to overcome his struggles. Almost all characters in the anime, whether its Kaori, Kousei's other friends or classmates, his mentors or his rival pianists have their own significance. It is difficult to hate any of them. You would also probably like the opening and the ending song. The animation too gives the feeling of warmth and looks pleasing.Overall, Shigatsu wa Kimi no Uso is a must watch anime. No matter how many anime you are planning to watch, this one cannot be delayed."
    },
    {
      "username": "nexustheberserker",
      "userUrl": "https://www.imdb.com/user/ur80561943",
      "reviewLink": "https://www.imdb.com/review/rw3809640",
      "warningSpoilers": false,
      "date": "19 September 2017",
      "rate": "9",
      "helpful": "40 out of 42 found this helpful.",
      "title": "Words cannot describe it completely",
      "content": "Your Lie in April. Such a masterpiece. A Magnum Opus, you can call it. It even forced me, a real lazy person, to get up and type this in the hopes that more people can enjoy it. I find myself at a loss on how to praise this anime more, having read the other reviews. Arima Kousei, the human metronome, trained by his mother to be a machine that wins competitions. But the incident at an young age leaves him tone deaf. With such a disability and a fear of music itself, he stops playing the piano. But as the series progresses, this hidden diamond of a genius is slowly unearthed and his inner artist revived. Such a simple,undoubtedly used before, generic plot to be honest. But it is anything but that. Because this story is just wonderful. A tale with classical music bringing it to life. With characters who all have their own story, who are all facing their own problems. Throughout my experience watching this, I found myself conflicted over several events. Because really, you can't hate anyone no matter what. Arima's hidden past came as a shocker to me, but its consequences a tearjerker. It always had me on the verge of tears. Never crying, just on the verge. But at the ending, it was like a dam had broken as all of my emotions came gushing out. Joy, Grief, Rage, everything. Because it was so perfect, yet not perfect. It gave me a new perspective on life. Absolutely recommend it as a must watch anime. Even after typing this, I feel as if I haven't yet done it justice.Just watch it you guys xD"
    },
    {
      "username": "TheHoodOfSwords",
      "userUrl": "https://www.imdb.com/user/ur106575348",
      "reviewLink": "https://www.imdb.com/review/rw5886456",
      "warningSpoilers": false,
      "date": "6 July 2020",
      "rate": "9",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Sad",
      "content": "This show is super super good and super super sad. I've been tempted to watch it again for years but I've never gotten around but I wanted to mark it as watched here."
    },
    {
      "username": "thethirdatwood",
      "userUrl": "https://www.imdb.com/user/ur96282461",
      "reviewLink": "https://www.imdb.com/review/rw4686332",
      "warningSpoilers": false,
      "date": "25 February 2019",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "YOU MUST WATCH IT RIGHT NOW!!!!!",
      "content": "After almost ten months after watching this anime for the first time I still can't stop thinking of this show! It's wonderful selection of classical music, fully fleshed out and diverse characters, and beautiful art makes this even better than any other slice of life anime. And it ranks among the best shonen jump has to offer."
    },
    {
      "username": "arishsankar",
      "userUrl": "https://www.imdb.com/user/ur74022315",
      "reviewLink": "https://www.imdb.com/review/rw4898598",
      "warningSpoilers": false,
      "date": "30 May 2019",
      "rate": "10",
      "helpful": "11 out of 15 found this helpful.",
      "title": "I choose a future as a pianist.",
      "content": "\"The moment I met him, my life changed. Everything I saw, everything I heard, everything I felt... All of the scenery around me started to take on color. The whole world began to sparkle...\""
    }
  ],
  "errorMessage": ""
}