{
  "imDbId": "tt4082744",
  "title": "Detectorists",
  "fullTitle": "Detectorists (TV Series 2014–2022)",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "agnabeya",
      "userUrl": "https://www.imdb.com/user/ur4586894",
      "reviewLink": "https://www.imdb.com/review/rw3104487",
      "warningSpoilers": false,
      "date": "9 October 2014",
      "rate": "10",
      "helpful": "197 out of 200 found this helpful.",
      "title": "I don't know why.....",
      "content": "?..........But I love this new series. It's not a laugh out loud comedy, but it makes me smile throughout and the half hour episode is finished far too quickly. It's a gentle comedy based on the lives of a metal detectorist club and the characters in that club. There is a mad farmer with imaginary dogs who gives the two main characters permission to scan his fields, except the paddock. No one is ever to go near the paddock! I wonder why? His wife did disappear many years ago, but I have a feeling that will have nothing to do with his aversion to paddock diggers. The characters have been written so well and the direction, also by McKenzie Crook, are intriguingly watchable. Mr Crook is a talented man and after only two episodes I know this will be a favourite with me."
    },
    {
      "username": "LouieInLove",
      "userUrl": "https://www.imdb.com/user/ur53576145",
      "reviewLink": "https://www.imdb.com/review/rw3331209",
      "warningSpoilers": true,
      "date": "7 October 2015",
      "rate": "10",
      "helpful": "74 out of 77 found this helpful.",
      "title": "Unpretentious Exellence - Simple & Beautifully Delivered",
      "content": "I have such high praise for this show. It is simple & heartfelt, beautifully delivered, devoid of pretence and PC twiddling (which is a near miracle to be seen on the BBC these days).I understand Mackenzie Crook of 'The Office' fame wrote/created this, if so, well done! This show has to be a career highlight for him because it's genuinely that good.Detectorists gives a lesson in good writing/storytelling, good casting & production. It is subtle and delicate in it's delivery & offers eccentricity but not wackiness (wackiness/quirkiness being rife in English TV comedy these days. The go to for so many Anglo middle class/upper middle class types who dominate UK television; in front & behind of camera).The cast is outstanding, as near perfect as you could hope for. Everything about this show looks effortless, which, once again, is an example of how good this show is.I final quick mention has to go to the music & location footage, both of which are simple & sweet, just like the show.Mackenzie Crook, well done lad!Uncluttered, precise & accessible storytelling at its best."
    },
    {
      "username": "plan99",
      "userUrl": "https://www.imdb.com/user/ur2109886",
      "reviewLink": "https://www.imdb.com/review/rw3118986",
      "warningSpoilers": false,
      "date": "7 November 2014",
      "rate": "10",
      "helpful": "79 out of 87 found this helpful.",
      "title": "Brilliant. The best comedy for years.",
      "content": "As this has been tucked away on BBC4 at 10.00 pm on a Thursday night I have been recommending it to plenty of people who might have missed it.It's very funny and it should be on BBC1 or BBC2 at prime time. The fact that it has no laughter track makes it even better and it's not required as we don't need to be told to laugh when there is a funny line.This comedy deserves to win several awards but it probably won't as it's not been \"dumbed down\" to appeal to the great unwashed. Everyone involved should be congratulated for bring this comedy gem to our screens. It's up there with Fawlty Towers and Only Fools and Horses.I've just watched the Christmas 2022 special and it's brilliant."
    },
    {
      "username": "poe-48833",
      "userUrl": "https://www.imdb.com/user/ur62693994",
      "reviewLink": "https://www.imdb.com/review/rw3427754",
      "warningSpoilers": false,
      "date": "7 March 2016",
      "rate": "10",
      "helpful": "38 out of 40 found this helpful.",
      "title": "Buried treasure(s)...",
      "content": "DETECTORISTS qualifies at once as a very dramatic Drama as well an as outstanding (and often slyly subtle) Comedy; not an easy blend, not at all. That the Star of the show is also both Writer and Director is truly amazing: one would think that, given the surprisingly superior QUALITY of the entire series, that there must've been many MORE hands involved in their production. Crook is indeed a Triple Threat. I must admit that I felt somewhat schizophrenic watching DETECTORISTS, laughing out loud at one moment and crying like a baby the next. Without a doubt, one of the finest shows I've ever happened across. I highly recommend it."
    },
    {
      "username": "Jorgosch",
      "userUrl": "https://www.imdb.com/user/ur1853921",
      "reviewLink": "https://www.imdb.com/review/rw3120362",
      "warningSpoilers": false,
      "date": "9 November 2014",
      "rate": "9",
      "helpful": "85 out of 88 found this helpful.",
      "title": "Heartwarming",
      "content": "Congratulations to Mr. Crook to have created something that I can only describe as love at first sight. The series takes a look at key situations that most adults have been through while putting them in a context that feels fresh. Mr. Crook may be guilty of a bit of viewer manipulation by depicting the main characters as meek and sometimes naive who face bullies and mocking. This is easily forgiven, though, because of the stellar cast that makes each and every persona feel real, believable and truly likable. Apart from that each character down to the smallest role has something unique that sets them apart. There is wisdom to be found here, and peace, if you have the patience. Sometimes life tosses you a gold coin and sometimes a ring pull - just go with it, it will balance out it in the end. A true dramedy gem. 9/10."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw7219110",
      "warningSpoilers": false,
      "date": "12 August 2021",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "A great comedy with few obvious gags",
      "content": "This gentle comedy is centred on Andy and Lance, two metal detectorists hoping to find items of historical value in the Essex countryside. They are part of a small club of likeminded individuals but tend to go detecting only with each other. The world of detecting is fairly quiet but some conflict is introduced through a pair of detectorists from a rival club dubbed 'Simon and Garfunkle' and the arrival of Sophie, a young woman who both men try to impress. Away from their hobby Andy is trying to make his relationship with Becky work while Lance is having difficulty getting over his ex-wife.I really enjoyed this series; unlike most sitcoms it doesn't rely on obvious gags and there is no laugh-track. Instead the characters provide the laughs in an entirely natural way as they chat to each other. Often shows featuring minority interests will invite the viewers to look down on the protagonists but I didn't feel this was the case here; Andy and Lance aren't 'a pair of losers'. The cast is great; Mackenzie Crook and Toby Jones are really impressive as Andy and Lance. Fine support is provided by an impressive cast which includes the always reliable Rachel Stirling, as Becky; Gerald Horan as club leader Terry; Aimee-Ffion Edwards as Sophie to name just a few. The setting is great; usually the same few fields but it the summer sun they look beautiful. Overall I'd certainly recommend this series to anybody wanting a good laugh and a gentle story."
    },
    {
      "username": "theknownames",
      "userUrl": "https://www.imdb.com/user/ur12161715",
      "reviewLink": "https://www.imdb.com/review/rw5927667",
      "warningSpoilers": false,
      "date": "23 July 2020",
      "rate": "9",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Do not read Netflix description!",
      "content": "I am adding this review so that anyone interested in the show knows not to read the Netflix Description they give a detailed summary of each entire episode - why ? I get that we kind of might want to know Something but do we want to know every single thing that's going to happen ? even the surprises ? No"
    },
    {
      "username": "lovefilm-57992",
      "userUrl": "https://www.imdb.com/user/ur63853338",
      "reviewLink": "https://www.imdb.com/review/rw3356571",
      "warningSpoilers": false,
      "date": "17 November 2015",
      "rate": "",
      "helpful": "48 out of 50 found this helpful.",
      "title": "Delightful",
      "content": "There is one uncredited star in the Detectorists, its the British summer. It does exist, and somehow they managed to film the whole thing in glorious summer.I've just watched episode 3 of the second series, and its a bleak November day at the time of writing this review. Just seeing the warm sun & verdant greenery brings a smile of nice things remembered. Add in some brilliant writing, top notch acting, mild eccentricity and a dash of the absurd, and the result is something very special.A great example of the humour in the Detectorists is in the episode I've just watched. Without giving away anything, Lance tells Andy about the time his bed was cut in half by an ex girl friend who used a chainsaw to do the deed. After a pause Andy asks \"Lengthways or sideways?\". No expression of surprise, no mention of why Lance (a very mild mannered man) has ended up with his bed being cut in half. No questions about what sort of person the ex was nor how Lance could have ever provoked her to do such a thing. Lance and Andy acted like it was a perfectly normal thing that could have happened to anyone. I laughed out loud."
    },
    {
      "username": "mikehoward-123-837839",
      "userUrl": "https://www.imdb.com/user/ur55601937",
      "reviewLink": "https://www.imdb.com/review/rw3114872",
      "warningSpoilers": false,
      "date": "31 October 2014",
      "rate": "9",
      "helpful": "94 out of 96 found this helpful.",
      "title": "Something to look forward to",
      "content": "A gentle and brilliantly written show. Rarely laugh out loud funny, but so well acted and so many chuckles, absolutely love this show.Crook is, as always, immensely likable. The other characters are vital and so well performed. But perhaps it is Toby Jones who steals the show, a fantastic actor to watch, and such good lines delivered so well.A refreshing change to the unfunny, badly acted dross we are usually offered - Mrs Brown's Boys, stuff like that.I hope this runs a few series, as the characters are so good. But perhaps Crook has learned from the master that 2 series might be enough, and move on to the next project.Thoroughly recommend."
    },
    {
      "username": "carson120",
      "userUrl": "https://www.imdb.com/user/ur54201153",
      "reviewLink": "https://www.imdb.com/review/rw3121322",
      "warningSpoilers": false,
      "date": "8 November 2014",
      "rate": "9",
      "helpful": "92 out of 95 found this helpful.",
      "title": "A diamond in the dross of TV sitcoms",
      "content": "Andy and Lance live in a rural English backwater that on the surface seems boring and uneventful. Mackenzie Crook's genius is to show us the comic gold that lies beneath. I'm not talking of the Saxon gold that our two heroes are searching for, but the ups and downs they face on their journey through life. While gently making fun of our two under-achievers, the humour never belittles them. Their male obsessions are given a dry, melancholic and often wistful comic voice. Andy and Lance are well meaning, but they can also be naive and boring, loyal and selfish or just total dick heads. However, they are also strangely endearing.They are like us and we learn to love them despite their faults and eccentricities. Loved it!"
    },
    {
      "username": "anniemarshallster",
      "userUrl": "https://www.imdb.com/user/ur18725046",
      "reviewLink": "https://www.imdb.com/review/rw3365060",
      "warningSpoilers": true,
      "date": "1 December 2015",
      "rate": "10",
      "helpful": "22 out of 24 found this helpful.",
      "title": "Observational comedy at its best",
      "content": "This is a pearler.Beautiful to look at, impeccably cast, with sweetly dry and sly humour, this is in the great British tradition.The human comedy at its most endearing.Every detail is appropriate - the sets, the music, the denouements and the characterisations.Love it, love Mackenzie Cook, love Racheal Stirling and love Toby.What a talented bunch.If you loved Jam and Jerusalem you'll take to this as well. Same wavelength, just gender POV shift."
    },
    {
      "username": "martimusross",
      "userUrl": "https://www.imdb.com/user/ur12048299",
      "reviewLink": "https://www.imdb.com/review/rw8818418",
      "warningSpoilers": false,
      "date": "22 January 2023",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "It Was Brilliant, I loved It!",
      "content": "DetectoristsWhilst appearing a gentle comedy about Andy and Lance, and their enduring love of metal detecting it explored a whole array of other issues in a deeply insightful way. Just briefly these were:- what is your place in the world, where do you belong, the finding of joy in small victories, the nature of friendship, the journey and not the destination. Not to mention a whole array demonstrable facets of the human condition.This programme was rooted in that thick vein of British comedy that is quirky, unique and ultimately life reaffirming and quite frankly could not have been made anywhere else and represents the BBC at its very best. The constant self-referencing to British culture roots this programme unashamedly in a non- metropolitan setting. And I must say it is so refreshing not to artificially contrive woke inserts, modern life and thought is present but in a natural and realistic way.The acting was sublime and the characterisations were complete, the script practically invisible behind the banter. We had real emotions at every turn.This was a truly excellent show and I'm giving this a 10 outta 10, I can find no fault I am in awe!"
    },
    {
      "username": "jemwand",
      "userUrl": "https://www.imdb.com/user/ur45192904",
      "reviewLink": "https://www.imdb.com/review/rw3118648",
      "warningSpoilers": false,
      "date": "6 November 2014",
      "rate": "10",
      "helpful": "168 out of 171 found this helpful.",
      "title": "Dry, Intelligent and Endearing",
      "content": "Mackenzie Crook's Detectorist's is not your average Sitcom, over the six episodes of the first series it delivers central characters who are desperately melancholy, yet intelligent. There are very few cliché's in this series. The story evolves, as do the characters with warmth and depth. The humour is dry and the belly laughs are few and far between, but what I found was a comedy of great sensitivity, with emotional depth and was ultimately deeply rewarding.I hope that if a second series is developed that it doesn't deviate from it's path because Detectorists (there's no apostrophe in Detectorists) really is gold. Detectorists is probably the most complete comedy sit com of all time, it's gentle humour really shines."
    },
    {
      "username": "vpck100-15-672657",
      "userUrl": "https://www.imdb.com/user/ur53080947",
      "reviewLink": "https://www.imdb.com/review/rw3683002",
      "warningSpoilers": false,
      "date": "11 April 2017",
      "rate": "",
      "helpful": "38 out of 40 found this helpful.",
      "title": "Metal Detecting IS and IS NOT what this show is all about",
      "content": "Most people wouldn't even begin to watch this series due to the basic premise of this show. A couple of Brit buddies roaming around fields, looking for stuff with metal detectors. Truly, that is the LEAST of what this show is all about. The metal detector element, just enhances what is truly great TV.This is a brilliantly written, humorous, witty show that is actually about people. And how their lives, interactions and their humanity pedal on show after show. The casting is phenomenal! The scripts are fantastic! The cinematography is amazing considering the low budget. This is a comedy in large part, but the hook is in how the weave a fine tapestry of feelings, human nature and humor into each and every show. This a Masterpiece.Once you start, there is no turning back. I personally can't wait for a season 3....4.....5.....6......7.......8....."
    },
    {
      "username": "suttonpeter",
      "userUrl": "https://www.imdb.com/user/ur17636906",
      "reviewLink": "https://www.imdb.com/review/rw6476206",
      "warningSpoilers": false,
      "date": "14 January 2021",
      "rate": "10",
      "helpful": "21 out of 23 found this helpful.",
      "title": "Golden",
      "content": "How many comedies can also bring a tear to the eye? The genius of this show lies in it's glorious simplicity, a true celebration of the now, and the everyday. Down to earth, yet infinitely profound. The mockery of one another that has love in it's background. The inherent loving kindness of all of humanity is exposed somehow, with all of our struggles, in this dead-pan comedy. For some reason, I feel this is one of the most mystical programs I've ever watched, and it's not easy to say why. Perhaps it is the effortless wabi sabi, unhewn log, almost Buddhist feel?! Anyway, enjoy!"
    },
    {
      "username": "kirbylee70-599-526179",
      "userUrl": "https://www.imdb.com/user/ur22487163",
      "reviewLink": "https://www.imdb.com/review/rw4214546",
      "warningSpoilers": true,
      "date": "24 June 2018",
      "rate": "10",
      "helpful": "15 out of 18 found this helpful.",
      "title": "SLOW, SUBTLE AND HILARIOUS",
      "content": "*This review is for the disc release of season 3*I'd never heard of this series until season 3 came my way but I'm glad it did. What I found was that the series is one of the driest and funniest shows to come from British TV. The show revolves around two main characters. Andy Stone (Mackenzie Crook), an agency worker with a degree in archeology that's going to waste, is married with a child, forced due to his work situation to live with his mother-in-law (Dianna Rigg). Lance Stater (Toby Jones) is a forklift truck driver and amateur musician. The two are best friends and both part of the Danebury Metal Detecting Club (DMDC). Living in Danebury near Essex the main plot of the show is what takes place in their lives and how it revolves around their hobby which is being detectorists. Now I'm not saying detectives but detectorists, someone who uses a metal detector trying to find treasure or historical items. With season three I gathered that they've were granted permission to go over the same piece of land for some time now, with little luck to date. This season finds Lance no longer living alone as his daughter Kate (Alexa Davis) has moved back in with him. She's inconsiderate of his home and life, leaving the place a mess not cleaning up after herself and uncaring of any time he wants to spend in his own home with his girlfriend Toni (Rebecca Callard). The pair could spend time together at her place except that she lives in a houseboat and the waves make Lace seasick, the focus of one episode. Andy on the other hand has found his dream job, working on a crew checking excavation sites in the hopes of discovering ancient relics. That comes crashing down around him when he discovers one, a set of tiles that excites him. Until the foreman tells him to ignore them and the next day he shows to work to find them covered over. It turns out the company he works for is more inclined to satisfy the clients who employ them by ignoring things like this to sign off that construction can continue without fear of disturbing anything.What brings the pair together is their scouting the farm in search of artifacts when time allows. Moving meticulously across the countryside they scan for anything and begin to find bits and pieces though nothing major. But that comes into question with this season as the farm has been sold and the detecting is opened with their fiercest competitor trying to home in on the farm. Worse yet is that we the viewers are shown that the pair are nearing what could be a tremendous discovery, a set of ancient coins that would not only be a major discovery but worth something as well. If it weren't for the magpies.The series was a hit and also an award winner. Why, in a world where hit shows from other countries are revamped for American audiences, this one hasn't been adapted yet is beyond me. Fortunately with the series on disc it gives those of us here a chance to watch and enjoy the adventures of this unlucky duo. But it's not just their search that offers the charm of the show. It's their entire lives from their love lives to their home situations to their odd friends in the DMDC. They each have a charm that makes you care about each of the characters here and want to know what happens next. I found myself in the throes of binge watching once I began here, unwilling to stop because I was having such a good time watching and waiting to see what would happen next. That the series only lasts 6 episodes was disturbing as I wanted to watch more.So take the risk and give this series a look. The performances by both leads is so low key and wonderful that you won't be able not to cheer them on with each methodical step they take on the farm. And you'll root for something to happen to change their fortunes. These two everymen are a welcome addition to the world of comedic television and are worthy of your time."
    },
    {
      "username": "nge-156-918547",
      "userUrl": "https://www.imdb.com/user/ur56405696",
      "reviewLink": "https://www.imdb.com/review/rw3121388",
      "warningSpoilers": false,
      "date": "10 November 2014",
      "rate": "10",
      "helpful": "179 out of 183 found this helpful.",
      "title": "My faith is restored.....",
      "content": "My faith is restored that there is still at least one person out there who can not only write but direct such an intelligent, unique, and endearing piece of workI don't know why but I was captured by the very first trailer that I saw and with much anticipation waited for the series to start...... and I was not disappointed.It has been such a long time since I have felt so totally engaged with a television series on British TV. The fact that it was tucked away on BBC4 is likely to mean that it will be missed by many, but then again if it was shown on the more mainstream channels then many may miss the point.Previous reviews have already mentioned the warmth and depth of the characters, the excellent writing and how you feel drawn into, and become part of, the world that has been created. But I want to add how stunning the filming has been throughout this series, with some of the shots being absolutely beautiful.It feels like something very special happened in the production of this series and I feel privileged that I caught it on its first showing.I only hope it gets the recognition it deserves........"
    },
    {
      "username": "fqxjj",
      "userUrl": "https://www.imdb.com/user/ur56018372",
      "reviewLink": "https://www.imdb.com/review/rw3113009",
      "warningSpoilers": false,
      "date": "24 October 2014",
      "rate": "10",
      "helpful": "110 out of 114 found this helpful.",
      "title": "By far the best comedy to appear over the last couple of years or so.",
      "content": "I was looking forward to this show since I saw the trailers for it towards the end of the summer, and from the start of Episode 1 it has certainly exceeded my (rather high) expectations!I may be slightly biased as I used to be a Detectorist in my college days some 20 years ago now, and so I immediately picked up on a lot of the behaviours and in-jokes that Mackenzie has scattered throughout the shows (\"Are you metal detectors?\" 'No, THESE are the metal detectors, WE are the metal detector-ISTs..') to little quirks of behaviour that I myself was guilty of (agreeing a mutual \"Detectors Off\" time at the end of a days hunting, or indicating an important find by performing an impromptu dance).This is a comedy that everyone should enjoy though, not just detectorists, although you can tell Mackenzie does love the hobby. I've often thought one of the corner stones of a good comedy (or drama in general) is to have characters you can relate to, and that work well together on screen. Andy and Lance (Toby Jones) have this in bucket loads, and they do come across as being very close, old friends.There's plenty of side-stories woven into the main thread, that keep you guessing and asking questions as the shows progress (Will Andy get together with Sophie, what/who lies buried in the paddock, why does Lance still hold a candle for Maggie..) but not enough to distract from the main plot.All in all this is fantastically written/directed, original comedy with a great choice of actors (Simon Farnaby, Pearce Quigley..) and to top it all it features a brilliant soundtrack throughout by Johnny Flynn (or Johnny Piper if you're short sighted.) I find myself looking forward to Thursday Nights at 22:00, and if I'm honest I'm struggling to remember a show that I could last say that about, possibly Rev series 3, or Toast of London."
    },
    {
      "username": "Brucey_D",
      "userUrl": "https://www.imdb.com/user/ur65243464",
      "reviewLink": "https://www.imdb.com/review/rw5215819",
      "warningSpoilers": false,
      "date": "26 October 2019",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "I'll be your treasure...",
      "content": "Put simply this is a remarkable piece of TV, portraying the lives of a few people who, like many otherwise unremarkable folk, have their hobbies and interests which form a backdrop to their lives. It is gentle, endearing, subtly funny and beautifully made.Two features which are welcome bonuses for me are the English countryside, and the wonderful theme song by Johnny Flynn. The largely tranquil countryside never looked so lovely, and not being overproduced, in this show the eye is allowed to linger on it. The sounds of birdsong can be heard in most of the outdoor scenes; so different from background sounds in other programmes.The theme song is utterly charming, and in one episode, Johnny Flynn appears in a cameo role during a pub song night, performing it.------------------------------------Will you search through the lonely earth for me, Climb through the briar and bramble, I'll be your treasure.I felt the touch of the kings and the breath of the wind, I knew the call of all the song birds, They sang all the wrong words, I'm waiting for you, I'm waiting for you,Will you swim through the briny sea for me, Roll along the ocean's floor, I'll be your treasure,I'm with the ghost of the men who can never sing again, There's a place, follow me, Where a love lost at sea, Is waiting for you, Is waiting for you.----------------------------------------------There is also another verse which only appears in the final episode of series three.This isn't riotously funny or fast moving so won't appeal to anyone with a short attention span . It is very good though."
    },
    {
      "username": "pcs-153-85372",
      "userUrl": "https://www.imdb.com/user/ur56321586",
      "reviewLink": "https://www.imdb.com/review/rw3121314",
      "warningSpoilers": false,
      "date": "7 November 2014",
      "rate": "10",
      "helpful": "46 out of 47 found this helpful.",
      "title": "you don't have to be a male hobbyist but it helps....",
      "content": "Having said that er indoors liked this series almost as much as I did. Utterly, totally and brilliantly observed and written , and if like me you're a lapsed detectorist, this will leave you wanting to get your kit out of the loft. It's the 'casual' details, eg: \"What you got ? \" .... pause.. \" Bikky foil \"pause... \" Viscount mint \" . Just so true. Only complaint is 30 minutes only so was over too soon. And the very last scene is sheer magic , don't miss any of it :0))) Oh and the reference to male hobbyists in the last episode, when did you last see a female trainspotter ? Never. I totally agree with above previous comments about the utter crap that poses as 'comedy', this series is in a completely different league."
    },
    {
      "username": "lionlake",
      "userUrl": "https://www.imdb.com/user/ur62165581",
      "reviewLink": "https://www.imdb.com/review/rw3300215",
      "warningSpoilers": false,
      "date": "18 August 2015",
      "rate": "10",
      "helpful": "86 out of 89 found this helpful.",
      "title": "Laugh out loud humor, adorable cast",
      "content": "I found this series on Acorn.TV. I love British shows anyway, but this was exceptional. This is dead-pan humor at its finest. The two main characters were lovable, funny and real. The supporting cast was great as well. This is not your typical Hollywood \"Aren't we funny\" predictable comedy, where you can tell what is coming next and they have to point out the humor in case you are to dumb to get it. With this show, the humor is subtle and delivered ingeniously. The situation is very believable, but delightfully silly as well. I hope this comes out for a second year, but it is great as it is as well. Well done you!!"
    },
    {
      "username": "lb-37433",
      "userUrl": "https://www.imdb.com/user/ur69652526",
      "reviewLink": "https://www.imdb.com/review/rw4601943",
      "warningSpoilers": false,
      "date": "23 January 2019",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Brought meaning to my life",
      "content": "I could have given Detectorists an 8 or a 9, but what the hell, I'm going with a 10. Not that the show blew me away with its character development, tension and climax, mystery or intrigue.Quite the opposite, it was in the mundane lives of Andy and Lance that I felt an emotional boost in my own.I go to work every morning. I took zero vacation days last year. Not because I'm that overwhelmed at work, just that I'm that underwhelmed in life and adventure.Is there happiness in monotony? Is there purpose in hobby? Even one as infrequently fruitful as metal detecting?These are the most bland, ordinary superheroes that one could revere.Move over Spiderman. Here comes Andy with a metal detector."
    },
    {
      "username": "dickstroker-18028",
      "userUrl": "https://www.imdb.com/user/ur66921311",
      "reviewLink": "https://www.imdb.com/review/rw3619261",
      "warningSpoilers": false,
      "date": "14 January 2017",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Watch Detectorists! Charming funny and inspired",
      "content": "We loved this, streaming both seasons of episodes from Netflix. So sad they didn't pick it up for a 3rd season and beyond. It's a bit like an understated version of Andy of Mayberry for the Brits, a slice of English country life with adorable quirky characters. Toby Jones and the rest of the cast are spot on. It made me want to go visit the English countryside again. This time with a metal detector. Doing some research, I see that they filmed in Framlingham. Framlingham's most famous attraction is its Norman castle, where Mary Tudor was proclaimed Queen of England in 1553. But the first Detectorists landmark is next door: the Scout Hall where Danebury Metal Detecting Club meet, better known to locals as St Michaels Rooms, which are available for hire if you'd like to host your own meeting (I just might do that)."
    },
    {
      "username": "rocknrelics",
      "userUrl": "https://www.imdb.com/user/ur15104159",
      "reviewLink": "https://www.imdb.com/review/rw5915613",
      "warningSpoilers": false,
      "date": "18 July 2020",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Perfect.",
      "content": "There is absolutely nothing in this programme that could be improved upon (well, except for a blu ray release!), it is perfection.Reminiscent of the England most of us want to remember, and wish still existed.The blend of pathos and comedy is wonderful, you actually care about these people, and wish you were part of the gang.If you haven't seen it, and don't think it would be your kind of thing, as I initially did, I urge you to throw your preconceptions out of the window, and settle down and prepare to be whisked away."
    },
    {
      "username": "debi_casey",
      "userUrl": "https://www.imdb.com/user/ur85237005",
      "reviewLink": "https://www.imdb.com/review/rw4056331",
      "warningSpoilers": false,
      "date": "8 February 2018",
      "rate": "10",
      "helpful": "37 out of 37 found this helpful.",
      "title": "A perfect sitcom",
      "content": "The problem with shows like this is they take them off the air. No nudity, no violence, no laugh track. A person has to actually just sit and enjoy it. You smile, you laugh, you cry. You are not hit over the head by moronic jokes. The acting is superb. Not overacted but perfectly done. Quiet, subtle, honest. Please, someone out there take pity on the mature audience. Not everyone likes the 3 Stooges. Thank you for giving us this show. Don't take it away."
    }
  ],
  "errorMessage": ""
}