{
  "imDbId": "tt4082744",
  "title": "Detectorists",
  "fullTitle": "Detectorists (TV Series 2014–2022)",
  "type": "TVSeries",
  "year": "2014",
  "episodes": [
    {
      "id": "tt4088818",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Episode 1",
      "image": "https://m.media-amazon.com/images/M/MV5BNzMzNzYyODM5MF5BMl5BanBnXkFtZTgwMjE5OTYyOTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "2 Oct. 2014",
      "plot": "Andy and Lance are members of the small but dedicated Danbury Metal Detecting Club (DMDC), who search for buried treasure with metal detectors. As boring club president Terry welcomes new member student Sophie Andy and Lance determine to look for the rumoured Saxon hoard on farm-land owned by eccentric Larry Bishop, a man once suspected of killing his wife. The pair visit Larry, now a befuddled old man, but he does tell them of an archaeological dig halted by the outbreak of World War Two and allow them to search his land.",
      "imDbRating": "7.5",
      "imDbRatingCount": "505"
    },
    {
      "id": "tt4095606",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Episode 2",
      "image": "https://m.media-amazon.com/images/M/MV5BMTgzMDU2ODA0OV5BMl5BanBnXkFtZTgwMjE3MDcyOTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "9 Oct. 2014",
      "plot": "Exploring Larry Bishop's land Lance and Andy find nothing of interest though they do encounter Art and Paul from the rival Antiquisearchers, whom they send packing. Bishop tells them that some years ago he found some treasures which he gave to Justine but declines to say who Justine is. He also gives them some gold but they decide to keep it a secret. Actually Sophie has heard what they are doing but believes from her research that the Saxon hoard they want is in the next county. Lance meanwhile is anxious to reform his old folk duo with Andy so that he can perform a ...",
      "imDbRating": "7.7",
      "imDbRatingCount": "428"
    },
    {
      "id": "tt4095612",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "Episode 3",
      "image": "https://m.media-amazon.com/images/M/MV5BMDdlYTYwOTItY2UyOS00ODUyLWJjZjEtYzI1Zjg1NmRkNTgwXkEyXkFqcGdeQXVyNjYyNDMwOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "16 Oct. 2014",
      "plot": "Andy and Lance perform at the open mike evening but Lance is upset that Maggie does not come to support him whilst Andy's insistence that his girlfriend Becky should not turn up to see him looking foolish leads to her believing he is having an affair with Sophie. They decide to tell Terry that they have permission to dig up Larry Bishop's land and, as an ex-policeman still determined to catch Larry for the suspected murder of his wife, he is happy to join them. Unfortunately the result is rather explosive.",
      "imDbRating": "8.2",
      "imDbRatingCount": "413"
    },
    {
      "id": "tt4095614",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Episode 4",
      "image": "https://m.media-amazon.com/images/M/MV5BOGQ2YjZhZDgtM2U3Yi00NmFlLTlkOGItMWIwNDMxMDc3N2UxXkEyXkFqcGdeQXVyNjYyNDMwOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "23 Oct. 2014",
      "plot": "Hospitalized after unearthing the UXB Terry decides to retire as club president, nominating a reluctant Andy to succeed him. Next day Andy and Sophie find a gold coin on Bishop's land and share a chaste, celebratory kiss before the army arrives to declare the land out of bounds whilst they look for more bombs. Angry that Andy was with Sophie and not him when he found the coin Lance forms his own pub quiz team comprising Maggie and Tony, who beat Andy, Sophie and Becky - the deal being that the loser not only stands down as president but resigns from the club.To make ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "382"
    },
    {
      "id": "tt4095616",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "Episode 5",
      "image": "https://m.media-amazon.com/images/M/MV5BMjRiMWY5Y2MtNzU2YS00YThjLTgzOWUtNjJlNjAxMGFjNWRkXkEyXkFqcGdeQXVyNjYyNDMwOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "30 Oct. 2014",
      "plot": "Still puzzled as to why she left him Andy visits Becky, who shows him the incriminating photo. He does make it up with Lance, who confesses to Sophie that he has won over a quarter of a million pounds on the lottery. He does not tell her that Maggie has asked him for a loan to save her shop. Sophie is however seen to be a traitor when it transpires that she is a former member of the Antiquisearchers and with the army declaring Larry's farm a free-for-all the group considers disbanding though Terry saves the day by withdrawing his resignation. Andy discovers that Becky...",
      "imDbRating": "8.2",
      "imDbRatingCount": "385"
    },
    {
      "id": "tt4095618",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "Episode 6",
      "image": "https://m.media-amazon.com/images/M/MV5BNzQ3MWQ3YjktOTgzNy00NWMzLWJkMWMtYTVlN2Q0NjAyZTVmXkEyXkFqcGdeQXVyNjYyNDMwOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "6 Nov. 2014",
      "plot": "Lance learns that Maggie has known about his lottery win whilst Andy wins back Becky by selling his detecting equipment and promising to give up his activity. In the pub they meet Larry Bishop, who tells them that his wife is alive and well and the bones dug up belonged to his dead dogs. The club holds an open day but the only person to turn up is Sophie, who informs everybody that Antiquisearchers have been disqualified from the dig for placing nails on the site. Becky's excellent local history knowledge comes in very handy as everybody rallies to find the Saxon ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "405"
    }
  ],
  "errorMessage": ""
}