{
  "imDbId": "tt4082744",
  "title": "Detectorists",
  "fullTitle": "Detectorists (TV Series 2014–2022)",
  "type": "TVSeries",
  "year": "2014",
  "episodes": [
    {
      "id": "tt5130672",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "Episode #2.1",
      "image": "https://m.media-amazon.com/images/M/MV5BMzkwYzI2YzAtODQzZS00ZWYwLTlhODktNDQ5NmRlOGJjMjE5XkEyXkFqcGdeQXVyNjYyNDMwOQ@@._V1_Ratio1.8254_AL_.jpg",
      "year": "2015",
      "released": "29 Oct. 2015",
      "plot": "Andy's been thinking about internet dating. Not for him, but for his friend Lance who's still not over the departure of his ex-wife. A mysterious stranger arrives to tempt the Danebury Metal Detecting Club in more ways than one.",
      "imDbRating": "8.0",
      "imDbRatingCount": "363"
    },
    {
      "id": "tt5144924",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Episode #2.2",
      "image": "https://m.media-amazon.com/images/M/MV5BMzczYzYwNmMtZjdjZi00N2FiLThhM2UtNGM4YmQ4YjhmYjFlXkEyXkFqcGdeQXVyNjYyNDMwOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2015",
      "released": "5 Nov. 2015",
      "plot": "A slightly jealous Andy spies on Sophie as she helps Peter with his research and on Lance as he secretly meets Internet date Kate though Lance and Andy unite to warn rival detectorists Simon and Garfunkel against joining the search for the plane wreckage. Becky meanwhile, bored with her job, considers voluntary work abroad and the mayor asks Terry to help him find his lost ceremonial chain.",
      "imDbRating": "7.8",
      "imDbRatingCount": "327"
    },
    {
      "id": "tt5179242",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "Episode #2.3",
      "image": "https://m.media-amazon.com/images/M/MV5BN2YyNzE5MDctNTE2OC00NWZkLWI5OWMtNDg1YWE0YzhiYmQxXkEyXkFqcGdeQXVyNjYyNDMwOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2015",
      "released": "12 Nov. 2015",
      "plot": "Charged with finding the mayor's lost chain detectorists Russell and Hugh are disturbed to find themselves in a dogging area but since the mayor owns the field with the plane wreckage in it they are told to keep searching. Andy is less than enthusiastic when Becky tells him that she has put them both forward for voluntary work in Africa but he gets an even bigger surprise when Lance tells him the identity of the young lady with whom he has been seen.",
      "imDbRating": "8.1",
      "imDbRatingCount": "331"
    },
    {
      "id": "tt5196380",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "Episode #2.4",
      "image": "https://m.media-amazon.com/images/M/MV5BYzdmYjljMWMtNGZlNS00NGEwLTllMTctMjQxMDg3MTRjNDdmXkEyXkFqcGdeQXVyNjYyNDMwOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2015",
      "released": "19 Nov. 2015",
      "plot": "Russell and Hugh lean on the mayor to let them dig in his field but Terry discovers that Peter's grandfather did not die in a plane crash though Peter seems vague about it and instead asks Sophie to tour the country with him in a camper van. Annoyed to see that an amateur detectorist in Warwickshire unearthed a valuable cache of coins Andy is further perturbed when his interview for the job in Africa does not seem to go well. Lance meanwhile is also upset when Kate finds his attempts to connect with her overpowering.",
      "imDbRating": "8.0",
      "imDbRatingCount": "326"
    },
    {
      "id": "tt5209404",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "Episode #2.5",
      "image": "https://m.media-amazon.com/images/M/MV5BNWM5YjU4NWYtZGVkMC00YWNmLTk0N2MtMTRhNjRkODAwNjczXkEyXkFqcGdeQXVyNjYyNDMwOQ@@._V1_Ratio1.9524_AL_.jpg",
      "year": "2015",
      "released": "26 Nov. 2015",
      "plot": "Andy passes his interview but keeps the fact a secret from Becky, which so annoys her she considers leaving him, whilst Lance is worried that his overly effusive actions have lost Kate forever. The pair discover that Peter is an impostor whose real interest is in unearthing a cache of gold coins in collusion with Simon and Garfunkel and without a licence to do so. A nocturnal stake-out results in Simon and Garfunkel being arrested though Peter escapes.",
      "imDbRating": "8.1",
      "imDbRatingCount": "327"
    },
    {
      "id": "tt5219256",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "Episode #2.6",
      "image": "https://m.media-amazon.com/images/M/MV5BZTkzMGRhMGItM2M1Ny00ZTA0LWJlYmQtZWZkZDM1NzMyMTVkXkEyXkFqcGdeQXVyNjYyNDMwOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2015",
      "released": "3 Dec. 2015",
      "plot": "Peter is arrested following the news that he has a life-time ban on metal detecting for disturbing war graves in Germany. The group hosts a rally for other local enthusiasts with Kate turning up to reconcile with her father and Andy getting unexpectedly wise advice from his mother-in-law regarding his and Becky's future. And Lance makes a very valuable find.",
      "imDbRating": "8.7",
      "imDbRatingCount": "398"
    },
    {
      "id": "tt5247478",
      "seasonNumber": "2",
      "episodeNumber": "7",
      "title": "Christmas Special",
      "image": "https://m.media-amazon.com/images/M/MV5BYjcyMTNkODAtYmM1NS00YWFiLWJkZDEtZWI4NjlkZDk4NDRlXkEyXkFqcGdeQXVyNjYyNDMwOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2015",
      "released": "23 Dec. 2015",
      "plot": "Lance's big find seems to have brought him nothing but misfortune, as the mysterious 'Curse of the Gold' appears to be taking its toll. Meanwhile, Andy briefly returns in good spirits from his adventures in Botswana and things take an upward turn for Lance when he finds a way to make his peace with the earth.",
      "imDbRating": "8.1",
      "imDbRatingCount": "321"
    }
  ],
  "errorMessage": ""
}