{
  "imDbId": "tt4082744",
  "title": "Detectorists",
  "fullTitle": "Detectorists (TV Series 2014–2022)",
  "type": "TVSeries",
  "year": "2014",
  "language": "en",
  "titleInLanguage": "Detectorists",
  "url": "https://en.wikipedia.org/wiki/Detectorists",
  "plotShort": {
    "plainText": "Detectorists is a British comedy television series first broadcast on BBC Four in October 2014. It is written and directed by Mackenzie Crook, who also stars alongside Toby Jones.\r\nThe series is set in the fictional small town of Danebury in north Essex. The plot revolves around the lives, loves and metal-detecting ambitions of Andy and Lance, members of the Danebury Metal Detecting Club. The main filming location for the series and Christmas specials is Framlingham, a small market town in Suffolk.\r\nDetectorists won a BAFTA at the 2015 British Academy Television Awards for Television Scripted Comedy. In May 2019, it was voted 19th in a Radio Times list of Britain's 20 favourite sitcoms by a panel that included sitcom writers and actors. It is filmed in single-camera setup.\r\nThe show ran for three series from 2014 to 2017, including a 2015 Christmas special. A further Christmas special aired in 2022.",
    "html": "<p>Detectorists is a British comedy television series first broadcast on BBC Four in October 2014. It is written and directed by Mackenzie Crook, who also stars alongside Toby Jones.</p><p>The series is set in the fictional small town of Danebury in north Essex. The plot revolves around the lives, loves and metal-detecting ambitions of Andy and Lance, members of the Danebury Metal Detecting Club. The main filming location for the series and Christmas specials is Framlingham, a small market town in Suffolk.</p><p>Detectorists won a BAFTA at the 2015 British Academy Television Awards for Television Scripted Comedy. In May 2019, it was voted 19th in a Radio Times list of Britain's 20 favourite sitcoms by a panel that included sitcom writers and actors. It is filmed in single-camera setup.</p><p>The show ran for three series from 2014 to 2017, including a 2015 Christmas special. A further Christmas special aired in 2022.</p>"
  },
  "plotFull": {
    "plainText": "Detectorists is a British comedy television series first broadcast on BBC Four in October 2014. It is written and directed by Mackenzie Crook, who also stars alongside Toby Jones.\r\nThe series is set in the fictional small town of Danebury in north Essex. The plot revolves around the lives, loves and metal-detecting ambitions of Andy and Lance, members of the Danebury Metal Detecting Club. The main filming location for the series and Christmas specials is Framlingham, a small market town in Suffolk.\r\nDetectorists won a BAFTA at the 2015 British Academy Television Awards for Television Scripted Comedy. In May 2019, it was voted 19th in a Radio Times list of Britain's 20 favourite sitcoms by a panel that included sitcom writers and actors. It is filmed in single-camera setup.\r\nThe show ran for three series from 2014 to 2017, including a 2015 Christmas special. A further Christmas special aired in 2022.\r\nCast\r\nMackenzie Crook as Andy Stone, an agency worker who qualifies as an archaeologist during the series. A member of the Danebury Metal Detecting Club (DMDC)\r\nToby Jones as Lance Stater, a forklift truck driver for a vegetable wholesaler, and amateur musician. A member of the DMDC\r\nLucy Benjamin as Maggie, Lance's ex-wife who runs a New Age supplies shop (series 1, 3)\r\nAdam Riches as Tony, Maggie's boyfriend, a pizza restaurant manager (series 1)\r\nRachael Stirling as Becky, Andy's girlfriend (wife as of series 2), a primary school teacher\r\nGerard Horan as Terry Seymour, a retired policeman who is the president of the DMDC\r\nSophie Thompson as Sheila Seymour, Terry's wife\r\nPearce Quigley as Russell, a DMDC member\r\nDivian Ladwa as Hugh, a shy and awkward DMDC member\r\nOrion Ben as Varde, a mostly silent DMDC member and girlfriend of Louise. Despite appearing in nearly every episode, and being described by members of the DMDC as very talkative, her only lines of dialogue are in series 2, episode 4, and the 2022 Christmas special.\r\nLaura Checkley as Louise, a forthright DMDC member and girlfriend of Varde\r\nAimee-Ffion Edwards as Sophie, an ancient history student at a university (series 1, 2)\r\nDavid Sterne as Larry Bishop, an eccentric farmer and landowner (series 1, 2)\r\nSimon Farnaby as Philip Peters and Paul Casar as Paul Lee, members of \"AntiquiSearchers\", later \"Dirt Sharks\", \"Terra Firma\", and then \"Absolut Hunters\", a rival metal detecting group. Lance and Andy call them Simon and Garfunkel due to their resemblance to the pop duo Paul Simon and Art Garfunkel. Both give their full names when questioned by the police in series 2, episode 5 (echoing the rather different vocal pairing of Peters and Lee)\r\nDiana Rigg as Veronica, Becky's mother and occasional child-minder for Stanley (series 2, 3). Rigg, who died in 2020, and Stirling were mother and daughter in real life. In the 2022 Christmas special Veronica is stated to have died prior to the events depicted in it.\r\nAlexa Davies as Kate, daughter of Lance (series 2, 3)\r\nRebecca Callard as Toni, a mechanic and colleague of Lance, who becomes his girlfriend (2015 Christmas special, series 3, 2022 Christmas special)\r\nDaniel Donskoy as Peter, a German visitor who seeks the DMDC's help in finding the location of his grandfather's aircraft, alleged to have crashed during World War II. He becomes a love interest for Sophie (series 2)\r\nJacob and Isabella Hill as Stanley, Becky and Andy's baby (series 2)\r\nAsa James Wallace as Stanley, Becky and Andy's child (series 3, 2022 Christmas special)\r\nEpisodes\r\nSeries 1 (2014)\r\nSeries 2 (2015)\r\nSeries 2 commences with a three-minute sequence showing an Anglo-Saxon priest carrying a holy book and an aestel (a pointer stick similar to that associated with the Alfred Jewel) in a sack and fleeing mounted spearmen. He buries the sack near a standing stone. Time lapse shows all but the decorated gold handle of the stick decaying, and the shot pans upwards to reveal Andy and Lance walking across the field in present-day Danebury, detecting as they go. Having had no success, they decide to look up the hill. The jewel is shown again, still buried, at the beginning of subsequent episodes.\r\nChristmas Special (2015)\r\nSeries 3 (2017)\r\nIn March 2017, the BBC released a statement confirming the filming of a third and final series. The six-episode third series was filmed in the summer of 2017 and aired weekly on BBC Four from 8 November 2017.\r\nThe first episode ends with a historical timeline sequence, backed by the song \"Magpie\" by The Unthanks. Reviewing the opening episode for The Guardian, Sam Wollaston said: \"Mackenzie Crook and Toby Jones shine in the third and final series of this beautifully written and performed slice of life.\"\r\nChristmas Special (2022)\r\nA 75-minute Christmas special was announced in May 2022. The episode aired on BBC Two on 26 December 2022.\r\nProduction\r\nDetectorists was announced by the BBC on 31 January 2014. The producer was Adam Tandy and the series was a Channel X and Lola Entertainment co-production.\r\nAlthough the series is set in Essex, it was mainly filmed in neighbouring Suffolk, with Framlingham used as a major location. Other locations used in filming include Orford, where Orford Primary School was used as the outside of Becky's school, Great Glemham, where interior pub scenes were filmed, and Ipswich. In series 2, the round-tower church at Aldham was used as a recurring location. One location in Essex was used in Detectorists: the scenes involving Lance's girlfriend Toni's houseboat, 'Elsie', were filmed at Paper Mill Lock, Little Baddow. Locations were sourced by Creative England.\r\nUpon deciding to finish the show at the end of series 3, Crook commented \"it took a while to realise that I did want to do six more episodes to finish. I don't want to make any sort of big, dramatic announcement that 'never again', but I can't see myself going back to it.\"\r\nDespite ruling out further episodes at the end of series 3, in December 2020 Crook alluded to the possibility that a fourth series was not out of the question, saying \"I'm just starting the process of thinking 'yeah, we should get the old band back together'.\"\r\nWhen asked about the possibility of Detectorists returning for a fourth series after the 2022 Christmas special, Crook responded \"I’m going to give the same answer I gave at the end of the third series; \"probably not\". I guess, dot dot dot, I mean, where can you go after this?\".\r\nBroadcast\r\nInternationally, the series premiered in Australia on 9 November 2015 on BBC First. In the United States, the series premiered on streaming subscription service Acorn TV in August 2015.\r\nReception\r\nCritical response\r\nSeries one of Detectorists was met with positive reviews from a number of UK and US media outlets. David Renshaw, writing for The Guardian, had particular praise for the \"delightful double-act\" Mackenzie Crook and Toby Jones. Renshaw points to the \"biggest ratings BBC4 has ever had for a comedy\" as evidence that \"Detectorists has clearly struck the sort of gold that Lance and Andy spend hours sweeping the fields for\". Rupert Hawksley, writing for The Daily Telegraph, was particularly impressed with Crook's \"first-rate writing\" and remarked in his review that series one \"has all the markings of a classic sitcom\".\r\nEllen E. Jones of The Independent said that while the show \"requires some patience... it has turned out to be one of the best new sitcoms of the year\".\r\nIn the US media, The New York Times writer Mike Hale describes Detectorists as a \"distinctive creation – not for everyone, but bound to be fiercely loved by those who fall into its rhythms\". Robert Lloyd of the Los Angeles Times \"can't recommend it enough\", saying: \"Like the ordinary lives it magnifies, Detectorists has the air of seeming to be small and immense at once, to be about hardly anything and almost everything. It is full of space and packed with life.\"\r\nWhen the programme returned for a second series, the response was again positive.\r\nOn the completion of the third and final series, Radio Times website reviewer Mark Braxton wrote \"The series finale... is one of the most satisfying conclusions ever. Series one and two both ended in clever and memorable ways: bittersweet and punch-the-air respectively. But the series three finale has a real poetry to it; Crook seems to be saying: \"Yes, that's where we'll leave it – I'm happy with that.\"\r\nThe series has also received praise for its authentic portrayal of \"a gentler side to maleness and male bonding\", with Ben Dowell of The Times describing the show as being \"steeped in a gentle kindness that I hadn't seen before\".\r\nA book of academic essays about the series, Landscapes of Detectorists, was published by Uniformbooks in 2020.\r\nAwards and nominations",
    "html": "<p>Detectorists is a British comedy television series first broadcast on BBC Four in October 2014. It is written and directed by Mackenzie Crook, who also stars alongside Toby Jones.</p><p>The series is set in the fictional small town of Danebury in north Essex. The plot revolves around the lives, loves and metal-detecting ambitions of Andy and Lance, members of the Danebury Metal Detecting Club. The main filming location for the series and Christmas specials is Framlingham, a small market town in Suffolk.</p><p>Detectorists won a BAFTA at the 2015 British Academy Television Awards for Television Scripted Comedy. In May 2019, it was voted 19th in a Radio Times list of Britain's 20 favourite sitcoms by a panel that included sitcom writers and actors. It is filmed in single-camera setup.</p><p>The show ran for three series from 2014 to 2017, including a 2015 Christmas special. A further Christmas special aired in 2022.</p><br/><h3>Cast</h3><ul><li>Mackenzie Crook as Andy Stone, an agency worker who qualifies as an archaeologist during the series. A member of the Danebury Metal Detecting Club (DMDC)</li><li>Toby Jones as Lance Stater, a forklift truck driver for a vegetable wholesaler, and amateur musician. A member of the DMDC</li><li>Lucy Benjamin as Maggie, Lance's ex-wife who runs a New Age supplies shop (series 1, 3)</li><li>Adam Riches as Tony, Maggie's boyfriend, a pizza restaurant manager (series 1)</li><li>Rachael Stirling as Becky, Andy's girlfriend (wife as of series 2), a primary school teacher</li><li>Gerard Horan as Terry Seymour, a retired policeman who is the president of the DMDC</li><li>Sophie Thompson as Sheila Seymour, Terry's wife</li><li>Pearce Quigley as Russell, a DMDC member</li><li>Divian Ladwa as Hugh, a shy and awkward DMDC member</li><li>Orion Ben as Varde, a mostly silent DMDC member and girlfriend of Louise. Despite appearing in nearly every episode, and being described by members of the DMDC as very talkative, her only lines of dialogue are in series 2, episode 4, and the 2022 Christmas special.</li><li>Laura Checkley as Louise, a forthright DMDC member and girlfriend of Varde</li><li>Aimee-Ffion Edwards as Sophie, an ancient history student at a university (series 1, 2)</li><li>David Sterne as Larry Bishop, an eccentric farmer and landowner (series 1, 2)</li><li>Simon Farnaby as Philip Peters and Paul Casar as Paul Lee, members of \"AntiquiSearchers\", later \"Dirt Sharks\", \"Terra Firma\", and then \"Absolut Hunters\", a rival metal detecting group. Lance and Andy call them Simon and Garfunkel due to their resemblance to the pop duo Paul Simon and Art Garfunkel. Both give their full names when questioned by the police in series 2, episode 5 (echoing the rather different vocal pairing of Peters and Lee)</li><li>Diana Rigg as Veronica, Becky's mother and occasional child-minder for Stanley (series 2, 3). Rigg, who died in 2020, and Stirling were mother and daughter in real life. In the 2022 Christmas special Veronica is stated to have died prior to the events depicted in it.</li><li>Alexa Davies as Kate, daughter of Lance (series 2, 3)</li><li>Rebecca Callard as Toni, a mechanic and colleague of Lance, who becomes his girlfriend (2015 Christmas special, series 3, 2022 Christmas special)</li><li>Daniel Donskoy as Peter, a German visitor who seeks the DMDC's help in finding the location of his grandfather's aircraft, alleged to have crashed during World War II. He becomes a love interest for Sophie (series 2)</li><li>Jacob and Isabella Hill as Stanley, Becky and Andy's baby (series 2)</li><li>Asa James Wallace as Stanley, Becky and Andy's child (series 3, 2022 Christmas special)</li></ul><br/><h3>Episodes</h3><h4>Series 1 (2014)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" style=\"width:3em;\">No.</th><th scope=\"col\">Title</th><th scope=\"col\" style=\"width:12em;\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 1\"</td><td style=\"text-align:center\">2 October 2014</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Andy and Lance are approached by Sophie, who explains that she is a student with an interest in metal detecting. They invite her to attend the next meeting of their detecting club, the DMDC, where she is enthusiastically welcomed. Lance finds an excuse to visit his ex-wife Maggie at her shop, in the hope of reviving their relationship, but she is never far from her obnoxious new boyfriend Tony. Andy is convinced that a royal Saxon ship-burial is located on a nearby farm. The landowner, the eccentric Farmer Bishop, permits Andy and Lance to search his land, with the exception of one field, where it is rumoured that he has buried his wife.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 2\"</td><td style=\"text-align:center\">9 October 2014</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Lance suggests to Andy that they perform a song he's written at a local pub open-mic event, hoping to impress Maggie. Andy tries to convince his girlfriend Becky to come along, knowing that she resents the time he spends out detecting with Lance. At Bishop's Farm, they are approached by two rival detectorists who also intend to search the site. Wary of others muscling in on their patch, Andy and Lance decide to keep their operations secret, but Sophie seems to know more than she should. Farmer Bishop shows the detectorists a couple of Saxon artefacts that were ploughed up on the farm decades ago, which seems to confirm that the site of the ship-burial is nearby.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 3\"</td><td style=\"text-align:center\">16 October 2014</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Andy and Lance get an unexpected visit from the rival detectorists the 'Antiquisearchers', who know all about the artefacts after Bishop showed them. Deciding they need to act fast, Lance and Andy get the club involved, and Terry — the club president — is only too keen to muck in if he can prove that Larry Bishop murdered his wife. Meanwhile, the open-mic event turns into a disaster. Andy cringes with embarrassment after performing Lance's song, prompting Sophie to take his hand to console him. Becky walks in on this scene and reacts furiously, accusing Andy of having an affair. (The episode includes a short performance of the title song, performed by <span class=\"mw-redirect\">Johnny Flynn</span> as \"Johnny Piper\".)</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 4\"</td><td style=\"text-align:center\">23 October 2014</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">After striking an unexploded bomb while digging on Bishop's land, Terry is hospitalised and announces that he is standing down as president of the DMDC. Sophie calls Andy, telling him she's bought a new detector and the two go out detecting. Andy is jubilant when he finds his first gold coin, but Lance resents him for going detecting without him and refuses to talk. They find themselves on opposite teams in a pub quiz, with Andy trying to keep the peace between Becky and Sophie, who are openly hostile, and Lance having to endure the company of Tony, who mocks him in front of Maggie. Later, Becky is sent an incriminating photograph of Andy sharing a celebratory kiss with Sophie (taken just after they had found the gold coin) and storms out on him.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 5\"</td><td style=\"text-align:center\">30 October 2014</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Andy tries to convince Becky that he isn't having an affair. She shows him the photograph but doesn't know who took it. Lance helps out at Maggie's shop, where she pressures him to give her a large loan. Later, he and Sophie encounter the Antiquisearchers, who announce that they now have the sole right to search Bishop's Farm. Andy storms up and accuses them of taking the photograph. When Sophie sees it, she is outraged at this attempt to destroy Andy's personal life and denounces the Antiquisearchers, revealing that they sent her to spy on Lance and Andy's detecting activities. The DMDC are on the verge of disbanding when Terry returns and takes back the club's presidency. Bishop is arrested on suspicion of murder when the archaeological excavation turns up bones on his land.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 6\"</td><td style=\"text-align:center\">6 November 2014</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Andy gives up detecting, hoping that by selling his detector he can prove his devotion to Becky. He proposes to her and she accepts. Lance discovers that the only reason Maggie keeps in contact with him is that she knows he has substantial lottery winnings saved. Sophie visits the DMDC to apologise, explaining that she was used by the Antiquisearchers and will undo the damage her actions have caused. Bishop is released without charge when it turns out that the bones found on his land were from a dog. He invites Andy, Lance, Sophie and Becky back to his land to detect, giving the detectorists one last chance to discover their hearts' desire: the burial place of King <span>Sexred</span> of the <span>East Saxons</span>.</td></tr></tbody></table><h4>Series 2 (2015)</h4><p>Series 2 commences with a three-minute sequence showing an Anglo-Saxon priest carrying a holy book and an aestel (a pointer stick similar to that associated with the Alfred Jewel) in a sack and fleeing mounted spearmen. He buries the sack near a standing stone. Time lapse shows all but the decorated gold handle of the stick decaying, and the shot pans upwards to reveal Andy and Lance walking across the field in present-day Danebury, detecting as they go. Having had no success, they decide to look up the hill. The jewel is shown again, still buried, at the beginning of subsequent episodes.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" style=\"width:3em;\">No.</th><th scope=\"col\">Title</th><th scope=\"col\" style=\"width:12em;\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 1\"</td><td style=\"text-align:center\">29 October 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Baby Stan has arrived, Andy has qualified as an archaeologist but has no work, and Becky is off with Gay Martin, talking about <span>VSO</span>. A young German man, Peter, turns up at a meeting of the DMDC, telling them he is looking for the wreckage of a <span>Junkers</span> World War II bomber. His grandfather was one of the crew members when it crashed somewhere nearby in 1941. Sophie offers to help him research the location of the crash site. Andy and the other members of the DMDC, worried that Lance is becoming lonely, try to convince him to try internet dating. Later Lance receives a call from a mystery woman called Kate.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 2\"</td><td style=\"text-align:center\">5 November 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Lance is preparing to meet the mystery woman, but keeps it a secret. Andy heads to the library to join Sophie and Peter with their research, but gets the impression they don't want him around, so leaves them to it. Meanwhile Becky's patience with the petty politics at her school is at breaking point and she walks out of a staff meeting. Andy spots Lance in a cafe with the mystery woman, who is much younger than he is. Danebury's mayor seeks the DMDC's help finding his <span class=\"mw-redirect\">chain of office</span> which he has lost at a <span>dogging</span> site. Whilst out detecting Andy and Lance encounter their old rivals—now renamed the 'Dirt Sharks'—who suggest that Peter might have other motives for finding the plane than simply to lay a wreath.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 3\"</td><td style=\"text-align:center\">12 November 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Russell and Hugh begin the search for the mayor's missing chain of office. Sophie and Peter discover Lance buying flowers and chocolate— apparently preparing for a date—and, on Andy's instructions, spy on him as he meets the mystery woman again. It transpires that the crash site is on the Mayor's land, leading Terry to suggest that the club should ask for permission to search his land as a reward for finding the chain. Becky tries to convince Andy to consider volunteering abroad; she has found an archaeological dig in Botswana and set him up for an interview. Lance reveals to Andy that Kate is his estranged daughter. The chains of office are discovered, along with an unspecified unpleasant item on it.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 4\"</td><td style=\"text-align:center\">19 November 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">The mayor—unwillingly, but with the threat of blackmail from Russell and Hugh—agrees to let the DMDC search his land. Sophie and Peter have been spending a lot of time together, and when Peter asks her to go travelling with him in the summer, she accepts. Andy's interview goes disastrously at first, but his enthusiasm for archaeology shows when he presents some clay pipe pieces he found in a flower-bed. Terry receives the licence from the MOD to excavate the crash site, which reveals there were no crewmen on board when the plane crashed. He challenges Peter, who is apparently taken aback at this news and hastily departs. Lance attempts to connect with Kate, but she is overwhelmed by 20 years' worth of presents and leaves him.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 5\"</td><td style=\"text-align:center\">26 November 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Andy fears the uncertainties of providing for his family in Botswana and conceals that he's been offered the job, leading to Becky becoming angry and telling him she and Stan are going to Botswana regardless of whether Andy accompanies them. Sophie manages to contact Peter, who tells her he's been offended by the accusations Terry made against him and is going home. Meanwhile Andy and Lance call an emergency meeting of the DMDC when they discover Peter has met with the Dirt Sharks and carries a Nazi gold coin in his wallet. Sophie defends Peter, accusing the others of paranoia, but later discovers he was lying to her all along. The other club members stake out the field at night and catch the Dirt Sharks Nighthawking, though Peter escapes. Lance makes several unreturned calls to Kate.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 6\"</td><td style=\"text-align:center\">3 December 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">The DMDC hold their rally at the <span>Junkers Ju 88</span> crash site. Peter, who Sophie learns has been twice convicted of disturbing war graves in Germany and is banned from using a metal detector there, skulks in to search and is caught by Terry, who calls the police on him. Kate arrives and is reconciled with Lance. After speaking with Veronica, Andy rushes to Becky at the school's <span>Dickens</span>-themed fete and they agree to have an adventure in Botswana together. Andy and Lance are returning from their last detecting session before Andy leaves for Botswana, when Lance hears horses near the fallen standing stone. Lance digs and uncovers the aestel, and joyously dances the gold dance with Andy and Sophie.</td></tr></tbody></table><h4>Christmas Special (2015)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" style=\"width:3em;\">No.</th><th scope=\"col\">Title</th><th scope=\"col\" style=\"width:12em;\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"\" style=\"text-align:center\">—</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Christmas Special\"</td><td style=\"text-align:center\">23 December 2015</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Lance's lucky strike, a late Saxon gold and jewelled aestel, is on display at the <span>British Museum</span> but seems to have used up all his luck, as he hasn't had a single find since (not even a ring-pull), and he suffers a series of misfortunes which his club-mates consider to be \"the curse of the gold.\"</td></tr></tbody></table><h4>Series 3 (2017)</h4><p>In March 2017, the BBC released a statement confirming the filming of a third and final series. The six-episode third series was filmed in the summer of 2017 and aired weekly on BBC Four from 8 November 2017.</p><p>The first episode ends with a historical timeline sequence, backed by the song \"Magpie\" by The Unthanks. Reviewing the opening episode for The Guardian, Sam Wollaston said: \"Mackenzie Crook and Toby Jones shine in the third and final series of this beautifully written and performed slice of life.\"</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" style=\"width:3em;\">No.</th><th scope=\"col\">Title</th><th scope=\"col\" style=\"width:12em;\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 1\"</td><td style=\"text-align:center\">8 November 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">An energy company plans on building a solar panel array on a farm in Danebury. Lance is finding Kate staying to be disruptive. Andy isn't enjoying his mother-in-law's hospitality and doesn't find his job rewarding. A newspaper has an article about Russell and Hugh finding a prison tag, as well as a piece about the proposed solar farm. Lance doesn't like staying on Toni's boat due to 'seasickness' and she doesn't like staying at his flat when Kate is there.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 2\"</td><td style=\"text-align:center\">15 November 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Six weeks to go before the fields become a solar farm. Lance and Andy are making interesting finds. Andy unearths a section of Roman mosaic at the development. Toni suggests Lance has hypnotherapy so he can stay with her. Terra Firma (\"Simon and Garfunkel\") get permission to search the fields which leads to a confrontation with Lance and Andy, though it is resolved after an intervention by someone representing the site's new owners.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 3\"</td><td style=\"text-align:center\">22 November 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Lance dreams about detecting with <span>Linda Lusardi</span>. He picks Andy up and they race Terra Firma to the fields. The mosaic has been removed, so Andy resigns. Becky has arranged to view a flat. Lance goes into work and sees Toni. Mags turns up at Lance's and is let in by Kate. Lance returns home and finds Mags there. Lance finds a gold coin but a magpie takes it. He tells the DMDC. Mags rings to say she's found a bottle of wine. Lance and Andy camp out at the fields.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 4\"</td><td style=\"text-align:center\">29 November 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Lance and Andy camp out at the field. Toni goes to Lance's and finds Mags there. Lance intends to catch a \"thieving\" magpie. Varde gives a talk to the group. Toni confronts Lance about Mags. Andy tells Veronica he quit his job. Kate finds out that Mags is after Lance's money and kicks her out.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 5\"</td><td style=\"text-align:center\">6 December 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">\"Simon and Garfunkel\" crash their drone. A contractor comes to chop down an ancient oak tree in the field where Andy and Lance are detecting, and the pair want to stop them. Kate tells Toni she is thinking of moving out of Lance's, and Lance asks Toni to move in with him. Andy stumbles across a dilapidated cottage and goes to see it with Becky. Andy installs a bat box in the tree and rings a bat helpline, which turns out to be run by \"Simon and Garfunkel\". They offer to help but want something in return.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 6\"</td><td style=\"text-align:center\">13 December 2017</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\">Lance and Kate go to Toni's <span>narrowboat</span>. Terry publishes a book on buttons of north-west Essex. Lance and Andy plan a rally and make \"Simon and Garfunkel\" an offer: access to their fields in exchange for a bat preservation order on the oak tree. Andy and Becky want to buy the cottage they have seen at auction. Andy wonders why he and Lance to metal detecting; to be \"time travellers\", replies Lance. As the show ends, Lance and Andy walk past the oak tree and notice the coins that have fallen from the magpie nest above them. They've found their gold.</td></tr></tbody></table><h4>Christmas Special (2022)</h4><p>A 75-minute Christmas special was announced in May 2022. The episode aired on BBC Two on 26 December 2022.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" style=\"width:3em;\">No.</th><th scope=\"col\">Title</th><th scope=\"col\" style=\"width:12em;\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"\" style=\"text-align:center\">—</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Christmas Special 2022\"</td><td style=\"text-align:center\">26 December 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"4\" style=\"border-bottom:solid 3px #CCCCFF\"><p>Trouble stalks the Danebury Metal Detecting Club when developers want to buy and demolish their base, the local scout hut. The club missed out on a big finder’s fee and need to find a way to raise funds to save the hall by refurbishing it.</p>Lance secures permission to detect on ten acres of previously unsearched land and things take a turn for the better when he and Andy start to find artifacts from an important medieval battle. However, when Lance makes an important discovery he breaks protocol by wanting to withhold the information from the authorities and the DMDC, threatening his friendship with Andy and the club’s survival.</td></tr></tbody></table><br/><h3>Production</h3><p>Detectorists was announced by the BBC on 31 January 2014. The producer was Adam Tandy and the series was a Channel X and Lola Entertainment co-production.</p><p>Although the series is set in Essex, it was mainly filmed in neighbouring Suffolk, with Framlingham used as a major location. Other locations used in filming include Orford, where Orford Primary School was used as the outside of Becky's school, Great Glemham, where interior pub scenes were filmed, and Ipswich. In series 2, the round-tower church at Aldham was used as a recurring location. One location in Essex was used in Detectorists: the scenes involving Lance's girlfriend Toni's houseboat, 'Elsie', were filmed at Paper Mill Lock, Little Baddow. Locations were sourced by Creative England.</p><p>Upon deciding to finish the show at the end of series 3, Crook commented \"it took a while to realise that I did want to do six more episodes to finish. I don't want to make any sort of big, dramatic announcement that 'never again', but I can't see myself going back to it.\"</p><p>Despite ruling out further episodes at the end of series 3, in December 2020 Crook alluded to the possibility that a fourth series was not out of the question, saying \"I'm just starting the process of thinking 'yeah, we should get the old band back together'.\"</p><p>When asked about the possibility of Detectorists returning for a fourth series after the 2022 Christmas special, Crook responded \"I’m going to give the same answer I gave at the end of the third series; \"probably not\". I guess, dot dot dot, I mean, where can you go after this?\".</p><br/><h3>Broadcast</h3><p>Internationally, the series premiered in Australia on 9 November 2015 on BBC First. In the United States, the series premiered on streaming subscription service Acorn TV in August 2015.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Series one of Detectorists was met with positive reviews from a number of UK and US media outlets. David Renshaw, writing for The Guardian, had particular praise for the \"delightful double-act\" Mackenzie Crook and Toby Jones. Renshaw points to the \"biggest ratings BBC4 has ever had for a comedy\" as evidence that \"Detectorists has clearly struck the sort of gold that Lance and Andy spend hours sweeping the fields for\". Rupert Hawksley, writing for The Daily Telegraph, was particularly impressed with Crook's \"first-rate writing\" and remarked in his review that series one \"has all the markings of a classic sitcom\".</p><p>Ellen E. Jones of The Independent said that while the show \"requires some patience... it has turned out to be one of the best new sitcoms of the year\".</p><p>In the US media, The New York Times writer Mike Hale describes Detectorists as a \"distinctive creation – not for everyone, but bound to be fiercely loved by those who fall into its rhythms\". Robert Lloyd of the Los Angeles Times \"can't recommend it enough\", saying: \"Like the ordinary lives it magnifies, Detectorists has the air of seeming to be small and immense at once, to be about hardly anything and almost everything. It is full of space and packed with life.\"</p><p>When the programme returned for a second series, the response was again positive.</p><p>On the completion of the third and final series, Radio Times website reviewer Mark Braxton wrote \"The series finale... is one of the most satisfying conclusions ever. Series one and two both ended in clever and memorable ways: bittersweet and punch-the-air respectively. But the series three finale has a real poetry to it; Crook seems to be saying: \"Yes, that's where we'll leave it – I'm happy with that.\"</p><p>The series has also received praise for its authentic portrayal of \"a gentler side to maleness and male bonding\", with Ben Dowell of The Times describing the show as being \"steeped in a gentle kindness that I hadn't seen before\".</p><p>A book of academic essays about the series, Landscapes of Detectorists, was published by Uniformbooks in 2020.</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Year</th><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient</th><th scope=\"col\">Result</th><th scope=\"col\">Ref.</th></tr><tr><td><span>2015</span></td><td><span>British Academy Television Award (BAFTA)</span></td><td><span>Best Situation Comedy</span></td><td><i>Detectorists</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>2016</span></td><td><span>British Academy Television Award (BAFTA)</span></td><td><span>Best Male Comedy Performance</span></td><td><span>Toby Jones</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>2018</span></td><td><span>British Academy Television Award (BAFTA)</span></td><td><span>Best Male Comedy Performance</span></td><td><span>Toby Jones</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>2018</span></td><td><span>Rose d'Or</span></td><td>Rose d'Or for Sitcom</td><td><i>Detectorists</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}