{
  "imDbId": "tt5555260",
  "title": "This Is Us",
  "fullTitle": "This Is Us (TV Series 2016–2022)",
  "type": "TVSeries",
  "year": "2016",
  "items": [
    {
      "username": "Harun_Karali",
      "userUrl": "https://www.imdb.com/user/ur23755943",
      "reviewLink": "https://www.imdb.com/review/rw3548244",
      "warningSpoilers": false,
      "date": "21 September 2016",
      "rate": "9",
      "helpful": "394 out of 442 found this helpful.",
      "title": "Pleasant Surprise",
      "content": "I think we can all admit that it's hard to create a show that stands out, As we are at a time where television is at it's pinnacle point. So when I started this show I was expecting a mildly entertaining series. What I got, is, a show that is real. So much so, that it brought tears to my eyes. That should tell you all you need to know about this beautiful tale about life. The story revolves around a few characters that seem to be unrelated. Just like the facts that were stated in the beginning of the show. However they have more in common than you realize. What sets this show apart from most, isn't the ending, But the journey you take in-between. As someone who's seen many new shows this year, both comedy and drama, I can say with absolute certainty, this is the most memorable. Not only because of it's outstanding story telling but because of it's cast, who bring life to the story."
    },
    {
      "username": "silviaavnet",
      "userUrl": "https://www.imdb.com/user/ur87486306",
      "reviewLink": "https://www.imdb.com/review/rw8165145",
      "warningSpoilers": false,
      "date": "22 May 2022",
      "rate": "10",
      "helpful": "33 out of 35 found this helpful.",
      "title": "Dan Fogelman and the whole troupe....",
      "content": "I think that kleenex owes this guy a percentage of the sellings! This awesome, fantastic, heartbreaking, intelligent, touching, sincere, unforgettable show will be forever in our lives, at least in mine!!Soooo special, the script, the actors,the characters had been elaborated with such delicate ways, each one of them means a whole world.This show has made my life better for sure....thank you,thank you, thank you ALL OF YOU."
    },
    {
      "username": "megan_chatterton",
      "userUrl": "https://www.imdb.com/user/ur129345401",
      "reviewLink": "https://www.imdb.com/review/rw8176923",
      "warningSpoilers": false,
      "date": "26 May 2022",
      "rate": "9",
      "helpful": "34 out of 38 found this helpful.",
      "title": "All of Us",
      "content": "I just finished watching the series finale last night. This is a show about the human condition. Not every decision they made on this show jived with me. In my opinion there is too much Randall (not enough Kate and Kevin) and the Toby fiasco in season 6 made me so mad... but life is full of its ups and downs too.The cast in this show is very good, definitely deserving of their nominations. The story itself is heartwarming. I cried more watching this show than most! From the births of children (some with disabilities), to an Alzheimer's decline and the deaths of parents, these struggles are all things people deal with.This is a show about all of us. A gem."
    },
    {
      "username": "RebeccaKeys84",
      "userUrl": "https://www.imdb.com/user/ur37009666",
      "reviewLink": "https://www.imdb.com/review/rw5191192",
      "warningSpoilers": false,
      "date": "16 October 2019",
      "rate": "8",
      "helpful": "172 out of 213 found this helpful.",
      "title": "Give Kate a real storyline",
      "content": "This is one of my favorite shows, but the writers really do a disservice to Kate's character. We're in season 4 now and every storyline of Kate's -at all ages- is about her weight. We get it: she's overweight and has struggled with it her whole life, but come on. Show her taking classes, show her hobbies, whatever. Give the woman some new content to work with."
    },
    {
      "username": "missmayhillary",
      "userUrl": "https://www.imdb.com/user/ur42247358",
      "reviewLink": "https://www.imdb.com/review/rw4318489",
      "warningSpoilers": false,
      "date": "3 September 2018",
      "rate": "9",
      "helpful": "188 out of 204 found this helpful.",
      "title": "It's like looking at love through a window.",
      "content": "So, this will be my first official review on IMBD. I believe it's warranted because I have absolutely fallen in love with this show. The writing, the characters, the emotion..everything just feels on par and real. I'm really not much of a TV watcher. This show though, and specifically the relationship between Jack and Kate, reminds me so much of my own relationship and it's just a reminder of how much I love and appreciate the amazing man that I have. This show will make you feel things. I really can't say it any better than that. Leave all of your politics and judgement at the door, and give this a chance."
    },
    {
      "username": "echozdog",
      "userUrl": "https://www.imdb.com/user/ur2104171",
      "reviewLink": "https://www.imdb.com/review/rw3548367",
      "warningSpoilers": false,
      "date": "21 September 2016",
      "rate": "9",
      "helpful": "211 out of 274 found this helpful.",
      "title": "Best Pilot in ages. (Spoilers)",
      "content": "SPOILER ALERTFirst I am a hard person to fool. The Village. Figured it out. Many others. The Sixth Sense and Fight club got me and that's why I love them. I love to be taken down a path and then realize everything wasn't as it seems.When the fireman lit the cigarette I realized it was 1980. But I still didn't get that those three would be raised together until the nursery with the knit onesies. I'm good at this stuff and the acting and characters blew me away that I wasn't looking for it. Best Pilot ever. IMHO.Then I thought. Well they can't do that every episode because if you are looking for twists you find them. If I was told there was a twist at the end, I would have figured it out (everyone's birthday on the same day, etc). But the fact one was black and the other two were twins threw me. PLUS the fact one was \"Ryan Gosling\" body and the other was overweight threw me that they were twins. Both played on stereotypes which I Loved they made us look into ourselves a little.So where does the show go from here? It has a great premise. Dual time lines. You can do a lot with that. Have stories play out with flashbacks to tell a larger story (ala Lost). The casting was nailed with exceptional talent. I was interested in every character. They even nailed it by casting Simon and Simon vet Gerald McRaney. He was the glue that MADE that story line click. He speech on the chair was Emmy worthy. I hope he is a regular cast member and explore his wife's death and the death of his one child.I'm hooked for at least season one. No need for twists. The dual time lines and great characters is enough for me. They can bounce all around in the 80s when the \"triplets\" are 4 or 10 or 15. triple time lines or more. Milo and Mandy can be made to look older and cast kids to play the parts at different ages. So much room to explore. I predict a good 4-7 year run."
    },
    {
      "username": "jasmann-narang",
      "userUrl": "https://www.imdb.com/user/ur52988045",
      "reviewLink": "https://www.imdb.com/review/rw5194305",
      "warningSpoilers": false,
      "date": "17 October 2019",
      "rate": "9",
      "helpful": "128 out of 140 found this helpful.",
      "title": "It's 4:57 am here and yet I could not resist myself from sharing my review on this show just because I loved it.",
      "content": "Let me just begin and geek out by saying how I started the first season and binged it till the 3rd and now I am writing this review at 4:57 am, in my country and only because I could not 'not' share my review about this.\"This Is Us,\" is built around four characters who share the same birthday & it is a heartwarming and emotional story about the struggles and life of unique set of triplets and their wonderful parents.This show celebrates the ordinary rhythms of family life, the unflashy joys of loving and being frustrated by your parents, or wanting to shoot the breeze with your siblings. It's also beautifully acted, most notably by Mandy Moore, Sterling K. Brown & Milo Ventimiglia. It validates it's characters' flaws and does not bow to hysterical dramatics, which the viewer's feel is something that makes it even more authentic!In the age of Netflix and their cringy shows, I chose to watch This Is Us because it offers so much in so little, It talks about birth, death, career crisis, self-doubts, heart-to-hearts, reconciliations and never fails to make viewers feel something.Possibly one of the best things in this show, is the ability of an American family to reach the hearts of audiences across the globe in a way that it manages to speak across cultures, resonate with audiences simply because of their characters and well thought storyline, being an Indian and having grown up in a completely different culture I can still feel the warmth of this show and appreciate it.The first 4 seasons have just seemed perfect to me, 5th is where things really started going downhill.Possibly the only reason I didn't give this a 10 and would have liked to give a 8.5, is that the buildup is so great but at times we don't get the adequate time to deal with the sudden buildup bursting within seconds. What I mean is, sometimes their buildup is so devastating that we would need a minute to react (and feel that the characters have reacted adequately) and the next second the scene has completely changed.This is what turned out to be wrong with the beginning of the latest season(Season 5), even though it shows the transition to the almost apocalyptic pandemic society we seem to live in now, it throws at us emotions, situations and current happenings for the audiences to digest within a few scenes.An amazingly executed drama, whose pilot should be enough to get you hooked because of it's own unique voice.Edit: I have reviewed the beginning of Season 5 as well in this edit (first 5-6 episodes)."
    },
    {
      "username": "michaelrthomson",
      "userUrl": "https://www.imdb.com/user/ur50215039",
      "reviewLink": "https://www.imdb.com/review/rw3563237",
      "warningSpoilers": true,
      "date": "16 October 2016",
      "rate": "10",
      "helpful": "108 out of 141 found this helpful.",
      "title": "Without equal so far this season....",
      "content": "2022: So a few years later this show has come to an end - after maybe 5 years of the Pearsons, it was time to say goodbye.The progressive life stories were in the main interesting and enjoyable storytelling, and unusually for me I did manage to keep a handle on all the time jumping going on, though the change of actors playing your versions mid way through was a turn off.I felt as though this show tried hard to capture the magic of season 1 every year, but it never really achieve that goal - mid way through things did start to feel done and lacking and as though they were struggling with ideas. The final season concluded most storylines, but some were certainly never progressed beyond short scenes shown at various points in season 3/4/5 - and also some of those stories were perhaps not pivotal to the overarching story, they were the start of exploration of secondary characters lives as adults that never really went any further, instead they focussed mostly on the love life of Kevin and the drama of kate and Randall.After all this time, there is no denying that Mandy Moore has more talent as an actress than most would have imagined, probably considerably more talent than she does as a singer if her recording history is anything to go by. It would be interesting to see if perhaps a show turns up at some stage that explores more about the grandchildrens lives and experiences, for example, how did Jack become a rich hollywood celebrity, was Tess a lesbian afterall, what about the twins - there were a lot of stories that could have be explored and perhaps in the end everyone just got a little bit tired and over it - so will there be a spinoff, maybe, and would that spin off have enough material to make a few seasons of shows, yep I would say there are enough loose ends to do that, with the occasional appearances of the leads from the main 'this is us' show... afterall, they are a family and you can't have the grandkids without the grandparents and parents.... It seems like an opportunity to do more, and to perhaps rediscovery the joy and remarkableness that was season 1.In the end, This is Us was an all around great show, it was very well acted and despite dips here and there the stories were usually interesting and fairly realistic. I feel like it was let down by an ending that felt hastened by a decision to end it by the studio or the actors or both.... I will keep an eye out for a reboot or spinoff of some sort, afterall, these days imagination in the tv industry is lacking and so it might just prove that the Pearson's are a family that is easily reinvented from another perspective.Thats it for 2022.All too often one ends up writing a review about a show that is less than amazing, often out of frustration, annoyance or plain old bored at yet another half as*ed attempt to get viewers to tune in with little effort on plot, dialogue or acting.I'm so pleased to say, this show is the opposite of it all, it is a delight to have found amongst the tedious modern take on entertainment.The tale is one of life, of seemingly unrelated people who share something in common, well that is the opener, the twist reveals itself blatantly at the end of episode one, and I didn't see it coming, so far episodes 2 and 3 have not delivered quite that surprise, but what they do deliver is excellence in acting, excellence in storytelling, and a compelling narrative and the continued potential for greatness.The characters are increasingly well developed with main and side stories in abundance, it has so far kept me interested and perhaps most importantly for a show, invested in who these characters are, and the journey they are on.There is something spine tingly about the show, as others have stated it can be an emotional journey, with moments of humour and moments of laughter and joy.It is merely 3 episodes in, but I am hoping we continue to explore the stories being told here, that the cast continues to deliver compelling acting and that the script writers take us on a human journey with all the typical highs and lows that involves. I am looking forward to more, much much more.If you hadn't noticed, I'm impressed by the acting cred of these people, with a couple of exceptions these actors aren't one's I've seen before, but they are doing an awesome job here.So for a change, i'm so please to commend this show to others, to say it needs to be watched with patience, with curiosity and and open mind and heart."
    },
    {
      "username": "drjgardner",
      "userUrl": "https://www.imdb.com/user/ur44482045",
      "reviewLink": "https://www.imdb.com/review/rw3552486",
      "warningSpoilers": false,
      "date": "28 September 2016",
      "rate": "9",
      "helpful": "82 out of 112 found this helpful.",
      "title": "Innovative and Surprising",
      "content": "This is a very inventive story line so I won't refer to it, except to say that both the first and second episodes have real surprises. Avoid reading any reviews with spoilers. It will dampen your joy as you figure things out.The acting is excellent and the script is well written. This looks like a comedy but in fact it has some profoundly dramatic moments. I want to single out some of the actors who were terrific – Milo Ventimiglia (played Rocky Jr), Mandy Moore (\"Tangled\"), Ron Cephas Jones, Sterling K. Brown (Chris Darden in \"OJ\") and Susan Kelechi Watson (\"Louie\"). Gerald McRaney does a cameo in Episode 1 which may be some of his best work ever.The disadvantage of a TV series like this is that it requires the audience to participate and fill in the gaps. Many people will not understand what's happening, so this is the type of series that is best viewed twice, or however long it takes you to get it."
    },
    {
      "username": "Ed-Shullivan",
      "userUrl": "https://www.imdb.com/user/ur31328960",
      "reviewLink": "https://www.imdb.com/review/rw4020365",
      "warningSpoilers": false,
      "date": "1 January 2018",
      "rate": "10",
      "helpful": "30 out of 40 found this helpful.",
      "title": "Not a dry eye will be left in your home watching this dramatic television series",
      "content": "This series is powerful, emotional, deep in thought and is a truly heart felt dramatic series that draws its audience in from the very first moment until before you know it, the episode has concluded and you are wiping away tears that have been building up until you cannot hold back anymore.There is one particular episode from season 2, episode 10, tilted simply \"Number Three\" which sums up what this series is all about. That being family dynamics that involve reminiscing about our own parents and how we developed into being the adults that we are.If you have never watched this dramatic television series as Mrs. Shullivan and I have from the very first episode, and you want to gain an appreciation for what dramatic performances should be, then this particular episode (Season 2, episode 10) will clinch it for you and your family.There are many families (truth be told it is more like most families) who have one or more family members who go through difficult times filled with emotional and difficult life experiences. In this episode Season 2, episode 10, titled \"Number Three\" it focuses on the young teenage Randall trying to figure out what college he should go to as he is extremely intelligent and has his choice of almost any college including Harvard. His dad Jack agrees to take Randall to a predominantly black college and they discuss Randall's options on the drive home where Randall's feelings about being a black child growing up in a predominantly white neighborhood are explained. Then the episode flips to the adult Randall struggling with keeping his emotions in check while having to let go of his and his wife Beth's foster child Déjà (played by a most compelling actress named Lyric Ross) to her biological troubled mother Shauna. As this extremely emotional scene continues to evolve the music from Cat Steven's 1970 song \"Where do the children play\" is heard in the background. I believe this scene alone should be enough to win actor Sterling K. Brown (who plays Randall Pearson) an Emmy for best actor in a dramatic series, hands down.If this series \"This Is Us\" was extended to a two hour episode each week Mrs. Shullivan and I would be sure to ignore other television shows we would be missing to make sure we did not miss a single minute of this extremely well done series. The two preceding episodes titled \"Number One\" and \"Number Two\" focus on the other two Pearson children, namely Kevin Pearson (number one) and Kate Pearson (number two). Congratulations to the series creator Dan Fogelman, and the series writers Dan Fogelma (created by) (54 episodes, 2016-2019), Kay Oyegun (27 episodes, 2016-2017), Aurin Squire (17 episodes, 2016-2017) Jas Waters and the other writers for just a fabulous dramatic series that has warmed our hearts and helps us to listen to others without pre-judging the why?"
    },
    {
      "username": "blanbrn",
      "userUrl": "https://www.imdb.com/user/ur9927546",
      "reviewLink": "https://www.imdb.com/review/rw3565675",
      "warningSpoilers": false,
      "date": "20 October 2016",
      "rate": "9",
      "helpful": "29 out of 39 found this helpful.",
      "title": "Heartfelt and emotional touching series that proves life and people are connected.",
      "content": "\"This Is US\" is by far the best new series on network TV as NBC has found a family drama that's a winner as this is filled with emotion and drama love, loss, regret, and search for happiness. This series is told a lot thru flashback to show how it made the present anyway it involves a couple Jack(Milo Ventimiglia)and Rebecca(Mandy Moore)who have triplets all on the same day with only two of them to survive and that's Kevin(Justin Hartley)and Kate(Chrissy Metz)who then become a sibling to the adopted son Randall(Sterling Brown). Now all of the kids are grown searching and trying to find their own way of life as Kevin is a want to be actor and Kate is an overweight mess and unhappy yet, she starts a \"Mike and Molly\" type relationship with Toby(Chris Sullivan). Now with Randall(Sterling Brown) he's successful and he finally finds his real life father who's dying with terminal cancer and this brings plenty of drama and conflict with his hard loving wife(Susan Kelechi Watson)as she feels Randall has to much of a big heart. Thru it all this family shares emotion and love thru the struggles of life and time as the viewer can see it's all connected to the bonding they had at birth and the flashbacks show how the trio was molded by Jack and Rebecca. Really this series is warm and touching it shows how change and life develops and it proves that love and connections last."
    },
    {
      "username": "eddieo1969",
      "userUrl": "https://www.imdb.com/user/ur53437099",
      "reviewLink": "https://www.imdb.com/review/rw3550117",
      "warningSpoilers": false,
      "date": "21 September 2016",
      "rate": "10",
      "helpful": "103 out of 142 found this helpful.",
      "title": "Loved the first episode !",
      "content": "I don't write many reviews I'm often tempted but don't get round to it. It might be because most of the time when i'm tempted it's because a series or a films is really really bad, so instead I decided to spend my time tying to find something that's good to watch. Now, I have only watched the first episode and normally I would want to watch a few more before making my mind up but I the case of \"This is us\" I feel compelled to comment on the pilot episode.I LOVED IT ! It was wonderfully written, cleverly written, well acted with a good cast. I felt for the main character, they werre interesting and I want to know what happens to them. I was going to go into details about the main characters but I don't wont to spoil anything for you, all I will say is watch the pilot episode I will add that this is not the type of programme I tend to watch \"family's struggling in the modern world\" the \"ups and downs of life\" but after one episode I cant recommend this series enough I just hope it continues in the same manner."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw4851955",
      "warningSpoilers": false,
      "date": "14 May 2019",
      "rate": "9",
      "helpful": "24 out of 34 found this helpful.",
      "title": "renewed for three more seasons",
      "content": "I just binge-watched the first season of \"This Is Us\". Basically, the show is about life and the human condition. The experiences that the protagonists have reflect the real world. The plot gravitates between funny and sad, threatening and soothing, but the show always has something to say. It's not the best show ever, but the people involved in the production deserve ample praise for participating. Good one."
    },
    {
      "username": "gelvisblue",
      "userUrl": "https://www.imdb.com/user/ur68003832",
      "reviewLink": "https://www.imdb.com/review/rw6515769",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "7",
      "helpful": "41 out of 55 found this helpful.",
      "title": "Season 5 - Crash and burn",
      "content": "Seasons 1-3 rank as one of my favourite TV experiences (10/10). An emotional roller coaster, immersive and brilliantly written and casted. Season 4 was good. What happened with season 5 (1/10)? I cannot believe how bad it is. Feel so let down. Like the last 12 months, a big pile of steaming...."
    },
    {
      "username": "faisal-15970",
      "userUrl": "https://www.imdb.com/user/ur69080765",
      "reviewLink": "https://www.imdb.com/review/rw4677647",
      "warningSpoilers": false,
      "date": "21 February 2019",
      "rate": "9",
      "helpful": "228 out of 251 found this helpful.",
      "title": "Heartvarming series",
      "content": "Think the World Will be a better place if most People would watch this show."
    },
    {
      "username": "liverbird28",
      "userUrl": "https://www.imdb.com/user/ur5965598",
      "reviewLink": "https://www.imdb.com/review/rw6846998",
      "warningSpoilers": false,
      "date": "24 April 2021",
      "rate": "7",
      "helpful": "18 out of 22 found this helpful.",
      "title": "Would have been a 10 if season 5 hadn't happened",
      "content": "We loved this show until season 5, during which it has deteriorated in almost every way. Episode 13 is the last straw. Kevin goes to see Randall and we have an hour of absolute boredom, where even the actors themselves seemed to have lost interest. I don't know how many episodes are planned for this season but we won't be watching any further. The character of Randall has sucked the life out of it and that's down to the writers, who, incidentally have also bombarded us with Covid-related scenes and dialogue to the point where escapism and enjoyment have gone out the window. So sad for the actors; it was delightful up to the end of season 4, and Jack is one of the most engaging characters ever."
    },
    {
      "username": "Ahmedfadil00",
      "userUrl": "https://www.imdb.com/user/ur106024418",
      "reviewLink": "https://www.imdb.com/review/rw7896923",
      "warningSpoilers": false,
      "date": "25 February 2022",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "my opinion",
      "content": "Now I have finished 3 and a half season of the series.. The first series in my life made me so affected. Every episode of the series makes me emotionally excited. Either I am sad and depressed, either I am happy and happy, or I am a fanatic. The series deserves 10 stars and more."
    },
    {
      "username": "enterprisingbeauty",
      "userUrl": "https://www.imdb.com/user/ur59747893",
      "reviewLink": "https://www.imdb.com/review/rw3554943",
      "warningSpoilers": false,
      "date": "2 October 2016",
      "rate": "10",
      "helpful": "74 out of 102 found this helpful.",
      "title": "Amazing Drama",
      "content": "Wow, what a come back for TV Drama. This is a multi layered, moving and totally relate-able show and so so entertaining. I am already so invested and have only watched two episodes. The leading cast are amazing with some of my all time favorites (looking at you Milo) and supporting cast seem more than adequate to keep up. The writers have their finger to pulse of what is really important to people today and throughout all of time... LOVE. It ticks so many boxes for me. I have been waiting for a show that I can safely watch with kids in the room, without soft porn, violence, bad language, and in general inappropriate story lines. This incredible show proves to be not too soppy, funny enough to break tension, loads of character diversity, Mandy Moore, I mean so many more reasons to fall in love with \"This Is Us\". That is all. Peace out"
    },
    {
      "username": "justin-fencsak",
      "userUrl": "https://www.imdb.com/user/ur18723110",
      "reviewLink": "https://www.imdb.com/review/rw4585193",
      "warningSpoilers": false,
      "date": "16 January 2019",
      "rate": "10",
      "helpful": "12 out of 17 found this helpful.",
      "title": "Prepare to cry....",
      "content": "A lot....which is why this show is popular among the young set of female viewers while their male counterpart parents and their wives watch NCIS and the kiddies watch Riverdale and Rosewell New Mexico and the sports fans watch sports. Mandy Moore shines as well as Milo Ventiligia and there's a lot of sadness and excitement. This show gained more exposure when it was shown after last year's Super Bowl and it has grown in leaps and bounds. This show has helped NBC become as popular as CBS and has trended on social media for awhile."
    },
    {
      "username": "kq999",
      "userUrl": "https://www.imdb.com/user/ur22509289",
      "reviewLink": "https://www.imdb.com/review/rw6232040",
      "warningSpoilers": false,
      "date": "3 November 2020",
      "rate": "1",
      "helpful": "62 out of 109 found this helpful.",
      "title": "WHAT ??? Happened ?",
      "content": "When I began watching this show way back at Episode 1 I thought it was one of the most brilliant series I have seen in a very long time. It was different, totally new in every way, tons of nostalgia, tugged at the heartstrings, got one's mind off the crazy world...I was so looking forward to this season. I started to watch and could not believe what I was seeing...I felt like I was watching the news. It was slow and boring, repetitive, too many scenes from old episodes and too much inserted into the episode of what is going on in the world today. Totally different from every other season. Possibly new writers? Bottom line...it is BAD.Great series usually begin to dwindle at a slow pace and then they just don't come back. BUT they leave one with a good impression...the original feelings one had for the show...for me, that is gone. I have never seen a series take a nosedive so quickly. They should stop now...their only chance of a save is if they make a 100% turnabout in the 2nd episode."
    },
    {
      "username": "tika90",
      "userUrl": "https://www.imdb.com/user/ur51695777",
      "reviewLink": "https://www.imdb.com/review/rw4679579",
      "warningSpoilers": false,
      "date": "22 February 2019",
      "rate": "10",
      "helpful": "15 out of 19 found this helpful.",
      "title": "Amazing.",
      "content": "This show is the best thing ever! On top of my list. Other TV series don't even compare... I was laughing and crying in almost every episode so far.. Story is amazing and cast is right on point! 💜"
    },
    {
      "username": "samhitapothuloori",
      "userUrl": "https://www.imdb.com/user/ur58022638",
      "reviewLink": "https://www.imdb.com/review/rw3551985",
      "warningSpoilers": false,
      "date": "27 September 2016",
      "rate": "10",
      "helpful": "134 out of 176 found this helpful.",
      "title": "Beautiful Series",
      "content": "STOP EVERYTHING YOU ARE DOING AND GO WATCH THIS SHOW. Beautiful, Simple and heart warming, this show is one emotional roller-coaster. I've been awed, shocked and surprised, crying and smiling to myself. Loving it.One of the best pilots i've seen in a while, giving me the best quote, \"There's no lemon so sour that you can't make something resembling lemonade.\" it's simply amazing. It's very rare to feel amazed and fall in love with the show just by watching it's pilot, this is one of them. Two episodes down so far and it has given two amazing and shocking ends, and i just can't wait how it will turn out. Trust me, Go watch it and you will not regret it. :)"
    },
    {
      "username": "mnilanjan",
      "userUrl": "https://www.imdb.com/user/ur79187379",
      "reviewLink": "https://www.imdb.com/review/rw6945346",
      "warningSpoilers": false,
      "date": "20 May 2021",
      "rate": "8",
      "helpful": "16 out of 21 found this helpful.",
      "title": "Season 5 drops off alarmingly",
      "content": "Season 5 is forced, contrived and Randall bores immensely."
    },
    {
      "username": "louisapeeza",
      "userUrl": "https://www.imdb.com/user/ur15907088",
      "reviewLink": "https://www.imdb.com/review/rw6427383",
      "warningSpoilers": false,
      "date": "31 December 2020",
      "rate": "5",
      "helpful": "43 out of 65 found this helpful.",
      "title": "Season five what happened !??",
      "content": "One of my favourite shows but season five so far is a big disappointment!Writing our current 2020 issues is not what I want to see in a show i use to escape these issues .Seems more about politics and Covid than anything else. Please don't go down this route because i really don't want to loose my favourite show.We have the news for that !!"
    }
  ],
  "errorMessage": ""
}