{
  "imDbId": "tt3230854",
  "title": "The Expanse",
  "fullTitle": "The Expanse (TV Series 2015–2022)",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3564280",
      "warningSpoilers": false,
      "date": "18 October 2016",
      "rate": "9",
      "helpful": "1,062 out of 1,158 found this helpful.",
      "title": "Ambitious, complex sci-fi/mystery thriller; offers great world-building and perfectly paced storytelling",
      "content": "Wow: This was by far the biggest surprise for me in 2016. And apparently, I was somewhat late to the party, as the show already began to air in 2015. I'm an avid sci-fi fan, but I hadn't heard or read anything about 'The Expanse', and yet it's one of the most ambitious sci-fi (or generally high profile/concept TV) shows I've come across in recent years. First, I believe a little (spoiler-free) information might be helpful prior to watching the show, because the viewer is thrown right into an incredibly detailed world where much is shown rather than explained (which is certainly an elegant choice in terms of storytelling and world-building, but there's so much going on and every shot is packed with so much visual information that it can be a little confusing during the first 2 or 3 episodes). So what you need to know is this: A couple of hundred years into the future, humanity is spread out throughout the solar system and divided into 3 opposing forces who are on the brink of an all out war for political power and resources (mainly water - which is harvested in the form of asteroid ice). The 3 fractions consist of the two superpowers Earth (governed by the U.N.) and Mars; the third party are the \"belters\", which is basically everyone unfortunate enough to be living on poor dwarf planets like Ceres or other large rocks in the asteroid belt (hence the name \"belters\").Those belters are the future equivalent of the 3rd World population, as they represent the poor, exploited and underdeveloped colonies in the solar system. Many belters feel represented by the \"Outer Planets Alliance\" (short: O.P.A.) which is a radical group demanding more autonomy and fairer distribution of resources for the inhabitants of the asteroid belt, but is viewed as a terrorist group by Earth and Mars. Belters are badly affected by the harsh conditions in low (or even zero) gravity (which is often referred to as \"low-G\" or \"zero-G\"), as well as low oxygen levels and the strict rationing of water; their bodies develop less muscles and their bone structure has less density compared to that of humans born and raised on Earth or Mars. The belters' life expectancy is roughly half of that of humans living on Earth.So that's the backdrop to the story told in 'The Expanse', and it all may seem a little complicated at the start, because the plot unfolds through several separate story lines. The key parts of the story are told through the eyes of three different protagonists: a high ranking U.N. official on Earth named Avasarala (played by Shohreh Aghdashloo); a cynical belter police detective named Miller (Thomas Jane) whose story starts on Ceres; and a young executive officer named Holden (Steven Strait) working on an ice freighter in space. Although those three don't know it (yet), their stories are connected - and that's all I'm gonna say about the plot, because this show deserves to be watched unspoiled.Featuring visual and narrative elements that reminded me of almost every sci-fi film I ever loved - 'Alien', 'Outland', 'Serenity', 'Blade Runner' and many more - this is an R-rated space opera no sci-fi fan should miss. And although it probably can't compete with 175 million costing blockbusters like the new 'Star Trek' movies in terms of visual effects, 'The Expanse' looks fantastic. Given the insane amount of effects work involved, it must have been a very expensive affair for SyFy (who ordered the series from production companies Alcon Television and The Sean Daniel Company), and although I doubt they were able to afford the kind of budget HBO usually spends on shows like 'Game of Thrones' or 'Westworld', in terms of scope and complexity, this new SyFy show easily matches HBO's flagships (it appears Syfy is trying to get rid of its reputation as \"shlock-channel\").The storytelling is meticulous and perfectly paced; the world-building richly detailed and always credible, and the patient viewer who doesn't demand everything be explained within the first episodes is rewarded with a thrilling, mysterious tale of adventure and discovery. The cast is terrific (especially Thomas Jane who seems to fit his character like a glove) and the writing manages the astounding feat to elegantly lead us through a very complex world and complicated story without ever feeling forced or weighed down by expository dialogue. Showrunners/writers Mark Fergus and Hawk Ostby (known for their Oscar nominated work on the screenplay for 'Children of Men') really have done a fine job bringing the series of novels by James S. A. Corey (aka Daniel Abraham and Ty Franck) to life. Highly recommended to every sci- fi fan: 9 stars out of 10.Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8576888",
      "warningSpoilers": false,
      "date": "30 September 2022",
      "rate": "9",
      "helpful": "54 out of 58 found this helpful.",
      "title": "Great Sci-fi Series!",
      "content": "The Expanse is a sci-fi series that takes place hundreds of years in the future where humanity has colonized the solar system and where Mars has become an independent military power. Tensions between Earth and Mars have put them at the brink of war. It follows a space ship and it's crew as the race through the solar system exposing one of the greatest conspiracy theories in human history. I never watched this show while it was on cable but finally started watching it once Amazon Prime Video picked it up. I just heard so many great things about it and how it was one the best sci-fi shows ever created. I'm glad I finally gave in and watched it because I couldn't agree more...this is one of the better sci-fi shows I've ever seen! I'm so glad Amazon picked it up and continued the show. It got even better at Amazon because they gave them a bigger budget. It just finished the last season and ended on a great note. People are talking about a follow up movie so maybe there's still more to come. We can only hope!"
    },
    {
      "username": "mhorg2018",
      "userUrl": "https://www.imdb.com/user/ur22761455",
      "reviewLink": "https://www.imdb.com/review/rw3639832",
      "warningSpoilers": false,
      "date": "14 February 2017",
      "rate": "9",
      "helpful": "168 out of 201 found this helpful.",
      "title": "Best thing on SyFy since Battlestar Galactica",
      "content": "Damn. If the Syfy (I hate that abbreviation) Channel would show more stuff like this and less from The Asylum, I'd watch it more. This is simply great SF. The physics of space travel are as realistic as can be. The characters, from Miller the beat up Belter Cop, to Amos the Earther, to Holden the righteous captain by default and the places, Ceres, Tycho, Earth and Mars are all well defined and believable. The sfx is brilliant and the ship designs look like they've evolved from what we use today. The situations, different governments vying for power, resources and land, are all excellently done. A really great adaptation of a really great book series. This should be watched by anyone who even claims to be a sf fan."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw6370267",
      "warningSpoilers": false,
      "date": "16 December 2020",
      "rate": "9",
      "helpful": "139 out of 166 found this helpful.",
      "title": "One of the better sci-fi shows I've seen in a while!",
      "content": "It's hard to even describe how good of a show The Expanse is, especially if you're a sci-fi fan. All you have to do is read through the reviews to see how loved this series is. I don't know anyone who's seen it who doesn't like it. It has an 8.6 rating for a reason. It's so good that I definitely plan on watching it a second time through in the near future. The series just ended after season 6 and even though it had a conclusion to the story and didn't end on some cliffhanger, it still is open ended enough to have another season or movie on the future. If you haven't seen this incredible series yet then do yourself a favor and go watch it immediately. I'm warning you now though to give yourself enough time because you're going to want to binge it as fast as you can."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw4953700",
      "warningSpoilers": false,
      "date": "23 June 2019",
      "rate": "9",
      "helpful": "77 out of 97 found this helpful.",
      "title": "Enthralling series: intelligent, intriguing and action-packed",
      "content": "Enthralling series: intelligent, intriguing and action-packed. 9/10(Updated after Season 6).Hundreds of years into the future, Earth has colonised Mars but Mars is now independent, and the two planets are in a constant state of distrust and unease. Caught between these two are the people of the asteroid belt and outer planets. James Holden, the executive officer of a freighter witnesses his ship, being destroyed by what appears to be a Martian warship. This heightens the tensions between Earth and Mars and sets Holden and his remaining crew on a quest across the galaxy to find the truth behind the incident. Meanwhile, on Ceres in the Asteroid Belt, a police detective is searching for the daughter of the wealthiest man in the galaxy. These are all parts of a conspiracy that that will threaten life in the Solar System.Brilliant. I am not a huge fan of sci fi series (Firefly was the notable exception): they tend to rely too much on gimmicky inventions and faux science, at the expense of plot. The Expanse is different: the science and future history are incredibly believable. I'm no physicist but I found it difficult to fault the physics and technology involved. More than that, the futuristic nature of the series provides the background, not the story, so the series does not rely on it.What the series does rely is plot, and it is a great one. Starts out pretty slowly, so doesn't immediately pull you in, but after three episodes or so it is off to the races. The seemingly-parallel stories start to intersect, things start to make more sense (though, thankfully, not so much that the mystery disappears), the characters become more interesting and the action ramps up.The story is then intelligently developed over the following seasons. Despite the many twists and turns, the plot remains solid, with no twists for twists sake and everything fits together very well. Even when one mystery is solved, another emerges to take its place, without feeling gratuitous.Quite grittily told too: no characters are unexpendable, making the plot quite unpredictable.Superb special effects and action scenes. The CGI is absolutely seamless and realistic, without being too ostentatious. Like the science, the CGI is the medium, not the message.Performances are where the series does feel a bit lacking. The main characters - the crew of the Rocinante - are reasonably well played, though there are no stand-out performances. Some of the lesser characters are quite badly played though, with the worst culprits being Shohreh Aghdashloo as Chrisjen Avasarala and Shawn Doyle as Sadavir Enright. Any scene they were in made me cringe, with Aghdashloo being particularly irritating. She wasn't helped by her character being pretty badly drawn, with the worst dialogue and most grating mannerisms of any character in the series. The two factors - the character and her performance - just compounded each other.The lack of character depth is a general weakness in the show too. The series is about the intrigue and action, much more than the people and their relationships, making character engagement less than complete (unlike Firefly, which was highly engaging because of the characters and their interactions).This is a minor flaw though, as the plot and its roller-coaster momentum propel the show.Amazingly, after five seasons, the series managed to get better. Most shows would be running out of ideas at that point but The Expanse managed to stay fresh and innovative. Season 5 is actually the best season of the lot, which says a lot. The show moves from our heroes vs weird science to a good old fashioned good guys vs bad guys war.After the brilliance of S5 I was expecting great things from Season 6. Everything was set up for a great, climactic finale. While it isn't bad, S6 feels padded and unfocussed, like the writers didn't know to end it and/or didn't have enough material for a complete season.Best evidence of this is the girl with dead bird sub-plot that takes up the first 5-10 minutes of every episode. This was totally pointless and was just there to take up space.Even when things get wrapped up it's sometimes in clumsy fashion: tight situations that get resolved by some out-of-the-blue force or a technology that nobody knew existed before. Between the slow, meaningless girl with dead bird sub-plot and the action scenes that sometimes get resolved in quick, out-of-the-blue fashion, the pacing is jarring in its inconsistency. The writing in S6 is definitely looser than the rest of the series making S6 the weakest of all the seasons.Season ratings: S1-4 9/10, S5 10/10, S6 7/10."
    },
    {
      "username": "philnoone21",
      "userUrl": "https://www.imdb.com/user/ur41501897",
      "reviewLink": "https://www.imdb.com/review/rw4176029",
      "warningSpoilers": false,
      "date": "24 May 2018",
      "rate": "10",
      "helpful": "963 out of 1,067 found this helpful.",
      "title": "Get past the first season to see its grandour",
      "content": "A few of the one-star reviews here say they gave up after 2 episodes, Dull acting, silly plot etc etc. Well, I did give up too. I concurred, and thought it was hopeless.Damn, though, my niece, son and a friend said it was the best TV series they had seen. Respecting their views based on previous recommendations, I persevered out of respect only, and recommenced watching the series with great reluctance and bemusement that they could be so misinformed.At some point, and certainly into Season 2 I became aware that I was watching the best TV series I had seen. Firefly used to be may fav, but this has swept past. The architecture is spectacular and importantly grounded. Not the fantasy (apologies to fans) that is served up in Star Wars but a grounded realism that hooks one to the possibility.It's just awesome, truely, I'm mesmerised.What ever you do, stick with it to Season 2 and I promise you wont be disappointed. If you are, then my profuse apologies for making a promise that I thought could not possibly be compromised."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw7782450",
      "warningSpoilers": false,
      "date": "20 January 2022",
      "rate": "9",
      "helpful": "70 out of 89 found this helpful.",
      "title": "real sci-fi",
      "content": "It's the 23rd century. The U. N. controls Earth. Mars is the main military rival. Independent miners called Belters operating in the asteroid belt are squeezing out a living from scarce resources. There is rising tension among these three different civilizations. On Ceres Station, detective Miller is given an off-the-books search for missing heiress Julie Mao. She's the sole survivor of a strange incident on the spaceship Scopuli. James Holden, Alex Kamal, Naomi Nagata, and Amos Burton are part of the crew of the Canterbury. They answer a distress call from Scopuli. UN Deputy Undersecretary Chrisjen Avasarala and Sadavir Errinwright are powerful earth politicians. The various players uncover a solar system wide conspiracy chasing an ancient alien secret.This is a Syfy series. After three seasons, the show was cancelled and Amazon picked it up for another three seasons. It finishes with six seasons and sixty two episodes. It's a compelling futurist epic. It has great characters. I love the addition of Bobbi in season 2. The standout of this series from other TV shows is its realistic physics. Sure this has some fantasy givens like the alien tech and super efficient rocket engines but the physics are generally real and they almost always surprise me. Like I've never considered having a wound in 0G. This is a show for that along with its great characters and story."
    },
    {
      "username": "ssvfolder-1",
      "userUrl": "https://www.imdb.com/user/ur18073308",
      "reviewLink": "https://www.imdb.com/review/rw8588160",
      "warningSpoilers": false,
      "date": "4 October 2022",
      "rate": "8",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Smart and captivating",
      "content": "Why do a good sci-fi shows usually run for a very long time? Probably because it's mostly made by the fans and for the fans. Without too much interruptions from the execs who think they know better. It's well known what happened to the once largest sci-fi franchise, Star Wars, when the big corporation got a hold oof it. Glad it's not that common occurence as this niche is largely in the hands who know what the fans like.Let me begin by saying that this show (and the books it is based on) is smart. Great plot, though a bit too slow in my opinion. Greatly written characters and a very nice visuals.That being said,the execution could be better, but I believe the creators had done the maximum with the cards they were dealt. Aside from Star wars actors and to some degree Star Treck, there were almost no A-listers ever in the sci -fi shows. I really loved the portrayal by Thomas Jane and John Chatham in all of the seasons, as they clearly stood out. The rest are either too emotional or too odd (for the lack of a better phrase).This show is a gem. Absolutely advised for all sci-fi lovers out there."
    },
    {
      "username": "abisio",
      "userUrl": "https://www.imdb.com/user/ur0879559",
      "reviewLink": "https://www.imdb.com/review/rw5519147",
      "warningSpoilers": false,
      "date": "1 March 2020",
      "rate": "10",
      "helpful": "58 out of 75 found this helpful.",
      "title": "Perhaps the best series I see in my life",
      "content": "The first two seasons of THE EXPANSE had very interesting and deep conflicts; incredibly absorbing characters. Pace and tension was so perfect is unbelievable the writers were able to keep 26 chapters without slowing down. Even the productions values were very high. Third season starting some slowdown particularly in the last few episodes but nothing too bad. Season 4 however is perhaps the slower and dissociated one. Some political and crime stories matter very little compared with the Rocinante and their crew adventures; but still after chapter 4 things become more interesting and tense. The Expanse has been able to get interesting secondary characters integrated into the main action. Sadly some emotive moments are not necessary but I assume is to make characters more human.In any case; not even Game of Thrones keep my interest that high and could not wait to reach the end so desperately"
    },
    {
      "username": "rsvp321",
      "userUrl": "https://www.imdb.com/user/ur12800375",
      "reviewLink": "https://www.imdb.com/review/rw7733008",
      "warningSpoilers": false,
      "date": "8 January 2022",
      "rate": "",
      "helpful": "15 out of 17 found this helpful.",
      "title": "Oh, my!",
      "content": "I've just finished reading the series book finale, \"Leviathan Falls\", and there is no way that the series closure can be completed with only one episode remaining as I write this.I do, however, see a path to satisfy the viewing audience, until hopefully another network picks this up for future episodes...If my fellow Expanse fans are left with a hunger for more, I suggest the books for a story ten times larger than what its video budget restraints left out."
    },
    {
      "username": "paul_haakonsen",
      "userUrl": "https://www.imdb.com/user/ur22654354",
      "reviewLink": "https://www.imdb.com/review/rw3692363",
      "warningSpoilers": false,
      "date": "24 April 2017",
      "rate": "8",
      "helpful": "66 out of 89 found this helpful.",
      "title": "A show out of this world - literally...",
      "content": "When I found \"The Expanse\" it was already at the end of the first season, and I had not heard about it prior to finding it. Nor did I know that the series was based on books, which apparently are driven more by the characters, as to what is seen in the series.Regardless, I sat down to watch \"The Expanse\", although my sci-fi needs are usually met by \"Star Wars\" and \"Star Wars\" alone. So I was more than genuinely and positively surprised with how exciting, thrilling and entertaining this series turned out to be.The story in \"The Expanse\" was interesting and compelling. It was a story that quickly found root in the audience and stayed fresh and interesting throughout the entire first season. And I have been told that it kicks up a notch in season two. Which is impressive, because I was really impressed with the first season.And they had cast some really great names for the various roles, and I was more than impressed with Thomas Jane in the lead role, because he really carried the character quite well. Just took a while to get accustomed to his hair.\"The Expanse\" is heavily laden with special effects, and the special effects team really pull off the effects quite nicely, which really adds a great flavor to the series. And as a sci-fi series, then having believable and convincing CGI effects is a make-or-break deal.The entire series is taking place in our own solar system, which is interesting, because it is easier to relate to it, since it is so close to home - relatively speaking, of course. And the entire atmosphere is good and makes for a vibrant universe.And it is a great way that the different story lines are interwoven and connect to each other in different ways. There are times when you think \"what is going on here?\" only to find enlightenment at a later point in the episode or a later episode. And that way of connecting everything together is great.I am definitely looking forward to starting on season 2 and believe that this is a series that I will follow to the very end. It is a great sci-fi show, and if you are not already familiar with this series, and you like sci-fi, then get into gear and start watching."
    },
    {
      "username": "XweAponX",
      "userUrl": "https://www.imdb.com/user/ur2366174",
      "reviewLink": "https://www.imdb.com/review/rw5016300",
      "warningSpoilers": false,
      "date": "24 July 2019",
      "rate": "10",
      "helpful": "62 out of 83 found this helpful.",
      "title": "Can't believe this was Syfy Channel",
      "content": "And, in true Syfy form, of course they cancelled the series right in the middle of an important season apparently - If I understand the trivia section correctly. Thankfully Amazon took over and did a fourth season, maybe they will do more- that would be great.The most impressive actress in this show has been Shohreh Aghdashloo, who I first saw in X-Men 3. She always had little cameos in these films, but in this show, gee character drives a lot of the motivation and direction of the series. She does not really participate in the final season 3 episodes, not being trapped in the ring with everyone else, but her fingerprints are all over the politics that brought Earthers, Martians and Belters to a common table.This show reminds me of Larry Niven's \"Belter\" stories, and his known space series of books which goes all the way back to stories of Gil \"The Arm\", who was a Belter who moved to earth and became a police officer for the \"amalgamation of regional militia\" aka ARM, Beowulf Schaeffer who had a relationship with puppeteers and flew a couple of their different general products ships, one of them into the center of the galaxy discovering that it had exploded. another to an antimatter planet (and apparently GP Hulls cannot tolerate Anti-Matter)- and his possible son Louis Wu via his GF Tanya Wu (See the book \"Flatlander\" by Niven) aka \"Luweewu\" who flew to the Ringworld and was last seen hanging out with the former \"Hindmost\" of the Puppeteers after saving the Ringworld from destruction, Protectors (3rd stage humans who become too smart and only are interested in preserving their own bloodline, so they always fight each other, killing everybody else in the process) and an ARM navy that was stupidly fighting each other with antimatter weapons around the orbit of the Ringworld.But that is a huge universe created by a different author. This series of books and this show based upon those books, is restricted to our own solar system and the governments of Earth Mars and the Belt which does not really have a government.And so we see a lot of things that also exist in the Larry Niven Known Space universe: including the mining of asteroids in the belt, or minerals and water, and the idea of Terra-forming Mars. Even the \"Belter Haircuts\" and tattoos of Niven's work are here. Ships landing on earth use compressed air like they do in Niven's book \"World of Ptavvs\", rather than using rockets. In the belt, the \"Epstein Drive\" is used rather than Niven's Fusion Drives. But there is still a lot of material borrowed from Niven's known space. But that's not a bad thing.But one thing that is different about this universe is that so far, The descendants of mankind who have populated the solar system have not really encountered any possible alien life-until now.And the concept of life that is thought up in this show is very different- in fact in 2 1/2 seasons, I still can't figure out the nature of that life form.Thomas Jane is a Ceres cop, who is given the job of locating the daughter of a rich industrialist, Julie Mao (Father named Jules)- she is the centerpiece of the series for the first season and a half or so- even though she doesn't really appear or interact with any of the other characters other than in flashback sequences. In fact the entire first season is a search for her among other things. Thomas Jane is Joe Miller, the Ceres Cop, and has made finding her his obsession because maybe it's the one good thing that he's ever done and he becomes so absorbed in finding her it causes problems with some of the other people in this series.Also there are quite a bit of politics in the show, sometimes directly relating to our own politics of this day, and a lot of this is extremely relevant.We also have four people, Jim Holden, Alex Kamal, Naomi Nagata and Amos Burton, who through no fault of their own become the crew of a ship that they have named The Rocinante, they were all crew members a board a ship called The Canterbury, sent out on a rescue operation which also just so happened to involve Julie Mao...And they become an important part of the story as well eventually Joe Miller gravitates toward them - and so does every other problem in the solar system it would seem.Later, other crew members include a gunnery sergeant from Mars and a botanist from Ganymede- and maybe even his daughter, which she lost track of during a catastrophe on Ganymede.I'm not sure if this show is going to continue into a fifth season, but if they can make a fifth season as interesting as the first three that I have seen, then I will definitely watch it.There are a lot of actors that I don't recognize except for Tom Jane who was The Punisher, he is a little older now but he still looks great even with the beard, and Florence Faivre who was a very nasty piece of work Kree soldier in Agents of SHIELD, she's the one that had those two floating balls that killed people, eventually killed off by Quake in a most satisfying way...Sometimes there are stupid decisions and arguments in some of these episodes which make me want to strangle the characters when I see it, but so far I like how things have worked out tween them, the crew of the \"Roci\" are friends, and this show depicts a very realistic friendship between these people. The small conflicts between each of them at the beginning of the show shows how people from all kinds of backgrounds could become good friends under the right circumstances.There are all kinds of other things going on, on earth, on Mars, On Ships various places in the solar system, and especially at a base called Tycho where the Mormons are building an incredibly huge ship called The Navoo... that is just another problem."
    },
    {
      "username": "RussHog",
      "userUrl": "https://www.imdb.com/user/ur41031967",
      "reviewLink": "https://www.imdb.com/review/rw6484656",
      "warningSpoilers": false,
      "date": "16 January 2021",
      "rate": "9",
      "helpful": "38 out of 49 found this helpful.",
      "title": "Love this show - sorry I took so long to find!",
      "content": "I am about halfway through season 2 and I'm so glad that I have so much more of this show to watch. The first season started a little slow but it was always interesting and this second season is on fire. It's very suspenseful and well acted and the universe is very believable. It's not really a great acting ensemble but there are some good performances all throughout. The plot is kind of confusing but it's not so confusing you cannot enjoy the show or get too lost. This is much better than most other shows on TV."
    },
    {
      "username": "jeffrey-46",
      "userUrl": "https://www.imdb.com/user/ur1012530",
      "reviewLink": "https://www.imdb.com/review/rw4116185",
      "warningSpoilers": false,
      "date": "4 April 2018",
      "rate": "9",
      "helpful": "390 out of 485 found this helpful.",
      "title": "Best \"hard\" sci fi I've seen since Battlestar Galactica",
      "content": "OMG I love this show. I've seen up through S02E03 on Amazon Prime.I only gave it a 9 because I don't like to give anything a 10.Others have gone into good detail of what is good about this show so I'll just add some bullet points that I didn't see covered (although with 250+ reviews I probably just missed 'em)In no particular order other than stream-of-consciousness:* Detailed, realistic science fiction * Space behaves like, well, space * Gravity. They did a stellar job with gravity. It isn't perfect. But they emphasize realistic ways to simulate gravity (ships under continuous acceleration, spinning, ring-shaped space stations). And they shut gravity off when appropriate. * Space ship battles are incredibly thoughtfully designed, with an eye for small details. They pump the air out of the ship before a battle, for goodness' sake. I can't think of *any* other scifi space show that goes into these details * Consistency. Characters act consistently. Environments act consistently. * Details. So many details! Mag boots. Ship maneuvers. technology such as computer/handheld devices. All so believable. * Mormons! There are mormons, because, of course there are. And they aren't even the bad guys! (I only state it this way because too often, mysterious religious groups are used as hollywood shorthand for \"bad guys\"). The presence of Mormons just enriches the worldbuilding. * I love the fact that Eros station just looks like a giant potato with a porthole on its butt. It isn't polished. It isn't flashy. It's grimy and utilitarian. * I love that every move made by a spaceship has corresponding thrusters pushing it in that direction. The space ships do not fly like fighter jets, like they do in other typical sci fi shows. They fly like rocks. * I love the fact that space craft tracking screens look like legitimate space object tracking screens, with curved, mathematically drawn projected trajectories.I can't gush enough about the \"hard\" sci-fi elements. I haven't even gushed about the production yet:* Story is detailed, in-depth, and engaging. It's basically a political/war drama, but it is very well written. * Acting is great. Seriously. Even the throwaway characters are great. * Anyone can die at any time. Very Game-of-Thrones-y in this regard, in a good way. Builds tension very realistically. * Costumes, sets, graphics, cinematography are all excellentStar Trek. I used to like Star Trek. Have you seen Star Trek Beyond (2016) though? That was terrible. Everything that is done wrong in Star Trek Beyond is done correctly in The Expanse. In fact, I'm not sure I can watch any Star Trek show or movie again after The Expanse.Ultimately The Expanse feels like a combination of Battlestar Galactica (2005 one) and Firefly, more than any other series I can think of."
    },
    {
      "username": "rsvp321",
      "userUrl": "https://www.imdb.com/user/ur12800375",
      "reviewLink": "https://www.imdb.com/review/rw4163004",
      "warningSpoilers": false,
      "date": "12 May 2018",
      "rate": "",
      "helpful": "209 out of 303 found this helpful.",
      "title": "Agenda driven industry and dumbed down audience are destroying entertainment.",
      "content": "Gobsmacked at the news that this show has been cancelled after only three seasons!Currently, if a series doesn't have social messages central to every plot, they won't be supported, and abandoned.With imbecilic agenda shows like Arrow/Flash/Legends/Supergirl continuing to survive in an era where the wrong people are making these propaganda decisions, it's obvious that there won't be much chance for another high caliber show as this one to make an appearance any time soon.***For fans of The Expanse, fortunately, there's an option. There are a stack of books available to continue the saga! (Unfortunately, it will upset you even more when you see how awesome future seasons of this series was going to be, once you read where the incredible story was taking us!) They are all also in audible book form. No CGI can duplicate your imagination."
    },
    {
      "username": "wandernn1-81-683274",
      "userUrl": "https://www.imdb.com/user/ur26578226",
      "reviewLink": "https://www.imdb.com/review/rw5903297",
      "warningSpoilers": false,
      "date": "12 July 2020",
      "rate": "8",
      "helpful": "47 out of 63 found this helpful.",
      "title": "Amazing World Created Here By James Corey",
      "content": "So the first watchthru of this show I didn't review it at all. 2nd Watchthru we'll see how it goes. I know I did love the first 2 seasons!!!Season 1The first 2 episodes, fantastic, then a good 3rd, ep4 the bridge escape through a hail of fire was very lame, they all should have died right there. Some of the later episodes, not perfect, but all in all a good season. Amazing world created here. Nothing at all wrapped up at the end of the season. So there's a lot left for a second season! 8/10Season 2This season picks up strong where season 1 left off as the crew follows the Protomolecule and tries to stop the war between Earth and Mars from happening. It really peaks at Episode 5. And after that the series sputters a bit. More and more illogical decisions and just blind luck that doesn't result in certain death and really certain death for everyone involved on both planets. And really the last 3 or 4 episodes were just really average or not good. Hopefully Season 3 can get stronger and breathe some new life into the story. Season 2 ends with a 7/10Season 3The story does really pick up again especially toward the end of the season where the Protomolecule which is now 'The Ring' becomes a new major force in the Universe. Great performances by David Straithairn and other actors we know and love such as Elizabeth Mitchell, Chris Owens, and a return appearance by Thomas Jane add to the mix. Another solid season. 8/10Season 4Straithairn and T. Jane return in limited roles as Holden and team deal with the fallout from the 'Ring' opening up 1300 new possible life supporting worlds. The Belters and the Inners continue their conflicts and disagreements. Thank you David Straithairn for being a part of this amazing show. 8/10"
    },
    {
      "username": "Kajohns49",
      "userUrl": "https://www.imdb.com/user/ur49804652",
      "reviewLink": "https://www.imdb.com/review/rw5322576",
      "warningSpoilers": false,
      "date": "15 December 2019",
      "rate": "9",
      "helpful": "102 out of 129 found this helpful.",
      "title": "Season 4",
      "content": "When I heard that SyFy was cancelling the series after 3 seasons I was very surprised. Since the beginning this show has had an excellent story, interesting world building, a great cast and good production values. I thought it was one of the better series on TV, not just science fiction but including all genres. I was gratified to find out that Amazon picked this up and was eagerly awaiting its release. Well, I just finished season 4 and am pleased to announce that the high quality series has returned! My only regret is that for some reason I thought this season was 13 episodes instead of 10 and I wasn't willing for this to be over. I have never read the book(s?) this is based on so that has nothing to do with my review. I will only say that to anyone discovering this series for the first time I envy you! When I saw S4 E10 I got a little sad that it was over. Season 5 looks like it will be fantastic as well!"
    },
    {
      "username": "m-burakyuksel-564-438070",
      "userUrl": "https://www.imdb.com/user/ur38944365",
      "reviewLink": "https://www.imdb.com/review/rw7860300",
      "warningSpoilers": false,
      "date": "12 February 2022",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Thank you to everyone who played and took part in this drama.",
      "content": "When I watched the first episode of the 1st season of the series, I said, \"Finally, I'm watching realistic science fiction.\" I watched the series until the final episode without missing a single episode. When the last episode was over, there was an emptiness inside me. Because I knew that a production of this quality would not come for a long time, a void arose inside me. I will really miss this serial."
    },
    {
      "username": "MiketheWhistle",
      "userUrl": "https://www.imdb.com/user/ur10115739",
      "reviewLink": "https://www.imdb.com/review/rw4168890",
      "warningSpoilers": false,
      "date": "18 May 2018",
      "rate": "10",
      "helpful": "38 out of 51 found this helpful.",
      "title": "Truly exceptional program - and I love Bobby the \"Martian Tank\"",
      "content": "I'm a big sci-fi fan and so my bar is fairly low, but this show raises the bar especially in seasons 2 and 3.There is action,great actor chemistry,great one-liners with unexpected actions,a good plot that doesn't seem like a repetitive drive,and relatable characters. I also have to say that I love Bobby the \"Martian Tank\".She has great wit,is attractive,and absolutely does Marines proud having served as a corpsman with Marines myself. Whether it gets renewed for a fourth season or not, time will tell, but I hope that SyFy keeps it going and with the characters and writers. (written before the Season 2 finale)."
    },
    {
      "username": "kevin-carruthers",
      "userUrl": "https://www.imdb.com/user/ur57698013",
      "reviewLink": "https://www.imdb.com/review/rw8582211",
      "warningSpoilers": false,
      "date": "2 October 2022",
      "rate": "8",
      "helpful": "16 out of 16 found this helpful.",
      "title": "Good show, but not as good as the books.",
      "content": "The books were amazing and the show does its best to recreate them. That being said, if you are going in hoping for an exact retelling of the books, you are going to be upset. The show is good and I think I would have liked it more if I had not read the books first.The main character casting is 10/10. I thought they brought the book characters right off the pages and Thomas Jane as Miller was the best in my opinion. But there are alot of story that is left out and was extremely dissapointing. There are also some major changes to characters and characters not from the books in major roles that felt unnecessary.Overall, it is still a solid show, I just wish they could have stayed closer to the books and made the show into more seasons. Definitely worth a watch if you like space and Sci-fi."
    },
    {
      "username": "Reviewer746",
      "userUrl": "https://www.imdb.com/user/ur30030184",
      "reviewLink": "https://www.imdb.com/review/rw7755498",
      "warningSpoilers": true,
      "date": "14 January 2022",
      "rate": "9",
      "helpful": "29 out of 36 found this helpful.",
      "title": "Wait... where's the rest?",
      "content": "That was not an ending. At best, that was a teaser for future content. At worst, that was a brilliant show getting axed right in the middle of its story.This is just surreal. How can a show with such excellent writing end like this? The pacing has been impeccable from s1e1 all the way through s6e5. They weren't even rushing the last season with a budget of 6 episodes. They pushed all of the rushing into that very last episode - \"oh s-, guys, we only have one episode left, we gotta tie this all together quick!\"It's not like Amazon axed them out of the blue mid-season (although it sure feels that way), they had plenty of warning, plenty of time to plan. Maybe they obstinately kept running the show as they would have right up to the finale and then just threw everything in there at the end as a coded message to the fans? Can't blame me for dreaming.Shall we count all the plot threads that they didn't even attempt to conclude?What will the Laconians do with that mysterious, potentially physics-defying, game-changing protomolecule ship? Maybe they'll use it in the final epic battle between Marco and the Roci. Maybe they'll use it to take over the ring space and start an interstellar empire. Maybe they'll... just look up at it wistfully for several episodes without using it for anything...What happens with the ominous red ring entities? Is Holden and co. Going to figure out a way to use them against the Laconian protoship? Are they going to wake up and threaten all of humanity like Holden has been warning everyone about since season 3? Are they going to be used to... just kill Marco in a really lame and anticlimactic way? These things ended up being the Night King of the Expanse universe.What about the dog aliens that revive dead children with their protomolecule magic? That must have been important, right, because they spent an entire episode's worth of time on that subplot. No? Not going to do anything with that one either? Fine, just end it right at the climax just before we get some hint of what's going on. The whole subplot is just a collection of timewasting, meaningless scenes.What about Prax' new yeast strain designed to increase crop yields? Does that help the Earth in any way? For that matter, what happens with Earth? Does the nuclear winter just get worse and everyone dies? Does it get better and everyone's fine? Maybe Prax just saved the Earth, or maybe the biosphere is permanently damaged and people will have to migrate to the ring worlds. Guess we'll never know.What happens on Mars? Does everyone leave for the ring worlds? Do some remain behind as the planet turns into something more like the Belt? We'll never know.What happens on Ceres? When the allied fleet left, I guess they all just starved to death.And the plot threads they did try to tie up aren't concluded very well.They did Marco dirty. They built up an epic battle between Marco and the Roci for three seasons and then he just gets merc'd by mysterious forces totally beyond his control and understanding. His final epic battle, if you can even call it that, is literally getting side-swipped by a minor character whose name I don't remember. Drummer taking Marco out would have been more satisfying than what we got, but no, she just casually loses, her whole fleet is destroyed in 5 seconds and contributes next to nothing to the battle, and Drummer gets to look like a tactical incompetent in the finale.That battle between Marco and the Roci that they, for reasons that will forever be mysterious to me, decided to randomly insert into s6e3 should have taken place during the massive finale battle. If they needed to remove Filip from the ship beforehand, then they could have removed him beforehand. That battle is how Marco should have gone out, it's how his character deserved to go out. Instead, he gets beaten by the Roci not once but twice. He's just a big loser.And another thing: Holden doesn't want to be the one to kill Naomi's son but then... he ends up killing him anyway (as far as anyone knows). In fact, he had more plausible deniability in the first encounter with the Pella because it was Bobby who launched the torpedo whereas in the second encounter it's Holden who suggests overloading the cargo ship's reactor. Naomi has a flashback to holding her son as an infant but aside from that she ends up being a-OK with the whole thing so what was the point in sparing Marco in the first battle!?The ultimate battle between the Free Navy and the combined fleets of Earth, Mars, and Drummer's faction happens OFF SCREEN!? Are you KIDDING ME? This is like if Peter Jackson skipped the battle of Minas Tirith and wrote it so that Gandalf just tells the gang that a few orcs made it back to Mordor. When they were talking about blowing their whole CGI budget on this last episode were they referring to the unintelligible pod confetti in the rail gun skirmish? This series has given us the most epic space battles I've ever seen and they just nope'd out of the pièce de résistance. Unreal.Immediately after the rail gun skirmish, in which faceless extras are the only casualties, there is a highly discontinuous cut to a round table meeting where the factions are meant to conclude a peace. This absurdly rushed cut was the first hint that they weren't even going to attempt to tie up the Laconia subplots. This meeting scene is also very cringe in its own right. Why is the administrator of Ceres, who sided with Marco and mocked Drummer as a pet of the Inners even after Marco abandoned Ceres, a party to the meeting? She's obviously a radical but now she's fine playing nice with the Inners? Why has Avasarala done a complete 180 in her attitude towards the Belters? It should have been her idea to make Drummer the admin of Medina Station, that would have completed both of their character arcs and solidified the alliance. But no, in the end she reverts back to season-1-Avasarala looking at the Belters like she's ready to gravity torture them after having just told us how much she changed not one episode ago. I swear, somebody just pontificated about judging people by their actions not their words. All we got from Avasarala were words about how much she's changed.If Earth and Mars were so opposed to letting the Belters be independent and/or control Medina Station, why would they have agreed to let Holden pick his own VP and then just resign? They would have seen that coming and even if he managed to pull one over on them they wouldn't have accepted it - it's just too contrived. But we're never going to get to know how that plays out because OOPS the show is over.And there were an unusual number of absurd plot holes in this episode.Wasn't the assault on Medina and the ring station supposed to be Plan B? They ended up not needing plan B at all because the Free Navy just gets spanked off screen.Here's a fun one for all the people who think there's too much AI and automation in the Expanse (/s) - If humans who can't survive much more than 15g could make it through the rail gun barrage by sending in a massive number of container pods that the guns couldn't shoot down in time, why didn't they just send the pods themselves (sans occupants) as high velocity projectiles to disable the rail guns? Better yet, why didn't the Martians just use missiles? They were planning on taking Marco in a ship-to-ship fight anyway, they didn't need to capture the rail guns. If they absolutely needed to use humans to capture the guns, why didn't they send in the cavalry instead of just 30 dudes? Every Martial Goliath suit still available should have been part of that operation, no?The Roci flying off and becoming just another star in the expanse would have been a pretty good ending if the show had actually had a few more seasons or at least a few more episodes to actually conclude. The cute little continuity Easter Eggs and guest stars from earlier seasons don't make this ending better. The icing doesn't help a cake that's gone bad.I can't rewatch Game of Thrones because of how it ended. In my opinion, the Expanse has been better than that show season for season and I don't think this finale is nearly the cluster that GoT had. But knowing that so many plot threads are never going to be concluded and so many characters are going to get really weird endings is probably going to put a damper on my inclination to rewatch this series. This was just not a good way for this otherwise brilliant show to end.Looking around the place, it seems everyone's defending Amazon. Surreal. There are either a lot of shills or a lot of suckers who bought into the whole \"Amazon saved the Expanse\" PR. Amazon bought up a vulnerable IP with a dedicated fan base, slashed the budget, gave it no marketing whatsoever, and axed it in the middle of its story. In other words, they made out like bandits without actually investing any risk in a worthy project. And no, you're not going to hear anything critical of Amazon from the folks working on the Expanse because they're under contract. Give it a few years and I'm sure Naren or Ty or somebody will let slip how frustrated they were that they had another 2-3 seasons lined up and instead got brutally axed in the middle of a season without even enough episodes to have a chance of tying any of the plots together in a reasonable way. Holy run on sentence, Batman! Amazon doesn't have a lot of quality content. Their in-house series and the bargain bin stuff they rotate in isn't worth the subscription fee without the Expanse on their lineup. Goodbye Prime membership!To the showrunners and all the creative talent that made this series what it is - cheers to you! You guys are awesome. Thanks for a great ride. I'm sorry that your project went the way of so many other niche sci-fi properties. I hope you find new partners who are more realistic about the scope and dedicated to quality because I'd sure love to see this story concluded."
    },
    {
      "username": "dk777",
      "userUrl": "https://www.imdb.com/user/ur80922659",
      "reviewLink": "https://www.imdb.com/review/rw7809704",
      "warningSpoilers": false,
      "date": "29 January 2022",
      "rate": "7",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Interesting, But Unfinished Story",
      "content": "Interesting and competent sci fi work. Rich and imaginative building of the world with characters that are layered and interesting.Most of today's TV series do not have such characteristics. Throughout the series, we follow several interesting characters played by solid actors, and their destinies and life stories are not one-dimensional, but filled with various ups and downs.The special effects are good and we have the feeling that we are watching a real space odyssey. There are almost no standard clichés of modern film production in which writers mostly tire us with unnecessary things that only lower the impression of the whole story. This, however, is reminiscent of interesting stories that we rarely see today.It reminds us of the days when the entertainment industry was mostly focused on providing the viewer with good entertainment and an interesting story. The cast is solid, and the actors have done a good job. The characters are fun, and I would especially single out Wes Chatham in the role of Amos Burton.An excellent casting was also made for the character of Chrisjen Avasarala, Shohreh Aghdashloo brilliantly portrayed an interesting character. Thomas Jane is always interesting, and here he is especially amusing as a detective on a space station.Unfortunately, the story remains unfinished, we didn't finally learn more about the ring builders, or about another civilization, or about strange creatures from another planet, there's just too much left unexplained.An interesting, imaginative and fun series that keeps us in suspense all the time, and it is a real pity that in the end we did not get answers to the most important questions, too many things remained unresolved."
    },
    {
      "username": "Charland-Reviews",
      "userUrl": "https://www.imdb.com/user/ur19192381",
      "reviewLink": "https://www.imdb.com/review/rw6600036",
      "warningSpoilers": false,
      "date": "15 February 2021",
      "rate": "7",
      "helpful": "38 out of 42 found this helpful.",
      "title": "The Expanse - a show of two halves",
      "content": "Firstly, as I say with all reviews, ignore any that are '1' or '10' - as they tend to be either bots or promotion companies.The Expanse is a series that can be divided into two halves...Seasons 1-3 created possibly the greatest sci-fi experience in the past 30 years. The intricate detail included on physics, locations, factions and their individual culture and technology is something rarely seen in modern-day TV (alas). The storylines are strong, intelligent, believable and rational. The universe is big, the action feels realistic and the characters are perfectly developed. This results in the viewer really caring about what happens to each person, as their different quests begin to unfold - eventually all linking together through superb scripting. As others have quite rightly said on here, what we get is one of the best sci-fi shows of all time and a style in which other shows have poorly tried to imitate since (shame on you current Star Trek writers). However...Seasons 4-5: This of course is the point where Amazon and their production team pick up the reins - the second half of the show.Season 4 had its plus points, in that the team continue the story in a similar fashion, with three main storylines occurring. However, the writing feels different, predictable and the pacing really hits the buffers - with the crew of the Rocinante stuck in one location for the whole 10 episodes. Character development seems somewhat less realistic, more clichéd and the casting even less on point (eg Brian George's Arjun being recast as Michael Benyaer). Much can be attributed to the book that the season is based on, with the producers acknowledging their mistakes.Sadly, season 5 is where the wheels come off. It's a whole lot of nothing and essentially feels like a totally different show. It takes 10 episodes for the whole crew to meet up for a drinks reception on the moon. 7 episodes of Naomi's crying melodrama, 5 episodes of Alex and Bobbie sitting in a small space, and 10 episodes of me trying to work out how old Naomi would need to be to have a 20 year-old son?! Gone is the clarity of direction, the geo-political realism and the intelligence of the earlier scripts. It's almost like the show had a 60% budget cut, leaving the universe feeling small and the show feeling amateur. Yes, there's a global pandemic going on, but most of us would have been happier to wait for a better end product.My biggest issue with season 5 is the inclusion of the most-meaningless and potentially-worst character death of all time, that was clearly added post-production (and no, not the equally pointless 'prison escape' episode). We're all aware of the external situation and film/TV companies wanting to act holier than holy, but surely a cast change would have been the more sensible and less nuclear option? Not to mention he was one the favourite characters up to this point.Sadly, the second half has spoilt what started out as a great show. Memo of the story: Finish while you're on top, keep your original script team, eliminate needless character deaths and don't let Amazon take over your show."
    },
    {
      "username": "daycu-",
      "userUrl": "https://www.imdb.com/user/ur147326490",
      "reviewLink": "https://www.imdb.com/review/rw8613370",
      "warningSpoilers": false,
      "date": "15 October 2022",
      "rate": "",
      "helpful": "17 out of 18 found this helpful.",
      "title": "A Thrilling Sci-fi Journey!",
      "content": "The Expanse is an ambitious Sci-fi series with many likable characters and amazing visuals. The Expanse has amazing world building which make the world richer and easier to get sucked into. The mystery elements and realistic Sci-fi aspects of the series make it all the more a gripping watch. Each season feels differently from one other while beginning and closing the main story. There's many shocking moments that propel the story forward. And the political aspects of the show might be its strongest trait. With complex plots that take time to unravel, The Expanse is a must watch Sci-fi series. Along with an awesome assembled group of characters, The Expanse is one not to be missed!!"
    },
    {
      "username": "bluesquirrel2004",
      "userUrl": "https://www.imdb.com/user/ur27116941",
      "reviewLink": "https://www.imdb.com/review/rw8895519",
      "warningSpoilers": false,
      "date": "27 February 2023",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "And the Razzie Award for Worst Actress goes to....",
      "content": "Firstly, let me say that I did really enjoy this tv show. I spent 3 months reading the entire series, including the short stories, then binge watched the entire series over two weeks. Except for my comments below, it was a very enjoyable viewing.The show remained fairly true to the source novels, most of the actors were likeable and played their part well. The SFX were great, there were a lot of great action scenes with the right amount of suspense throughout the show.Unfortunately, there were a couple of detractions...The first was Dominique Tipper playing Naomi Nagata. I found her acting very mediocre. She was unable to maintain a consistent accent, ranging from standard English all the way to very annoying Belter patois which, at times, bordered on sounding like baby talk. I know that it has been said that she emulates the speech patterns of those around her, but no other character in the show does that, nor was that ever done in the novels. I found her entire presence an irritant where by the fourth season, I started skipping some of her longer dialogue scenes to avoid listening to the accent.Secondly was Steven Strait as James Holden. I think he took a few seasons to find his feet in the role. It was not until season 5 that I started enjoying his role. In the first few seasons, I found that he looked as if he had a severe case of conjunctivitis (pink-eye) or was perpetually on the verge of crying.Overall a great show worth viewing, and a show that I will rewatch in the coming years.We need more scifi shows of this caliber."
    }
  ],
  "errorMessage": ""
}