{
  "imDbId": "tt3230854",
  "title": "The Expanse",
  "fullTitle": "The Expanse (TV Series 2015–2022)",
  "type": "TVSeries",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "The Expanse (TV series)",
  "url": "https://en.wikipedia.org/wiki/The_Expanse_(TV_series)",
  "plotShort": {
    "plainText": "The Expanse is an American science fiction television series developed by Mark Fergus and Hawk Ostby for the Syfy network, and is based on the series of novels of the same name by James S. A. Corey. The series is set in a future where humanity has colonized the Solar System. It follows a disparate band of protagonists—United Nations Security Council member Chrisjen Avasarala (Shohreh Aghdashloo), police detective Josephus Miller (Thomas Jane), ship's officer James Holden (Steven Strait) and his crew—as they unwittingly unravel and place themselves at the center of a conspiracy that threatens the system's fragile state of cold war, while dealing with existential crises brought forth by newly discovered alien technology.\r\nThe Expanse has received a positive critical response, with particular praise for its visuals, character development and political narrative. It received a Hugo Award for Best Dramatic Presentation and three Saturn Award nominations for Best Science Fiction Television Series. Syfy cancelled the series after three seasons. Amazon later acquired the series, producing three more seasons, with the sixth and final season premiering on December 10, 2021.",
    "html": "<p>The Expanse is an American science fiction television series developed by Mark Fergus and Hawk Ostby for the Syfy network, and is based on the series of novels of the same name by James S. A. Corey. The series is set in a future where humanity has colonized the Solar System. It follows a disparate band of protagonists—United Nations Security Council member Chrisjen Avasarala (Shohreh Aghdashloo), police detective Josephus Miller (Thomas Jane), ship's officer James Holden (Steven Strait) and his crew—as they unwittingly unravel and place themselves at the center of a conspiracy that threatens the system's fragile state of cold war, while dealing with existential crises brought forth by newly discovered alien technology.</p><p>The Expanse has received a positive critical response, with particular praise for its visuals, character development and political narrative. It received a Hugo Award for Best Dramatic Presentation and three Saturn Award nominations for Best Science Fiction Television Series. Syfy cancelled the series after three seasons. Amazon later acquired the series, producing three more seasons, with the sixth and final season premiering on December 10, 2021.</p>"
  },
  "plotFull": {
    "plainText": "The Expanse is an American science fiction television series developed by Mark Fergus and Hawk Ostby for the Syfy network, and is based on the series of novels of the same name by James S. A. Corey. The series is set in a future where humanity has colonized the Solar System. It follows a disparate band of protagonists—United Nations Security Council member Chrisjen Avasarala (Shohreh Aghdashloo), police detective Josephus Miller (Thomas Jane), ship's officer James Holden (Steven Strait) and his crew—as they unwittingly unravel and place themselves at the center of a conspiracy that threatens the system's fragile state of cold war, while dealing with existential crises brought forth by newly discovered alien technology.\r\nThe Expanse has received a positive critical response, with particular praise for its visuals, character development and political narrative. It received a Hugo Award for Best Dramatic Presentation and three Saturn Award nominations for Best Science Fiction Television Series. Syfy cancelled the series after three seasons. Amazon later acquired the series, producing three more seasons, with the sixth and final season premiering on December 10, 2021.\r\nSeries overview\r\nSetting\r\nHundreds of years in the future, humanity has colonized the Solar System. The three largest powers are the United Nations of Earth and Luna, the Martian Congressional Republic on Mars, and the Outer Planets Alliance (OPA), a loose confederation of the asteroid belt and the moons of Jupiter and Saturn.\r\nSeason 1\r\nChrisjen Avasarala, a United Nations executive, works to prevent war between Earth and Mars. Ceres police detective Joe Miller is sent to find a missing young woman, Julie Mao. The space-freighter Canterbury and the Martian Navy flagship Donnager are destroyed by unknown stealth ships. James Holden, Naomi Nagata, Alex Kamal and Amos Burton survive both attacks and escape in the Tachi, a Martian gunship. They rename the ship Rocinante, which becomes the main setting of the series. The crew of the Rocinante, with Miller's help, investigates and eventually discovers a biohazard that kills off most of the humans on the asteroid Eros, including Julie.\r\nSeason 2\r\nThe crew of the Rocinante, along with members of the OPA, attack the station responsible for the biohazard on Eros. Learning that it is an extra-solar bio-weapon known as the protomolecule, they attempt to destroy Eros. Miller becomes trapped there and dies when it crashes into Venus. Martian Marine Bobbie Draper fights an inhuman figure on Ganymede and later, during peace talks between Earth and Mars, becomes a protégé of Avasarala. The crew tries to help a father, Prax, find his daughter. In the process, they encounter and kill a figure akin to the one that Draper fought, now known as a \"protomolecule hybrid\", developed by Jules-Pierre Mao. A research ship, sent to Venus to investigate the crash of Eros into the planet, is stopped dead in the atmosphere and dismantled by the protomolecule.\r\nSeason 3\r\nThe UN declares war, as Earth and Mars send science vessels to investigate what is happening on Venus. Political tensions soar as the OPA is recognized as the government of the Belters and Prax is reunited with his daughter. The protomolecule forms the Ring, a structure which takes an orbital position beyond Uranus, and all three governments race to send their ships through. After a Belter racing ship slingshots through the Ring at high speed, the ring believes the high speed humans and objects to be dangerous and activates defenses that threaten humanity. Through Holden, a projection of Miller tries to shut off the defenses of the ring and convince the protomolecule that humanity is not a threat.\r\nSeason 4\r\nA land rush to other star systems with habitable worlds begins, with thousands of planets accessible via the Ring's wormholes. Refugee ships from the Belt and overcrowded Earth are stopped at the gateway. A ship runs the blockade, and the crew of the Rocinante are sent through the portal to investigate the situation on the exoplanet, called Ilus. The settlers have been joined by an officially backed scientific expedition with private military support, leading to frequent violence between the two groups. The crew fails to ease tensions and decides to find out what is happening on the planet and where the previous civilization has gone. With the help of Miller, Holden reactivates an ancient structure, setting off a chain of cataclysmic events. Efforts to terraform Mars wane as habitable worlds are available.\r\nSeason 5\r\nA deadly conspiracy threatens Earth, as the crew of the Rocinante pursue personal missions while their ship is in dry dock at Tycho Station. Draper and Avasarala investigate the Martian military's ties to a growing threat from a rogue faction of Belters. Marco Inaros, the rebel leader, assembles a Belter fleet and attacks Earth with stealth-shielded asteroids.\r\nSeason 6\r\nHolden and the crew of the Rocinante fight alongside the Combined Fleet of Earth and Mars to protect the Inner Planets from Marco Inaros and his Free Navy. The combined fleet, allied with the ships of Camina Drummer and other Belter forces, defeats Marco and the Free Navy by antagonizing an unknown alien presence. On a distant planet, a young colonist discovers animals that can resurrect her dead sibling.\r\nCast and characters\r\nMain\r\nThomas Jane as Joe Miller/The Investigator (seasons 1–2; special appearances seasons 3–4), a Belter detective on Ceres assigned to find Julie Mao\r\nSteven Strait as James Holden, the Earther executive officer on the Canterbury, later the captain of the Rocinante\r\nCas Anvar as Alex Kamal (seasons 1–5), the Martian pilot of the Canterbury, later the pilot of the Rocinante\r\nDominique Tipper as Naomi Nagata, a Belter engineer of the Canterbury, later the engineer of the Rocinante\r\nWes Chatham as Amos Burton, an Earther mechanic of the Canterbury, originally from Baltimore; later the mechanic of the Rocinante\r\nPaulo Costanzo as Shed Garvey (season 1), the Canterbury's medical technician\r\nFlorence Faivre as Juliette \"Julie\" Andromeda Mao (seasons 1–2; special appearance season 3), the missing daughter of business tycoon Jules-Pierre Mao\r\nShawn Doyle as Sadavir Errinwright (seasons 1–3), UN Undersecretary of Executive Administration\r\nShohreh Aghdashloo as Chrisjen Avasarala, UN Deputy Undersecretary of Executive Administration, later UN Secretary-General\r\nFrankie Adams as Roberta \"Bobbie\" W. Draper (seasons 2–6), an MMC (Martian Marine Corps) gunnery sergeant\r\nCara Gee as Camina Drummer (seasons 4–6; recurring seasons 2–3), Tycho Station's Belter head of security, later the leader of the rebel faction opposing the Free Navy\r\nKeon Alexander as Marco Inaros (seasons 5–6; recurring season 4), a Belter faction leader, later head of the Free Navy\r\nJasai Chase Owens as Filip Inaros (seasons 5–6; guest season 4), Marco and Naomi's son, currently working for Marco\r\nNadine Nicole as Clarissa Melpomene Mao (seasons 5–6; recurring season 3; guest season 4), Jules-Pierre Mao's elder daughter who initially seeks revenge against Holden, later a crew member on Rocinante\r\nRecurring\r\nIntroduced in season 1\r\nChad L. Coleman as Fred Lucius Johnson, \"the Butcher of Anderson Station\" (seasons 1–5), a UNN colonel-turned-leader of the OPA on Tycho Station\r\nAndrew Rotilio as Diogo Harari (seasons 1–3), a young Belter from Ceres in the OPA\r\nMartin Roach as Michael Souther (seasons 1–3), a UNN admiral\r\nFrançois Chau as Jules-Pierre Mao (seasons 1–3), the owner of Mao-Kwikowski Mercantile\r\nAthena Karkanis as Tavi Muss (season 1), Miller's former partner at Star Helix Security\r\nJared Harris as Anderson Dawes (seasons 1–2), the OPA's Ceres liaison\r\nJay Hernandez as Dmitri Havelock (season 1), Miller's Earther partner at Star Helix Security\r\nLola Glaudini as Shaddid (season 1), captain of Star Helix Security's Ceres detachment\r\nKevin Hanchard as Sematimba (season 1), a detective on Eros\r\nDaniel Kash as Antony Dresden (seasons 1–2), Protogen's head of biological research\r\nBrian George (seasons 1–2; guest, season 6) and Michael Benyaer (season 4) as Arjun Avasarala, Avasarala's husband\r\nGreg Bryk as Lopez (season 1), an MMC lieutenant assigned to the Martian Congressional Republic Navy (MCRN) Donnager\r\nElias Toufexis as Kenzo Gabriel (season 1), a Davila Aerospatiale spy on Tycho Station\r\nJean Yoon as Theresa Yao (season 1), captain of the MCRN Donnager\r\nIntroduced in season 2\r\nNick E. Tarabay as Cotyar Ghazi (seasons 2–3), a security professional working for Avasarala\r\nTerry Chen as Praxideke \"Prax\" Meng (seasons 2–3; guest, season 6), a botanist from Ganymede\r\nLeah Jung as Mei Meng (seasons 2–3), Prax's daughter\r\nTed Atherton as Lawrence Strickland (seasons 2–3), a pediatrician on Ganymede\r\nJonathan Whittaker as Esteban Sorrento-Gillis (seasons 2–3), the UN Secretary General\r\nByron Mann as Augusto Nguyễn (seasons 2–3), a UNN admiral\r\nMpho Koaho as Richard Travis (season 2), an Earth-born MMC private assigned to the MCRN Scirocco\r\nCarlos Gonzalez-Vio as Paolo Cortázar (season 2; guest, seasons 5–6), a Protogen scientist\r\nPeter Outerbridge as Martens (season 2), an MCRN captain and chaplain assigned to the MCRN Scirocco\r\nSarah Allen as T. Hillman (season 2), an MMC private assigned to the MCRN Scirocco\r\nDewshane Williams as L. Sa'id (season 2), an MMC corporal assigned to the MCRN Scirocco\r\nConrad Pla as Janus (season 2), an UNMC colonel assigned to the UNS Arboghast\r\nTed Whittall as Michael Iturbi (season 2), a UN scientist assigned to the UNS Arboghast\r\nHugh Dillon as Sutton (season 2), an MCRN lieutenant assigned to the MCRN Scirocco\r\nJeff Seymour as Pyotr Korshunov (season 2), the former MCR Minister of Defense\r\nRachael Crawford as J. Peñano (season 2), an MCRN admiral\r\nIntroduced in season 3\r\nDavid Strathairn as Klaes Ashford (seasons 3–4), a Belter pirate-turned-executive officer of the OPAS Behemoth\r\nElizabeth Mitchell as Anna Volovodov (season 3; guest, season 6), a Methodist pastor and speech writer\r\nBrock Johnson as Grigori (season 3), a former acquaintance of Ashford's aboard the OPAS Behemoth\r\nChris Owens as Kolvoord (season 3), a science officer aboard the UNN Thomas Prince\r\nGenelle Williams as Tilly Fagan (season 3), a socialite aboard the UNN Thomas Prince who befriends Anna\r\nAnna Hopkins as Monica Stuart (seasons 3, 5–6), an Earther journalist filming a documentary on the Rocinante\r\nJaeden Noel as Katoa Merton (season 3), Mei's friend\r\nRaven Dauda as Nono Volovodov (season 3), Anna's wife\r\nBrandon McGibbon as Elio \"Cohen\" Casti (season 3), Monica's technical crewman and camera operator\r\nAri Millen as Stanni Kulp (season 3), a Savage Industries electrician assigned to the UNN Thomas Prince\r\nPaulino Nunes as Hank Cortez (season 3), a priest aboard the UNN Thomas Prince\r\nSabryn Rock as Riko Oshi (season 3), an MMC private assigned to the MCRN Xuesen\r\nHamed Dar as Jed Trepp (season 3), an MMC private assigned to the MCRN Xuesen\r\nAtticus Mitchell as Sinopoli (season 3), a MCRN ensign who served aboard the MCRN Kittur Chennamma\r\nNatalie Lisinska as Shaffer (season 3), a lieutenant aboard the UNN Agatha King who is loyal to Souther\r\nMorgan Kelly as Mancuso (season 3), a lieutenant aboard the UNN Agatha King who is loyal to Souther\r\nJohn Kapelos as Ren Hazuki (season 3), a Savage Industries electrician assigned to the UNN Thomas Prince\r\nYanna McIntosh as Chandra Lucas (season 3), captain of the MCRN Askia, later captain of the MCRN Xuesen\r\nKrista Bridges as Sandrine Kirino (seasons 3, 6), captain of the MCRN Hammurabi\r\nIntroduced in season 4\r\nBurn Gorman as Adolphus Murtry (season 4), chief of security for Royal Charter Energy (RCE) aboard the Edward Israel\r\nLyndie Greenwood as Elvi Okoye (season 4; guest, season 6), a biologist working for the RCE\r\nRosa Gilmore as Lucia Mazur (season 4), a medical technician on Ilus\r\nPatti Kim as Carol Chiwewe (season 4), a Belter leader\r\nKyla Madeira as Felcia Mazur (season 4), a Belter refugee\r\nSteven McCarthy as Jakob Mazur (season 4), a Belter refugee\r\nDayle McLeod as Leelee (season 4), a thief on Mars\r\nJess Salgueiro as Chandra Wei (season 4), corporate security officer\r\nZach Smadu as Fayez Sarkis (season 4), a scientist aboard the Edward Israel\r\nKolton Stewart as David Draper (season 4), Bobbie's nephew\r\nLily Gao as Nancy Gao (seasons 4–5), a candidate for UN secretary-general\r\nPaul Schulze as Esai Martin (season 4), a corrupt police officer on Mars\r\nIntroduced in season 5\r\nJosé Zúñiga as Carlos \"Bull\" de Baca (season 5), chief of security on Tycho Station\r\nMichael Irby as Felix Delgado (season 5), a UN admiral\r\nSugith Varughese as David Paster (season 5), a high-ranking UN official\r\nBrent Sexton as Cyn (season 5), an old friend of Naomi\r\nBahia Watson as Sakai (season 5), chief engineer on Tycho station\r\nOluniké Adeliyi as Karal (season 5), a henchman in the Inaros faction\r\nGeorge Tchortov as Leveau (season 5), a Tycho officer who assists Holden\r\nSandrine Holt as Oksana Busch (season 5), a member of Drummer's crew\r\nSamer Salem as Josep (seasons 5–6), a member of Drummer's crew\r\nVanessa Smythe as Michio (seasons 5–6), a member of Drummer's crew\r\nLara Jean Chorostecki as Emily Babbage (season 5), a Martian lieutenant\r\nSomkele Idhalama as a Tycho Engineer (season 5), helping Holden pursue the Zmeya\r\nJacob Mundell as Erich (season 5), a childhood friend of Amos in Baltimore\r\nTim DeKay as Emil Sauveterre (season 5), a Martian admiral\r\nIntroduced in season 6\r\nGabriel Darku as Yoan, friend of Filip\r\nConrad Coates as Sidiqi, a UNN admiral\r\nTed Dykstra as Gareth, an aide to Chrisjen Avasarala\r\nEmma Ho as Cara, young girl colonist on Laconia\r\nIan Ho as Xan, young boy colonist of Laconia\r\nDaniel Jun as Gary, Cara and Xan's father\r\nDianne Aguilar as Dot, Cara and Xan's mother\r\nStuart Hughes as Liang Walker, a Free Navy captain\r\nKathleen Robertson as Rosenfeld Guoliang, second-in-command to Marco Inaros\r\nJo Vannicola as Nico Sanjrani, administrator of Ceres Station\r\nDylan Taylor as Winston Duarte, former Martian admiral on Laconia\r\nVieslav Krystyan as Owain, Belter on Ceres with a cat\r\nJoe Perry as Tadeo, repair technician onboard the Pella\r\nProduction\r\nDevelopment\r\nThe Expanse is based on the novel series of the same name by James S. A. Corey, a pen name of the authors Daniel Abraham and Ty Franck, who also serve as writers and producers for the show. The first novel, Leviathan Wakes (2011), was nominated for the Hugo Award for Best Novel and Locus Award for Best Science Fiction Novel. On September 4, 2013, The Expanse was optioned for television by Alcon Television Group. On April 11, 2014, Syfy announced a straight-to-series commitment to a television adaptation of the book series, and ordered the production of 10 one-hour-long episodes for the first season. On that date Syfy President Dave Howe commented: \"The Expanse is epic in scale and scope and promises to be Syfy's most ambitious series to date\". Mark Fergus and Hawk Ostby wrote the pilot and served as writers and showrunners alongside Naren Shankar.\r\nTerry McDonough was revealed to be directing the first two episodes of the series in October 2014. In May 2015, before the first season aired, writing commenced for a second season, which was ordered in December 2015. The second season of The Expanse premiered on February 1, 2017. On March 16, 2017, The Expanse was renewed by Syfy for a 13-episode third season to air in 2018. Four digital comics based on the books and tying into the television series have been published by ComiXology. The first focuses on the origin of James Holden and was released February 1, 2017. The next three, highlighting the origins of other characters are: Naomi Nagata, released April 19, 2017; Alex Kamal, released May 24, 2017; and Amos Burton, released July 12, 2017. The show's title sequence was animated and directed by Australian studio Breeder and its VFX team.\r\nCancellation and renewals\r\nAlcon Entertainment produces and finances the series. It sold three seasons to Syfy, which canceled the series in May 2018. Fans protested the cancellation, gathering over 100,000 signatures for an online petition. They lobbied Amazon Studios and Netflix to greenlight the fourth season and a crowdfunding campaign paid for an airplane to fly a \"#SaveTheExpanse\" banner around Amazon Studios. Celebrities including Wil Wheaton, George R. R. Martin, Patton Oswalt and Andreas Mogensen supported the campaign. Amazon Prime Video picked up the series for a fourth season, which was released on December 12, 2019. In July 2019, Amazon renewed The Expanse for a fifth season, which premiered on December 15, 2020.\r\nOn November 24, 2020, ahead of the fifth season's release, Amazon renewed the series for a sixth and final season. Filming started in late January 2021. However, the authors of the novels and writers on the series, Daniel Abraham and Ty Franck, have stated that they view season 6 as a \"pause\" rather than a conclusion and that Alcon Entertainment \"is very committed to the IP\", Alcon's Andrew Kosove and Broderick Johnson said that they are \"considering all kinds of interesting possibilities\". On October 8, 2021, it was announced that the sixth and final season would premiere on December 10, 2021.\r\nIn January 2023, it was announced that the continuation of the series, set between Babylon's Ashes and Persepolis Rising, would be adapted into a 12-issue comic book series, The Expanse: Dragon Tooth.\r\nCasting\r\nIn July 2014, Thomas Jane was cast as Joe Miller. In August 2014, Steven Strait and Shohreh Aghdashloo's attachment to the series as James Holden, and Chrisjen Avasarala was announced. October of that same year, Dominique Tipper, Cas Anvar, Paulo Costanzo, and Wes Chatham were cast as Naomi Nagata, Alex Kamal, Shed Garvey, and Amos Burton while Jonathan Banks and Jay Hernandez were announced to be guest starring in the series. One month later, Shawn Doyle was cast as Sadavir Errinwright, while Chad L. Coleman and Jared Harris were cast in the recurring roles of Fred Johnson and Anderson Dawes, respectively. Frankie Adams was cast as Bobbie Draper for the second season in April 2016. On January 21, 2020, Keon Alexander, Nadine Nicole, and Jasai Chase Owens (who portray Marco Inaros, Clarissa Melpomene Mao, and Filip Inaros, respectively), were promoted to the main cast for the fifth season. Later, Lily Gao was cast in a recurring role as Nancy Gao for the fourth and fifth seasons, a candidate for UN secretary-general. Additionally, Anvar did not return for the sixth and final season after being the subject of multiple sexual misconduct allegations.\r\nFilming\r\nProduced by Alcon Television and The Sean Daniel Company, principal photography on the first season started on October 29, 2014, in Toronto and concluded on March 27, 2015. The second season filmed between April 13, 2016, and September 12, 2016. Filming for season 3 began on July 12, 2017. In February 2019, cast member Lyndie Greenwood announced that the fourth season concluded filming. Filming for the fifth season began on September 23, 2019, and ended on February 21, 2020. Production on the sixth season took place between January 27, 2021, and May 7, 2021. It was impacted by COVID-19 pandemic restrictions, as was post-production of the fifth season.\r\nTitle sequence\r\nThe title sequence of the series has been lauded by reviewers for its ability to elegantly and wordlessly convey important information about the worlds in which the series takes place. The title sequence was created by Breeder, a motion graphics design studio in Brisbane, Australia. Drawing comparisons to the opening sequence of Game of Thrones, Jason Morehead of Opuszine notes that not only does it depict the development of Earth's expansion into the solar system, it introduces the viewer to the political dynamics within the series. \"Earth is the old guard, intent on controlling the system and her former colonies; technologically advanced Mars is driven to become a paradise; and the Belt is fighting to keep from being treated as a second-class citizen by both Earth and Mars.\"\r\nWhile the title sequence does change visually as the series progresses, the lyrics that accompany Clinton Shorter's title theme – written and performed by Lisbeth Scott – remain the same. Scott noted in a post on Facebook that her words were drawn from Norwegian, though she apologized for any errors in syntax, grammar and pronunciation.\r\nMusic\r\nThe show's soundtrack was composed by Shorter. The first season's soundtrack dubbed The Expanse Season 1 – The Original Television Soundtrack, consisting of nineteen tracks, was released by Lakeshore Records, on May 20, 2016, via iTunes, and on May 26, 2016, via Amazon.\r\nLanguage\r\nThe Belter characters speak Belter Creole, an invented language created for the show by linguist Nick Farmer; these characters speak English with a distinctive accent. As explained in one article, \"People who have migrated to the Belt come from all over Earth speaking dozens of languages, and they're often isolated for years at a time on remote mining stations. To communicate, they evolve a creole called Belter, which becomes the lingua franca for what is essentially the solar system's new proletariat.\"\r\nGenre and themes\r\nThe series has been described as a space opera by critics. Emily VanDerWerff of Vox describes the first season of the series to be a \"blend of science fiction and noir-infused detective drama, with a backdrop of political intrigue\". Vice has referred to the series as a \"sci fi noir mystery-thriller\" and as hard science fiction. Opposed to the latter, the source books' authors define their approach as aiming for a \"Wikipedia level of plausibility\".\r\nPrior to the series premiere, Mark Fergus spoke of the series's Western themes: \"Everywhere is kind of back to the frontier rules so it gives us all that stuff back that we lost. Cellular technology. You can get a little more Western about it.\" The fourth season, according to the writers, also had \"space Western vibes\".\r\nAnalyzing the show, Tech Times wrote that The Expanse \"...is more than just a science fiction show about people traveling the solar system in spaceships. It ... covers ... politics, poverty, oppression, discrimination, and the struggle for resources in harsh environments.\"\r\nRelease\r\nThe pilot episode was screened at San Diego Comic-Con in July 2015. In the United States, seasons 1 to 3 of The Expanse were broadcast by Syfy and streamed on Amazon Prime Video. In Canada, these seasons aired on Space and streamed on Crave. In New Zealand, these seasons aired on Sky. In all other countries where Netflix is available, seasons 1 and 2 were streamed until September 2018. On February 8, 2019, Prime Video took over exclusive distribution of the first three seasons worldwide in preparation for premier of the fourth season in 2019.\r\nReception\r\nCritical response\r\nSeason 1\r\nOn Rotten Tomatoes, the first season has a score of 78% with an average rating of 7.1 out of 10 based on 46 reviews. The site's consensus states: \"The Expanse blends sci-fi elements and detective noir into a visually compelling whole, though it takes a few episodes for the story to capture viewers' intrigue.\" The first season received a rating of 65 out of 100 on Metacritic based on reviews from 23 critics, indicating \"generally favorable reviews\". Reporting on the pilot screening, io9's Lauren Davis declared herself \"blown away\" by The Expanse, appreciating its \"incredible sense of scale\" and its \"deeply thought out future world that reflects on our present one, with high production values and characters who speak and act like real people\". Max Nicholson of IGN characterized the pilot as \"grim and dramatic\", and a \"very dense hour of television\", with the terminology and large cast sometimes difficult to follow for viewers unfamiliar with the novels, but highlighted the pilot's \"gorgeous\" visuals and effects reminiscent of Battlestar Galactica, Dune and Firefly. Writing for Variety, Maureen Ryan was unimpressed by the first four episodes \"awkwardly linking a series of somewhat muddled stories\" and the series's stereotypical characters but credited it with tackling \"issues of class, representation and exploitation\" and a convincing design. At Tor.com, Justin Landon highlighted The Expanse's \"bold and unique cinematography\" and its claustrophobic, discomforting set designs, as well as the \"extremely faithful\" characterization, but remarked that the patois spoken by the Belters, the natives of the asteroid belt, made the series difficult to follow.\r\nSeason 2\r\nOn Rotten Tomatoes, the season has a score of 95% with an average rating of 9 out of 10 based on 21 reviews. The site's critical consensus reads, \"The Expanse's second season offers more of the show's excellent signature production values while increasing character development and politically thrilling narratives.\" On Metacritic, it has a score of 77 out of 100 based on 5 reviews. Writing for io9, Katherine Trendacosta noted how the show had become \"shockingly prescient\", insofar as many of the issues and ideas explored by The Expanse mirrored contemporary trends in global politics. Brian Tallerico, in \"Why The Expanse Is the Best Sci-FI TV Show You're Not Watching\" for Rolling Stone, praised the show for its contemporary political relevance and called its willingness to mix tones, and its protagonists, laudable. He summarized that at its core, The Expanse was all about people responding to fear – fear of the other, fear of the new, fear of inequality, fear of death. Writing for 13.7: Cosmos & Culture, a blog hosted by NPR, astrophysicist Adam Frank praised the show and its writers for the scientific realism. He wrote that \"more than any other TV space-themed show, it gets the science right\".\r\nSeason 3\r\nOn Rotten Tomatoes, the season has a score of 100% with an average rating of 8.6 out of 10 based on 26 reviews. The site's critical consensus reads, \"Building on earlier potential and extending character arcs throughout a solidly crafted third season, The Expanse continues to impress – and shows no signs of abating.\" Michael Ahr of Den of Geek said the series \"wowed fans with its complex characters, its political intrigue, its attention to scientific authenticity, and its stunningly good visual effects, and with several more books in the series that inspired the show, there's plenty more source material for the adaptation to explore in future seasons.\" Liz Shannon Miller of IndieWire praised the performances of Coleman and Strait in the absence of the Joe Miller character, saying \"In general, while the mid-Season 2 departure of Joe Miller (Thomas Jane) and his wonderful hats does leave a bit of a vacuum, the ensemble has coalesced nicely, with both established performers like Chad L. Coleman and relative newcomers like Strait settling into their roles.\" Speaking about the premiere, Kevin Yeoman said, \"All in all ... season three begins by dramatically raising the immediate stakes of the story without drastically altering the dynamics of the show itself.\"\r\nSeason 4\r\nOn Rotten Tomatoes, the season has a score of 100% with an average rating of 9 out of 10 based on 34 reviews. The site's critical consensus reads, \"Smart and thrilling as ever, The Expanse's fourth season doesn't miss a beat, successfully navigating network changes without losing any of its rich character work or narrative complexities.\" The season received a rating 91 out of 100 on Metacritic based on reviews from 4 critics indicating \"universal acclaim\". Writing for Den of Geek, Michael Ahr gave it a 5/5 review and wrote, \"With its brilliantly crafted, multilayered plot, The Expanse season four proves itself worthy of Amazon's rescue in a nearly perfect season.\" Sadie Gennis of TV Guide also praised the fourth season, giving it a score of 4.5/5.\r\nSeason 5\r\nOn Rotten Tomatoes, the season has a score of 100% with an average rating of 8.7 out of 10 based on 32 reviews. The site's critical consensus reads, \"The Expanse's many threads come to a head in an excellent fifth season that expertly capitalizes on everything that makes the show work while setting the stage for an epic final season.\" The season received a rating 82 out of 100 on Metacritic based on reviews from 5 critics indicating \"universal acclaim\".\r\nSeason 6\r\nOn Rotten Tomatoes, the season has a score of 95% with an average rating of 8.6 out of 10 based on 20 reviews. The site's critical consensus reads, \"The Expanse's truncated final season honors the series' characters and themes with a graceful conclusion.\"\r\nRatings\r\nSeason four was the first season not to be broadcast on live TV and not get weekly viewership ratings. The season ranked fourth in most watched digital original in the United States in December 2019.\r\nAccolades\r\nOther media\r\nThe Expanse: A Telltale Series\r\nDuring The Game Awards 2021, a reveal trailer announced The Expanse: A Telltale Series which would be co-developed by Deck Nine Games and Telltale Games. The game will be a prequel to the TV series and Cara Gee will be reprising her role as Camina Drummer, who is the executive officer onboard a scavenger ship named Artemis. Episode one of the game is expected to be released in summer 2023 and be published by Telltale Games for PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S, and the Epic Games Store on PC.\r\nAftershow and podcast\r\nBeginning December 16, 2020, Wes Chatham and Ty Franck started hosting weekly programs that feature behind-the-scenes information about the series, first as The Expanse Season 5 Aftershow after each season's episode. Upon the conclusion of Season 5 (after the airing of the season 5 finale), they continued on Wednesdays as Ty & That Guy Podcast, covering each series' episode, from The Expanse S1E1, additionally discussing their inspirations from genre culture, and occasionally having guests both related and not to the series. The Expanse Season 6 Aftershow with Chatham and Franck, produced by Amazon Studios, was distributed by Amazon Prime Video and Ty & That Guy Podcast in video and audio formats.",
    "html": "<p>The Expanse is an American science fiction television series developed by Mark Fergus and Hawk Ostby for the Syfy network, and is based on the series of novels of the same name by James S. A. Corey. The series is set in a future where humanity has colonized the Solar System. It follows a disparate band of protagonists—United Nations Security Council member Chrisjen Avasarala (Shohreh Aghdashloo), police detective Josephus Miller (Thomas Jane), ship's officer James Holden (Steven Strait) and his crew—as they unwittingly unravel and place themselves at the center of a conspiracy that threatens the system's fragile state of cold war, while dealing with existential crises brought forth by newly discovered alien technology.</p><p>The Expanse has received a positive critical response, with particular praise for its visuals, character development and political narrative. It received a Hugo Award for Best Dramatic Presentation and three Saturn Award nominations for Best Science Fiction Television Series. Syfy cancelled the series after three seasons. Amazon later acquired the series, producing three more seasons, with the sixth and final season premiering on December 10, 2021.</p><br/><h3>Series overview</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally released</th></tr><tr><th scope=\"col\">First released</th><th scope=\"col\">Last released</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">December 14, 2015</td><td style=\"padding:0 8px\">February 2, 2016</td><td rowspan=\"3\"><span>Syfy</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 1, 2017</td><td style=\"padding:0 8px\">April 19, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 11, 2018</td><td style=\"padding:0 8px\">June 27, 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">December 12, 2019</td><td rowspan=\"3\"><span>Amazon Prime Video</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">December 15, 2020</td><td style=\"padding:0 8px\">February 2, 2021</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">December 10, 2021</td><td style=\"padding:0 8px\">January 14, 2022</td></tr></tbody></table><h4>Setting</h4><p>Hundreds of years in the future, humanity has colonized the Solar System. The three largest powers are the United Nations of Earth and Luna, the Martian Congressional Republic on Mars, and the Outer Planets Alliance (OPA), a loose confederation of the asteroid belt and the moons of Jupiter and Saturn.</p><h4>Season 1</h4><p>Chrisjen Avasarala, a United Nations executive, works to prevent war between Earth and Mars. Ceres police detective Joe Miller is sent to find a missing young woman, Julie Mao. The space-freighter Canterbury and the Martian Navy flagship Donnager are destroyed by unknown stealth ships. James Holden, Naomi Nagata, Alex Kamal and Amos Burton survive both attacks and escape in the Tachi, a Martian gunship. They rename the ship Rocinante, which becomes the main setting of the series. The crew of the Rocinante, with Miller's help, investigates and eventually discovers a biohazard that kills off most of the humans on the asteroid Eros, including Julie.</p><h4>Season 2</h4><p>The crew of the Rocinante, along with members of the OPA, attack the station responsible for the biohazard on Eros. Learning that it is an extra-solar bio-weapon known as the protomolecule, they attempt to destroy Eros. Miller becomes trapped there and dies when it crashes into Venus. Martian Marine Bobbie Draper fights an inhuman figure on Ganymede and later, during peace talks between Earth and Mars, becomes a protégé of Avasarala. The crew tries to help a father, Prax, find his daughter. In the process, they encounter and kill a figure akin to the one that Draper fought, now known as a \"protomolecule hybrid\", developed by Jules-Pierre Mao. A research ship, sent to Venus to investigate the crash of Eros into the planet, is stopped dead in the atmosphere and dismantled by the protomolecule.</p><h4>Season 3</h4><p>The UN declares war, as Earth and Mars send science vessels to investigate what is happening on Venus. Political tensions soar as the OPA is recognized as the government of the Belters and Prax is reunited with his daughter. The protomolecule forms the Ring, a structure which takes an orbital position beyond Uranus, and all three governments race to send their ships through. After a Belter racing ship slingshots through the Ring at high speed, the ring believes the high speed humans and objects to be dangerous and activates defenses that threaten humanity. Through Holden, a projection of Miller tries to shut off the defenses of the ring and convince the protomolecule that humanity is not a threat.</p><h4>Season 4</h4><p>A land rush to other star systems with habitable worlds begins, with thousands of planets accessible via the Ring's wormholes. Refugee ships from the Belt and overcrowded Earth are stopped at the gateway. A ship runs the blockade, and the crew of the Rocinante are sent through the portal to investigate the situation on the exoplanet, called Ilus. The settlers have been joined by an officially backed scientific expedition with private military support, leading to frequent violence between the two groups. The crew fails to ease tensions and decides to find out what is happening on the planet and where the previous civilization has gone. With the help of Miller, Holden reactivates an ancient structure, setting off a chain of cataclysmic events. Efforts to terraform Mars wane as habitable worlds are available.</p><h4>Season 5</h4><p>A deadly conspiracy threatens Earth, as the crew of the Rocinante pursue personal missions while their ship is in dry dock at Tycho Station. Draper and Avasarala investigate the Martian military's ties to a growing threat from a rogue faction of Belters. Marco Inaros, the rebel leader, assembles a Belter fleet and attacks Earth with stealth-shielded asteroids.</p><h4>Season 6</h4><p>Holden and the crew of the Rocinante fight alongside the Combined Fleet of Earth and Mars to protect the Inner Planets from Marco Inaros and his Free Navy. The combined fleet, allied with the ships of Camina Drummer and other Belter forces, defeats Marco and the Free Navy by antagonizing an unknown alien presence. On a distant planet, a young colonist discovers animals that can resurrect her dead sibling.</p><br/><h3>Cast and characters</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\" scope=\"col\">Character</th><th rowspan=\"2\" scope=\"col\">Portrayed by</th><th colspan=\"6\" scope=\"col\">Appearances</th></tr><tr><th scope=\"col\" style=\"width:10%;\"><span class=\"mw-selflink-fragment\">Season 1</span></th><th scope=\"col\" style=\"width:10%;\"><span class=\"mw-selflink-fragment\">Season 2</span></th><th scope=\"col\" style=\"width:10%;\"><span class=\"mw-selflink-fragment\">Season 3</span></th><th scope=\"col\" style=\"width:10%;\"><span class=\"mw-selflink-fragment\">Season 4</span></th><th scope=\"col\" style=\"width:10%;\"><span class=\"mw-selflink-fragment\">Season 5</span></th><th scope=\"col\" style=\"width:10%;\"><span class=\"mw-selflink-fragment\">Season 6</span></th></tr><tr><th scope=\"row\">Joe Miller</th><td><span>Thomas Jane</span></td><td colspan=\"2\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td><td colspan=\"2\" style=\"background: #FFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Special appearances</td><td colspan=\"2\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td></tr><tr><th scope=\"row\">James Holden</th><td><span>Steven Strait</span></td><td colspan=\"6\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\">Alex Kamal</th><td><span>Cas Anvar</span></td><td colspan=\"5\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td><td style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td></tr><tr><th scope=\"row\">Naomi Nagata</th><td><span>Dominique Tipper</span></td><td colspan=\"6\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\">Amos Burton</th><td><span>Wes Chatham</span></td><td colspan=\"6\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\">Shed Garvey</th><td><span>Paulo Costanzo</span></td><td style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td><td colspan=\"5\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td></tr><tr><th scope=\"row\">Juliette Mao</th><td><span>Florence Faivre</span></td><td colspan=\"2\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td><td style=\"background: #FFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Special appearance</td><td colspan=\"3\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td></tr><tr><th scope=\"row\">Sadavir Errinwright</th><td><span>Shawn Doyle</span></td><td colspan=\"3\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td><td colspan=\"3\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td></tr><tr><th scope=\"row\">Chrisjen Avasarala</th><td><span>Shohreh Aghdashloo</span></td><td colspan=\"6\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\">Bobbie Draper</th><td><span>Frankie Adams</span></td><td style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td colspan=\"5\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\">Camina Drummer</th><td><span>Cara Gee</span></td><td style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td colspan=\"2\" style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\">Recurring</td><td colspan=\"3\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\">Marco Inaros</th><td><span>Keon Alexander</span></td><td colspan=\"3\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\">Recurring</td><td colspan=\"2\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\">Filip Inaros</th><td>Jasai Chase Owens</td><td colspan=\"3\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td style=\"background: #DEF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Guest</td><td colspan=\"2\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\">Clarissa Mao</th><td><span>Nadine Nicole</span></td><td colspan=\"2\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\">Recurring</td><td style=\"background: #DEF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Guest</td><td colspan=\"2\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr></tbody></table><h4>Main</h4><ul><li>Thomas Jane as Joe Miller/The Investigator (seasons 1–2; special appearances seasons 3–4), a Belter detective on Ceres assigned to find Julie Mao</li><li>Steven Strait as James Holden, the Earther executive officer on the Canterbury, later the captain of the Rocinante</li><li>Cas Anvar as Alex Kamal (seasons 1–5), the Martian pilot of the Canterbury, later the pilot of the Rocinante</li><li>Dominique Tipper as Naomi Nagata, a Belter engineer of the Canterbury, later the engineer of the Rocinante</li><li>Wes Chatham as Amos Burton, an Earther mechanic of the Canterbury, originally from Baltimore; later the mechanic of the Rocinante</li><li>Paulo Costanzo as Shed Garvey (season 1), the Canterbury's medical technician</li><li>Florence Faivre as Juliette \"Julie\" Andromeda Mao (seasons 1–2; special appearance season 3), the missing daughter of business tycoon Jules-Pierre Mao</li><li>Shawn Doyle as Sadavir Errinwright (seasons 1–3), UN Undersecretary of Executive Administration</li><li>Shohreh Aghdashloo as Chrisjen Avasarala, UN Deputy Undersecretary of Executive Administration, later UN Secretary-General</li><li>Frankie Adams as Roberta \"Bobbie\" W. Draper (seasons 2–6), an MMC (Martian Marine Corps) gunnery sergeant</li><li>Cara Gee as Camina Drummer (seasons 4–6; recurring seasons 2–3), Tycho Station's Belter head of security, later the leader of the rebel faction opposing the Free Navy</li><li>Keon Alexander as Marco Inaros (seasons 5–6; recurring season 4), a Belter faction leader, later head of the Free Navy</li><li>Jasai Chase Owens as Filip Inaros (seasons 5–6; guest season 4), Marco and Naomi's son, currently working for Marco</li><li>Nadine Nicole as Clarissa Melpomene Mao (seasons 5–6; recurring season 3; guest season 4), Jules-Pierre Mao's elder daughter who initially seeks revenge against Holden, later a crew member on Rocinante</li></ul><h4>Recurring</h4><h4>Introduced in season 1</h4><ul><li>Chad L. Coleman as Fred Lucius Johnson, \"the Butcher of Anderson Station\" (seasons 1–5), a UNN colonel-turned-leader of the OPA on Tycho Station</li><li>Andrew Rotilio as Diogo Harari (seasons 1–3), a young Belter from Ceres in the OPA</li><li>Martin Roach as Michael Souther (seasons 1–3), a UNN admiral</li><li>François Chau as Jules-Pierre Mao (seasons 1–3), the owner of Mao-Kwikowski Mercantile</li><li>Athena Karkanis as Tavi Muss (season 1), Miller's former partner at Star Helix Security</li><li>Jared Harris as Anderson Dawes (seasons 1–2), the OPA's Ceres liaison</li><li>Jay Hernandez as Dmitri Havelock (season 1), Miller's Earther partner at Star Helix Security</li><li>Lola Glaudini as Shaddid (season 1), captain of Star Helix Security's Ceres detachment</li><li>Kevin Hanchard as Sematimba (season 1), a detective on Eros</li><li>Daniel Kash as Antony Dresden (seasons 1–2), Protogen's head of biological research</li><li>Brian George (seasons 1–2; guest, season 6) and Michael Benyaer (season 4) as Arjun Avasarala, Avasarala's husband</li><li>Greg Bryk as Lopez (season 1), an MMC lieutenant assigned to the Martian Congressional Republic Navy (MCRN) Donnager</li><li>Elias Toufexis as Kenzo Gabriel (season 1), a Davila Aerospatiale spy on Tycho Station</li><li>Jean Yoon as Theresa Yao (season 1), captain of the MCRN Donnager</li></ul><h4>Introduced in season 2</h4><ul><li>Nick E. Tarabay as Cotyar Ghazi (seasons 2–3), a security professional working for Avasarala</li><li>Terry Chen as Praxideke \"Prax\" Meng (seasons 2–3; guest, season 6), a botanist from Ganymede</li><li>Leah Jung as Mei Meng (seasons 2–3), Prax's daughter</li><li>Ted Atherton as Lawrence Strickland (seasons 2–3), a pediatrician on Ganymede</li><li>Jonathan Whittaker as Esteban Sorrento-Gillis (seasons 2–3), the UN Secretary General</li><li>Byron Mann as Augusto Nguyễn (seasons 2–3), a UNN admiral</li><li>Mpho Koaho as Richard Travis (season 2), an Earth-born MMC private assigned to the MCRN Scirocco</li><li>Carlos Gonzalez-Vio as Paolo Cortázar (season 2; guest, seasons 5–6), a Protogen scientist</li><li>Peter Outerbridge as Martens (season 2), an MCRN captain and chaplain assigned to the MCRN Scirocco</li><li>Sarah Allen as T. Hillman (season 2), an MMC private assigned to the MCRN Scirocco</li><li>Dewshane Williams as L. Sa'id (season 2), an MMC corporal assigned to the MCRN Scirocco</li><li>Conrad Pla as Janus (season 2), an UNMC colonel assigned to the UNS Arboghast</li><li>Ted Whittall as Michael Iturbi (season 2), a UN scientist assigned to the UNS Arboghast</li><li>Hugh Dillon as Sutton (season 2), an MCRN lieutenant assigned to the MCRN Scirocco</li><li>Jeff Seymour as Pyotr Korshunov (season 2), the former MCR Minister of Defense</li><li>Rachael Crawford as J. Peñano (season 2), an MCRN admiral</li></ul><h4>Introduced in season 3</h4><ul><li>David Strathairn as Klaes Ashford (seasons 3–4), a Belter pirate-turned-executive officer of the OPAS Behemoth</li><li>Elizabeth Mitchell as Anna Volovodov (season 3; guest, season 6), a Methodist pastor and speech writer</li><li>Brock Johnson as Grigori (season 3), a former acquaintance of Ashford's aboard the OPAS Behemoth</li><li>Chris Owens as Kolvoord (season 3), a science officer aboard the UNN Thomas Prince</li><li>Genelle Williams as Tilly Fagan (season 3), a socialite aboard the UNN Thomas Prince who befriends Anna</li><li>Anna Hopkins as Monica Stuart (seasons 3, 5–6), an Earther journalist filming a documentary on the Rocinante</li><li>Jaeden Noel as Katoa Merton (season 3), Mei's friend</li><li>Raven Dauda as Nono Volovodov (season 3), Anna's wife</li><li>Brandon McGibbon as Elio \"Cohen\" Casti (season 3), Monica's technical crewman and camera operator</li><li>Ari Millen as Stanni Kulp (season 3), a Savage Industries electrician assigned to the UNN Thomas Prince</li><li>Paulino Nunes as Hank Cortez (season 3), a priest aboard the UNN Thomas Prince</li><li>Sabryn Rock as Riko Oshi (season 3), an MMC private assigned to the MCRN Xuesen</li><li>Hamed Dar as Jed Trepp (season 3), an MMC private assigned to the MCRN Xuesen</li><li>Atticus Mitchell as Sinopoli (season 3), a MCRN ensign who served aboard the MCRN Kittur Chennamma</li><li>Natalie Lisinska as Shaffer (season 3), a lieutenant aboard the UNN Agatha King who is loyal to Souther</li><li>Morgan Kelly as Mancuso (season 3), a lieutenant aboard the UNN Agatha King who is loyal to Souther</li><li>John Kapelos as Ren Hazuki (season 3), a Savage Industries electrician assigned to the UNN Thomas Prince</li><li>Yanna McIntosh as Chandra Lucas (season 3), captain of the MCRN Askia, later captain of the MCRN Xuesen</li><li>Krista Bridges as Sandrine Kirino (seasons 3, 6), captain of the MCRN Hammurabi</li></ul><h4>Introduced in season 4</h4><ul><li>Burn Gorman as Adolphus Murtry (season 4), chief of security for Royal Charter Energy (RCE) aboard the Edward Israel</li><li>Lyndie Greenwood as Elvi Okoye (season 4; guest, season 6), a biologist working for the RCE</li><li>Rosa Gilmore as Lucia Mazur (season 4), a medical technician on Ilus</li><li>Patti Kim as Carol Chiwewe (season 4), a Belter leader</li><li>Kyla Madeira as Felcia Mazur (season 4), a Belter refugee</li><li>Steven McCarthy as Jakob Mazur (season 4), a Belter refugee</li><li>Dayle McLeod as Leelee (season 4), a thief on Mars</li><li>Jess Salgueiro as Chandra Wei (season 4), corporate security officer</li><li>Zach Smadu as Fayez Sarkis (season 4), a scientist aboard the Edward Israel</li><li>Kolton Stewart as David Draper (season 4), Bobbie's nephew</li><li>Lily Gao as Nancy Gao (seasons 4–5), a candidate for UN secretary-general</li><li>Paul Schulze as Esai Martin (season 4), a corrupt police officer on Mars</li></ul><h4>Introduced in season 5</h4><ul><li>José Zúñiga as Carlos \"Bull\" de Baca (season 5), chief of security on Tycho Station</li><li>Michael Irby as Felix Delgado (season 5), a UN admiral</li><li>Sugith Varughese as David Paster (season 5), a high-ranking UN official</li><li>Brent Sexton as Cyn (season 5), an old friend of Naomi</li><li>Bahia Watson as Sakai (season 5), chief engineer on Tycho station</li><li>Oluniké Adeliyi as Karal (season 5), a henchman in the Inaros faction</li><li>George Tchortov as Leveau (season 5), a Tycho officer who assists Holden</li><li>Sandrine Holt as Oksana Busch (season 5), a member of Drummer's crew</li><li>Samer Salem as Josep (seasons 5–6), a member of Drummer's crew</li><li>Vanessa Smythe as Michio (seasons 5–6), a member of Drummer's crew</li><li>Lara Jean Chorostecki as Emily Babbage (season 5), a Martian lieutenant</li><li>Somkele Idhalama as a Tycho Engineer (season 5), helping Holden pursue the Zmeya</li><li>Jacob Mundell as Erich (season 5), a childhood friend of Amos in Baltimore</li><li>Tim DeKay as Emil Sauveterre (season 5), a Martian admiral</li></ul><h4>Introduced in season 6</h4><ul><li>Gabriel Darku as Yoan, friend of Filip</li><li>Conrad Coates as Sidiqi, a UNN admiral</li><li>Ted Dykstra as Gareth, an aide to Chrisjen Avasarala</li><li>Emma Ho as Cara, young girl colonist on Laconia</li><li>Ian Ho as Xan, young boy colonist of Laconia</li><li>Daniel Jun as Gary, Cara and Xan's father</li><li>Dianne Aguilar as Dot, Cara and Xan's mother</li><li>Stuart Hughes as Liang Walker, a Free Navy captain</li><li>Kathleen Robertson as Rosenfeld Guoliang, second-in-command to Marco Inaros</li><li>Jo Vannicola as Nico Sanjrani, administrator of Ceres Station</li><li>Dylan Taylor as Winston Duarte, former Martian admiral on Laconia</li><li>Vieslav Krystyan as Owain, Belter on Ceres with a cat</li><li>Joe Perry as Tadeo, repair technician onboard the Pella</li></ul><br/><h3>Production</h3><h4>Development</h4><p>The Expanse is based on the novel series of the same name by James S. A. Corey, a pen name of the authors Daniel Abraham and Ty Franck, who also serve as writers and producers for the show. The first novel, Leviathan Wakes (2011), was nominated for the Hugo Award for Best Novel and Locus Award for Best Science Fiction Novel. On September 4, 2013, The Expanse was optioned for television by Alcon Television Group. On April 11, 2014, Syfy announced a straight-to-series commitment to a television adaptation of the book series, and ordered the production of 10 one-hour-long episodes for the first season. On that date Syfy President Dave Howe commented: \"The Expanse is epic in scale and scope and promises to be Syfy's most ambitious series to date\". Mark Fergus and Hawk Ostby wrote the pilot and served as writers and showrunners alongside Naren Shankar.</p><p>Terry McDonough was revealed to be directing the first two episodes of the series in October 2014. In May 2015, before the first season aired, writing commenced for a second season, which was ordered in December 2015. The second season of The Expanse premiered on February 1, 2017. On March 16, 2017, The Expanse was renewed by Syfy for a 13-episode third season to air in 2018. Four digital comics based on the books and tying into the television series have been published by ComiXology. The first focuses on the origin of James Holden and was released February 1, 2017. The next three, highlighting the origins of other characters are: Naomi Nagata, released April 19, 2017; Alex Kamal, released May 24, 2017; and Amos Burton, released July 12, 2017. The show's title sequence was animated and directed by Australian studio Breeder and its VFX team.</p><h4>Cancellation and renewals</h4><p>Alcon Entertainment produces and finances the series. It sold three seasons to Syfy, which canceled the series in May 2018. Fans protested the cancellation, gathering over 100,000 signatures for an online petition. They lobbied Amazon Studios and Netflix to greenlight the fourth season and a crowdfunding campaign paid for an airplane to fly a \"#SaveTheExpanse\" banner around Amazon Studios. Celebrities including Wil Wheaton, George R. R. Martin, Patton Oswalt and Andreas Mogensen supported the campaign. Amazon Prime Video picked up the series for a fourth season, which was released on December 12, 2019. In July 2019, Amazon renewed The Expanse for a fifth season, which premiered on December 15, 2020.</p><p>On November 24, 2020, ahead of the fifth season's release, Amazon renewed the series for a sixth and final season. Filming started in late January 2021. However, the authors of the novels and writers on the series, Daniel Abraham and Ty Franck, have stated that they view season 6 as a \"pause\" rather than a conclusion and that Alcon Entertainment \"is very committed to the IP\", Alcon's Andrew Kosove and Broderick Johnson said that they are \"considering all kinds of interesting possibilities\". On October 8, 2021, it was announced that the sixth and final season would premiere on December 10, 2021.</p><p>In January 2023, it was announced that the continuation of the series, set between Babylon's Ashes and Persepolis Rising, would be adapted into a 12-issue comic book series, The Expanse: Dragon Tooth.</p><h4>Casting</h4><p>In July 2014, Thomas Jane was cast as Joe Miller. In August 2014, Steven Strait and Shohreh Aghdashloo's attachment to the series as James Holden, and Chrisjen Avasarala was announced. October of that same year, Dominique Tipper, Cas Anvar, Paulo Costanzo, and Wes Chatham were cast as Naomi Nagata, Alex Kamal, Shed Garvey, and Amos Burton while Jonathan Banks and Jay Hernandez were announced to be guest starring in the series. One month later, Shawn Doyle was cast as Sadavir Errinwright, while Chad L. Coleman and Jared Harris were cast in the recurring roles of Fred Johnson and Anderson Dawes, respectively. Frankie Adams was cast as Bobbie Draper for the second season in April 2016. On January 21, 2020, Keon Alexander, Nadine Nicole, and Jasai Chase Owens (who portray Marco Inaros, Clarissa Melpomene Mao, and Filip Inaros, respectively), were promoted to the main cast for the fifth season. Later, Lily Gao was cast in a recurring role as Nancy Gao for the fourth and fifth seasons, a candidate for UN secretary-general. Additionally, Anvar did not return for the sixth and final season after being the subject of multiple sexual misconduct allegations.</p><h4>Filming</h4><p>Produced by Alcon Television and The Sean Daniel Company, principal photography on the first season started on October 29, 2014, in Toronto and concluded on March 27, 2015. The second season filmed between April 13, 2016, and September 12, 2016. Filming for season 3 began on July 12, 2017. In February 2019, cast member Lyndie Greenwood announced that the fourth season concluded filming. Filming for the fifth season began on September 23, 2019, and ended on February 21, 2020. Production on the sixth season took place between January 27, 2021, and May 7, 2021. It was impacted by COVID-19 pandemic restrictions, as was post-production of the fifth season.</p><h4>Title sequence</h4><p>The title sequence of the series has been lauded by reviewers for its ability to elegantly and wordlessly convey important information about the worlds in which the series takes place. The title sequence was created by Breeder, a motion graphics design studio in Brisbane, Australia. Drawing comparisons to the opening sequence of Game of Thrones, Jason Morehead of Opuszine notes that not only does it depict the development of Earth's expansion into the solar system, it introduces the viewer to the political dynamics within the series. \"Earth is the old guard, intent on controlling the system and her former colonies; technologically advanced Mars is driven to become a paradise; and the Belt is fighting to keep from being treated as a second-class citizen by both Earth and Mars.\"</p><p>While the title sequence does change visually as the series progresses, the lyrics that accompany Clinton Shorter's title theme – written and performed by Lisbeth Scott – remain the same. Scott noted in a post on Facebook that her words were drawn from Norwegian, though she apologized for any errors in syntax, grammar and pronunciation.</p><h4>Music</h4><p>The show's soundtrack was composed by Shorter. The first season's soundtrack dubbed The Expanse Season 1 – The Original Television Soundtrack, consisting of nineteen tracks, was released by Lakeshore Records, on May 20, 2016, via iTunes, and on May 26, 2016, via Amazon.</p><h4>Language</h4><p>The Belter characters speak Belter Creole, an invented language created for the show by linguist Nick Farmer; these characters speak English with a distinctive accent. As explained in one article, \"People who have migrated to the Belt come from all over Earth speaking dozens of languages, and they're often isolated for years at a time on remote mining stations. To communicate, they evolve a creole called Belter, which becomes the lingua franca for what is essentially the solar system's new proletariat.\"</p><h4>Genre and themes</h4><p>The series has been described as a space opera by critics. Emily VanDerWerff of Vox describes the first season of the series to be a \"blend of science fiction and noir-infused detective drama, with a backdrop of political intrigue\". Vice has referred to the series as a \"sci fi noir mystery-thriller\" and as hard science fiction. Opposed to the latter, the source books' authors define their approach as aiming for a \"Wikipedia level of plausibility\".</p><p>Prior to the series premiere, Mark Fergus spoke of the series's Western themes: \"Everywhere is kind of back to the frontier rules so it gives us all that stuff back that we lost. Cellular technology. You can get a little more Western about it.\" The fourth season, according to the writers, also had \"space Western vibes\".</p><p>Analyzing the show, Tech Times wrote that The Expanse \"...is more than just a science fiction show about people traveling the solar system in spaceships. It ... covers ... politics, poverty, oppression, discrimination, and the struggle for resources in harsh environments.\"</p><br/><h3>Release</h3><p>The pilot episode was screened at San Diego Comic-Con in July 2015. In the United States, seasons 1 to 3 of The Expanse were broadcast by Syfy and streamed on Amazon Prime Video. In Canada, these seasons aired on Space and streamed on Crave. In New Zealand, these seasons aired on Sky. In all other countries where Netflix is available, seasons 1 and 2 were streamed until September 2018. On February 8, 2019, Prime Video took over exclusive distribution of the first three seasons worldwide in preparation for premier of the fourth season in 2019.</p><br/><h3>Reception</h3><h4>Critical response</h4><h4>Season 1</h4><p>On Rotten Tomatoes, the first season has a score of 78% with an average rating of 7.1 out of 10 based on 46 reviews. The site's consensus states: \"The Expanse blends sci-fi elements and detective noir into a visually compelling whole, though it takes a few episodes for the story to capture viewers' intrigue.\" The first season received a rating of 65 out of 100 on Metacritic based on reviews from 23 critics, indicating \"generally favorable reviews\". Reporting on the pilot screening, io9's Lauren Davis declared herself \"blown away\" by The Expanse, appreciating its \"incredible sense of scale\" and its \"deeply thought out future world that reflects on our present one, with high production values and characters who speak and act like real people\". Max Nicholson of IGN characterized the pilot as \"grim and dramatic\", and a \"very dense hour of television\", with the terminology and large cast sometimes difficult to follow for viewers unfamiliar with the novels, but highlighted the pilot's \"gorgeous\" visuals and effects reminiscent of Battlestar Galactica, Dune and Firefly. Writing for Variety, Maureen Ryan was unimpressed by the first four episodes \"awkwardly linking a series of somewhat muddled stories\" and the series's stereotypical characters but credited it with tackling \"issues of class, representation and exploitation\" and a convincing design. At Tor.com, Justin Landon highlighted The Expanse's \"bold and unique cinematography\" and its claustrophobic, discomforting set designs, as well as the \"extremely faithful\" characterization, but remarked that the patois spoken by the Belters, the natives of the asteroid belt, made the series difficult to follow.</p><h4>Season 2</h4><p>On Rotten Tomatoes, the season has a score of 95% with an average rating of 9 out of 10 based on 21 reviews. The site's critical consensus reads, \"The Expanse's second season offers more of the show's excellent signature production values while increasing character development and politically thrilling narratives.\" On Metacritic, it has a score of 77 out of 100 based on 5 reviews. Writing for io9, Katherine Trendacosta noted how the show had become \"shockingly prescient\", insofar as many of the issues and ideas explored by The Expanse mirrored contemporary trends in global politics. Brian Tallerico, in \"Why The Expanse Is the Best Sci-FI TV Show You're Not Watching\" for Rolling Stone, praised the show for its contemporary political relevance and called its willingness to mix tones, and its protagonists, laudable. He summarized that at its core, The Expanse was all about people responding to fear – fear of the other, fear of the new, fear of inequality, fear of death. Writing for 13.7: Cosmos & Culture, a blog hosted by NPR, astrophysicist Adam Frank praised the show and its writers for the scientific realism. He wrote that \"more than any other TV space-themed show, it gets the science right\".</p><h4>Season 3</h4><p>On Rotten Tomatoes, the season has a score of 100% with an average rating of 8.6 out of 10 based on 26 reviews. The site's critical consensus reads, \"Building on earlier potential and extending character arcs throughout a solidly crafted third season, The Expanse continues to impress – and shows no signs of abating.\" Michael Ahr of Den of Geek said the series \"wowed fans with its complex characters, its political intrigue, its attention to scientific authenticity, and its stunningly good visual effects, and with several more books in the series that inspired the show, there's plenty more source material for the adaptation to explore in future seasons.\" Liz Shannon Miller of IndieWire praised the performances of Coleman and Strait in the absence of the Joe Miller character, saying \"In general, while the mid-Season 2 departure of Joe Miller (Thomas Jane) and his wonderful hats does leave a bit of a vacuum, the ensemble has coalesced nicely, with both established performers like Chad L. Coleman and relative newcomers like Strait settling into their roles.\" Speaking about the premiere, Kevin Yeoman said, \"All in all ... season three begins by dramatically raising the immediate stakes of the story without drastically altering the dynamics of the show itself.\"</p><h4>Season 4</h4><p>On Rotten Tomatoes, the season has a score of 100% with an average rating of 9 out of 10 based on 34 reviews. The site's critical consensus reads, \"Smart and thrilling as ever, The Expanse's fourth season doesn't miss a beat, successfully navigating network changes without losing any of its rich character work or narrative complexities.\" The season received a rating 91 out of 100 on Metacritic based on reviews from 4 critics indicating \"universal acclaim\". Writing for Den of Geek, Michael Ahr gave it a 5/5 review and wrote, \"With its brilliantly crafted, multilayered plot, The Expanse season four proves itself worthy of Amazon's rescue in a nearly perfect season.\" Sadie Gennis of TV Guide also praised the fourth season, giving it a score of 4.5/5.</p><h4>Season 5</h4><p>On Rotten Tomatoes, the season has a score of 100% with an average rating of 8.7 out of 10 based on 32 reviews. The site's critical consensus reads, \"The Expanse's many threads come to a head in an excellent fifth season that expertly capitalizes on everything that makes the show work while setting the stage for an epic final season.\" The season received a rating 82 out of 100 on Metacritic based on reviews from 5 critics indicating \"universal acclaim\".</p><h4>Season 6</h4><p>On Rotten Tomatoes, the season has a score of 95% with an average rating of 8.6 out of 10 based on 20 reviews. The site's critical consensus reads, \"The Expanse's truncated final season honors the series' characters and themes with a graceful conclusion.\"</p><h4>Ratings</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><style data-mw-deduplicate=\"TemplateStyles:r1152813436\">.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);clip-path:polygon(0px 0px,0px 0px,0px 0px);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px;white-space:nowrap}</style><span class=\"sr-only\">Viewership and ratings per season of <i>The Expanse</i></span></caption><tbody><tr><th scope=\"col\" rowspan=\"2\">Season</th><th scope=\"col\" rowspan=\"2\">Timeslot (<span>ET</span>)</th><th scope=\"col\" rowspan=\"2\">Episodes</th><th scope=\"col\" colspan=\"2\">First aired</th><th scope=\"col\" colspan=\"2\">Last aired</th><th scope=\"col\" rowspan=\"2\"><abbr title=\"Average\">Avg.</abbr> viewers<br>(millions)</th><th scope=\"col\" rowspan=\"2\"><abbr title=\"Average\">Avg.</abbr> 18–49<br>rating</th></tr><tr><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(millions)</th><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>1</span></th><td rowspan=\"1\">Monday 10:00pm <span style=\"font-size:85%;\">(premiere)</span><br>Tuesday 10:00pm</td><td>10</td><td>December 14, 2015</td><td>1.19</td><td>February 2, 2016</td><td>0.555</td><td rowspan=\"1\">0.703</td><td rowspan=\"1\">0.22</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>2</span></th><td rowspan=\"1\">Wednesday 10:00pm</td><td>13</td><td>February 1, 2017</td><td>0.700</td><td>April 19, 2017</td><td>0.581</td><td rowspan=\"1\">0.562</td><td rowspan=\"1\">0.18</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>3</span></th><td rowspan=\"1\">Wednesday 9:00pm</td><td>13</td><td>April 11, 2018</td><td>0.653</td><td>June 27, 2018</td><td>0.606</td><td rowspan=\"1\">0.606</td><td rowspan=\"1\">0.18</td></tr></tbody></table><p>Season four was the first season not to be broadcast on live TV and not get weekly viewership ratings. The season ranked fourth in most watched digital original in the United States in December 2019.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Year</th><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Nominee(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference(s)\">Ref.</abbr></th></tr><tr><td rowspan=\"4\">2016</td><td><span>Directors Guild of Canada Awards</span></td><td>Best Sound Editing – Television Series</td><td data-sort-value=\"Ferriera, Nelson\">Nelson Ferriera, Nathan Robitaille, Dustin Harris, Tyler Whitham, Dashen Naidoo<br><span style=\"font-size:85%;\">(for \"The Big Empty\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Saturn Awards</span></td><td><span>Best Science Fiction Television Series</span></td><td data-sort-value=\"Expanse, The\"><i>The Expanse</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span class=\"mw-redirect\">Visual Effects Society Awards</span></td><td>Outstanding Visual Effects in a Photoreal Episode</td><td data-sort-value=\"Munroe, Robert\">Robert Munroe, Clint Green, Kyle Menzies, Tom Turnbull<br><span style=\"font-size:85%;\">(for \"Salvage\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Dragon Awards</span></td><td>Best Science Fiction or Fantasy TV Series</td><td data-sort-value=\"Expanse, The\"><i>The Expanse</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"4\">2017</td><td>Directors Guild of Canada Awards</td><td>Outstanding Directorial Achievement in Dramatic Series</td><td data-sort-value=\"Lieberman, Robert\">Robert Lieberman <span style=\"font-size:85%;\">(for \"Rock Bottom\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>Dragon Awards</td><td>Best Science Fiction or Fantasy TV Series</td><td data-sort-value=\"Expanse, The\"><i>The Expanse</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Hugo Awards</span></td><td><span>Best Dramatic Presentation, Short Form</span></td><td data-sort-value=\"Fergus, Mark\">Mark Fergus, Hawk Ostby and Terry McDonough<br><span style=\"font-size:85%;\">(for \"Leviathan Wakes\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Saturn Awards</span></td><td>Best Science Fiction Television Series</td><td data-sort-value=\"Expanse, The\"><i>The Expanse</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"4\">2018</td><td>Directors Guild of Canada Awards</td><td>Best Sound Editing – Television Series</td><td data-sort-value=\"Ferriera, Nelson\">Nelson Ferriera, Kevin Banks, Nathan Robitaille, Dustin Harris, Tyler Whitham, Dashen Naidoo<br><span style=\"font-size:85%;\">(for \"Home\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>People's Choice Awards</span></td><td>The Sci-Fi/Fantasy Show of 2018</td><td data-sort-value=\"Expanse, The\"><i>The Expanse</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Saturn Awards</span></td><td>Best Science Fiction Television Series</td><td data-sort-value=\"Expanse, The\"><i>The Expanse</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>Dragon Awards</td><td>Best Science Fiction or Fantasy TV Series</td><td data-sort-value=\"Expanse, The\"><i>The Expanse</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"3\">2019</td><td>Directors Guild of Canada Awards</td><td>Best Picture Editing – Dramatic Series</td><td data-sort-value=\"Roque, Stephen\">Stephen Roque <br><span style=\"font-size:85%;\">(for \"Abaddon's Gate\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>Hugo Awards</td><td>Best Dramatic Presentation, Short Form</td><td data-sort-value=\"Abraham, Daniel\">Daniel Abraham, Ty Franck, Naren Shankar, &amp; Simon Cellan Jones<br><span style=\"font-size:85%;\">(for \"Abaddon's Gate\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Saturn Awards</span></td><td>Best Streaming Science Fiction, Action &amp; Fantasy Series</td><td data-sort-value=\"Expanse, The\"><i>The Expanse</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\">2020</td><td>Hugo Awards</td><td>Best Dramatic Presentation, Short Form</td><td data-sort-value=\"Abraham, Daniel\">Daniel Abraham, Ty Franck, Naren Shankar, &amp; Breck Eisner<br><span style=\"font-size:85%;\">(for \"Cibola Burn\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"1\" style=\"text-align:center;\"></td></tr><tr><td>Dragon Awards</td><td>Best Science Fiction or Fantasy TV Series</td><td data-sort-value=\"Expanse, The\"><i>The Expanse</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"6\">2021</td><td><span>Nebula Awards</span></td><td><span>Outstanding Dramatic Presentation</span></td><td data-sort-value=\"Nowak, Dan\">Dan Nowak, Amazon Prime <br><span style=\"font-size:85%;\">(for \"Gaugamela\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"1\" style=\"text-align:center;\"></td></tr><tr><td>Dragon Awards</td><td>Best Science Fiction or Fantasy TV Series</td><td data-sort-value=\"Expanse, The\"><i>The Expanse</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td>Hugo Awards</td><td>Best Dramatic Presentation, Short Form</td><td data-sort-value=\"Nowak, Dan\">Dan Nowak, Nick Gomez <br><span style=\"font-size:85%;\">(for \"Gaugamela\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"1\" style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\">Directors Guild of Canada Awards</td><td>Best Picture Editing – Dramatic Series</td><td data-sort-value=\"Deogrades, Roderick\">Roderick Deogrades<br><span style=\"font-size:85%;\">(for \"Winnipesaukee\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td>Best Sound Editing – Dramatic Series</td><td data-sort-value=\"Ferriera, Nelson\">Nelson Ferreira, Alex Bullick, Dustin Harris, Josh Brown, Craig MacLellan, Ayaz Kamani<br><span style=\"font-size:85%;\">(for \"Gaugamela\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Saturn Awards</span></td><td>Television Spotlight Award</td><td data-sort-value=\"Expanse, The\"><i>The Expanse</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"3\">2022</td><td><span>Writers Guild of America Awards</span></td><td>Adapted Short Form New Media</td><td data-sort-value=\"Chatham, Wes\">Wes Chatham, Julianna Damewood, Glenton Richards<br><span style=\"font-size:85%;\">(for <i><span>The Expanse: One Ship</span></i>)</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>Hugo Awards</td><td>Best Dramatic Presentation, Short Form</td><td data-sort-value=\"Abraham, Daniel\">Daniel Abraham, Ty Franck, and Naren Shankar<br><span style=\"font-size:85%;\">(for \"Nemesis Games\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\" style=\"text-align:center;\"></td></tr><tr><td rowspan=\"1\"><span>Saturn Awards</span></td><td>Best Science Fiction Series (Streaming)</td><td><i>The Expanse</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"1\" style=\"text-align:center;\"></td></tr></tbody></table><br/><h3>Other media</h3><h4>The Expanse: A Telltale Series</h4><p>During The Game Awards 2021, a reveal trailer announced The Expanse: A Telltale Series which would be co-developed by Deck Nine Games and Telltale Games. The game will be a prequel to the TV series and Cara Gee will be reprising her role as Camina Drummer, who is the executive officer onboard a scavenger ship named Artemis. Episode one of the game is expected to be released in summer 2023 and be published by Telltale Games for PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S, and the Epic Games Store on PC.</p><h4>Aftershow and podcast</h4><p>Beginning December 16, 2020, Wes Chatham and Ty Franck started hosting weekly programs that feature behind-the-scenes information about the series, first as The Expanse Season 5 Aftershow after each season's episode. Upon the conclusion of Season 5 (after the airing of the season 5 finale), they continued on Wednesdays as Ty & That Guy Podcast, covering each series' episode, from The Expanse S1E1, additionally discussing their inspirations from genre culture, and occasionally having guests both related and not to the series. The Expanse Season 6 Aftershow with Chatham and Franck, produced by Amazon Studios, was distributed by Amazon Prime Video and Ty & That Guy Podcast in video and audio formats.</p><br/>"
  },
  "errorMessage": ""
}