{
  "imDbId": "tt6769208",
  "title": "Blue Planet II",
  "fullTitle": "Blue Planet II (TV Series 2017–2017)",
  "type": "TVSeries",
  "year": "2017",
  "items": [
    {
      "username": "thespookybuz",
      "userUrl": "https://www.imdb.com/user/ur64238818",
      "reviewLink": "https://www.imdb.com/review/rw3844568",
      "warningSpoilers": false,
      "date": "29 October 2017",
      "rate": "10",
      "helpful": "98 out of 99 found this helpful.",
      "title": "Blue is the new Blue",
      "content": "Much will probably be discussed about the genuinely stunning photography in this series but it cannot be underplayed enough: it is imperious.Beautiful, beautiful shots of wonderful creatures going about their daily lives, together with informative narration and innovation. All rounded off accompanied by a blockbuster-movie-standard score which soars and settles with the visuals.This series took around four years to film, and I can only imagine what the poor editors had to leave out.Worthy of a mention is the astounding super-slow motion on display. In oceans so vast, we can see single droplets! It is a brilliant series for all ages.The BBC is unsurpassed at this type of documentary. And to think, the BBC costs UK taxpayers about 50 pence per day and some people think it should be cut down/split up/privatised. I really hope this doesn't happen as, yes, the BBC has faults like many broadcasters, but when it does something like this, it really cannot be beaten.Watch this with your children, or your partner, or on you own. It doesn't matter, just watch it. And experience some awe."
    },
    {
      "username": "Bert45",
      "userUrl": "https://www.imdb.com/user/ur8669765",
      "reviewLink": "https://www.imdb.com/review/rw3856381",
      "warningSpoilers": false,
      "date": "12 November 2017",
      "rate": "10",
      "helpful": "18 out of 19 found this helpful.",
      "title": "Sensational television",
      "content": "I watched the first installment of Blue Planet II with high hopes last night and it was everything I had hoped for. Once again, the BBC/David Attenborough-led team of international wildlife photographers has come up with a sensational piece of television documentary-making - updating and enriching the theme of the original Blue Planet series 10 years ago. You might think you could not be any more entranced by pods of dolphins swimming, until you see the spectacular footage of them surfing for pleasure in huge waves. And to then see a large pod of dolphins rendezvous with another species in a way never seen before, shows us that this is indeed a new way of looking at nature. I will be glued to the rest of the series to see just how much more the latest underwater filming techniques can show us about the seas - but also to hear the salient warning about how badly we are wrecking this Blue Planet of ours. I suggest the BBC make a gift of a boxed set of this series to every national leader on Earth - with a message that says: the future of all this is in YOUR hands."
    },
    {
      "username": "peterjdickinson",
      "userUrl": "https://www.imdb.com/user/ur81829689",
      "reviewLink": "https://www.imdb.com/review/rw3856658",
      "warningSpoilers": false,
      "date": "13 November 2017",
      "rate": "10",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Unbelievably good",
      "content": "The first two episodes seemed to me to be among the best episodes of a TV documentary I had ever seen. Then, yesterday, episodes 3 came along and took things to a whole new level.It was beautiful and informative beyond words. The producers have created something very special which will be viewed with awe and admiration for many years to come. Blue Planet II is easily one of the classiest productions ever made and everyone involved deserves a round of applause. The small glimpses into how this incredible show was created are very welcome but, in all honesty, you could probably have a 7 part series devoted to just that. Brilliant TV."
    },
    {
      "username": "bushd0",
      "userUrl": "https://www.imdb.com/user/ur23857360",
      "reviewLink": "https://www.imdb.com/review/rw3845434",
      "warningSpoilers": false,
      "date": "30 October 2017",
      "rate": "10",
      "helpful": "53 out of 56 found this helpful.",
      "title": "Absolutely epic",
      "content": "If you loved the first installment of the series, you'll love this too, no questions asked. Do yourself a favor and stop using your eyes for reading and go watch it now. I still have to write 2 more lines but I'll put down some random nonsense until you stop reading this and go watch it. 10/10"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3875555",
      "warningSpoilers": false,
      "date": "6 December 2017",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "The Beautiful Deep Blue",
      "content": "David Attenborough, as has been said many times, is wholly deserving of being called a national treasure, although it is a term he happens to not like. He has done so many treasures and even his lesser output of a long and consistently impressive career is still good.Absolutely adore the first 'The Blue Planet', one of my favourites of his, so was psyched to hear that there was a second 'Blue Planet' series. Luckily, 'Blue Planet II' turned out to be every bit as amazing, easily a highlight of 2017 television (a strong contender for the best BBC produced one and the best nature documentary series) and one of not many 2017 dramas/series that had me looking forward to see the entire lot. This is saying a lot, seeing as apart from the odd gem 2017 has not seen me watching new television by habit, often find myself seeing re-runs or films.OK, so 'Blue Planet II' may not be as ground-breaking as 'The Blue Planet' and not everything is new here. This doesn't matter, because 'Blue Planet II' is just as beautiful to watch, non-stop transfixing, educational, inspirational and emotionally complex.Visually, 'Blue Planet II' was, as it was with 'The Blue Planet' and the best of Attenborough's work, a wonder. It has gorgeous scenery and rich colours, while the animals and marine life are captured in all their glory. Standing out even more is the photography, the underwater sequences are just as stunning as 'The Blue Planet' (unequalled when it comes to underwater sequences).While not with the involvement of George Fenton, the music here soars, rouses just as much and touches the soul just as much, definitely worthy of cinematic quality. It not only complements the visuals but enhances them to a greater level.Really can't fault the narrative aspects in 'Blue Planet II' either. There are things already known to me, still delivered with a lot of freshness, but there was a lot that was quite an education and after watching the full series it honestly felt like the series taught me a lot about the mysteries of the ocean and the marine life that inhabit it. One episode explores the consequences of environmental waste and, while it may seem out of place for some, it was very much relevant and important and well-handled.Attenborough's narration helps quite significantly too, he clearly knows his stuff and knows what to say and how to say it. He delivers it with his usual richness, soft-spoken enthusiasm and sincerity, never talking down to the viewer and keeping them riveted and wanting to know more.'Blue Planet II' has a lot of effective scenes. It's not easy picking a standout, because there is a lot of emotional complexity here. There are shockingly gut-wrenching moments, especially the whale carcass (a strong contender for the most shocking scene of 2017). There are emotional moments, such as the mother with the dead calf. There are tense moments like the octopus and the shark. There are awe-inspiring moments like with the dolphins. There are also moments of great surprise, like in the first episode where one expects a bird to fall prey to an underwater predator but instead something that one cannot believe was able to be filmed let alone found happens.Nothing episodic or repetitive here. Instead, it feels like its own individual story with real, complex emotions and conflicts. One roots for the animals, whether prey or predator. The behind the scenes footage \"The Deep Blue\" brings honesty and humanity, what the crew go through and how they work against sometimes volatile conditions makes the viewer feel admiration for them.In short, utterly amazing and calling 'Blue Planet II' a must watch does it no justice. 10/10 Bethany Cox"
    },
    {
      "username": "farshidkarimi",
      "userUrl": "https://www.imdb.com/user/ur69859630",
      "reviewLink": "https://www.imdb.com/review/rw3847520",
      "warningSpoilers": false,
      "date": "2 November 2017",
      "rate": "9",
      "helpful": "16 out of 19 found this helpful.",
      "title": "An Enthralling Masterpiece",
      "content": "From space, astronauts describe the earth as a magnificently bluish sphere, standing out against a dark backdrop. The earth is an inspiring gift bestowed on us human beings to appreciate the nature, the animals, the oceans and the universe. Oceans constitute a major part of this gift, showcasing a vast spectrum of glorious animals and a boundless array of phenomena. These animals are the gems festooning the oceans, living harmoniously together, creating vast treasure troves for us to behold and ponder over, to take delight in discovering. The oceans are the arteries of life pulsating throughout the Planet Earth, reminding us of the splendor and also fragility of rainbow of life hanging majestically over the Earth. This stunning series awakens in us the respect for life and the gift given to us, reminding us of how enchanting oceans are and the animals that make a large and beautiful part of this awesome Life on earth.I hope more people, more politicians, more religious zealots are brought to watch series like this to appreciate and respect the glory of life on Planet Earth and in the Blue Planet. It may cast a spell on them to stop the destruction of this magnificent life, as it did on me watching it.I once again bow to the people involved in the creation of this sparkling diamond of a documentary and wish that Sir David Attenborough live for many years to mesmerize us with his iconic narration and voice."
    },
    {
      "username": "gregoryblanch88",
      "userUrl": "https://www.imdb.com/user/ur55939332",
      "reviewLink": "https://www.imdb.com/review/rw3859291",
      "warningSpoilers": false,
      "date": "16 November 2017",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Eye wide, mouth open, in awe",
      "content": "This series had me reaching for the thesaurus as I simply don't have enough words to encompass its utter brilliance. Time after time I caught myself exclaiming out loud \"OMG\" or \"whooaaah\" - inarticulate I know but so overwhelming is the impact the brain cannot cope. The only documentary to ever come close in Planet Earth II from the same source - it's difficult to imagine anything topping this duo, ever.This time around there is more storytelling to accompany the visual feast, and its a welcome enhancement. The sad and devastating truth is that this may be the last time the ocean looks this way - if we let it degrade our descendants will rightly despise us.You must see this - there are no excuses."
    },
    {
      "username": "alexmarchant",
      "userUrl": "https://www.imdb.com/user/ur81983509",
      "reviewLink": "https://www.imdb.com/review/rw3848892",
      "warningSpoilers": false,
      "date": "3 November 2017",
      "rate": "10",
      "helpful": "38 out of 39 found this helpful.",
      "title": "Unbelievable",
      "content": "Anyone who saw the first installment remembers the feeling of awe they had, listening to David telling us of the Deep Blue. Somehow they have outdone this. The mysteries of the ocean are unveiled in this masterpiece of film in which I feel is an unparalleled feat of modern cinematography. Can give it no higher praise, an educational delight and simply unmissable."
    },
    {
      "username": "gb-sity",
      "userUrl": "https://www.imdb.com/user/ur26827060",
      "reviewLink": "https://www.imdb.com/review/rw3846383",
      "warningSpoilers": false,
      "date": "31 October 2017",
      "rate": "10",
      "helpful": "27 out of 28 found this helpful.",
      "title": "A great reminding that we all live because of the oceans.",
      "content": "The visuals are spectacular. Very inspiring documentary.Makes you want to leave everything and embrace the beauty of the ocean. Let's hope it will raise awareness about climate change and how much it affects the oceans because oceans maintain life on the Planet, oceans are the Guardians of the Planet. Hats-off to the team who worked so much on this!"
    },
    {
      "username": "davidjum",
      "userUrl": "https://www.imdb.com/user/ur29118522",
      "reviewLink": "https://www.imdb.com/review/rw3847128",
      "warningSpoilers": false,
      "date": "1 November 2017",
      "rate": "10",
      "helpful": "31 out of 33 found this helpful.",
      "title": "There is still hope",
      "content": "Watching this masterpiece of a documentary, I do believe that, if we all contribute and change our way of life to a more respectful and sustainable way, the oceans and the planet still will have a chance to survive the human species. This documentary it should be shown in every school and broadcasting worldwide, so everyone could appreciate the raw beauty of our planet and that we have to do EVERYTHING in our power to save it, starting from NOW. There is still hope, we just have to believe and fight for it, It is worth it."
    },
    {
      "username": "dtalbot-1",
      "userUrl": "https://www.imdb.com/user/ur13916041",
      "reviewLink": "https://www.imdb.com/review/rw3871897",
      "warningSpoilers": true,
      "date": "1 December 2017",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "The BBC and Sir David at their best",
      "content": "This is the BBC back to doing what it does best, world spanning documentary that takes years to film with little though on the commercial aspects (though I am sure this will make the BBC a fortune in years to come). Stunning filming with every episode seeming to make at least one genuine scientific discovery, spanning the world from pole to pole and across every ocean and most of the seas showing astonishing behaviour from familiar animals (I challenge every single one of the British MPs who recently voted to say animals have no sentience and can't feel emotion to watch the whale cradling her dead calf or the octopus outsmarting the shark) and stunning creatures stranger than any science fiction alien. Sit back, enjoy and learn!"
    },
    {
      "username": "paul-allaer",
      "userUrl": "https://www.imdb.com/user/ur48675674",
      "reviewLink": "https://www.imdb.com/review/rw4044734",
      "warningSpoilers": false,
      "date": "26 January 2018",
      "rate": "9",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Jaw-dropping photography makes this a must-see documentary series",
      "content": "Less than 2 years ago, we received another batch of David Attenborough-hosted and narrated (and BBC-produced) nature documentaries in \"Plane Earth II\", and now already comes a new round in the form of \"Blue Planet II\", which is of course the sequel to the original \"Blue Planet\" series from 2001, yes almost 2 decades ago. In the opening moments of \"One Ocean\", the first episode of \"Blue Planets II\", Attenborough explains that since 2001, there has been a breakthrough both in science and in technology as to the filing of life in the oceans, and hence the time has come to revisit the 'blue planet\".Couple of comments: while I've had an HD TV for a couple of years, it's only been about a year that I actually get all my TV channels in high definition, and what a difference this has made. The photography in \"Blue Planet II\" is so amazing, it's like sitting IN the water and experiencing it in person. I honestly can't think of another documentary series that features this kind of jaw-dropping photography. And while the photography gets all of the acclaim, kudos to the documentary makers for bringing us some fascinating stories as such (check out the fish that breaks open the clam shell, \"all without hands\" adds Attenborough jokingly, or the devastating effects of the shrinking ice cover in the Arctic on the walrus, especially the females who need to provide places to rest to their young ones, etc. etc.). Yes, the documentary makes do address climate change but it's done in a very respectful way.\"One Ocean\" premiered this past weekend, and thankfully \"Blue Planet II\" has 6 more episodes to go (\"The Deep\", \"Coral Reefs\", \"Big Blue\", \"Green Seas\", \"Coasts\", and \"Our Blue Planet\"). Episodes originally airs 9 pm on Saturdays on BBC America, and then available On Demand (at least on Spectrum), and of course are also available on Amazon Instant Video. If you love or enjoy nature documentaries, you should absolutely not miss this. \"Blue Planet II\" is a WINNER."
    },
    {
      "username": "ellimic",
      "userUrl": "https://www.imdb.com/user/ur45663621",
      "reviewLink": "https://www.imdb.com/review/rw4033308",
      "warningSpoilers": false,
      "date": "15 January 2018",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "An incredible series",
      "content": "A fantastic series with brilliant filming, David Attenborough is great as ever. Very good how they showed the impact of humans to the seas and oceans."
    },
    {
      "username": "adam-whitmore",
      "userUrl": "https://www.imdb.com/user/ur23633243",
      "reviewLink": "https://www.imdb.com/review/rw4021165",
      "warningSpoilers": false,
      "date": "2 January 2018",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Expands one's view of life",
      "content": "Many movies and television series claim to push the boundaries. This one really does. As the material about the making of the series (at the end of each episode and online) shows, the four years it took to make included a record depth for a manned submersible dive in Antarctica, round the clock diving to make sure they did not miss a once-a-year event at a remote island, coping with huge sharks attacking the crew's submarine, deploying a range of novel filming technologies, and taking so much time under water that they were able to record behaviours never seen before. Around a thousand hours of shooting were needed for each hour of programme. The results are genuinely sublime, with an astonishing range of natural wonders captured by photography that is surely peerless in its beauty, range and consistency. Skilful editing and commentary helps bring each of the subjects to life. Evocative music and sound effects may irritate some but for me, and I expect most others, these add to the impact. The conservation message is there in part in most episodes, emerging into its own in the final episode, but really the whole series is a uniquely powerful plea for the conservation of the oceans. Beyond that there is not much to say except \"see it\"."
    },
    {
      "username": "gerzac",
      "userUrl": "https://www.imdb.com/user/ur82115297",
      "reviewLink": "https://www.imdb.com/review/rw3853062",
      "warningSpoilers": false,
      "date": "8 November 2017",
      "rate": "10",
      "helpful": "15 out of 17 found this helpful.",
      "title": "The Greatest",
      "content": "This is by far the best BBC Natural History program I have watched this year(besides Spy in the Wild). It just keeps getting better. Especially with Attenborough, Zimmer, Buck Taylor, and everyone else. For me, and possibly others, this is a solid 10/10. As I write this, One Ocean and The Deep have already come out. It truly is a window of hope in a world being destroyed before us."
    },
    {
      "username": "SameerAls",
      "userUrl": "https://www.imdb.com/user/ur22337048",
      "reviewLink": "https://www.imdb.com/review/rw4264876",
      "warningSpoilers": false,
      "date": "2 August 2018",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Masterpiece",
      "content": "Blue Planet II is simply fantastic. This is among the few best documentaries for our Blue Planet indeed. This educational documentary gives you the excitement when you see the amazing things that live in the oceans. They show the human impact on marine life and how we can save them. I like the first part of this documentary as well which came in 2001."
    },
    {
      "username": "cumnersr",
      "userUrl": "https://www.imdb.com/user/ur90583105",
      "reviewLink": "https://www.imdb.com/review/rw4256548",
      "warningSpoilers": false,
      "date": "28 July 2018",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Outstanding series; essential viewing",
      "content": "This series explores, with stunning video footage, the range of underwater habitats that make up our fragile blue planet. Despite making up 70% of the Earth our oceans are still poorly understood. David Attenborough and his BBC team do an excellent job of educating us about the interactions that are taking place in the depths of the oceans and in the shallows of coral reefs. The final episode should be required viewing for everyone. It tells of the immediate issues that need to be addressed if we are to restore the health of the oceans. A place that provides over half the oxygen that we breathe has to be a top priority. David Attenborough tells us how we all can help. There is no time to waste - reduce your carbon dioxide output to cut back on global warming and ocean acidification and use less plastic which has proved a major hazard to ocean life."
    },
    {
      "username": "valwauthor",
      "userUrl": "https://www.imdb.com/user/ur116558576",
      "reviewLink": "https://www.imdb.com/review/rw5647087",
      "warningSpoilers": false,
      "date": "16 April 2020",
      "rate": "9",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Extraordinary photography",
      "content": "I loved each and every episode and actually taped them to rewatch. The only reason I didn't rank the series with a 10 was the soporific tones of David Attenboro's voice. Unfortunately, he relaxed me so well I often dozed off, hence the reason for taping. :)"
    },
    {
      "username": "Gremlyn70",
      "userUrl": "https://www.imdb.com/user/ur47557016",
      "reviewLink": "https://www.imdb.com/review/rw4393130",
      "warningSpoilers": false,
      "date": "12 October 2018",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Can't be less than a 10 can it?",
      "content": "If this isn't a 10 rated program I don't know what is. Peerless photography with of course the best possible narrator who not only brings gravitas to the subject but genuine care, emotion. This subject that's not only hugely interesting but increasingly topical and important in our consideration of how we act in the world."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw6616191",
      "warningSpoilers": false,
      "date": "20 February 2021",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Astonishng",
      "content": "If possible do watch this as big as you can. While I cannot look into the future and make a case what that would look like (no pun intended), I can only say that I watched this on a 4k TV, which really brings out ... quite a lot to say the least. You have to have a certain curiosity about the planet you live on and about the other inhabitants of it. In other words, you should love animals. Even the ones that may look either fearful or just plain ugly.And while the show is not able to show everything (there are still so many mysteries either hidden in the depth or just not surveyed long enough), it is quite comprehensive and lenghty to say the least. Of course you will get the obvious animals (sharks, dolphins, penguins), but there will be some that you might not have heard of before.A very fine show with a really great track explaining and narrating things."
    },
    {
      "username": "tim-07347",
      "userUrl": "https://www.imdb.com/user/ur82868568",
      "reviewLink": "https://www.imdb.com/review/rw4294759",
      "warningSpoilers": false,
      "date": "20 August 2018",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Absolutely Stunning",
      "content": "Outstanding cinematography. Outstanding narration. Outstanding research and storytelling.If this level of compelling and passionate documentary doesn't have an effect on our attitude towards the utter essentialness of the well-being of our oceans, then I fear nothing ever will. This should be compulsory viewing for all students everywhere, lest the next generation follows in the current generation's attitude of unforgivable nonchalance towards our planet's health and astonishing biodiversity."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw9064206",
      "warningSpoilers": false,
      "date": "19 May 2023",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Excellent documentary series",
      "content": "A documentary series on life in and around seas and oceans. The series covers: oceans in general, deep sea, coral reefs, open ocean, green seas, coasts and the threats facing oceans and sea life. Narrated by David Attenborough (of course!).Another excellent nature documentary series from David Attenborough. It is essentially an update of The Blue Planet (2001). That was also an excellent series and this is even better, largely thanks to advances in video technology and image capturing techniques. Some pretty amazing, never-before-seen or even imagined footage, all in perfect high resolution. The short \"making of\" featurettes at the end of each episode show how many of the scenes were captured and it's very impressive.Like The Blue Planet this series shows in great detail life in and around seas and especially the food cycle and predator-prey dynamic. Like with many David Attenborough productions there's often a narrative around the animal being viewed, making the series even more engaging.Very interesting, engaging and educational."
    },
    {
      "username": "r-38373",
      "userUrl": "https://www.imdb.com/user/ur82159545",
      "reviewLink": "https://www.imdb.com/review/rw3853502",
      "warningSpoilers": false,
      "date": "9 November 2017",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "shock of soul",
      "content": "There is no doubt that this documentary is a masterpiece,and one of the best i have ever seen.the vast scene and the fascinating species of the sea will make you feel respect and awe to the nature ,the creator.forgetting the unhappiness ,trifles and pressure ,just throw yourself into the shock and purify your soul."
    },
    {
      "username": "cgtam",
      "userUrl": "https://www.imdb.com/user/ur113586051",
      "reviewLink": "https://www.imdb.com/review/rw5478204",
      "warningSpoilers": false,
      "date": "12 February 2020",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "BBC at its best-wondrous!. Every person must watch the hidden wonders.",
      "content": "Once again both BBC & David Attenborough excel. Incredible jaw-dropping beauty in the ocean, especially at the depths where no human has witnessed before. Understand how essential ALL oceanic ecosystems, from microscopic to gigantic, are required to maintain our planet's health. It's a stunning cinematic wake up call to humanity."
    },
    {
      "username": "ryandavidhoyle",
      "userUrl": "https://www.imdb.com/user/ur96924793",
      "reviewLink": "https://www.imdb.com/review/rw5676096",
      "warningSpoilers": false,
      "date": "25 April 2020",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Awesome",
      "content": "Incredible footage. So good to see how the camera tech has evolved since planet earth, and the new viewpoints this gives the crew."
    }
  ],
  "errorMessage": ""
}