{
  "imDbId": "tt6769208",
  "title": "Blue Planet II",
  "fullTitle": "Blue Planet II (TV Series 2017–2017)",
  "type": "TVSeries",
  "year": "2017",
  "language": "en",
  "titleInLanguage": "Blue Planet II",
  "url": "https://en.wikipedia.org/wiki/Blue_Planet_II",
  "plotShort": {
    "plainText": "Blue Planet II is a 2017 British nature documentary series on marine life produced by the BBC Natural History Unit. Like its predecessor, The Blue Planet (2001), it is narrated and presented by naturalist Sir David Attenborough.\r\nAfter being announced in 2013, filming took four years in 39 countries over more than 125 international trips. The musical score was composed by Hans Zimmer, Jacob Shea and David Fleming, and English rock band Radiohead reworked their 2011 song \"Bloom\" with Zimmer specifically for the series.\r\nThe series debuted on 29 October 2017 and was simultaneously cast on BBC One, BBC One HD and BBC Earth, making it the first natural history series to premiere on the same day in the United Kingdom, Nordic regions, Europe and in Asia. In the United States, the series premiered on January 20, 2018, as part of a five-network simulcast on BBC America, AMC, IFC, Sundance, and WE tv.\r\nThe series received almost universal critical acclaim. It had the highest viewing figures of any television programme in the United Kingdom during 2017, and was so widely watched in China that it reportedly caused internet issues. It was credited with increasing public and political interest in issues affecting marine life, in particular marine plastic pollution, which was dubbed \"the Blue Planet effect\".",
    "html": "<p>Blue Planet II is a 2017 British nature documentary series on marine life produced by the BBC Natural History Unit. Like its predecessor, The Blue Planet (2001), it is narrated and presented by naturalist Sir David Attenborough.</p><p>After being announced in 2013, filming took four years in 39 countries over more than 125 international trips. The musical score was composed by Hans Zimmer, Jacob Shea and David Fleming, and English rock band Radiohead reworked their 2011 song \"Bloom\" with Zimmer specifically for the series.</p><p>The series debuted on 29 October 2017 and was simultaneously cast on BBC One, BBC One HD and BBC Earth, making it the first natural history series to premiere on the same day in the United Kingdom, Nordic regions, Europe and in Asia. In the United States, the series premiered on January 20, 2018, as part of a five-network simulcast on BBC America, AMC, IFC, Sundance, and WE tv.</p><p>The series received almost universal critical acclaim. It had the highest viewing figures of any television programme in the United Kingdom during 2017, and was so widely watched in China that it reportedly caused internet issues. It was credited with increasing public and political interest in issues affecting marine life, in particular marine plastic pollution, which was dubbed \"the Blue Planet effect\".</p>"
  },
  "plotFull": {
    "plainText": "Blue Planet II is a 2017 British nature documentary series on marine life produced by the BBC Natural History Unit. Like its predecessor, The Blue Planet (2001), it is narrated and presented by naturalist Sir David Attenborough.\r\nAfter being announced in 2013, filming took four years in 39 countries over more than 125 international trips. The musical score was composed by Hans Zimmer, Jacob Shea and David Fleming, and English rock band Radiohead reworked their 2011 song \"Bloom\" with Zimmer specifically for the series.\r\nThe series debuted on 29 October 2017 and was simultaneously cast on BBC One, BBC One HD and BBC Earth, making it the first natural history series to premiere on the same day in the United Kingdom, Nordic regions, Europe and in Asia. In the United States, the series premiered on January 20, 2018, as part of a five-network simulcast on BBC America, AMC, IFC, Sundance, and WE tv.\r\nThe series received almost universal critical acclaim. It had the highest viewing figures of any television programme in the United Kingdom during 2017, and was so widely watched in China that it reportedly caused internet issues. It was credited with increasing public and political interest in issues affecting marine life, in particular marine plastic pollution, which was dubbed \"the Blue Planet effect\".\r\nBackground and production\r\nThe series was announced by the BBC in 2013 with the working title Oceans, but the title was later changed to Blue Planet II as was revealed on 19 February 2017, making it a follow-up to the 2001 series The Blue Planet. Filming took place over a course of more than four years; involving 125 expeditions across 39 countries and produced more than 6,000 hours of underwater dive footage from over an estimated 4,000 dives.\r\nBroadcast\r\nBritish television\r\nThe premiere of the series took place at Bristol's Cinema de Lux on 11 October 2017, with special guest appearance by Attenborough along with the producers and wildlife experts. Bristol has been the global home of BBC's Natural History programme making for the past 60 years. The series was first broadcast on 29 October 2017 (from 20:00 GMT to 21:00 GMT) on BBC One and BBC One HD. The first six episodes included a 10-minute making-of documentary called Into the Blue. The previous week's episode was repeated in an earlier time slot the following Sunday. The series was critically acclaimed and gained the highest UK viewing figure for 2017, 14.1 million.\r\nInternational\r\nThe BBC pre-sold the series to several overseas broadcasters, which includes Canada (Blue Ant Media’s licensed channel for BBC Earth), Australia (Channel Nine) and New Zealand (TVNZ), to Europe with Denmark (DR), Netherlands (NPO), Sweden (SVT), Spain (Telefonica’s BBC Earth block), Discovery Channel for Latin America and co-production partnerships with BBC America, Germany's WDR, France Télévisions, China's Tencent and CCTV-9. The series was eventually sold to more than 30 countries.\r\nThe series is set to broadcast internationally on BBC Earth channel, and also commercial television channels in various countries, besides. The series debuted in Nordic regions and other European countries on 29 October 2017. In Asia, the series began to premiere on each early Monday (from 04:05 SGT to 05:05 SGT) starting from 30 October 2017, the episode was then repeated on following each Tuesday evening (from 20:00 SGT). In Poland, it premiered on 16 November 2017. As for South Africa, it aired from 4 February 2018.\r\nIn China, the premiere took place at Shanghai's East China Normal University on 27 October 2017, with guest appearance by the producer Orla Doherty and Mike Gunton, the executive producer of Planet Earth II. The series is streaming broadcast at Tencent's QQLive from 30 October 2017, with episodes updating every Monday at 18:00 CST. It would also be broadcast on the state owned China Central Television’s documentary channel, CCTV-9, with episodes airing each Monday from 6 November 2017 at 21:00 CST.\r\nIn the Netherlands, the series is airing on the Dutch channel NPO 1, with episodes airing each Thursday from 28 December 2017. In Belgium, it will air on the Flemish channel Canvas, with episodes airing each Saturday starting from 2 January 2018.\r\nThe series aired in Canada and the United States on 20 January 2018. In Canada, it will broadcast with a three-network simulcast across BBC Earth, Cottage Life and T+E channel. In the United States, the series premiered the first episode – with a five-network simulcast across BBC America, AMC, IFC, WE tv and Sundance TV, while the remaining episodes continued to be aired every Saturday on BBC America. It is also available on BBCAmerica.com and the BBCA app.\r\nAs for Australia, the series will premiere on Nine Network and 9Now on 17 February 2018. In New Zealand, it premiered on 12 November 2017 on TVNZ 1.\r\nFor Singapore, the series premiered on Mediacorp Channel 5 on Sundays starting 27 May 2018.\r\nIn Greece, all the seven original episodes were broadcast from 12 April 2020 until 18 April 2020 at 10.30pm on the free-to-air television network Skai TV.\r\nEpisodes\r\n\"The oceans, seemingly limitless, invoke in us a sense of awe and wonder, and also sometimes fear. They cover 70% of the surface of our planet, and yet they are still the least explored. Hidden beneath the waves, right beneath my feet, there are creatures beyond our imagination.\"— David Attenborough's opening words\r\n\"We are at unique stage in our history. Never before have we had such an awareness of what we are doing to the planet, and never before have we had the power to do something about that. Surely we have a responsibility to care for our blue planet. The future of humanity, and indeed all life on Earth, now depends on us.\"— David Attenborough, in closing\r\nMusic\r\n(ocean) bloom\r\nIn September 2017, the BBC announced that the English rock band Radiohead had collaborated with composer Hans Zimmer to record a new version of \"Bloom\", a song from their 2011 album The King of Limbs. The new track, \"(ocean) bloom\", was recorded alongside the BBC Concert Orchestra. In a press release, Radiohead singer Thom Yorke said: \"'Bloom' was inspired by the original Blue Planet series so it's great to be able to come full circle with the song.\" Zimmer and Radiohead worked with the orchestra in an attempt to emulate a 'tidal effect' in the music. The song was used as the soundtrack for a Blue Planet II prequel video released by the BBC to promote the series.\r\nSoundtrack\r\nComposer Hans Zimmer returned to score the series. The musical score and songs featured in the series were composed by Hans Zimmer, Jacob Shea and David Fleming for Bleeding Fingers Music. It was recorded at Synchron Stage Vienna.\r\nA digital soundtrack was released on 29 October 2017, while a single physical disc was released on 1 December 2017 in the UK. The soundtrack was released as special edition LP for Record Store Day on 21 April 2018.\r\nReception\r\nCritical reception\r\nOn the review aggregator website Rotten Tomatoes, 97% of 32 critics' reviews are positive, with an average rating of 9.4/10. The website's consensus reads: \"Blue Planet II's hypnotic beauty is complemented by intense ethical musing, contrasting the micro and the macro in a humbling exploration of humanity's relationship with the ground it stands on.\" In a positive review, Ed Yong of The Atlantic called Blue Planet II \"the greatest nature series that the BBC has ever produced\".\r\nThe Guardian columnist George Monbiot criticised the series for mostly omitting the impact of the fishing industry on the oceans: \"It's as if you were to make a film about climate breakdown without revealing the role of fossil fuel companies\". Monbiot stated that the film's only mention of the fishing industry was a story \"about how kind Norwegian herring boats are to orcas\".\r\nImpact\r\nThe programme has been credited with raising awareness of plastic pollution both domestically and internationally, an influence dubbed the 'Blue Planet effect'.\r\nAfter the first episode aired in the UK, there was a surge in search engine enquiries about conservation charities, with the Marine Conservation Society, WWF and Plastic Oceans Foundation all receiving a significant spike in traffic. Following the programme's airing in the UK, the BBC announced its intention to completely ban single-use plastics within its organisation by 2020. In April 2018, in response to growing public support directly linked to Blue Planet II, the British government announced it was considering a national ban on single-use plastic products. It was also reported that Queen Elizabeth II's decision to ban plastic bottles and straws across the Royal estates was in part a response to the documentary. A 2020 study suggested that the programme triggered long-lasting increased political, media and public interest in plastic pollution in the UK, where previous efforts to do so had not been successful. Another study found that watching the single documentary did not influence participants to change their individual plastic consumption behaviour, even if they were made more aware of the issue or if it had a wider societal impact.\r\nBritish universities such as the University of Southampton noticed a sudden increase in applications for marine biology courses following the programme's airing, which was again attributed to the 'Blue Planet effect'.\r\nIt was reported that the number of people in China simultaneously streaming Blue Planet II (approximately 80 million) had a noticeable impact upon internet speeds within the country. The popularity of the documentary in China was cited as partly the reason British prime minister Theresa May gave Chinese president Xi Jinping a Blue Planet II box set signed by David Attenborough. It was also symbolic of a joint plan to tackle plastic pollution and the illegal wildlife trade, announced by British officials during Xi's 2018 visit.\r\nAwards and nominations\r\nMerchandise\r\nDVD and Blu-ray\r\nThe series was released as a three-disc DVD set as well as a standard Blu-ray set on 27 November 2017, and as a six-disc 4K UHD Blu-ray + Blu-ray set on 15 January 2018. It is distributed by BBC Worldwide in the UK.\r\nIn the US and Canada, the DVD, Blu-ray and 4K UHD Blu-ray sets were released on 6 March 2018 and distributed by BBC Worldwide Americas.\r\nBook\r\nAn accompanying hardback book was written by James Honeyborne and Mark Brownlow, with foreword by David Attenborough. It was published by BBC Books (ISBN 978-1849909679). The book was released on 19 October 2017 in the UK and on 1 January 2018 in the US.\r\nOpen University poster\r\nA free poster was made available through the Open University's OpenLearn website.",
    "html": "<p>Blue Planet II is a 2017 British nature documentary series on marine life produced by the BBC Natural History Unit. Like its predecessor, The Blue Planet (2001), it is narrated and presented by naturalist Sir David Attenborough.</p><p>After being announced in 2013, filming took four years in 39 countries over more than 125 international trips. The musical score was composed by Hans Zimmer, Jacob Shea and David Fleming, and English rock band Radiohead reworked their 2011 song \"Bloom\" with Zimmer specifically for the series.</p><p>The series debuted on 29 October 2017 and was simultaneously cast on BBC One, BBC One HD and BBC Earth, making it the first natural history series to premiere on the same day in the United Kingdom, Nordic regions, Europe and in Asia. In the United States, the series premiered on January 20, 2018, as part of a five-network simulcast on BBC America, AMC, IFC, Sundance, and WE tv.</p><p>The series received almost universal critical acclaim. It had the highest viewing figures of any television programme in the United Kingdom during 2017, and was so widely watched in China that it reportedly caused internet issues. It was credited with increasing public and political interest in issues affecting marine life, in particular marine plastic pollution, which was dubbed \"the Blue Planet effect\".</p><br/><h3>Background and production</h3><p>The series was announced by the BBC in 2013 with the working title Oceans, but the title was later changed to Blue Planet II as was revealed on 19 February 2017, making it a follow-up to the 2001 series The Blue Planet. Filming took place over a course of more than four years; involving 125 expeditions across 39 countries and produced more than 6,000 hours of underwater dive footage from over an estimated 4,000 dives.</p><br/><h3>Broadcast</h3><h4>British television</h4><p>The premiere of the series took place at Bristol's Cinema de Lux on 11 October 2017, with special guest appearance by Attenborough along with the producers and wildlife experts. Bristol has been the global home of BBC's Natural History programme making for the past 60 years. The series was first broadcast on 29 October 2017 (from 20:00 GMT to 21:00 GMT) on BBC One and BBC One HD. The first six episodes included a 10-minute making-of documentary called Into the Blue. The previous week's episode was repeated in an earlier time slot the following Sunday. The series was critically acclaimed and gained the highest UK viewing figure for 2017, 14.1 million.</p><h4>International</h4><p>The BBC pre-sold the series to several overseas broadcasters, which includes Canada (Blue Ant Media’s licensed channel for BBC Earth), Australia (Channel Nine) and New Zealand (TVNZ), to Europe with Denmark (DR), Netherlands (NPO), Sweden (SVT), Spain (Telefonica’s BBC Earth block), Discovery Channel for Latin America and co-production partnerships with BBC America, Germany's WDR, France Télévisions, China's Tencent and CCTV-9. The series was eventually sold to more than 30 countries.</p><p>The series is set to broadcast internationally on BBC Earth channel, and also commercial television channels in various countries, besides. The series debuted in Nordic regions and other European countries on 29 October 2017. In Asia, the series began to premiere on each early Monday (from 04:05 SGT to 05:05 SGT) starting from 30 October 2017, the episode was then repeated on following each Tuesday evening (from 20:00 SGT). In Poland, it premiered on 16 November 2017. As for South Africa, it aired from 4 February 2018.</p><p>In China, the premiere took place at Shanghai's East China Normal University on 27 October 2017, with guest appearance by the producer Orla Doherty and Mike Gunton, the executive producer of Planet Earth II. The series is streaming broadcast at Tencent's QQLive from 30 October 2017, with episodes updating every Monday at 18:00 CST. It would also be broadcast on the state owned China Central Television’s documentary channel, CCTV-9, with episodes airing each Monday from 6 November 2017 at 21:00 CST.</p><p>In the Netherlands, the series is airing on the Dutch channel NPO 1, with episodes airing each Thursday from 28 December 2017. In Belgium, it will air on the Flemish channel Canvas, with episodes airing each Saturday starting from 2 January 2018.</p><p>The series aired in Canada and the United States on 20 January 2018. In Canada, it will broadcast with a three-network simulcast across BBC Earth, Cottage Life and T+E channel. In the United States, the series premiered the first episode – with a five-network simulcast across BBC America, AMC, IFC, WE tv and Sundance TV, while the remaining episodes continued to be aired every Saturday on BBC America. It is also available on BBCAmerica.com and the BBCA app.</p><p>As for Australia, the series will premiere on Nine Network and 9Now on 17 February 2018. In New Zealand, it premiered on 12 November 2017 on TVNZ 1.</p><p>For Singapore, the series premiered on Mediacorp Channel 5 on Sundays starting 27 May 2018.</p><p>In Greece, all the seven original episodes were broadcast from 12 April 2020 until 18 April 2020 at 10.30pm on the free-to-air television network Skai TV.</p><br/><h3>Episodes</h3><blockquote>\"The oceans, seemingly limitless, invoke in us a sense of awe and wonder, and also sometimes fear. They cover 70% of the surface of our planet, and yet they are still the least explored. Hidden beneath the waves, right beneath my feet, there are creatures beyond our imagination.\"— David Attenborough's opening words</blockquote><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#345794;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#345794\">Title</th><th scope=\"col\" style=\"background:#345794\">Produced by</th><th scope=\"col\" style=\"background:#345794\">Original air date</th><th scope=\"col\" style=\"background:#345794;width:10%\">UK viewers<br>(millions) <span style=\"background-color:white;padding:1px;display:inline-block;line-height:50%\"></span></th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"\" style=\"text-align:center\">–</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Prequel\"</td><td style=\"text-align:center\"><span style=\"color:gray;\"><small>N/A</small></span></td><td style=\"text-align:center\">27 September 2017</td><td style=\"text-align:center\"><span style=\"color:gray;\"><small>N/A</small></span></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #345794\">A 5-minute clip introduction which focuses in particular on the upcoming stories from the ocean depths.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"One Ocean\"</td><td style=\"text-align:center\">Jonathan Smith</td><td style=\"text-align:center\">29 October 2017</td><td style=\"text-align:center\">14.01</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #345794\">Animals featured include <span>bottlenose dolphins</span> that surf and rub themselves in <span>corals</span> in the <span>Red Sea</span>, smart <span>tuskfish</span> that use <span>coral</span> to break open <span>clam</span> shells, large packs of <span>giant trevallies</span> hunting <span>tern</span> chicks in <span>atolls</span> in the <span>Indian Ocean</span>, a female <span>kobudai</span> changing its sex to male, <span>false killer whales</span> joining a pack of bottlenose dolphins in <span>New Zealand</span>, <span>orca</span> and <span>humpback whales</span> feasting in large schools of <span>herring</span> in <span>Norway</span> and <span>walruses</span> trying to rest on the melting ice in the <span>Arctic</span> to escape <span>polar bears</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Deep\"</td><td style=\"text-align:center\">Orla Doherty</td><td style=\"text-align:center\">5 November 2017</td><td style=\"text-align:center\">13.97</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #345794\">The <span>depths of the ocean</span> are among the most difficult conditions in the world. The depths of <span>Antarctica</span> host diverse endemic creatures. In other oceans, giant <span>tunicate</span> – <span>pyrosome</span>, <span>swordfish</span>, <span>cock-eyed squid</span> and <span>barreleyes</span> are specially adapted to dark conditions, and large <span>Humboldt squids</span> hunt <span>lanternfish</span> then cannibalize one another. The deep sea <span>anglerfish</span> and <span>dragonfish</span> attracts prey, and <span>fangtooths</span> eat fish and squid. In the deep, a <span>sperm whale</span> carcass attracts many <span class=\"mw-redirect\">scavengers</span>, such as <span>bluntnose sixgill sharks</span>, <span>spider crabs</span>, <span>rock crabs</span>, and <span>osedax</span>; as well as the scavenger's predators, including <span>silver scabbardfish</span>. Also features <span class=\"mw-redirect\">shrimps</span> living in a <span>Venus' flower basket</span> sponge, swimming pools of <span>brine</span> in the <span>Gulf of Mexico</span>, and the life found in the <span>Mariana Trench</span>, including the <span>snailfish</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Coral Reefs\"</td><td style=\"text-align:center\">Jonathan Smith</td><td style=\"text-align:center\">12 November 2017</td><td style=\"text-align:center\">13.45</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #345794\"><span>Coral reefs</span> are a large habitat created by tiny creatures called coral <span>polyps</span>. Features <span class=\"mw-redirect\">broadclub cuttlefish</span> searching prey, <span class=\"mw-redirect\">coral trout</span> cooperatively hunting with <span>octopus</span>, <span>Green sea turtles</span> in <span>Borneo</span> cleaned by <span class=\"mw-redirect\">surgeonfish</span> and <span>blennies</span>, bottlenose dolphins playing, a <span class=\"mw-redirect\">bobbit worm</span> hunting in the sands of the reef, a family of <span>saddleback clownfish</span> transporting a shell on which to lay their eggs, and <span>marbled groupers</span> breeding in <span>French Polynesia</span> while <span class=\"mw-redirect\">blacktip reef sharks</span> attack.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Big Blue\"</td><td style=\"text-align:center\">John Ruthven</td><td style=\"text-align:center\">19 November 2017</td><td style=\"text-align:center\">13.11</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #345794\">A large school of <span>spinner dolphins</span> chase <span>lanternfish</span> with <span>yellowfin tuna</span>, <span>sailfish</span> and the <span>mobula ray</span>, <span class=\"mw-redirect\">sperm whales</span> with their calves hunting <span>squid</span>, <span>blue sharks</span> scavenge a whale carcass with the world's largest predatory fish, the <span>great white shark</span>. Young <span>sea turtles</span> find refuge at flotsam. A <span>Portuguese man o' war</span> floats in the current waiting for small fish, <span>whale sharks</span> breed in the <span>Galápagos Islands</span> along with <span>hammerhead</span> and <span>silky sharks</span>, and <span>wandering albatrosses</span> raising their chicks. Highlights the effects of plastic on marine life, with a <span>short-finned pilot whale</span> family mourning a calf that died after ingesting milk contaminated with plastic particles.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Green Seas\"</td><td style=\"text-align:center\">Kathryn Jeffs</td><td style=\"text-align:center\">26 November 2017</td><td style=\"text-align:center\">12.62</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #345794\">Within <span>kelp forests</span>, <span>starfish</span> release their eggs, which are consumed by <span class=\"mw-redirect\">sea cucumbers</span> and <span class=\"mw-redirect\">sea pens</span>. <span>Common octopus</span> escape from <span>pyjama sharks</span> by hiding inside shells; <span>Garibaldi</span> hide from <span>torpedo rays</span> and try to protect their patches of <span>seaweed</span> from grazers and from a plague of <span class=\"mw-redirect\">sea urchins</span>, whose numbers are kept in check by <span class=\"mw-redirect\">sea otters</span>. In <span>Australia</span>, <span>green sea turtles</span> graze on <span>seagrass</span> beds and are chased by <span class=\"mw-redirect\">tiger sharks</span>. Other inhabitants of the seagrass beds are <span class=\"mw-redirect\">spider crabs</span> coming to molt with protection from a <span>short-tail stingray</span>, <span>giant cuttlefish</span> mating, and <span class=\"mw-redirect\">weedy seadragon</span> fathers carrying eggs. In the <span>mangrove</span> roots of North Australia, a <span class=\"mw-redirect\">zebra mantis shrimp</span> hunts small fish for his mate. A large pack of <span>common dolphins</span>, <span>California sea lions</span> and <span>humpback whales</span> feasting in school of <span>anchovies</span>, themselves feeding on <span>phytoplankton</span>, in <span>Monterey Bay</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Coasts\"</td><td style=\"text-align:center\">Miles Barton</td><td style=\"text-align:center\">3 December 2017</td><td style=\"text-align:center\">11.45</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #345794\">Animals featured include thousands of <span>olive ridley sea turtles</span> that come up to land to lay their eggs; <span>Galápagos sea lion</span> catching <span>yellowfin tuna</span> in the shallow bay of the coast; <span class=\"mw-redirect\">rock pool</span> creatures including predators like starfish, <span class=\"mw-redirect\">sea anemones</span> and <span class=\"mw-redirect\">clingfishes</span> that prey on <span>limpets</span> and <span class=\"mw-redirect\">bivalves</span>; a <span>chain moray eel</span> and an octopus hunt <span>Sally Lightfoot crabs</span> in <span>Brazil</span>, <span>Pacific leaping blennies</span> making their home on land, <span>puffins</span> and <span>common murres</span> avoiding <span>arctic skuas</span>; a colony of <span>king penguins</span> crossing a colony of fiercely territorial <span>southern elephant seals</span>; and large groups of <span>spinner sharks</span> and <span>blacktip sharks</span> off the coast of <span>Palm Beach, Florida</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Our Blue Planet\"</td><td style=\"text-align:center\">Orla Doherty, Will Ridgeon</td><td style=\"text-align:center\">10 December 2017</td><td style=\"text-align:center\">11.91</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #345794\">Examining the role of human <span>anthropogenic</span> activity on the oceans. <span>Microplastics</span> and <span>pollution</span> are an increasing problem for the world's seas, threatening the lives of marine life and ultimately affecting the ecosystem. Can humans reverse their activity to protect the seas and the wildlife that inhabit it?</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"\" style=\"text-align:center\">–</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Oceans of Wonder\"</td><td style=\"text-align:center\"><span style=\"color:gray;\"><small>N/A</small></span></td><td style=\"text-align:center\">1 January 2018</td><td style=\"text-align:center\"><span style=\"color:gray;\"><small>N/A</small></span></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #345794\">A 90-minute compilation episode which highlights the wonders of our world's oceans as well as filming some extraordinary animal behaviours which were never seen before.</td></tr></tbody></table><blockquote>\"We are at unique stage in our history. Never before have we had such an awareness of what we are doing to the planet, and never before have we had the power to do something about that. Surely we have a responsibility to care for our blue planet. The future of humanity, and indeed all life on Earth, now depends on us.\"— David Attenborough, in closing</blockquote><br/><h3>Music</h3><h4>(ocean) bloom</h4><p>In September 2017, the BBC announced that the English rock band Radiohead had collaborated with composer Hans Zimmer to record a new version of \"Bloom\", a song from their 2011 album The King of Limbs. The new track, \"(ocean) bloom\", was recorded alongside the BBC Concert Orchestra. In a press release, Radiohead singer Thom Yorke said: \"'Bloom' was inspired by the original Blue Planet series so it's great to be able to come full circle with the song.\" Zimmer and Radiohead worked with the orchestra in an attempt to emulate a 'tidal effect' in the music. The song was used as the soundtrack for a Blue Planet II prequel video released by the BBC to promote the series.</p><h4>Soundtrack</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Blue Planet II</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\"><span>Hans Zimmer</span>, David Fleming &amp; Jacob Shea</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">29 October 2017 (Digital)<br>1 December 2017 (Audio CD)</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Soundtrack</span>, <span>Classical music</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"h\">1</span>:<span class=\"min\">11</span>:<span class=\"s\">29</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\">Silva Screen Records</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\"><span>BBC Worldwide</span><br><span>BBC Earth</span></td></tr></tbody></table><p>Composer Hans Zimmer returned to score the series. The musical score and songs featured in the series were composed by Hans Zimmer, Jacob Shea and David Fleming for Bleeding Fingers Music. It was recorded at Synchron Stage Vienna.</p><p>A digital soundtrack was released on 29 October 2017, while a single physical disc was released on 1 December 2017 in the UK. The soundtrack was released as special edition LP for Record Store Day on 21 April 2018.</p><br/><h3>Reception</h3><h4>Critical reception</h4><p>On the review aggregator website Rotten Tomatoes, 97% of 32 critics' reviews are positive, with an average rating of 9.4/10. The website's consensus reads: \"Blue Planet II's hypnotic beauty is complemented by intense ethical musing, contrasting the micro and the macro in a humbling exploration of humanity's relationship with the ground it stands on.\" In a positive review, Ed Yong of The Atlantic called Blue Planet II \"the greatest nature series that the BBC has ever produced\".</p><p>The Guardian columnist George Monbiot criticised the series for mostly omitting the impact of the fishing industry on the oceans: \"It's as if you were to make a film about climate breakdown without revealing the role of fossil fuel companies\". Monbiot stated that the film's only mention of the fishing industry was a story \"about how kind Norwegian herring boats are to orcas\".</p><h4>Impact</h4><p>The programme has been credited with raising awareness of plastic pollution both domestically and internationally, an influence dubbed the 'Blue Planet effect'.</p><p>After the first episode aired in the UK, there was a surge in search engine enquiries about conservation charities, with the Marine Conservation Society, WWF and Plastic Oceans Foundation all receiving a significant spike in traffic. Following the programme's airing in the UK, the BBC announced its intention to completely ban single-use plastics within its organisation by 2020. In April 2018, in response to growing public support directly linked to Blue Planet II, the British government announced it was considering a national ban on single-use plastic products. It was also reported that Queen Elizabeth II's decision to ban plastic bottles and straws across the Royal estates was in part a response to the documentary. A 2020 study suggested that the programme triggered long-lasting increased political, media and public interest in plastic pollution in the UK, where previous efforts to do so had not been successful. Another study found that watching the single documentary did not influence participants to change their individual plastic consumption behaviour, even if they were made more aware of the issue or if it had a wider societal impact.</p><p>British universities such as the University of Southampton noticed a sudden increase in applications for marine biology courses following the programme's airing, which was again attributed to the 'Blue Planet effect'.</p><p>It was reported that the number of people in China simultaneously streaming Blue Planet II (approximately 80 million) had a noticeable impact upon internet speeds within the country. The popularity of the documentary in China was cited as partly the reason British prime minister Theresa May gave Chinese president Xi Jinping a Blue Planet II box set signed by David Attenborough. It was also symbolic of a joint plan to tackle plastic pollution and the illegal wildlife trade, announced by British officials during Xi's 2018 visit.</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Nominee</th><th>Result</th><th class=\"unsortable\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><td rowspan=\"10\">2018</td><td><span>National Television Awards</span></td><td>Impact Award</td><td>Blue Planet II &amp; David Attenborough</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"2\"><span>British Academy Television Awards</span></td><td><span>Huw Wheldon Award for Specialist Factual</span></td><td><i>Blue Planet II</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Virgin TV's Must-See Moments</td><td>\"Mother Pilot Whale Grieves\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\"><span>British Academy Television Craft Awards</span></td><td rowspan=\"2\"><span>Best Editing: Factual</span></td><td>Matt Meech (for: \"One Ocean\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"5\"></td></tr><tr><td>Nigel Buck (for: \"The Deep\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Photography: Factual</span></td><td>Camera Team (for: \"One Ocean\")</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Titles &amp; Graphic Identity</span></td><td>BDH Creative</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound: Factual</span></td><td>Graham Wild, Tim Owens, Kate Hopkins (for: \"Coral Reefs\")</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Merchandise</h3><h4>DVD and Blu-ray</h4><p>The series was released as a three-disc DVD set as well as a standard Blu-ray set on 27 November 2017, and as a six-disc 4K UHD Blu-ray + Blu-ray set on 15 January 2018. It is distributed by BBC Worldwide in the UK.</p><p>In the US and Canada, the DVD, Blu-ray and 4K UHD Blu-ray sets were released on 6 March 2018 and distributed by BBC Worldwide Americas.</p><h4>Book</h4><p>An accompanying hardback book was written by James Honeyborne and Mark Brownlow, with foreword by David Attenborough. It was published by BBC Books (ISBN 978-1849909679). The book was released on 19 October 2017 in the UK and on 1 January 2018 in the US.</p><h4>Open University poster</h4><p>A free poster was made available through the Open University's OpenLearn website.</p><br/>"
  },
  "errorMessage": ""
}