{
  "imDbId": "tt3428912",
  "title": "Happy Valley",
  "fullTitle": "Happy Valley (TV Series 2014–2023)",
  "type": "TVSeries",
  "year": "2014",
  "episodes": [
    {
      "id": "tt3680396",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Episode #1.1",
      "image": "https://m.media-amazon.com/images/M/MV5BYTU3ODc3MzYtNmMxMy00NzRhLWE4NzQtNzMwOWU4ODY3OWY0XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "29 Apr. 2014",
      "plot": "Catherine Cawood is a policewoman in the ironically named Happy Valley, the nickname for the drug-affected Calder Valley in West Yorkshire, England. Her private life is complicated. She still sees and sleeps with her ex-husband, journalist Richard Cawood, even though he has a new woman in his life. She lives with her sister Clare, a recovering addict, and grandson, Ryan, whose mother, Catherine's daughter, Becky, killed herself after being raped. Now the man Catherine believes to be the rapist, Tommy Lee Royce, is out of jail and back in town. At the same time, Kevin ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "1360"
    },
    {
      "id": "tt3680406",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Episode #1.2",
      "image": "https://m.media-amazon.com/images/M/MV5BNGMzYTQxM2ItZTU4MS00OTMyLThhMjItNTdmMDc3Y2Q3YTM5XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "6 May 2014",
      "plot": "Learning that Nevison's wife Helen is terminally ill Kevin feels increasingly guilty and tells his own wife Jenny what has happened. She advises him to deny all contact with the others and refuse to accept any money so that when, on Nevison's instructions, he takes the ransom to Cowgill, he hides his own share. Lewis is concerned that Royce is ill-treating Ann and plans to kill her when the full ransom is received but is savagely beaten by Royce when he tries to intervene on her behalf. Catherine meanwhile starts a poster campaign to locate Royce and, after arresting ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1171"
    },
    {
      "id": "tt3688032",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "Episode #1.3",
      "image": "https://m.media-amazon.com/images/M/MV5BZWZmZjNjNWQtMDg1My00YmEwLWE0OWEtMTgxZTAxY2Y4MGM4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "13 May 2014",
      "plot": "Following Catherine's visit to the house Royce moves Ann but the van in which he and Lewis are taking her is stopped for speeding by policewoman Kirsten McAskill and so Royce, to Lewis's horror, runs Kirsten over, killing her. Reminded of her daughter's death and accused by Kirsten's partner of pushing her into action Catherine is devastated and, whilst Richard offers to accept Ryan, she can do without being told not to prosecute Gascoigne for drink and drugs as he donates to the police fund. Cowgill is also appalled by Royce's actions, particularly as Royce wants to ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "1175"
    },
    {
      "id": "tt3718780",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Episode #1.4",
      "image": "https://m.media-amazon.com/images/M/MV5BMjFjZmQxZTItYTc4Zi00NTE0LWE0MDQtZWEwMmJmM2E2ODEyXkEyXkFqcGdeQXVyODE5MTMzMzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "20 May 2014",
      "plot": "Catherine is pleased that Richard is bonding with Ryan. She also learns that the house she investigated belongs to Cowgill's wife. She visits both the wife and Cowgill himself, though he feigns ignorance of any illegal activities. She also calls on Royce's mother Lynn who indicates she has heard that Royce is Ryan's father. Another visit to Lynn leads to a life-threatening situation.",
      "imDbRating": "9.0",
      "imDbRatingCount": "1318"
    },
    {
      "id": "tt3661828",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "Episode #1.5",
      "image": "https://m.media-amazon.com/images/M/MV5BZjhlYmVmMzUtYzNmYi00ZTVhLTgyYjEtOTM0MjE4MDljZGQ1XkEyXkFqcGdeQXVyOTMyODgwOTQ@._V1_Ratio1.8095_AL_.jpg",
      "year": "2014",
      "released": "27 May 2014",
      "plot": "Catherine and Ann manage to escape and are rescued by the police, but Kevin's questionable account of his involvement leads to his arrest and remand in custody and, via his phone calls, the arrest of Cowgill. Cowgill enters into a plea bargain for a reduced sentence by giving information about a vast drugs importation racket, and as a result he and his family will need witness protection. Catherine recovers in hospital and is visited by Ann, who asks her not to tell her mother about her rape by Royce. On discharge, Catherine is despondent since Royce is still at large.",
      "imDbRating": "8.3",
      "imDbRatingCount": "1058"
    },
    {
      "id": "tt3734088",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "Episode #1.6",
      "image": "https://m.media-amazon.com/images/M/MV5BYWFkZThiOTktZmFiMi00Nzg3LTk0ZDAtMDFlYTRhOGU1ZDg2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "3 Jun. 2014",
      "plot": "Clare organizes a birthday party for Catherine with the family, colleagues and the Gallaghers but makes the mistake of telling Daniel that Catherine has been seeing Richard. At the party Daniel gets drunk and accuses his parents as well as harshly criticizing Becky, whom he claims was a spoilt bitch and Royce's willing partner, rather than the victim they have all beatified. Next day Lewis's corpse is discovered and Cowgill is murdered by the drugs gang. Royce hides out on a narrow boat and contacts Ryan, explaining that he is his father and encouraging him to visit ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "1105"
    }
  ],
  "errorMessage": ""
}