{
  "imDbId": "tt3428912",
  "title": "Happy Valley",
  "fullTitle": "Happy Valley (TV Series 2014–2023)",
  "type": "TVSeries",
  "year": "2014",
  "episodes": [
    {
      "id": "tt4371366",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "Episode #2.1",
      "image": "https://m.media-amazon.com/images/M/MV5BOGMyYmI4M2MtMmMwZS00MmMwLWJhMDctMTcwNTM3YzhiNGVmXkEyXkFqcGdeQXVyNDU2OTIyMTc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "9 Feb. 2016",
      "plot": "Eighteen months have elapsed. While investigating a bizarre case of sheep-rustling, Catherine discovers the corpse of prostitute Lynne Dewhurst, Royce's mother, whom she had warned to keep away from her grandson. Along with new recruit Ann Gallagher, Catherine joins the investigation. The woman has been killed and sexually assaulted. CID officer John Wadsworth, meanwhile, is more concerned with preventing his mistress, Vicky Fleming, from telling his wife Amanda about their affair, whilst Ann's father Nevison has to sack volatile employee Sean Balmforth, and Clare ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1094"
    },
    {
      "id": "tt5119124",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Episode #2.2",
      "image": "https://m.media-amazon.com/images/M/MV5BOTNkODNjMTQtOGUyYS00YmE1LTljZGYtYWVmYjIwYTJkZWQ3XkEyXkFqcGdeQXVyNDU2OTIyMTc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "16 Feb. 2016",
      "plot": "Catherine brings home Croatian Ilinka, one of several women rescued from human traffickers, and places her with elderly Polish friend Winnie before joining the house-to-house investigation of the serial killer who murdered three female victims. After his wife's death, Nevison reinstates Sean but Catherine suspects the young man of stalking prostitutes. She also attends Lynn's funeral, which Royce has been allowed to attend. He makes a scene and accuses her of killing his mother, a fact which does not please her superiors. Also present is Frances Drummond who, under an...",
      "imDbRating": "8.3",
      "imDbRatingCount": "899"
    },
    {
      "id": "tt5119144",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "Episode #2.3",
      "image": "https://m.media-amazon.com/images/M/MV5BYjI4NDg1ZjktMTY3YS00NTFmLWFjMmYtZTBhOGY3YTUzMTY1XkEyXkFqcGdeQXVyNjkwNDM2NjU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "23 Feb. 2016",
      "plot": "Catherine reconciles with Clare but her superiors see her as unstable and offer medical leave, which she rejects - accepting to see a therapist instead. Vicky's body is discovered but the murder of yet another prostitute allows John to suggest that both were the serial killer's victims. His marriage is on the rocks anyway. Catherine is shaken by the apparent suicide of one of Ilinka's slave-masters, whom she had tasered and arrested but who had been released on bail. Ilinka thinks he has been silenced. Meanwhile, deceived by Royce's lies, vulnerable, besotted Frances ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "860"
    },
    {
      "id": "tt5119166",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "Episode #2.4",
      "image": "https://m.media-amazon.com/images/M/MV5BYWViMTMyMWUtNDIzMS00ZTk0LTkyNDYtMDJjMTcyYzg1MDU1XkEyXkFqcGdeQXVyNDU2OTIyMTc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "1 Mar. 2016",
      "plot": "Catherine interviews a prostitute who has survived being attacked by Sean Balmforth, who is subsequently arrested and charged as being the serial killer whilst vulnerable young farmer Daryl Garrs is also taken in for hitting out at the thugs who stole his mother's sheep. Catherine is shocked when, on grandson Ryan's birthday, he receives a lavish present, purportedly from his father Royce, which allows Drummond to suggest to the boy that he is anxious for forgiveness. In fact Royce wants a more direct revenge. As John's wife throws him out Neil tells Clare that he ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "848"
    },
    {
      "id": "tt5119176",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "Episode #2.5",
      "image": "https://m.media-amazon.com/images/M/MV5BYzkwZGIzNDYtYzU1Mi00OGMwLWFkMDYtYmU1Mjc5YThhMGJjXkEyXkFqcGdeQXVyNDU2OTIyMTc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "8 Mar. 2016",
      "plot": "Catherine and Ann have a long drunken night out while Frances makes the petrol bomb she plans to throw through Catherine's window.",
      "imDbRating": "8.6",
      "imDbRatingCount": "867"
    },
    {
      "id": "tt5119182",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "Episode #2.6",
      "image": "https://m.media-amazon.com/images/M/MV5BMWZkMjdmNjQtOGYwZi00YWNkLThlNzktNzNmNTZmZDljY2U5XkEyXkFqcGdeQXVyNDU2OTIyMTc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2016",
      "released": "15 Mar. 2016",
      "plot": "Following a tip-off Catherine makes a gruesome discovery at the Garrs' farm, leading to an arrest, as well as learning Drummond's true identity and confronting her with the facts about Royce - though some damage has already been done. Hearing Neil's account of Vicky Fleming's penchant for blackmailing her married lovers and a statement from John's wife's boyfriend means that the net finally closes in on Vicky's killer, once again involving Catherine in a precarious situation.",
      "imDbRating": "9.0",
      "imDbRatingCount": "1101"
    }
  ],
  "errorMessage": ""
}