{
  "imDbId": "tt3322312",
  "title": "Daredevil",
  "fullTitle": "Daredevil (TV Series 2015–2018)",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8574424",
      "warningSpoilers": false,
      "date": "28 September 2022",
      "rate": "10",
      "helpful": "52 out of 53 found this helpful.",
      "title": "Amazing!!",
      "content": "As a huge fan of Marvel I'm a little biased because I pretty much like everything they put out. My bias aside, Daredevil is terrific! It's actually my favorite Marvel show (along with The Punisher). If you don't believe me just read through the reviews here and look at the ratings. Even the critics loved this. Charlie Cox and Vincent D'Onofrio were born to play Daredevil and Kingpin. They're easily the best part of the show. This is a show that you'll want to binge as quickly as you can, it's that good. It's too bad that Netflix couldn't renew their contracts with Marvel and they had to stop making the Netflix Marvel shows because every single one of them was great! Now that they're on Disney they can bring these wonderful characters back. They already started to with Daredevil and Kingpin showing up in other shows and they just renewed Daredevil for another season. Now they have to do the same for The Punisher, Luke Cage and Jessica Jones. At least bring them back into the MCU somehow. If you're a Marvel fan then this is a must watch!"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw4862172",
      "warningSpoilers": false,
      "date": "18 May 2019",
      "rate": "9",
      "helpful": "95 out of 102 found this helpful.",
      "title": "best of the Marvel Netflix pocket universe",
      "content": "Matt Murdock as a child was blinded by a toxic spill from a crash. He becomes a lawyer fighting for the little guys. In secret, he develops his other senses and becomes the vigilant Daredevil of Hell's Kitchen. Foggy Nelson is his law partner. They defend Karen Page in the first episode and she becomes their office manager. Later, she becomes a journalist. Their main nemesis is master criminal Wilson Fisk known as Kingpin.It's the first of the Netflix Marvel universe. It's also the best of them. It's a moderately budgeted series geared towards more adult stories. The characters are compelling. The actors really work. It maintains the cartoon action while giving some real world tension to the stories. The first season sets up this pocket universe with a great tone and great start. The second season fades a little. The thirteen episode runs may be a little too long. The third season returns to form as Vincent D'Onofrio takes back the mantle as the head villain. It is as much his story as it is Matt Murdock's story. It does dwell on Dex a little too much as it tries to set up his character. In the end, Dex and Nadeem are not much more than one season wonders and they aren't a draw for the audience. Dex would become another big Daredevil character but the show is canceled before that. With Disney-Marvel starting up its own streaming service, the partnership with Netflix ends after three seasons. It's been a really fun side hustle and this is the best of the them."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7254030",
      "warningSpoilers": false,
      "date": "21 August 2021",
      "rate": "10",
      "helpful": "53 out of 58 found this helpful.",
      "title": "Absolutely Awesome!",
      "content": "Daredevil was such an incredible show! Charlie Cox (Daredevil) and Vincent D'Onofrio (Wilson Fisk) led such an amazing cast who were all at the top of their game throughout the entire series! It's too bad that Marvel and Netflix had to split up because they made some pretty special shows. All of them were great but Daredevil and The Punisher were easily the best of them! It's one of the best superhero/crime shows ever made and where all 3 seasons were great! There's really not much more to say that hasn't already been said about this amazing show so just do yourself a favor and go watch it!"
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw3442545",
      "warningSpoilers": false,
      "date": "30 March 2016",
      "rate": "10",
      "helpful": "246 out of 282 found this helpful.",
      "title": "One of the best superhero series!",
      "content": "After delivering a wonderfully crafted show with Agent Carter, Marvel is back with another one, Daredevil. I love Netflix. They are enjoying good business. I think Marvel is one step ahead according to DC in TV series. My favorite was superhero series Daredevil. He is lawyer in the morning but he fights with criminals at nights. The fight scenes are quite impressive and realistic. Hallway scene in first season, stairs scene in second season. Enormous scenes! The show has a great atmosphere and is extremely dark, but it has a couple of jokes fitted around. The characters are greatly acted and the story is one of the greatest stories that has been on TV recently. The supporting cast is very good and characters get a lot of shared screen time, exploring street level hero stuff in ways we haven't seen and providing some real grit and action like never before in this genre. Punisher and Elektra were above my expectations. I can't believe this surpassed my expectations. The show is perfect, by far the best superhero show to have ever played on screen. This is by far my favorite thing the MCU has produced thus far. Daredevil is a must watch for Superhero fans, DC, Marvel or both. And I'm sure, you'll enjoy it! 10/10"
    },
    {
      "username": "paul_haakonsen",
      "userUrl": "https://www.imdb.com/user/ur22654354",
      "reviewLink": "https://www.imdb.com/review/rw4311198",
      "warningSpoilers": false,
      "date": "29 August 2018",
      "rate": "8",
      "helpful": "31 out of 34 found this helpful.",
      "title": "Now this was impressive...",
      "content": "Now, I can't really claim to be much of a fan of superheroes in general, but I was recommended that I watched \"Daredevil\", but was a little bit reluctant given the movie that had Ben Affleck in it.But I decided to give it a go anyway, and must admit that I was so happy and thrilled that I did so, because \"Daredevil\" really turned out to be an amazing thrill ride of entertainment, action and character development.You quickly take a liking to the various characters in the show, both good and bad, because they are so detailed and nuanced that it feels so very realistic and natural. And it was helped along so nicely by a rather impressive cast whom put on amazing performances. I was especially impressed with Charlie Cox (platying daredevil), Vincent D'Onofrio (playing Wilson Fisk), Elden Henson (plating Foggy Nelson) and also Deborah Ann Woll (playing Karen Page).One thing that didn't sit well with me, was the fact that you had to wait the entire first season before you got to see the suit. A clever way of keeping the viewers glued to the screen or just downright idiocy? I do not know, but I believe it was the former.Granted I have only seen seasons 1 and 2, but I have been so very adequately entertained by it, that I most definitely want to watch season 3 as well."
    },
    {
      "username": "roaches_97",
      "userUrl": "https://www.imdb.com/user/ur141489368",
      "reviewLink": "https://www.imdb.com/review/rw8537515",
      "warningSpoilers": false,
      "date": "12 September 2022",
      "rate": "10",
      "helpful": "29 out of 30 found this helpful.",
      "title": "One of the best superhero adaptations",
      "content": "Season 1 - 9/10 Season 2- 7/10 Season 3 - 10/10This show is awesome. It's intense, violent, the action is awesome, and it's well written. I watched this because Disney announced a new Daredevil series so I figured I should see this first, and it's totally worth a watch. Seeing it for myself also lead me to believe that Disney will without a doubt mess their show up. I can't do it very much justice just by explaining it, so go watch it yourself. Also keep in mind that you need to watch Defenders between seasons 2 and 3. It's okay, like a 7/10, but it's only 8 episodes long, so it's not too painful to get through."
    },
    {
      "username": "lockout-59506",
      "userUrl": "https://www.imdb.com/user/ur106095847",
      "reviewLink": "https://www.imdb.com/review/rw8599073",
      "warningSpoilers": false,
      "date": "9 October 2022",
      "rate": "9",
      "helpful": "27 out of 28 found this helpful.",
      "title": "Another victim of disney",
      "content": "The netflix marvel series were all awesome! Especially when comparing it to the trash disney is pushing out in the name of Marvel. Disney shut down these netflix series so they could take the characters an mash them up in their hot garbage. Such a shame. This is easily one of the best marvel series to be released to date. I have watched luke cage, dare devil and the punisher from Netflix several times over. The iron fist an jessica jones were alright and Ive watched both series but those characters didn't seem to pop like the these did. Even the defenders was a pretty decent outing. I wish netflix could have kept these series going kind of like how Sony has managed to maintain the reigns on the Spider-Man universe until 2050 or something like that."
    },
    {
      "username": "elie-music",
      "userUrl": "https://www.imdb.com/user/ur32075872",
      "reviewLink": "https://www.imdb.com/review/rw4766262",
      "warningSpoilers": false,
      "date": "6 April 2019",
      "rate": "10",
      "helpful": "208 out of 225 found this helpful.",
      "title": "''Daredevil'' the real ''Dark Knight'' of Marvel.",
      "content": "The Marvel Netflix Universe was the best thing in Netflix along with ''Jessica Jones'', ''Luke Cage'', ''Iron Fist'', ''The Punisher'' and ''Daredevil'' is my favorite of them. I was always looking forward to see the episodes when I have time after work.I don't want to tell anything on this trilogy Master-Piece but I'm really sad they cancelled this show but at least it ended with a perfect trilogy of seasons so I suggest you to watch this because Its what I think it is the greatest Marvel adaptation of all time."
    },
    {
      "username": "bartgodboy",
      "userUrl": "https://www.imdb.com/user/ur103335934",
      "reviewLink": "https://www.imdb.com/review/rw7292986",
      "warningSpoilers": false,
      "date": "31 August 2021",
      "rate": "10",
      "helpful": "47 out of 51 found this helpful.",
      "title": "Marvel's greatest failure was cancelling this masterpiece",
      "content": "I know it's probably mostly Disney's fault with the coming of their streaming service Disney+ but man, cancelling what is the best Marvel media ever made is the biggest mistake they've ever made.This show is beyond fantastic. In terms of execution, it's almost flawless, the acting is fantastic (everyone is great, there isnt a single actor who is bad but Charlie cox and Vincent donofrio definitely steal the show, they are masterful), the story is always engaging and the action is on par with the likes of John Wick and The Raid. I cannot recommend this show enough, truly the greatest thing Marvel has ever done."
    },
    {
      "username": "Kingofthehill000",
      "userUrl": "https://www.imdb.com/user/ur80319543",
      "reviewLink": "https://www.imdb.com/review/rw4408852",
      "warningSpoilers": false,
      "date": "20 October 2018",
      "rate": "9",
      "helpful": "454 out of 487 found this helpful.",
      "title": "Season 3...",
      "content": "Let me start by saying Daredevil season 1 was so great it was the reason I got Netflix.Daredevil season 2 for me was ok,I really liked the punisher but I didn't feel much for the main plot.but wow season 3 ..I would probably get my memory erased to relive this masterpiece again... Every character which is introduced has a proper backstory.you actually care about each and every persons motives.you get to choose who you like.i love great villians and this show delivers not one but two.Wilson Fisk from season 1 itself was very impressive and season 3 he delivers an exemplary performance,but the person who stole the show was bullseye,his character development was amazing and the action scenes were phenomenal.usually shows have plot holes ,directors don't really care to fill them up but this show had no plot holes.It was really amazing ,they went for a bit unexpected ending which I really liked.usually multiple villains ruin movies and shows but this they did it so well.lol,this is probably how been afflecks Daredevil movie should have been.Must watch :)"
    },
    {
      "username": "FeastMode",
      "userUrl": "https://www.imdb.com/user/ur104603847",
      "reviewLink": "https://www.imdb.com/review/rw5065569",
      "warningSpoilers": false,
      "date": "17 August 2019",
      "rate": "9",
      "helpful": "19 out of 21 found this helpful.",
      "title": "some of the best fight scenes coming out of hollywood",
      "content": "I LOVE this show. I love the characters. I love the tone, the directing, the cinematography, the music, and ESPECIALLY the fight scenes. I can see everything, they are so clear and well-done.The best complement I can give this show is that it made me, to the full extent of the word, LOVE the character Daredevil/Matt Murdock.Season 1: 9 stars.Too awesome. Captivating. Well-made in every way. Beastly music. One of my favorite villains. Gg. (3 viewings, 12/24/2021)Season 2: 10 stars.Amazing, exciting, well-made, phenomenal fight scenes, intense, deep, thrilling, captivating, enthralling, elektrafying, punishing, daredeviling (4 viewings, 1/6/2022)Season 3: 9 stars.Too awesome. So suspenseful even in the non-action scenes. The stakes always felt high. Super entertaining. Great music. Awesome fight scenes. (2 viewings, 3/6/2022)"
    },
    {
      "username": "emamzadeh-83848",
      "userUrl": "https://www.imdb.com/user/ur87837058",
      "reviewLink": "https://www.imdb.com/review/rw4580470",
      "warningSpoilers": false,
      "date": "13 January 2019",
      "rate": "10",
      "helpful": "212 out of 232 found this helpful.",
      "title": "Save this masterpiece",
      "content": "Save daredevil. Don't let one of the best super hero shows of all time (if not the best) die so soon. Daredevil doesn't deserve this fate. He is the one who keeps the city safe so the Avengers can save the earth. Can't believe such masterpiece ends so soon."
    },
    {
      "username": "reddiemurf81",
      "userUrl": "https://www.imdb.com/user/ur27018907",
      "reviewLink": "https://www.imdb.com/review/rw8625556",
      "warningSpoilers": false,
      "date": "21 October 2022",
      "rate": "8",
      "helpful": "9 out of 9 found this helpful.",
      "title": "There are other ways to see...",
      "content": "Matt Murdock lives in Hell's Kitchen (NYC), where he was born & bred.As a kid, Matt learned he had no choice but to grow up tough. From the dangers of just walking down the street, to seeing his father fight battles in the boxing ring,, there wasn't a choice. Life was just tough. Even more so for a kid like Matt,,,One afternoon, Matt sees an old man about to be hit by a truck while crossing the street. Reacting out of instinct, Matt rushes over abd pushes the man out of the way. Miraculously enough, the truck doesn't hit Matt in the process,, but a barrell of the chemicals the truck was carrying does fall from the truck. The barrell cap comes loose and the chemicals spray Matt in the face, seeping into his eyes. Within moments,, Matt loses his sight,,, permanently.Fast forward to present day. Matt is now a lawyer just starting out in his practice, with his friend / colleague Foggy Nelson.To the outside world, Matt is a blind lawyer who lives a fairly ordinary life in the the big city. However,, Matt Murdock is anything but ordinary. At night, Matt dawns a disguise and prowls the streets and rooftops as the vigilante known as Daredevil (well,, that's what they eventually call him).What a series!! Netflix got this one right!Cox is Matt Murdock/Daredevil. I'd only seen him in one crappy movie before this,, so I didn't know how he'd do. My worries were quickly put to rest. He's incredible.Karen and Foggy couldn't have been cast more perfectly, imo. So good, both of them.D'Nofrio as the KingPin? Genius move by casting. He's so good at bringing depth to every character he plays. He made Fisk so much more than just the bad guy.If you want to watch something gritty that you will become invested in,, this is one to watch."
    },
    {
      "username": "JokesOut",
      "userUrl": "https://www.imdb.com/user/ur123130890",
      "reviewLink": "https://www.imdb.com/review/rw8558680",
      "warningSpoilers": false,
      "date": "21 September 2022",
      "rate": "9",
      "helpful": "21 out of 21 found this helpful.",
      "title": "One of the best piece Marvel created",
      "content": "This show truly needs appreciation and is undoubtedly one of the best tv shows that I watched. I tried to watch it in span of couple of days but couldn't resist so finished each season in 2 days and It was all done within a week and definitely enjoyed each episode.Unlike any other MCU series, this was at another level due to its compelling storyline, great characters and fast paced action scenes. It needed to go a bit more in depth and I would have loved to see more seasons because there was clearly a potential to extend beyond 3 seasons. The Last season was quite engaging and It leaves you wanting more.Charlie Cox as the Matt Murdock was perfect and the soundtrack is pretty amazing.Makes your blood pump even through the whisper of the name \"Daredevil\""
    },
    {
      "username": "ruhsa",
      "userUrl": "https://www.imdb.com/user/ur65838181",
      "reviewLink": "https://www.imdb.com/review/rw4447369",
      "warningSpoilers": false,
      "date": "9 November 2018",
      "rate": "10",
      "helpful": "48 out of 54 found this helpful.",
      "title": "Thank you Netflix",
      "content": "As a comic books fan, I must say he's (Daredevil) one of the most complex characters. I loved it. The characters, story line, fight sequences, scores, production, cinematography, direction, music ,everything was great! Can't wait to see the next season. Season 1 - 8.8 Season 2 - 9.5 Season 3 - 9.3 .Thank you Marvel, Thank you Netflix, simply a perfect show."
    },
    {
      "username": "southdavid",
      "userUrl": "https://www.imdb.com/user/ur0715971",
      "reviewLink": "https://www.imdb.com/review/rw4496043",
      "warningSpoilers": false,
      "date": "5 December 2018",
      "rate": "9",
      "helpful": "12 out of 13 found this helpful.",
      "title": "King(pin) of Superhero TV",
      "content": "As with Luke Cage and Iron Fist before, the demise of \"Daredevil\", which must been seen as the crown jewel of the Netflix/Marvel partnership gives me the chance to write an appraisal for the three seasons we've received.By day, Matt Murdock (Charlie Cox) is a principled lawyer who, along with his friend and partner Foggy Nelson (Eldon Hansen) defend the good people of Hell's Kitchen as a public defendant. Once night falls, he takes a more direct approach, heading to the night as \"Daredevil\" and fighting crime in a more literal sense. Both his divergent lives bring him up against Wilson Fisk (Vincent D'Onofrio) a brutal but intelligent criminal mastermind.Daredevil is really, for whatever reason, a cut above the other shows that have made up this Netflix shared universe. It might be something to do with the quality of people that were attracted to work on it behind the camera. Stephen D Knight and Drew Goddard initially, though Goddard moved on after the first season. The real star of the show though are whomever the fight co-ordinators are. There is at least one glorious corridor battle in each series, with the one in the first season, where the camera pans up and down a corridor as DD battles various goons crossing in and out of the shot being one of the my most memorable TV sequences of all-time.It might also just be that the character is better than his Defenders contemporaries. Though still powered, heightened senses related to his blindness, he doesn't have the same invulnerability that make Jessica Jones and Luke Cage's battles more one sided affairs. They also aren't afraid to show the damage that the fighting causes to Matt and the toll it takes on his body. Charlie Cox does an excellent job playing Murdock, so much so I really don't feel like I want to see anyone else take on the role if Disney does decided to reboot the series for their own app.Though they did get to hit some of the characters key points, his relationships with Elecktra, Frank Castle and Bullseye, it still feels like an opportunity missed here to continue to create some great television."
    },
    {
      "username": "jtgarcia-13987",
      "userUrl": "https://www.imdb.com/user/ur76147824",
      "reviewLink": "https://www.imdb.com/review/rw4744658",
      "warningSpoilers": false,
      "date": "26 March 2019",
      "rate": "10",
      "helpful": "300 out of 324 found this helpful.",
      "title": "Easily the Best Show I've Ever Seen!",
      "content": "I seriously don't understand why Netflix would cancel this show. The writing was spectacular, the acting was phenomenal, the action scenes are just perfect, and so much more. I cannot even express my love for this show. I was a fan of the Flash and thought it was a good show until I watched this. I haven't even continued the Flash since because it does NOT compare to this show.Vincent D'Onofrio's Wilson Fisk is easily my favorite MCU villain. He's just so compelling and thrilling. He truly brings this show to life. Jon Bernthal as Punisher was absolutely flawless. Wilson Bethel as Bullseye is a fantastic villain. And finally, we have Daredevil himself: Charlie Cox. Charlie Cox IS Daredevil. No question about it. Just watch it. You'll thank yourself.This is a spectacular, more realistic adaptation of Daredevil and it works so well. The action is done much more realistically, making them even better. Action, character development, story, all the things a TV show and movie should have can all be found right here.WATCH. IT. It will change superhero shows for you forever"
    },
    {
      "username": "lnvicta",
      "userUrl": "https://www.imdb.com/user/ur30151001",
      "reviewLink": "https://www.imdb.com/review/rw3465528",
      "warningSpoilers": false,
      "date": "8 May 2016",
      "rate": "9",
      "helpful": "51 out of 64 found this helpful.",
      "title": "One of the best live action comic book adaptations of all time.",
      "content": "Daredevil is the kind of show that, even when taken out of context, is still a great piece of work. Even if Marvel wasn't associated with this at all, Daredevil would still be one of the best crime/vigilante dramas out there. It's just great storytelling elevated by its superhero backdrop, with classic characters like Wilson Fisk and The Punisher butting heads with Matt Murdock through insanely choreographed fight sequences (the best in Marvel history) in the dark, gritty streets of Hell's Kitchen. Daredevil shows the grimier side of Marvel for sure, not quite as disturbing as Jessica Jones, but there's a fair share of graphic imagery. It's never gratuitous, though. The violence is real and raw, and you believe the wounds Daredevil gets in his numerous altercations, painfully so. Every little detail is accounted for, from the functionality of Foggy and Matt's lawyer firm to the martial arts techniques used in the many mind-blowingly impressive fight scenes. It all works so well; the writing is sharp, sometimes slow and brooding but it always pays off, and it's character-driven without delving into soap opera territory like many comic book shows do (though the Elektra storyline comes close). Wilson Fisk is one of the best villains to come out of Marvel live action universe, played to perfection by Vincent D'Onofrio. The acting all around is top-notch. Charlie Cox gives a convincing performance of the blind lawyer vigilante, and Jon Bernthal as the Punisher is superb. You begin to care about every character though, even the antagonists. Frank Castle is a written as a fully fleshed out person - he does what he does for a reason that's very personal to him, and you understand why and you care. Even Foggy and Karen, who I didn't care much for in season 1, grew on me by season 2 and I really came to like some of their arcs. The first four episodes of season 2 might be the best stretch of comic book episodes put to screen, ever. It's unbelievable. Seeing that alone should sell you on the show (but you should most certainly start with season 1). Daredevil is just something you have to experience if you're a comic book fan, or an action fan, or a fan of quality television. It's that good."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw6243727",
      "warningSpoilers": true,
      "date": "7 November 2020",
      "rate": "9",
      "helpful": "21 out of 25 found this helpful.",
      "title": "\"Lawyer by day, vigilante by night. Hell does that work?\"",
      "content": "On the strength of the Netflix series \"The Punisher\", I decided to give \"Daredevil\" a shot and I'm glad I did. Both series have incredible writing and really dig into the character of their protagonists. I think I liked Punisher just a tad better even if I rated both series the same, that's just a personal preference. And like \"The Punisher\", this review is based only on the first season which I just finished, so I'm open to further consideration. Starting out, it didn't appear to me that actor Charlie Cox was appropriately cast in the title role, but as the chapters of Season One rolled by, he grew on me as both Daredevil and alter-ego Matt Murdock. And if you've read the Marvel comic on which this is based, you'll know there's no separating the costumed hero from his origins in New York City's 'Hell's Kitchen'.The thirteen episode first season introduces familiar characters from the Daredevil comic, notably young Matt's mentor 'Stick', portrayed by Scott Glenn, and one of Daredevil's primary antagonists - Wilson Fisk. I thought casting Vincent D'Onofrio in the role of Fisk was a major coup, he really brings the character to life in a way that makes it credible on screen as opposed to the comic book page. The story itself is expertly written, with intertwining connections among Fisk, Russian gangsters, Chinese heroin merchants, and Japanese Yakuza. Revenge and betrayal are all par for the course among the bad guys, with side stories of dirty cops, an intrepid newspaper reporter, and a handful of twists that make you sit up and take notice.Since I watched the Punisher series first, I was somewhat surprised by character appearances bearing the same name in this program because they didn't seem like the same person, even though they were portrayed by the same actors. Apparently, Karen Page (Deborah Ann Woll) develops as a principal over the course of the two series, as well as Brett Mahoney, the cop who later becomes a detective, well portrayed by Royce Johnson. Actually, that adds a lot to the appreciation of these series, which further enhances anticipation to see if they show up in other shows like \"Luke Cage\" , \"Iron Fist\" and \"The Defenders\", all part of the Marvel Universe. In fact, by cheating a bit and reading ahead, I see that the Punisher is a leading character in the second season of \"Daredevil\", which makes it all the more reason to get to once I wrap up this review."
    },
    {
      "username": "frankiesilver-91836",
      "userUrl": "https://www.imdb.com/user/ur120447312",
      "reviewLink": "https://www.imdb.com/review/rw8419548",
      "warningSpoilers": false,
      "date": "9 August 2022",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "The best superhero show I've ever seen. A masterclass in its genre.",
      "content": "SEASON 3 REVIEW (and final thoughts on the show):I've finally finished the show I've praised so much already, and Season 3 did not disappoint.This season takes Matt at his lowest point, where he feels like he's lost himself, and it gives him the most satisfying redemption thinkable.It's peak superhero storytelling. Seeing him try to rebuild himself physically and emotionally, accepting that he is Daredevil, but he is also Matt Murdock, and he needs his friends to be who he always has been.It's so impressive how they implement his religion and struggle with faith into the story, it is done so carefully and is beautifully woven into his character arc. It handles the matter better than a lot of \"religion-based\" storytelling/shows.Ultimately, the show has validified Daredevil as my all-time favorite hero, despite knowing nothing about him before watching. There is something so special about his character. He learns how to become \"a man without fear' but doesn't lose himself or his purpose.But this isn't just a show with an amazing hero/protagonist, it also has amazing villains.Kingpin is back in full force and I must say, specifically in this season he is easily the most mind-blowing and impressive villain I've seen in anything of the genre. Every second he is on screen is amazing. He's so calculated and the acting only makes it so much better.Along with him is the new addition of Bullseye aka Agent Poindexter. He is such an epically twisted man with so much potential that I hope we get to see realized in future Marvel projects.And then there's the supporting cast: First off, Foggy is just as great as always. The best \"best friend\" character.Nadeem was a pleasant surprise who you can't help but feel awful for by the end.Karen especially was at her best this season. Her stand-alone episode was so powerful. I love her to death and she needs to return.This show culminates in of the best finales ever. Seeing Matt, Foggy, and Karen back together is the most wholesome thing and Matt's final confrontation with Fisk is so powerful and genuinely inspirational. Between the acting and the score, it is genuinely tear-jerking every time I go back to either one of these scenes.So is Season 3 better than Season 1? I'd argue maybe so, but either way, the show as a whole is up there with The Walking Dead as my favorite ever (and definitely better as a whole too).It's a masterclass in its genre that uses the superhero concept to make a story way more powerful than it has any right to be.I'm so happy to have Daredevil and Kingpin return to the MCU, and both excited and cautiously hopeful about the continuation show Daredevil: Born Again. Still, I don't think they'll ever be able to live up to what they did here.So yeah, WATCH DAREDEVIL!!!"
    },
    {
      "username": "Here_2_Review",
      "userUrl": "https://www.imdb.com/user/ur93857030",
      "reviewLink": "https://www.imdb.com/review/rw4412888",
      "warningSpoilers": false,
      "date": "22 October 2018",
      "rate": "10",
      "helpful": "33 out of 39 found this helpful.",
      "title": "This show....",
      "content": "Daredevil is some of the best I have ever seen from MCU...particularly Netflix MCU! Season 1 and 2 are good and worth your time, but season 3...omg This season is a MASTERPIECE!!!! It does everything right and even better than the first 2 seasons. This new season really fleshes out every character so much more, Matt himself, Karen, Foggy, KINGPIN, Dex, holy cow! For villainous performances, D'Onofrio was BORN to play Wilson!!! He is even a better Kingpin than in the Spiderman Ps4 game! All Netflix Kingpin has to do is sit with a straight face and still look like he will choke a person out or put a head through a table at any moment. You do not see Vincent on Kingpin at all... This is the best role of his career! Before season 3 showed up, I knew NOTHING about Ben Poindexter in the world of Marvel as far as comics or whatever.. This show gives you Pointexter's entire backstory all at once, but so cleverly well done, omg! How it does it is a long process, but NEVER drags or takes you out of the show! How Dex is portrayed in this show, when he is in the spotlight, you somewhat give a crap about him. This season gives the audience who has never picked up a comic, like myself...all the help needed to learn way more about Matt, Karen, Foggy, etc in through the best performances I have ever seen in this show.. The character development is beautiful, the tone, everything. This season is just a beautiful flawless masterpiece! Almost puts the first two seasons to shame! BETTER BE A FOURTH SEASON!!!"
    },
    {
      "username": "niamhcostello-16921",
      "userUrl": "https://www.imdb.com/user/ur93712275",
      "reviewLink": "https://www.imdb.com/review/rw8574526",
      "warningSpoilers": true,
      "date": "28 September 2022",
      "rate": "9",
      "helpful": "19 out of 19 found this helpful.",
      "title": "AMAZING show and fantastic ending",
      "content": "Such a good ending!! The fight scenes were great, and I'm glad at how the show finished. It was great characterisation that Matt didn't kill Fisk (even though I kind of wanted him too), and I love how Nadeem helped even from after he got killed. It was a good redemption arc for him, and it was nice that he was the one who caused Fisk's downfall. Loved seeing Matt, Foggy and Karen back together again working together. Wished we had more of that the rest of the season. Really want another season just seeing the three of them working together, with no drama or murders, just simple cases. A girl can dream 😂Will miss seeing Charlie Coz as this daredevil, hope the new MCU version will be just as good. The last scene with Dex made it seem like there would be a 4th season (which there definitely isn't). Wished the scene of Matt, Foggy and Karen deciding to work together was the last scene."
    },
    {
      "username": "cjonesas",
      "userUrl": "https://www.imdb.com/user/ur79683341",
      "reviewLink": "https://www.imdb.com/review/rw5468409",
      "warningSpoilers": false,
      "date": "8 February 2020",
      "rate": "10",
      "helpful": "17 out of 20 found this helpful.",
      "title": "A titanium 10 for a phenomenal show",
      "content": "Praise, awe, applause, appreciation, flawlessness, pure gold material laced with diamonds are only some of the terms that pop to mind when talking about Daredevil, the series.IMO it is easily in the top five of all time TV series regardless of viewers ratings.It is so good, so well-made, so atomic that only praise come to mind and i am not someone easily bowing to the sparkling value of something.The writing, the opening sequence, the acting, the soundtrack & music, the fights choreography, the development are the BEST that I have ever watched and listened to in a TV series. Flawless in all aspects.Charlie Cox IS and personifies Daredevil. He truly brings the hero to life in the small screen and easily delivers the most stellar embodiment and performance of his career.Vincent D'Onofrio as Wilson Fisk is sheer joy to watch and ponder on his acting. Never ever will an actor outshine him in this role. His staring at a white and bare wall is so magnetic and contagious that I do so from time to time to gather energy, to find focus and straight my mind up, and it works.All the supporting cast do a tremendous job. Every one of them.Karen, Foggy, Elektra, Vanessa, Punisher, Bullseye, Maggie, Claire... The fighting sequences are the best that I have ever had the pleasure to watch in any TV show. The choreography, timing and martial arts' value are just breathtaking and masterfully performed.All seasons delivered. All deserve a true 10. Seasons 1 and 3 being my favorite together with season 2, episode 3 - New York's Finest.Having a universe watching it, it came to an end because of Netflix! Whatever events, judgements and decisions led to that debacle are just unforgivable.May it rise from its ashes on another Network and fill us up, The Fans, with ecstasy and bliss for more seasons to come.Watch it, re-watch it and never let go of 'the man without fear'."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw6096784",
      "warningSpoilers": false,
      "date": "15 September 2020",
      "rate": "9",
      "helpful": "25 out of 32 found this helpful.",
      "title": "Devil of Hells kitchen",
      "content": "You know when you watch something and someone grows on you? Vincent D'Onofrio is a great actor his turn as a villain is fantastic, his presence is felt, even when he's just shortly seen like in season 2. But the main character, Daredevil and his two sidekicks - I didn't exactly feel them too much at the beginning. There was a certain blandness there. Maybe it wasn't Ben Affleck then and it is the role that is weird to say the least.The cast over the seasons is amazing to say the least. Having people like Scott Glenn appear and even have action scenes that would make Liam Neesons Taken character jealous and/or proud is quite something. And speaking of action: the choreography is amazing to say the least. What didn't quite work in Iron Fist Season 1, is full on display here. I liked all the seasons of this but it does end on quite the high note ... which is sad overall because the character grew on me. Then again, there are talks of Marvel maybe reviving the show or at least the character (for the MCU I'd reckon, maybe on Disney +) ... it would be interesting to see how the violence would be handled though. Netflix did not hold back ... Disney on the other hand is more ... let's say family orientated. We'll see I reckon, great show with an amazing season 3, that ticks off all the right boxes!"
    },
    {
      "username": "danieljackthomas",
      "userUrl": "https://www.imdb.com/user/ur94686337",
      "reviewLink": "https://www.imdb.com/review/rw4537237",
      "warningSpoilers": false,
      "date": "27 December 2018",
      "rate": "10",
      "helpful": "29 out of 33 found this helpful.",
      "title": "Post-Cancellation Review",
      "content": "Okay, I rarely do reviews on here, and when I say rarely, I mean I've done two others before.Can I just say, that it is 1. CRIMINAL that this show has been cancelled by Netflix and 2. LIKELY that it's due to the Disney+ Streaming Service (regardless of rumours) and will hopefully be continued on there (or at least the character).This is genuinely such an AMAZING series. From the acting, to the story-lines, to the character development to the fight choreography.Trying to keep it as brief as possible, it pays extremely respectable homeage to the comicbook source material (DD, Kingpin & S3 Bullseye are all far better than i could have hoped for) whilst also featuring some of the greatest martial arts fight choreography in Western Film/TV. It really is hands down the best superhero series out there, and in my top 3 TV series of all time (Game of Thrones first & Stranger Things third).It is that grounded in realism yet respectfully invested in the Marvel/Daredevil Universe that i recommend it to friends who love Superheroes/Sci-fi and those who don't. This really is the \"Dark Knight\" of Marvel productions, yet with better action.I really can't praise this season anymore than I can, and I can only hope that the MCU continues with the adventures of Charlie Cox specifically (and the actors of kingpin, Bullseye, heck even Foggy and Karen) as they really make the characters who they are.9.5/10 (I rounded to 10 for my vote)"
    }
  ],
  "errorMessage": ""
}