{
  "imDbId": "tt7908628",
  "title": "What We Do in the Shadows",
  "fullTitle": "What We Do in the Shadows (TV Series 2019– )",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8791644",
      "warningSpoilers": false,
      "date": "10 January 2023",
      "rate": "10",
      "helpful": "53 out of 53 found this helpful.",
      "title": "One of the funniest shows ever!",
      "content": "What We Do in the Shadows is not only one of the funniest shows on tv right now but it has become one of my favorite comedies of all-time. It reminds me a little of Seinfeld in which every character on the show is as equally as funny as the others. It's hard to pick out the best and everyone has their own favorite. It's based on the film of the same name and is created by the same people, Taika Waititi and Jermaine Clement. As funny as the movie was the show might be even better. It's one of the rare shows where every single episode is hilarious! There's nothing more I can really say except to go watch this show, I promise you'll love it!"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw5717044",
      "warningSpoilers": false,
      "date": "7 May 2020",
      "rate": "10",
      "helpful": "128 out of 141 found this helpful.",
      "title": "Hilarious!",
      "content": "What We Do In the Shadows is one of the best new comedies to come out in years, it's actually one of the funniest comedies I've ever seen! I absolutely loved the movie so I thought this was going to be a letdown but boy was I wrong...EVERY episode is great!"
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw8498542",
      "warningSpoilers": false,
      "date": "30 August 2022",
      "rate": "9",
      "helpful": "25 out of 26 found this helpful.",
      "title": "Excellent Start",
      "content": "I was told to watch this by my son. It was worth it. The three vampires are hilarious. They are balancing being everyday citizens with being folks who suck blood and kill. Guillarmo is the guy who keeps everything moving along. He is called a familiar. He opens caskets. Rounds up virgins. And hopes someday to be a vampire. The first episode involve a visit from an ancient vampire, a nosferatu look-alike who pops out of a sarcophagus. He is apparently quite a stud but the others can't wait for him to be gone. One hilarious bit takes place in a stationary store where they are buying glitter and crepe paper (creepy paper?). Guillarmo has a rough time getting them to be accepted as normal customers."
    },
    {
      "username": "mignonette1",
      "userUrl": "https://www.imdb.com/user/ur26722321",
      "reviewLink": "https://www.imdb.com/review/rw4821717",
      "warningSpoilers": false,
      "date": "2 May 2019",
      "rate": "10",
      "helpful": "213 out of 239 found this helpful.",
      "title": "As good as the movie!",
      "content": "For any who haven't seen the movie of the same title, it's highly recommended.I was worried the show wouldn't be able to capture the comedic genius of the movie, but i have not been disappointed in the slightest. It's fantastic!"
    },
    {
      "username": "pontram",
      "userUrl": "https://www.imdb.com/user/ur17731534",
      "reviewLink": "https://www.imdb.com/review/rw8541550",
      "warningSpoilers": false,
      "date": "13 September 2022",
      "rate": "",
      "helpful": "22 out of 23 found this helpful.",
      "title": "The Munsters of the 21st Century",
      "content": "This is an absolute beloved show of mine, and I love the mockumentary style, since the wonderful and political incorrect 'Death Valley', which had to disappear for no reason.The humor is very dry. The actors and their characters are why I fell in love with the show. Kayvan Novaks' and Mark Prokschs' performances, now basically the same over the course of four seasons, they never get dull. Between them, my beloved Matt Berry and incredible Nastasia. Demetriou do their thing with ease, while poor but sympathetic Harvey Guillen has the unthankful job of being their mundane servant (with some special abilities though). Kirsten Schaal, who I loved and hated equally in 'The last man on earth' becomes a very nice regular in season 4.Watching this show is like watching something from another age (hence my title), and I embrace every episode, great, good, or mediocre (yes there are some).Also, the title music and the ending songs, along with other music themes in the show, are great. Matt Berry as the great musician he is, has often his hands in it (especially in season four).The stories are often covering surreal facets of our daily life, and by transforming them into the vampiric lifestyle, they show how ridiculous these things are.Note that in my opinion the show has not much to do with the original movie (except vampires living in a shared flat), which I found nice, but not great. The show is much more sophisticated.The four seasons up to now (fall 2022) I would rate as following: S01 - Hilarious entrance 9/10 S02 - A lot of wonderful ideas 8/10 S03 - Always surprising 8/10 S04 - Slightly decreasing story quality 7/10."
    },
    {
      "username": "morrisonliz",
      "userUrl": "https://www.imdb.com/user/ur71079374",
      "reviewLink": "https://www.imdb.com/review/rw4749442",
      "warningSpoilers": false,
      "date": "29 March 2019",
      "rate": "10",
      "helpful": "247 out of 285 found this helpful.",
      "title": "I'm dying!",
      "content": "This show is hysterical. Reminds me of the British 'The Office' without the uncomfortableness. Some people said the jokes don't land but that's the point. It's supposed to be awkward. So glad I found this. Not many shows interest me."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw4916227",
      "warningSpoilers": false,
      "date": "6 June 2019",
      "rate": "9",
      "helpful": "34 out of 40 found this helpful.",
      "title": "Superb: in the same league as the movie",
      "content": "(Updated after Season 4).Four vampires and their human helper share a house on Staten Island, New York. Turns out vampires have domestic problems too.What We Do In The Shadows, the movie, was released in 2014. Co-written and -directed by Jermaine Clement (Flight of the Conchords) and Taika Waititi (Boy, Hunt for the Wilderpeople, Eagle vs Shark, Jojo Rabbit) it was brilliant: with wonderfully understated humour, sharp dialogue and clever skits it was quirkily funny and intelligent without becoming silly or even seeming to try too hard.The movie was set and filmed in Wellington, New Zealand and captured the folksy understated humour that is a New Zealand trademark. When I discovered that the series is set in the US, I had my doubts as to how it would measure up to the movie, figuring it had been hijacked by US producers and writers.I needn't have worried.Clement and Waititi are the executive producers and lead writers, so, while the setting has changed, the creative geniuses behind the movie are behind the series too. The series largely captures the same quirky, understated humour of the movie, but with different characters and actors, and the new players don't put a foot wrong.Not entirely the same feel as the movie: the movie felt more candid (as was ostensibly filmed by a documentary crew), giving it a slight edge but there is little to choose between the two.Four seasons in and the show is as good as ever, showing that the writers haven't run out of ideas. There's also a long-term story arc developing, making it even more interesting."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw8481373",
      "warningSpoilers": false,
      "date": "23 August 2022",
      "rate": "10",
      "helpful": "23 out of 26 found this helpful.",
      "title": "Way better than I could've imagined",
      "content": "This is so good I'm blown away by how enjoyable What We Do in the Shadows is! Well deserving of the 8.6 rating on IMDB, I'd agree with any great reviews. I love most the scenes and the main song You're dead is so damn good. Been skeptical of the series for awhile cause the humor but it's perfect, I'll definitely enjoy binging to catch up. I've absolutely fallen in love with this series easily one of the best out there!"
    },
    {
      "username": "thesar-2",
      "userUrl": "https://www.imdb.com/user/ur17825945",
      "reviewLink": "https://www.imdb.com/review/rw7825831",
      "warningSpoilers": true,
      "date": "2 February 2022",
      "rate": "9",
      "helpful": "13 out of 14 found this helpful.",
      "title": "What I'd Do to Guillermo",
      "content": "Really kinda sad here...Just wrapped up Season 3 of What We Do In The Shadows and now have to wait for Season 4 - but at least it was renewed! This show is INCREDIBLE. Wonderfully written, hilarious, original (except for The Office/Parks & Rec filming style, of course) with a great cast, snappy and quick dialogue and a standout that improved episode by episode: Harvey Guillén's Guillermo de la Cruz.He really is the center of this show and impresses me all the time. Of course, he's gorgeous and I love his voice and mannerisms, but beyond that, he's the glue that holds both the show and the scripts together. I do love the entire cast, but this show wouldn't be half of what it is without him.And talk about perfect casting. ALL actors (and some puppets) belong in this movie and universe. I never once failed to believe these could be real-life characters and that's difficult for a show about the Undead.The show, about four long-\"living\" vampires living under one spooky roof with their familiar and being filmed as a documentary for them/mockumentary for us, is enormously funny and deep, as well. All seasons so far were great and Season 3 was by far their best one. There was even a surprising death I did NOT see coming and it 100% made me sad!! Even in a blatant comedy with hardly any dramatic elements. You just really learned to love this character and would have a hard time seeing the group without her/him.The Cliffhanger Season Three Finale also made me sad. I guess they ARE tugging at our hearts while disguised as a sitcom. I CANNOT wait for this to return and I might watch all three seasons back-to-back as I did just now before Season 4. I need to rewatch the movie, as well. I recall liking it a ton, but I LOVE this show. LOVE.***Final Thoughts: Quite frankly, Guillermo's story is tragic and despite him allowing himself to unsuccessfully try for unacquired love, I can truly relate to him. Guillermo spent 10+ years wanting to be a vampire and also possible love interest to one of the Vamps, and I did the same for about 7 years with a roommate. Now...he wasn't a vampire, as far as I know..."
    },
    {
      "username": "jimel98",
      "userUrl": "https://www.imdb.com/user/ur4841956",
      "reviewLink": "https://www.imdb.com/review/rw5772566",
      "warningSpoilers": false,
      "date": "26 May 2020",
      "rate": "10",
      "helpful": "35 out of 40 found this helpful.",
      "title": "Energy Vampires are REAL!",
      "content": "My review (#224) will get lost in the shuffle, but I had to add something. I didn't read ALL the reviews, I eventually will have to go to bed, but the ones I did, I agree with, absolutely. This show IS brilliant, funny, dark, twisted and all that other devilishly wonderful stuff. The one thing I feel the need to add is a reference to Colin Robinson, played brilliantly by Mark Proksch. Ok, he's not one of the leads, but he's very, very funny in his own right. None of us will EVER know a real vampire (though sure, there are nut jobs who think they ARE real vampires) but we've all met Energy Vampires, THESE FOLKS ARE REAL! And it's great to see Colin interact with the regular vampires and the way they grudgingly accept him as one of their own, in some ways. I just hate the idea that this character and this actor are overlooked because, he's a very funny take on a very real issue. I'm glad he's been getting more screen time this season. Thanks cast, crew, producers for this fantastic show."
    },
    {
      "username": "degrees-43497",
      "userUrl": "https://www.imdb.com/user/ur157237587",
      "reviewLink": "https://www.imdb.com/review/rw8667997",
      "warningSpoilers": false,
      "date": "11 November 2022",
      "rate": "10",
      "helpful": "30 out of 31 found this helpful.",
      "title": "On the best shows on TV today... Hysterical :)",
      "content": "We never miss an episode. Since the movie by Waititi and Clement, we have been absolute fans of the whole idea of a house of vampires just trying to \"get by\" in the modern world. A hysterical concept excellently produced. All the actors embrace their roles to the hilt, and the comedy material is profound and abundant. The show just gets sillier and sillier... in the best way. Despite the concept - a house in the middle of the suburbs full of vampires who are kind of \"nice guys\" - they somehow make it tangible and even sympathetic. With all the vast number of \"dark & evil\" vampire tales out there, this show perfectly counterbalances the genre with some much needed silliness, presented in a thoroughly enjoyable romp every episode. Highly recommended, and I equally recommend you see the original movie for the greatest context."
    },
    {
      "username": "djozone001",
      "userUrl": "https://www.imdb.com/user/ur18558772",
      "reviewLink": "https://www.imdb.com/review/rw4802048",
      "warningSpoilers": false,
      "date": "25 April 2019",
      "rate": "9",
      "helpful": "88 out of 104 found this helpful.",
      "title": "It's the little things in life",
      "content": "This show grows on you if you enjoy Halloween and vampires and office comedy and mockumentary style shots. Keep em coming!"
    },
    {
      "username": "raptorshark",
      "userUrl": "https://www.imdb.com/user/ur9064540",
      "reviewLink": "https://www.imdb.com/review/rw8424329",
      "warningSpoilers": false,
      "date": "11 August 2022",
      "rate": "9",
      "helpful": "20 out of 21 found this helpful.",
      "title": "hilarious",
      "content": "Aside from this show bring amazing, I just want to say that the set design and wardrobe are glorious, some of the best I've ever seen I appreciate it so much!!!Practical effects also!!! I hope wwdits continues for several more seasons:)"
    },
    {
      "username": "NormalGuyReviews",
      "userUrl": "https://www.imdb.com/user/ur144578527",
      "reviewLink": "https://www.imdb.com/review/rw8471094",
      "warningSpoilers": false,
      "date": "20 August 2022",
      "rate": "9",
      "helpful": "22 out of 24 found this helpful.",
      "title": "A Workplace Comedy (but with vampires)",
      "content": "I know it may sound strange to call this a workplace comedy but if a vampires job is to hunt and overall be a vampire then it fits. The show has that Office, Parks and Rec type vibe but add Vampires and yes it works and I love it. The show is funny and feels refreshingly original. I recommend this show to anyone who enjoys workplace comedies, vampires, or just wants to laugh. (Also it has a dope soundtrack)"
    },
    {
      "username": "llhorton",
      "userUrl": "https://www.imdb.com/user/ur7283366",
      "reviewLink": "https://www.imdb.com/review/rw4748157",
      "warningSpoilers": false,
      "date": "28 March 2019",
      "rate": "9",
      "helpful": "146 out of 171 found this helpful.",
      "title": "As Good As the Movie... And That's Saying A Lot",
      "content": "The original movie was hysterical from beginning to end and the same folks who wrote and starred in that one, wrote and directed this series. The entire situation is unique and different from anything else on TV, which helps to make it special. Don't miss it!"
    },
    {
      "username": "celt007",
      "userUrl": "https://www.imdb.com/user/ur16126010",
      "reviewLink": "https://www.imdb.com/review/rw8375373",
      "warningSpoilers": false,
      "date": "27 July 2022",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Funniest Show On TV",
      "content": "Funniest show on tv . Hilarious . The cast is superb and the jokes are non stop . Every season is better than the previous so at number 4 now and it's a true masterpiece of tv comedy . Not telling anyone what's it's about just watch and laugh ."
    },
    {
      "username": "ronnie_blackiii",
      "userUrl": "https://www.imdb.com/user/ur27901025",
      "reviewLink": "https://www.imdb.com/review/rw4805787",
      "warningSpoilers": false,
      "date": "26 April 2019",
      "rate": "10",
      "helpful": "70 out of 88 found this helpful.",
      "title": "BAT!!",
      "content": "Short and sweet version....This is absolutely the funniest show on"
    },
    {
      "username": "saucyheifer",
      "userUrl": "https://www.imdb.com/user/ur102099164",
      "reviewLink": "https://www.imdb.com/review/rw4801832",
      "warningSpoilers": false,
      "date": "25 April 2019",
      "rate": "10",
      "helpful": "224 out of 251 found this helpful.",
      "title": "So funny",
      "content": "I love this show. The writing and acting are perfect. It makes me laugh out loud. It is so clever."
    },
    {
      "username": "daveyc-54705",
      "userUrl": "https://www.imdb.com/user/ur117262127",
      "reviewLink": "https://www.imdb.com/review/rw8236088",
      "warningSpoilers": false,
      "date": "13 June 2022",
      "rate": "9",
      "helpful": "11 out of 11 found this helpful.",
      "title": "The Office+The Real World+Vampires=What We Do In The Shadows",
      "content": "This show is an absolute blast. But I also acknowledge that it's for fans of a certain kind of comedy. If the randomness of The Office isn't your cup of tea, I doubt this will be either. And that's ok.An example that jumps to mind is in the first season where they are trying to figure out where to put up a visiting vampire in their house. Someone suggests the attic and Lazlo says \"no the stairmaster is up there!\"Stuff like that gets a laugh out of me. It's random and ridiculous and said by a vampire those things are just multiplied. Don't even get me started on the kickball game they have against the werewolves.This is a funny show. But you'll know almost immediately if it's your kind of funny or not. I'd say give it a shot regardless."
    },
    {
      "username": "IHaveNoCommentToMake",
      "userUrl": "https://www.imdb.com/user/ur138992480",
      "reviewLink": "https://www.imdb.com/review/rw7468307",
      "warningSpoilers": false,
      "date": "22 October 2021",
      "rate": "9",
      "helpful": "40 out of 43 found this helpful.",
      "title": "Seeing the bad reviews is just depressing",
      "content": "It's hard to dislike this show. It has so many gifted and just plain funny actors. It's not gut busting humour, but rather a mellow guffaw. How you can muster enmity against a gloriously silly display like this is beyond me."
    },
    {
      "username": "Cedric_Catsuits",
      "userUrl": "https://www.imdb.com/user/ur9062918",
      "reviewLink": "https://www.imdb.com/review/rw4975223",
      "warningSpoilers": false,
      "date": "3 July 2019",
      "rate": "10",
      "helpful": "16 out of 19 found this helpful.",
      "title": "Genius",
      "content": "The 2014 film which precedes this is comedy gold and I was initially sceptical that this might be watered-down for a more mainstream TV audience. The location is different and there are new characters, but on the whole it lives up to the high standards set by the movie. The casting is spot-on and the acting flawless. The writing is inspired - this could be any family in any street in any town.Indeed, the appearance of some fairly heavyweight stars would suggest that those in the industry recognise the quality of the scripts. It has all the hallmarks of a cult TV show in the making. There is a ready-made audience of vampire fans of course, but these vamps are just so darn human that the comedy should appeal to anybody who recognises how utterly complex and ultimately insignificant people are."
    },
    {
      "username": "philip-dillon",
      "userUrl": "https://www.imdb.com/user/ur45370763",
      "reviewLink": "https://www.imdb.com/review/rw4775242",
      "warningSpoilers": false,
      "date": "11 April 2019",
      "rate": "10",
      "helpful": "189 out of 213 found this helpful.",
      "title": "Absolute Gold",
      "content": "Love this show. Great cast and fun show. Colin Robinson is a great character as the energy vampire"
    },
    {
      "username": "Pukeonthestreet",
      "userUrl": "https://www.imdb.com/user/ur113529171",
      "reviewLink": "https://www.imdb.com/review/rw5475020",
      "warningSpoilers": false,
      "date": "11 February 2020",
      "rate": "10",
      "helpful": "20 out of 25 found this helpful.",
      "title": "Even better than the movie",
      "content": "With time and age the cast writers and directors have only gotten more hilarious. Don't miss it it's one of the best shows currently on tv."
    },
    {
      "username": "tycannah",
      "userUrl": "https://www.imdb.com/user/ur9436910",
      "reviewLink": "https://www.imdb.com/review/rw8333006",
      "warningSpoilers": false,
      "date": "14 July 2022",
      "rate": "8",
      "helpful": "11 out of 11 found this helpful.",
      "title": "A Secret gem of a Comedy Series",
      "content": "Its been around since 2019 but I had never heard of it until recently. Its the best comedy series out there and you will fall in love with the characters. Very reminiscent of \" The Addams family\" or \" The Munsters\" comedy series."
    },
    {
      "username": "CoopertheBeagle",
      "userUrl": "https://www.imdb.com/user/ur152388340",
      "reviewLink": "https://www.imdb.com/review/rw8491239",
      "warningSpoilers": false,
      "date": "27 August 2022",
      "rate": "9",
      "helpful": "18 out of 20 found this helpful.",
      "title": "A sublime comedy, consistently inventive",
      "content": "If you enjoyed the movie, or even if you haven't seen it, you're in for a real treat with the comedy adaptation about vampires in Staten Island. The larger cast, including the core couple Lazlo and Nadja, makes for a lot of scenarios that succeed in going beyond the premises of the film. Somehow after 3-4 seasons they still come up with some of the most inventive concepts which leave the audience pleasantly shocked. Brings together a lot of the character based humor one sees in UK comedies but with the New Zealand quirkiness you see in any of the film's producer's other work. There are also a lot of moments where you realize the characters care about each other, as well as inside jokes that come back over the time, rewarding the audience for paying attention. You will laugh and be amazed."
    }
  ],
  "errorMessage": ""
}