{
  "imDbId": "tt7908628",
  "title": "What We Do in the Shadows",
  "fullTitle": "What We Do in the Shadows (TV Series 2019– )",
  "type": "TVSeries",
  "year": "2019",
  "language": "en",
  "titleInLanguage": "What We Do in the Shadows (TV series)",
  "url": "https://en.wikipedia.org/wiki/What_We_Do_in_the_Shadows_(TV_series)",
  "plotShort": {
    "plainText": "What We Do in the Shadows is an American mockumentary comedy horror television series created by Jemaine Clement that premiered March 27, 2019, on FX. The second television series in the franchise based on the 2014 New Zealand film of the same name written by Clement and Taika Waititi, the series follows four vampire roommates in Staten Island, and stars Kayvan Novak, Matt Berry, Natasia Demetriou, Harvey Guillén, and Mark Proksch.\r\nFour seasons of the series have aired and it was renewed for a fifth and sixth season ahead of the fourth season premiere. The fifth season will premiere on July 13, 2023. It has been critically acclaimed (particularly for its cast and writing) and nominated for 17 Emmy Awards, including Outstanding Comedy Series in 2020 and 2022.",
    "html": "<p>What We Do in the Shadows is an American mockumentary comedy horror television series created by Jemaine Clement that premiered March 27, 2019, on FX. The second television series in the franchise based on the 2014 New Zealand film of the same name written by Clement and Taika Waititi, the series follows four vampire roommates in Staten Island, and stars Kayvan Novak, Matt Berry, Natasia Demetriou, Harvey Guillén, and Mark Proksch.</p><p>Four seasons of the series have aired and it was renewed for a fifth and sixth season ahead of the fourth season premiere. The fifth season will premiere on July 13, 2023. It has been critically acclaimed (particularly for its cast and writing) and nominated for 17 Emmy Awards, including Outstanding Comedy Series in 2020 and 2022.</p>"
  },
  "plotFull": {
    "plainText": "What We Do in the Shadows is an American mockumentary comedy horror television series created by Jemaine Clement that premiered March 27, 2019, on FX. The second television series in the franchise based on the 2014 New Zealand film of the same name written by Clement and Taika Waititi, the series follows four vampire roommates in Staten Island, and stars Kayvan Novak, Matt Berry, Natasia Demetriou, Harvey Guillén, and Mark Proksch.\r\nFour seasons of the series have aired and it was renewed for a fifth and sixth season ahead of the fourth season premiere. The fifth season will premiere on July 13, 2023. It has been critically acclaimed (particularly for its cast and writing) and nominated for 17 Emmy Awards, including Outstanding Comedy Series in 2020 and 2022.\r\nPremise\r\nSet primarily in Staten Island, New York City, New York, What We Do in the Shadows follows the lives of three traditional vampires, Nandor, Laszlo, and Nadja; Colin Robinson, an energy vampire; and Guillermo, Nandor's familiar. The series revolves around the vampires interacting with the modern world and other supernatural beings.\r\nCast and characters\r\nMain\r\nKayvan Novak as Nandor the Relentless – Once the bloodthirsty leader of the fictional kingdom of Al-Quolanudar in southern Iran and a warrior serving the Ottoman Empire. At age 760, he is the oldest vampire and the self-proclaimed leader of the group, leading him to frequently calling house meetings for frivolous discussions. Although he genuinely cares for his human familiar Guillermo, he has difficulty expressing it. Nandor is also quite naive to the ways of modern society and humans, which often results in Guillermo becoming frustrated with him. He is a massive fan of the 1992 Dream Team and collects much of their memorabilia; they also inspired him to apply for American citizenship, but he fails his test after being physically unable to say the phrase One Nation, Under God.\r\nMatt Berry as Leslie \"Laszlo\" Cravensworth – A 310-year-old British nobleman vampire who was turned by Nadja and is now married to her. He is pansexual and a former porn actor, who is often preoccupied with thoughts of sex; he enjoys sexual relationships with both Nadja and Nandor. He also enjoys making topiary sculptures of vulvas in the yard, including those of his wife and mother. He confessed in season 1 to having been Jack the Ripper. In season 2, he briefly goes on the run and assumes the alias \"Jackie Daytona\", a \"regular human bartender\" in Clairton, Pennsylvania (which he chose because it sounded like Transylvania).\r\nNatasia Demetriou as Nadja of Antipaxos – A 500-year-old Greek Romani vampire who turned Laszlo into a vampire and later married him. She is frequently frustrated with her male housemates and nostalgic about her human life. She has entertained an affair with a reincarnated knight named Gregor for hundreds of years, only for him to be decapitated in every reincarnation. In season 3, she reveals that she frequently collaborated with the Rat Pack and later becomes manager of her own vampire nightclub in season 4. Demetriou also plays Nadja's human ghost, split from its corporeal form when Nadja was turned into a vampire. The ghost later inhabits a doll, and appears as a recurring character since season two.\r\nDemetriou also plays Nadja's human ghost, split from its corporeal form when Nadja was turned into a vampire. The ghost later inhabits a doll, and appears as a recurring character since season two.\r\nHarvey Guillén as Guillermo de la Cruz – Nandor's long-suffering Latino familiar. Despite his frustration with his unreasonable workload and Nandor's disregard for his mortality, he has served his master for more than a decade in the hope of being made a vampire, a dream inspired by Armand in the 1994 film Interview with the Vampire. Late in season one, Guillermo discovers that he is a descendant of the famous vampire hunter Abraham Van Helsing, and he proves to be very skilled at killing vampires (including by accident), giving him conflicting feelings about his desire to become a vampire. Guillermo's skill as a vampire slayer leads to him becoming a bodyguard for Nandor, Nadja, and Laszlo in the third season. He reveals he is gay in the fourth season, coming out to his family, with Nadja having to erase their memories about Guillermo's confession about wishing to become a vampire.\r\nMark Proksch as Colin Robinson (and Baby Colin \"The Boy\" in season 4) – An energy vampire who lives in the basement. He lives by draining humans and vampires of their energy by being boring or frustrating. As a \"day walker\", he is not harmed by sunlight or entry into churches and is able to work in a cubicle office and feed on his coworkers' frustrations. Unlike the others, he shows no outward sign of vampirism except that his irises glow when he feeds on energy, and his reflection shows a pale and decrepit version of himself. The others are continually annoyed by him and often try to avoid associating with him, although they are entirely dependent on him as he is the only source of income into the house. In the third season finale, following Colin Robinson's 100th birthday, he dies and his infant offspring (also portrayed by Proksch) bursts out of his chest; Laszlo (having become friends with the original Colin Robinson) elects to raise the child as his own.\r\nRecurring\r\nKristen Schaal as The Guide (also known as the \"Floating Woman\") – An envoy of the Vampiric Council who likes to float and sometimes speak in a demonic voice. In season 4 she becomes close with Nadja and helps her convert the Vampiric Council's headquarters into a vampiric nightclub. (season 3–present; guest season 1)\r\nAnthony Atamanuik as Sean Rinaldi – The human next-door neighbor. He sometimes witnesses Laszlo doing something vampiric, but is easily hypnotized into forgetting everything. The vampires spare him because he brings their trash cans in when they forget, and Laszlo considers Sean his best friend and even makes sexual advances toward him (which Sean forgets due to hypnosis).\r\nBeanie Feldstein as Jenna – a LARPer and virgin whom Guillermo lured for the vampires to feast on. She was later transformed into a vampire by Nadja who witnessed her being treated poorly by her peers. During her vampire training with Nadja, she discovers she has the rare ability to turn invisible, which fits the tendency of people to ignore her. (season 1)\r\nDoug Jones as Baron Afanas – An ancient vampire from the Old Country who believes vampires should rule the world. Both Nadja and Laszlo had secret affairs with the Baron despite his lack of genitals. Later it is disclosed that he is not actually a Baron, but simply \"barren\" because he was unable to have children. In the first season, Guillermo inadvertently kills the Baron by opening a door and exposing him to sunlight. In the third season, however, it is revealed that he barely survived, albeit reduced to his head, torso and left arm. He finally has his full body restored with a more youthful appearance in the fourth season. (seasons 1, 3–4)\r\nNick Kroll as Simon the Devious – A vampire who rules over the Manhattan vampires and owns the Sassy Cat nightclub. He was a close friend to the Staten Island trio when all the vampires first arrived in America. He is obsessed with Laszlo's cursed hat made out of witch skin. (guest seasons 1–2, 4)\r\nJake McDorman as Jeff Suckler – A reincarnation of Nadja's former human lover, Gregor, a knight who has been killed by decapitation in each of his lives. Nadja eventually restores Jeff's memories of his previous lives so that he can be more like his former self, leading to him falling into insanity and being committed to a mental institution. It is later revealed to Nadja and Gregor that Laszlo had been causing each of his deaths through history, which he does again. (season 1; guest season 2)\r\nMarissa Jaret Winokur as Charmaine Rinaldi – Sean's wife. (guest seasons 2–4)\r\nAnoop Desai as Djinn – Nandor's magical genie (season 4)\r\nParisa Fakhri as Marwa – Nandor's resurrected ex-wife, now fiancée (season 4)\r\nChris Sandiford as Derek – A vampire hunter turned vampire (seasons 2–4)\r\nMyrna Cabello as Silvia – Guillermo's mother (seasons 2, 4)\r\nVeronika Slowikowska as Shanice – Jenna's college roommate who witnesses her transformation into a vampire. Shanice later joins the Mosquito Collectors of the Tri-State Area, a secret team of amateur vampire hunters. (seasons 1; guest seasons 2–3)\r\nGuests\r\nSeason 1\r\nArj Barker as Arjan – The pack leader of the Staten Island Werewolf Support Group. He entered into the truce between his kind and the vampires (which was created in 1993).\r\nDave Bautista and Alexandra Henrikson as Garrett and Vasillika the Defiler – A duo of vampires imprisoned by the Council after Garrett was framed by Laszlo for turning a baby into a vampire (which is very illegal), and Vasillika for too much defiling.\r\nVanessa Bayer as Evie Russell – Colin Robinson's co-worker. He discovers that she is an advanced form of energy vampire — an emotional vampire — who feeds off of the pity and sadness generated by her outlandish stories of suffering and misfortune. She and Colin Robinson date for a short time, feeding together on bored and pitying humans, until he begins to feel the relationship is unhealthy. Her first name is a homophone of \"E.V.\", for Emotional Vampire.\r\nMary Gillis as June – Nadja and Laszlo's familiar. She appears to be an ill old woman that communicates through grunts. She is killed when the Baron sucks all her blood when he arrives on Staten Island.\r\nJeremy O. Harris as Colby – A human familiar to Dantos the Cruel and Radinka the Brutal, two 400-year-old vampires who appear to be children while Colby portrays as their father.\r\nMarceline Hugot as Barbara Lazarro – The president of the Staten Island Council. She was going to be the vampires' way of taking over Staten Island until Laszlo left a pile of dead raccoons on her doorstep in an attempt to win her trust, resulting in her believing it was a form of terrorist threat.\r\nGloria Laino as The Baron's Familiar – The Baron's familiar, who maintains a silent, watchful eye on the vampires of Staten Island as her master awakes. Guillermo says that she pops out of nowhere and hears \"everything\".\r\nPaul Reubens as Paul – A member of the Council.\r\nTilda Swinton as a fictionalized version of herself who is the leader of the Vampiric Council.\r\nWesley Snipes as Wesley the Daywalker / Wesley Sykes – A half-vampire member of the Council who could not participate in person but only video chat through Skype. Danny despises him, claiming he is a vampire hunter, which he denies.\r\nHayden Szeto as Jonathan – A LARPer college student that Guillermo lured for the vampires to feast on. However, Colin Robinson beat them to it by draining his energy instead.\r\nDanny Trejo as Danny – A Hispanic tattooed member of the Council. He has an open dislike towards Wesley.\r\nTaika Waititi, Jonathan Brugh, and Jemaine Clement reprise their roles as Viago von Dorna Schmarten Scheden Heimburg, Deacon Brucke, and Vladislav the Poker from the original film. Three vampires arrived from New Zealand to participate in the Vampiric Council.\r\nBobby Wilson as Marcus – The actual Native American member of the Werewolf Pack. He is Native American, and a werewolf but, as he explains, \"Not a werewolf because\" he is Native American. \"It's not an ethnic thing.\"\r\nEvan Rachel Wood as Evan the Immortal Princess of the Undead – A member of the Council who just goes by her first name.\r\nHannan Younis as Ange – An African American werewolf and part of Arjan's group. She undermines Arjan's rules and is openly hostile towards Nadja due to Nadja's insulting the werewolves by assuming they are all \"Indian\" (as in, Native Americans).\r\nSeason 2\r\nJames Frain as the voice of Black Peter – A goat and witch's familiar\r\nMark Hamill as Jim the Vampire – A vampire who claims that Laszlo owes him rent money from the 1800s and demands retribution.\r\nGreta Lee as Celeste – A familiar who pretends to be a vampire\r\nHaley Joel Osment as Topher – Nadja and Laszlo's familiar who is accidentally killed and revived as a zombie. Unlike Guillermo, Topher has no interest in becoming a vampire. He is energetic, fun-loving, and charismatic, and he is well-liked by all other members of the household, except Guillermo.\r\nLucy Punch as Lilith – A witch and rival of Nadja\r\nCraig Robinson as Claude – The leader of the Mosquito Collectors of the Tri-State Area, a secret team of amateur vampire hunters.\r\nBenedict Wong as Wallace – A necromancer and tchotchke salesman.\r\nSeason 3\r\nJulie Klausner and Cole Escola as The Gargoyles – A duo of gargoyles who gossip and give tips to The Guide.\r\nLauren Collins as Meg – A gym receptionist on whom Nandor has a crush.\r\nTyler Alvarez as Wes Blankenship – The leader of a group of rebellious young vampires that refuse to follow the Council's orders.\r\nAida Turturro as Gail – Nandor's on-again, off-again werewolf-turned-vampire girlfriend.\r\nCatherine Cohen as Sheila – The siren\r\nScott Bakula as himself\r\nCree Summer as Jan – A vampire scam artist who is head of the Post-Chiropterean Wellness Center cult\r\nDonal Logue as a fictionalized vampire version of himself\r\nKhandi Alexander as Contessa Carmilla De Mornay\r\nDavid Cross as Dominykas the Dreadful\r\nSeason 4\r\nAffion Crockett as Richie Suck, superstar vampire rapper\r\nFred Armisen as Doctor DJ Tom Schmidt, Richie Suck's familiar who is manipulating him for financial gain.\r\nSal Vulcano as himself\r\nSklar Brothers as Toby and Bran\r\nAl Roberts as Freddie, Guillermo's boyfriend\r\nSofia Coppola as herself\r\nThomas Mars as himself\r\nJim Jarmusch as himself\r\nMichael McDonald as Gustave Leroy\r\nEpisodes\r\nSeason 1 (2019)\r\nSeason 2 (2020)\r\nSeason 3 (2021)\r\nSeason 4 (2022)\r\nProduction\r\nDevelopment\r\nOn January 22, 2018, it was announced that FX had given the production a pilot order. The pilot was written by Jemaine Clement and directed by Taika Waititi, both of whom are also executive producers alongside Scott Rudin, Paul Simms, Garrett Basch, and Eli Bush. On May 3, 2018, it was announced that FX had given the production a series order for a first season consisting of ten episodes, which premiered on March 27, 2019.\r\nAccording to Clement: \"We stay pretty basic '70s/'80s vampire rules, with a little bit of '30s. They can turn into bats. They can't go in the sunlight; they don't sparkle in the sun, they die. They have to be invited in; in a lot of literature vampires have to be invited into private buildings, but this is a documentary so it's the real rules which means they have to be invited into any building.\" Clement has also stated that the part of Laszlo was written specifically for Berry. The main influences on the series are Fright Night, Martin, The Lost Boys, Nosferatu, Interview with the Vampire, Vampire's Kiss, and Bram Stoker's Dracula. The character Nadja was named after the 1994 film of the same name.\r\nThe song used in the opening credits is \"You're Dead\" by Norma Tanega (1966), which was used during the opening credits sequence in the original film.\r\nThe second season premiered on April 15, 2020. On May 22, 2020, FX renewed the series for a third season, which premiered on September 2, 2021. On August 13, 2021, FX renewed the series for a fourth season, ahead of the third season premiere. Upon the fourth season's renewal, it was reported that Rudin would no longer be an executive producer, beginning with the third season, due to allegations of abusive behavior. On June 6, 2022, FX renewed the series for a fifth and sixth season, ahead of the fourth season premiere.\r\nFilming\r\nPrincipal photography for the first season took place from October 22 to December 18, 2018, in Toronto, Ontario. Filming for the third season began on February 8, 2021, and finished on May 3, 2021.\r\nThe writer/producer Paul Simms said that series does not use CGI effects: \"There's no fully digital characters or anything like that. One of the movies we really talked about a lot when we were conceiving the show was Francis Ford Coppola's Dracula where he went back to really doing as many effects as possible in camera and figuring out ways to do that. One of my favorite supernatural moments is completely in camera. It's where Beanie Feldstein's character is walking along in the park and Nadja appears walking next to her. That was all just done completely the old fashioned way where Natasia was hiding behind a tree and the camera was tracking along and at the right moment, she walked out from behind a tree. I think there's something about that old fashioned way that makes things more interesting than when you can tell it's digital and rubbery and fake looking\".\r\nAmong the cinematographers D.J. Stipsen and Christian Sprenger's influences for the series was the work of Michael Ballhaus and production designer Thomas E. Sanders on the Coppola-directed Bram Stoker's Dracula: \"We referenced that film for the general sumptuousness of the vampires' mansion, which was our main set. Our take, however, was that the Staten Island vampires have let their place go. The former glory is evident but now exists in a worn, faded and distressed state. Production designer Kate Bunch and I had a lot of conversations about striking the right balance between sumptuousness and neglect. There are strong reds, but also yellow that has faded to the point of being a warm brown.\"\r\nRelease\r\nMarketing\r\nOn October 31, 2018, a series of teaser trailers for the series were released. On January 10, 2019, another teaser trailer was released. On February 4, 2019, the official trailer for the series was released.\r\nPremiere\r\nOn October 7, 2018, the series held a panel at the annual New York Comic Con moderated by Rolling Stone's Alan Sepinwall and featuring co-creators Taika Waititi and Jemaine Clement, along with fellow executive producer Paul Simms. Before the panel began, the first episode of the series was screened for the audience. The world premiere for the series was screened during the 2019 South by Southwest film festival in Austin, Texas as a part of the festival's \"Episodic Premieres\" series.\r\nReception\r\nCritical response\r\nThe first season received acclaim from critics. On the review aggregator Rotten Tomatoes, the first season has an approval rating of 94%, based on 71 reviews, with an average rating of 7.8/10. The website's critical consensus reads, \"Delightfully absurd and ridiculously fun, What We Do in the Shadows expands on the film's vampiric lore and finds fresh perspective in its charming, off-kilter cast to create a mockumentary series worth sinking your teeth into.\" On Metacritic, it has a weighted average score of 80 out of 100, based on 30 critics, indicating \"generally favorable reviews\".\r\nThe second season also received critical acclaim. On Rotten Tomatoes, the second season has an approval rating of 98%, based on 44 reviews, with an average rating of 8.3/10. The website's critical consensus reads, \"Bat! What We Do In the Shadows loses no steam in a smashing second season that savvily expands its supernatural horizons while doubling down on the fast flying fun.\" On Metacritic, it has a weighted average score of 79 out of 100, based on 11 critics, indicating \"generally favorable reviews\".\r\nThe third season also received universal acclaim from critics. On Rotten Tomatoes, the third season has an approval rating of 100%, based on 28 reviews, with an average rating of 9/10. The website's critical consensus reads, \"Carried on the wings of its cast's incredible chemistry and the strongest writing of the series so far, What We Do in the Shadows' third season is scary good.\" On Metacritic, the third season has an average score of 96 out of 100, based on 11 critics, indicating \"universal acclaim\".\r\nThe fourth season also received universal acclaim from critics. On Rotten Tomatoes, the fourth season has an approval rating of 100%, based on 29 reviews, with an average rating of 8.7/10. The website's critical consensus reads, \"Aside from turning this demonic household into Three Vampires and a Baby, What We Do in the Shadows doubles down on what it does best without drastically changing the formula – and remains fang-tastic all the same.\" On Metacritic, the fourth season has an average score of 84 out of 100, based on 8 critics, indicating \"universal acclaim\". However, some critics complained of the reductive treatment of Nandor's wife, Marwa, in season 4. Comic Book Resources complained of the show \"stripping a woman of her identity – physically and mentally – for laughs\" and The Mary Sue stated that \"What We Do in the Shadows missed hard with its treatment of Marwa.\"\r\nRatings\r\nSeason 1\r\nSeason 2\r\nSeason 3\r\nSeason 4\r\nAccolades",
    "html": "<p>What We Do in the Shadows is an American mockumentary comedy horror television series created by Jemaine Clement that premiered March 27, 2019, on FX. The second television series in the franchise based on the 2014 New Zealand film of the same name written by Clement and Taika Waititi, the series follows four vampire roommates in Staten Island, and stars Kayvan Novak, Matt Berry, Natasia Demetriou, Harvey Guillén, and Mark Proksch.</p><p>Four seasons of the series have aired and it was renewed for a fifth and sixth season ahead of the fourth season premiere. The fifth season will premiere on July 13, 2023. It has been critically acclaimed (particularly for its cast and writing) and nominated for 17 Emmy Awards, including Outstanding Comedy Series in 2020 and 2022.</p><br/><h3>Premise</h3><p>Set primarily in Staten Island, New York City, New York, What We Do in the Shadows follows the lives of three traditional vampires, Nandor, Laszlo, and Nadja; Colin Robinson, an energy vampire; and Guillermo, Nandor's familiar. The series revolves around the vampires interacting with the modern world and other supernatural beings.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Kayvan Novak as Nandor the Relentless – Once the bloodthirsty leader of the fictional kingdom of Al-Quolanudar in southern Iran and a warrior serving the Ottoman Empire. At age 760, he is the oldest vampire and the self-proclaimed leader of the group, leading him to frequently calling house meetings for frivolous discussions. Although he genuinely cares for his human familiar Guillermo, he has difficulty expressing it. Nandor is also quite naive to the ways of modern society and humans, which often results in Guillermo becoming frustrated with him. He is a massive fan of the 1992 Dream Team and collects much of their memorabilia; they also inspired him to apply for American citizenship, but he fails his test after being physically unable to say the phrase One Nation, Under God.</li><li>Matt Berry as Leslie \"Laszlo\" Cravensworth – A 310-year-old British nobleman vampire who was turned by Nadja and is now married to her. He is pansexual and a former porn actor, who is often preoccupied with thoughts of sex; he enjoys sexual relationships with both Nadja and Nandor. He also enjoys making topiary sculptures of vulvas in the yard, including those of his wife and mother. He confessed in season 1 to having been Jack the Ripper. In season 2, he briefly goes on the run and assumes the alias \"Jackie Daytona\", a \"regular human bartender\" in Clairton, Pennsylvania (which he chose because it sounded like Transylvania).</li><li>Natasia Demetriou as Nadja of Antipaxos – A 500-year-old Greek Romani vampire who turned Laszlo into a vampire and later married him. She is frequently frustrated with her male housemates and nostalgic about her human life. She has entertained an affair with a reincarnated knight named Gregor for hundreds of years, only for him to be decapitated in every reincarnation. In season 3, she reveals that she frequently collaborated with the Rat Pack and later becomes manager of her own vampire nightclub in season 4. Demetriou also plays Nadja's human ghost, split from its corporeal form when Nadja was turned into a vampire. The ghost later inhabits a doll, and appears as a recurring character since season two.</li><li>Demetriou also plays Nadja's human ghost, split from its corporeal form when Nadja was turned into a vampire. The ghost later inhabits a doll, and appears as a recurring character since season two.</li><li>Harvey Guillén as Guillermo de la Cruz – Nandor's long-suffering Latino familiar. Despite his frustration with his unreasonable workload and Nandor's disregard for his mortality, he has served his master for more than a decade in the hope of being made a vampire, a dream inspired by Armand in the 1994 film Interview with the Vampire. Late in season one, Guillermo discovers that he is a descendant of the famous vampire hunter Abraham Van Helsing, and he proves to be very skilled at killing vampires (including by accident), giving him conflicting feelings about his desire to become a vampire. Guillermo's skill as a vampire slayer leads to him becoming a bodyguard for Nandor, Nadja, and Laszlo in the third season. He reveals he is gay in the fourth season, coming out to his family, with Nadja having to erase their memories about Guillermo's confession about wishing to become a vampire.</li><li>Mark Proksch as Colin Robinson (and Baby Colin \"The Boy\" in season 4) – An energy vampire who lives in the basement. He lives by draining humans and vampires of their energy by being boring or frustrating. As a \"day walker\", he is not harmed by sunlight or entry into churches and is able to work in a cubicle office and feed on his coworkers' frustrations. Unlike the others, he shows no outward sign of vampirism except that his irises glow when he feeds on energy, and his reflection shows a pale and decrepit version of himself. The others are continually annoyed by him and often try to avoid associating with him, although they are entirely dependent on him as he is the only source of income into the house. In the third season finale, following Colin Robinson's 100th birthday, he dies and his infant offspring (also portrayed by Proksch) bursts out of his chest; Laszlo (having become friends with the original Colin Robinson) elects to raise the child as his own.</li></ul><h4>Recurring</h4><ul><li>Kristen Schaal as The Guide (also known as the \"Floating Woman\") – An envoy of the Vampiric Council who likes to float and sometimes speak in a demonic voice. In season 4 she becomes close with Nadja and helps her convert the Vampiric Council's headquarters into a vampiric nightclub. (season 3–present; guest season 1)</li><li>Anthony Atamanuik as Sean Rinaldi – The human next-door neighbor. He sometimes witnesses Laszlo doing something vampiric, but is easily hypnotized into forgetting everything. The vampires spare him because he brings their trash cans in when they forget, and Laszlo considers Sean his best friend and even makes sexual advances toward him (which Sean forgets due to hypnosis).</li><li>Beanie Feldstein as Jenna – a LARPer and virgin whom Guillermo lured for the vampires to feast on. She was later transformed into a vampire by Nadja who witnessed her being treated poorly by her peers. During her vampire training with Nadja, she discovers she has the rare ability to turn invisible, which fits the tendency of people to ignore her. (season 1)</li><li>Doug Jones as Baron Afanas – An ancient vampire from the Old Country who believes vampires should rule the world. Both Nadja and Laszlo had secret affairs with the Baron despite his lack of genitals. Later it is disclosed that he is not actually a Baron, but simply \"barren\" because he was unable to have children. In the first season, Guillermo inadvertently kills the Baron by opening a door and exposing him to sunlight. In the third season, however, it is revealed that he barely survived, albeit reduced to his head, torso and left arm. He finally has his full body restored with a more youthful appearance in the fourth season. (seasons 1, 3–4)</li><li>Nick Kroll as Simon the Devious – A vampire who rules over the Manhattan vampires and owns the Sassy Cat nightclub. He was a close friend to the Staten Island trio when all the vampires first arrived in America. He is obsessed with Laszlo's cursed hat made out of witch skin. (guest seasons 1–2, 4)</li><li>Jake McDorman as Jeff Suckler – A reincarnation of Nadja's former human lover, Gregor, a knight who has been killed by decapitation in each of his lives. Nadja eventually restores Jeff's memories of his previous lives so that he can be more like his former self, leading to him falling into insanity and being committed to a mental institution. It is later revealed to Nadja and Gregor that Laszlo had been causing each of his deaths through history, which he does again. (season 1; guest season 2)</li><li>Marissa Jaret Winokur as Charmaine Rinaldi – Sean's wife. (guest seasons 2–4)</li><li>Anoop Desai as Djinn – Nandor's magical genie (season 4)</li><li>Parisa Fakhri as Marwa – Nandor's resurrected ex-wife, now fiancée (season 4)</li><li>Chris Sandiford as Derek – A vampire hunter turned vampire (seasons 2–4)</li><li>Myrna Cabello as Silvia – Guillermo's mother (seasons 2, 4)</li><li>Veronika Slowikowska as Shanice – Jenna's college roommate who witnesses her transformation into a vampire. Shanice later joins the Mosquito Collectors of the Tri-State Area, a secret team of amateur vampire hunters. (seasons 1; guest seasons 2–3)</li></ul><h4>Guests</h4><h4>Season 1</h4><ul><li>Arj Barker as Arjan – The pack leader of the Staten Island Werewolf Support Group. He entered into the truce between his kind and the vampires (which was created in 1993).</li><li>Dave Bautista and Alexandra Henrikson as Garrett and Vasillika the Defiler – A duo of vampires imprisoned by the Council after Garrett was framed by Laszlo for turning a baby into a vampire (which is very illegal), and Vasillika for too much defiling.</li><li>Vanessa Bayer as Evie Russell – Colin Robinson's co-worker. He discovers that she is an advanced form of energy vampire — an emotional vampire — who feeds off of the pity and sadness generated by her outlandish stories of suffering and misfortune. She and Colin Robinson date for a short time, feeding together on bored and pitying humans, until he begins to feel the relationship is unhealthy. Her first name is a homophone of \"E.V.\", for Emotional Vampire.</li><li>Mary Gillis as June – Nadja and Laszlo's familiar. She appears to be an ill old woman that communicates through grunts. She is killed when the Baron sucks all her blood when he arrives on Staten Island.</li><li>Jeremy O. Harris as Colby – A human familiar to Dantos the Cruel and Radinka the Brutal, two 400-year-old vampires who appear to be children while Colby portrays as their father.</li><li>Marceline Hugot as Barbara Lazarro – The president of the Staten Island Council. She was going to be the vampires' way of taking over Staten Island until Laszlo left a pile of dead raccoons on her doorstep in an attempt to win her trust, resulting in her believing it was a form of terrorist threat.</li><li>Gloria Laino as The Baron's Familiar – The Baron's familiar, who maintains a silent, watchful eye on the vampires of Staten Island as her master awakes. Guillermo says that she pops out of nowhere and hears \"everything\".</li><li>Paul Reubens as Paul – A member of the Council.</li><li>Tilda Swinton as a fictionalized version of herself who is the leader of the Vampiric Council.</li><li>Wesley Snipes as Wesley the Daywalker / Wesley Sykes – A half-vampire member of the Council who could not participate in person but only video chat through Skype. Danny despises him, claiming he is a vampire hunter, which he denies.</li><li>Hayden Szeto as Jonathan – A LARPer college student that Guillermo lured for the vampires to feast on. However, Colin Robinson beat them to it by draining his energy instead.</li><li>Danny Trejo as Danny – A Hispanic tattooed member of the Council. He has an open dislike towards Wesley.</li><li>Taika Waititi, Jonathan Brugh, and Jemaine Clement reprise their roles as Viago von Dorna Schmarten Scheden Heimburg, Deacon Brucke, and Vladislav the Poker from the original film. Three vampires arrived from New Zealand to participate in the Vampiric Council.</li><li>Bobby Wilson as Marcus – The actual Native American member of the Werewolf Pack. He is Native American, and a werewolf but, as he explains, \"Not a werewolf because\" he is Native American. \"It's not an ethnic thing.\"</li><li>Evan Rachel Wood as Evan the Immortal Princess of the Undead – A member of the Council who just goes by her first name.</li><li>Hannan Younis as Ange – An African American werewolf and part of Arjan's group. She undermines Arjan's rules and is openly hostile towards Nadja due to Nadja's insulting the werewolves by assuming they are all \"Indian\" (as in, Native Americans).</li></ul><h4>Season 2</h4><ul><li>James Frain as the voice of Black Peter – A goat and witch's familiar</li><li>Mark Hamill as Jim the Vampire – A vampire who claims that Laszlo owes him rent money from the 1800s and demands retribution.</li><li>Greta Lee as Celeste – A familiar who pretends to be a vampire</li><li>Haley Joel Osment as Topher – Nadja and Laszlo's familiar who is accidentally killed and revived as a zombie. Unlike Guillermo, Topher has no interest in becoming a vampire. He is energetic, fun-loving, and charismatic, and he is well-liked by all other members of the household, except Guillermo.</li><li>Lucy Punch as Lilith – A witch and rival of Nadja</li><li>Craig Robinson as Claude – The leader of the Mosquito Collectors of the Tri-State Area, a secret team of amateur vampire hunters.</li><li>Benedict Wong as Wallace – A necromancer and tchotchke salesman.</li></ul><h4>Season 3</h4><ul><li>Julie Klausner and Cole Escola as The Gargoyles – A duo of gargoyles who gossip and give tips to The Guide.</li><li>Lauren Collins as Meg – A gym receptionist on whom Nandor has a crush.</li><li>Tyler Alvarez as Wes Blankenship – The leader of a group of rebellious young vampires that refuse to follow the Council's orders.</li><li>Aida Turturro as Gail – Nandor's on-again, off-again werewolf-turned-vampire girlfriend.</li><li>Catherine Cohen as Sheila – The siren</li><li>Scott Bakula as himself</li><li>Cree Summer as Jan – A vampire scam artist who is head of the Post-Chiropterean Wellness Center cult</li><li>Donal Logue as a fictionalized vampire version of himself</li><li>Khandi Alexander as Contessa Carmilla De Mornay</li><li>David Cross as Dominykas the Dreadful</li></ul><h4>Season 4</h4><ul><li>Affion Crockett as Richie Suck, superstar vampire rapper</li><li>Fred Armisen as Doctor DJ Tom Schmidt, Richie Suck's familiar who is manipulating him for financial gain.</li><li>Sal Vulcano as himself</li><li>Sklar Brothers as Toby and Bran</li><li>Al Roberts as Freddie, Guillermo's boyfriend</li><li>Sofia Coppola as herself</li><li>Thomas Mars as himself</li><li>Jim Jarmusch as himself</li><li>Michael McDonald as Gustave Leroy</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 27, 2019</td><td style=\"padding:0 8px\">May 29, 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 15, 2020</td><td style=\"padding:0 8px\">June 10, 2020</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 2, 2021</td><td style=\"padding:0 8px\">October 28, 2021</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 12, 2022</td><td style=\"padding:0 8px\">September 6, 2022</td></tr></tbody></table><h4>Season 1 (2019)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#4543CC;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#4543CC;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#4543CC\">Title</th><th scope=\"col\" style=\"background:#4543CC\">Directed by</th><th scope=\"col\" style=\"background:#4543CC\">Written by</th><th scope=\"col\" style=\"background:#4543CC\">Original air date</th><th scope=\"col\" style=\"background:#4543CC;width:7%\"><abbr title=\"Production\">Prod.</abbr><br>code</th><th scope=\"col\" style=\"background:#4543CC;width:10%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Pilot\"</td><td style=\"text-align:center\"><span>Taika Waititi</span></td><td style=\"text-align:center\"><span>Jemaine Clement</span></td><td style=\"text-align:center\">March 27, 2019</td><td id=\"pcXWS01001\" rowspan=\"1\" style=\"text-align:center\">XWS01001</td><td style=\"text-align:center\">0.617</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4543CC\">Four vampire roommates live together in <span>Staten Island</span>: Nandor the Relentless, the self-appointed leader of the house; Laszlo and Nadja, a married couple; and Colin Robinson, an <span>energy vampire</span> who works in an office and drains humans of their energy by boring or irritating them. The other vampires are often annoyed by his presence. They are joined by their <span class=\"mw-redirect\">familiars</span>, including Guillermo, who has served Nandor for ten years and hopes to become a vampire one day. Nadja believes she has found her former lover Gregor who has been <span>reincarnated</span> as a human named Jeff; Nadja reveals Gregor has been decapitated in each of his lives. Nandor receives a letter and holds a meeting announcing Baron Afanas, an ancient vampire from the Old Country, will be arriving. The vampires then prepare for his arrival. When the Baron arrives, he announces their plan to take over the Western Hemisphere.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"City Council\"</td><td style=\"text-align:center\">Jemaine Clement</td><td style=\"text-align:center\"><span>Paul Simms</span></td><td style=\"text-align:center\">April 3, 2019</td><td id=\"pcXWS01002\" rowspan=\"1\" style=\"text-align:center\">XWS01002</td><td style=\"text-align:center\">0.658</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4543CC\">The vampires begin their first step in their plan of conquest: taking over Staten Island. They attend local city council meetings, trying to persuade the mayor and the council members, but they fail when Nandor attempts to threaten the council. Laszlo seeks out the mayor and attempts to convince her to surrender, killing the raccoons that had been eating her garbage and leaving the bodies on her porch. Meanwhile, Nandor seeks out and hypnotizes the mayor's opponent in the upcoming election, causing him to react violently and be arrested during the next council meeting. Nadja follows Jenna, a virgin <span class=\"mw-redirect\">LARPer</span>, and, after observing how she is mistreated by the rest of the group, turns her into a vampire.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Werewolf Feud\"</td><td style=\"text-align:center\">Jemaine Clement</td><td style=\"text-align:center\"><span>Josh Lieb</span></td><td style=\"text-align:center\">April 10, 2019</td><td id=\"pcXWS01004\" rowspan=\"1\" style=\"text-align:center\">XWS01004</td><td style=\"text-align:center\">0.305</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4543CC\">Laszlo finds that his <span>topiary</span> garden has been urinated on by <span class=\"mw-redirect\">werewolves</span> and sets traps, sparking a feud with the pack. Following the 1993 pact, Nandor engages in single combat with the werewolf pack's champion, ending with him throwing a chew-toy off a roof to win. Meanwhile, Colin Robinson competes with Evie, an emotional vampire at work who feeds on the sympathy of her co-workers by telling upsetting or depressing stories. They eventually decide to team up and have a brief relationship, before breaking up.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Manhattan Night Club\"</td><td style=\"text-align:center\">Jemaine Clement</td><td style=\"text-align:center\"><span>Tom Scharpling</span></td><td style=\"text-align:center\">April 17, 2019</td><td id=\"pcXWS01003\" rowspan=\"1\" style=\"text-align:center\">XWS01003</td><td style=\"text-align:center\">0.439</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4543CC\">The vampires attempt to form an alliance with Simon the Devious, the leader of the <span>Manhattan</span> vampires, to aid in their takeover. Laszlo insists on wearing a hat made of witch skin, which Nadja insists is cursed. Laszlo runs into several instances of bad luck. The vampires go to his headquarters, a nightclub, to talk with him. Simon agrees to an alliance, but only if Laszlo gives him the hat. Simon kicks them out once he has the hat, and the nightclub promptly explodes. Guillermo continues to feel underappreciated, so Nandor makes it up to him by flying him over the city, but he accidentally drops him, which puts him in the hospital. Laszlo reclaims his hat from a badly injured and bandaged Simon. Meanwhile, Jenna continues her vampire transition.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Animal Control\"</td><td style=\"text-align:center\"><span>Jackie van Beek</span></td><td style=\"text-align:center\"><span>Duncan Sarkies</span></td><td style=\"text-align:center\">April 24, 2019</td><td id=\"pcXWS01008\" rowspan=\"1\" style=\"text-align:center\">XWS01008</td><td style=\"text-align:center\">0.320</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4543CC\">Nadja and Laszlo feed together, but on their way to the house Laszlo decides to torment his new neighbor Phil in bat-form, leading to him being knocked out with a broom by Phil's girlfriend and taken to an animal shelter. Nandor, Guillermo, and Colin Robinson follow to attempt a rescue and first release a seemingly rabid bat before Nandor lets himself be caught in the form of a dog but is trapped in a cage. Meanwhile, Nadja goes to see Jeff (Gregor) and they go out to a carnival. Nadja is bored and frustrated by him and makes him remember his past lives. The two celebrate, but Nadja is forced to leave. She rescues Laszlo and Nandor with ease, while Jeff is arrested by police.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Baron's Night Out\"</td><td style=\"text-align:center\">Jackie van Beek</td><td style=\"text-align:center\"><span>Iain Morris</span></td><td style=\"text-align:center\">May 1, 2019</td><td id=\"pcXWS01005\" rowspan=\"1\" style=\"text-align:center\">XWS01005</td><td style=\"text-align:center\">0.418</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4543CC\">Baron Afanas wakes up and demands the vampires take him out to see the city. The vampires are sick and tired of the Baron's old fashioned ideas, so they intend on killing him. The vampires and the Baron go out and spend the night going to various bars and nightclubs, where they drink blood of drugged clubbers and allow the Baron to eat pizza (with disastrous results as vampires cannot consume human food without being violently sick). After returning home in the morning, the Baron is accidentally killed by sunlight when Guillermo opens the front door.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Trial\"</td><td style=\"text-align:center\">Taika Waititi</td><td style=\"text-align:center\">Jemaine Clement</td><td style=\"text-align:center\">May 8, 2019</td><td id=\"pcXWS01006\" rowspan=\"1\" style=\"text-align:center\">XWS01006</td><td style=\"text-align:center\">0.527</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4543CC\">The three vampires must face the Vampiric Council for the death of the Baron, having no memory of the previous night due to their consumption of drug-laced blood. At the trial, Guillermo admits he killed the Baron, but the council does not believe him. Nandor then takes the blame, and he, along with Laszlo and Nadja are sentenced to death by sunlight. The three vampires are put in a well and await their death, but Colin Robinson and Guillermo rescue them by blocking the sun with an umbrella.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Citizenship\"</td><td style=\"text-align:center\"><span>Jason Woliner</span></td><td style=\"text-align:center\"><span>Stefani Robinson</span></td><td style=\"text-align:center\">May 15, 2019</td><td id=\"pcXWS01007\" rowspan=\"1\" style=\"text-align:center\">XWS01007</td><td style=\"text-align:center\">0.522</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4543CC\">Nadja guides Jenna on how to be a vampire after her transition is complete. Jenna learns that her vampire power is invisibility and she later makes her first kill. Nandor, who learns that the country he was born in no longer exists, applies for <span class=\"mw-redirect\">American citizenship</span> after being suggested by Guillermo. However, Nandor fails the process due to his lack of knowledge about America and his inability to recite the Oath of Allegiance (his mouth catching fire upon saying the word \"God\").</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Orgy\"</td><td style=\"text-align:center\">Jason Woliner</td><td style=\"text-align:center\">Marika Sawyer</td><td style=\"text-align:center\">May 22, 2019</td><td id=\"pcXWS01009\" rowspan=\"1\" style=\"text-align:center\">XWS01009</td><td style=\"text-align:center\">0.434</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4543CC\">The vampires plan for the bi-annual vampire orgy, which must go perfectly, because throwing a bad orgy results in eternal humiliation. In the attic, Laszlo finds his old vampire-themed pornos he made. Nadja insults Laszlo when she tells him she finds them boring. After everyone has arrived for the orgy, Laszlo professes his love to Nadja, which sours the mood of the orgy and everyone leaves.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Ancestry\"</td><td style=\"text-align:center\">Taika Waititi</td><td style=\"text-align:center\">Jemaine Clement &amp; Stefani Robinson &amp; Tom Scharpling &amp; Paul Simms</td><td style=\"text-align:center\">May 29, 2019</td><td id=\"pcXWS01010\" rowspan=\"1\" style=\"text-align:center\">XWS01010</td><td style=\"text-align:center\">0.427</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #4543CC\">Guillermo has the vampires' DNA tested to show them their heritage. While Laszlo and Nadja are uninterested, Nandor discovers he has over 200,000 living descendants, including one who lives in Staten Island. Nandor visits her, a 94-year-old woman, by floating by her window with a teddy bear; this results in her having a fatal heart attack. Nandor has the other vampires attend her funeral in a church, and Laszlo and Nadja run out after catching on fire. Nadja calls out to Gregor, who is now in a psychiatric ward after being arrested previously, and breaks out. Gregor goes to the house to see Nadja, but Laszlo appears, and reveals it was he who killed Gregor in each of his past lives. Laszlo declares his love for Nadja, and Gregor stands down. As Gregor leaves, he is decapitated by a metal wire that was strung across that yard that Laszlo was using to trim a topiary bush sculpted like Nadja. Guillermo discovers he is a descendant of <span class=\"mw-redirect\">Van Helsing</span> and wonders if he is destined to kill the vampires.</td></tr></tbody></table><h4>Season 2 (2020)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#6EBE8B;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#6EBE8B;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#6EBE8B\">Title</th><th scope=\"col\" style=\"background:#6EBE8B\">Directed by</th><th scope=\"col\" style=\"background:#6EBE8B\">Written by</th><th scope=\"col\" style=\"background:#6EBE8B\">Original air date</th><th scope=\"col\" style=\"background:#6EBE8B;width:7%\"><abbr title=\"Production\">Prod.</abbr><br>code</th><th scope=\"col\" style=\"background:#6EBE8B;width:10%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Resurrection\"</td><td style=\"text-align:center\"><span>Kyle Newacheck</span></td><td style=\"text-align:center\">Marika Sawyer</td><td style=\"text-align:center\">April 15, 2020</td><td id=\"pcXWS02001\" rowspan=\"1\" style=\"text-align:center\">XWS02001</td><td style=\"text-align:center\">0.537</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6EBE8B\">Laszlo and Nadja are elated with their latest familiar, Topher (<span>Haley Joel Osment</span>), who appears to be a most dedicated servant when they are around; however, he is just a slacker who has no desire to become a vampire. Topher's attitude annoys Guillermo, who has been busy secretly killing vampire assassins who are invading the house on behalf of the Vampiric Council. Topher is accidentally electrocuted and dies, causing Nadja and the others to visit Wallace (<span>Benedict Wong</span>), a <span class=\"mw-redirect\">necromancer</span>. Laszlo believes Wallace is just a <span>shyster</span> as he demands $350 for the job. Wallace revives Topher, but he comes back as a ravenous zombie who continually attacks Guillermo. The vampires bring Topher back to Wallace, where Wallace agrees to take him back, placing Topher in his basement alongside other zombies to make miniature license plate keychains.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Ghosts\"</td><td style=\"text-align:center\">Kyle Newacheck</td><td style=\"text-align:center\"><span>Paul Simms</span></td><td style=\"text-align:center\">April 15, 2020</td><td id=\"pcXWS02003\" rowspan=\"1\" style=\"text-align:center\">XWS02003</td><td style=\"text-align:center\">0.409</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6EBE8B\">The vampires deduce that a ghost has invaded their home, and Nadja performs a <span class=\"mw-redirect\">seance</span> to make the ghost appear. The ghost turns out to be the spirit of her former lover Jeff/Gregor, who has unfinished business. The vampires, being dead themselves, wonder if they have their own ghosts with unfinished business, so they perform a second seance. Their spirit doppelgangers appear and each tries to help their own ghost complete whatever unfinished business they have. Nandor and Laszlo help their ghosts to pass on, while Nadja's ghost ends up inhabiting a doll and sticking around, and Colin Robinson conjures his dead grandmother just to try to tell his \"updog\" joke.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Brain Scramblies\"</td><td style=\"text-align:center\">Kyle Newacheck</td><td style=\"text-align:center\">Jake Bender &amp; Zach Dunn</td><td style=\"text-align:center\">April 22, 2020</td><td id=\"pcXWS02002\" rowspan=\"1\" style=\"text-align:center\">XWS02002</td><td style=\"text-align:center\">0.566</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6EBE8B\">The vampires are invited to their neighbor Sean's <span>Super Bowl</span> party, which they believe is a \"Superb Owl\" party. Sean mentions to Nandor and Laszlo that he only sees them at night and jokes that they're like vampires. Believing Sean is serious, the two consider killing him before deciding to double-hypnotize him, but they overdo it, causing him to lose all his memories. Nadja meets Sean's mother Joan, who Nadja used to play with when Joan was a child. Meanwhile, Guillermo searches for virgins for his master, which leads him to a mosquito-hunting club meeting. However, he learns that this is a cover for a group of vampire hunters. Among the members is Shanice, Jenna's college roommate, who is aware of her being a vampire. Having never thought about the victims he brought to his masters, Guillermo feels guilty and questions his role as a familiar.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Curse\"</td><td style=\"text-align:center\"><span>Liza Johnson</span></td><td style=\"text-align:center\">Sarah Naftalis</td><td style=\"text-align:center\">April 29, 2020</td><td id=\"pcXWS02004\" rowspan=\"1\" style=\"text-align:center\">XWS02004</td><td style=\"text-align:center\">0.618</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6EBE8B\">The vampires panic after receiving a <span>chain e-mail</span> threatening them with death if they do not forward it to 10 more people. Colin Robinson takes the opportunity to use the chain e-mail to feed himself, while calming the other vampires. Meanwhile, Guillermo visits his vampire hunting group to find them about to embark on a mission to attack a home full of vampires. His initial delight on finding out it is a different house, and not his, turns to terror when it turns out that this house really is inhabited by vampires. Guillermo manages to kill many of them, but one of his team members, Derek, also dies.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep15\" style=\"text-align:center\">15</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Colin's Promotion\"</td><td style=\"text-align:center\"><span>Jemaine Clement</span></td><td style=\"text-align:center\">Shana Gohd</td><td style=\"text-align:center\">May 6, 2020</td><td id=\"pcXWS02005\" rowspan=\"1\" style=\"text-align:center\">XWS02005</td><td style=\"text-align:center\">0.378</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6EBE8B\">Colin Robinson expresses grief that his needs for both energy and companionship are incompatible. He later receives a promotion at work and forces subordinates to listen to him, which multiplies his power and forms a feedback loop allowing him to drain people and plants instantly, even gaining the ability to fly. After draining his housemates to the point that they age, he splits into three copies of himself, who drain each other, leaving one survivor. The survivor, having financially destroyed his company, moves to a new one. Meanwhile, Nadja discovers that Nandor pillaged the village she grew up in, causing a rift in their friendship.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep16\" style=\"text-align:center\">16</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"On the Run\"</td><td style=\"text-align:center\"><span>Yana Gorskaya</span></td><td style=\"text-align:center\"><span>Stefani Robinson</span></td><td style=\"text-align:center\">May 13, 2020</td><td id=\"pcXWS02007\" rowspan=\"1\" style=\"text-align:center\">XWS02007</td><td style=\"text-align:center\">0.436</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6EBE8B\">A vengeful and menacing vampire named Jim (<span>Mark Hamill</span>) arrives at the Staten Island vampire residence in search of Laszlo, who had failed to pay him a month's rent in California 167 years ago. Laszlo flees and sets up shop in a small town in Pennsylvania (as it sounded like Transylvania), killing the owner of a bar and assuming control of the establishment. In his new human persona, Laszlo goes by the name Jackie Daytona, and becomes greatly admired by the town not only for his party-throwing skills but for his great support of the local girls volleyball team. While Laszlo has a great time in his new life, his vampire roommates have trouble coping with his disappearance. Jim the Vampire also continues his search for Laszlo.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep17\" style=\"text-align:center\">17</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Return\"</td><td style=\"text-align:center\">Jemaine Clement</td><td style=\"text-align:center\">Jemaine Clement</td><td style=\"text-align:center\">May 20, 2020</td><td id=\"pcXWS02006\" rowspan=\"1\" style=\"text-align:center\">XWS02006</td><td style=\"text-align:center\">0.377</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6EBE8B\">The vampires are visited by an old foe, Simon the Devious, who is now down on his luck and only has two people left in his crew after the accident at his nightclub involving Laszlo's cursed witch hat. Nadja encourages the crew to welcome Simon into the house with open arms. Laszlo, however, is still very suspicious of Simon's true intentions. Carol, one of Simon's crew members, accuses Guillermo of being a vampire slayer, after which he kills her in an act of self-defense. Nandor finds out about it and becomes wary of Guillermo. Meanwhile, Colin Robinson uses social media to <span class=\"mw-redirect\">troll</span> people online and feed on their energy. However, someone gets all of his accounts banned, which greatly upsets him. Laszlo and Simon fight over the hat while Colin Robinson confronts the user in-person, but they turn out to be an actual <span>troll</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep18\" style=\"text-align:center\">18</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Collaboration\"</td><td style=\"text-align:center\">Yana Gorskaya</td><td style=\"text-align:center\"><span>Sam Johnson &amp; Chris Marcil</span></td><td style=\"text-align:center\">May 27, 2020</td><td id=\"pcXWS02008\" rowspan=\"1\" style=\"text-align:center\">XWS02008</td><td style=\"text-align:center\">0.443</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6EBE8B\">Laszlo hears the song \"<span>Come On Eileen</span>\" while attacking a jogger, and is shocked as he believes he is the song's original writer. Looking back through his old songs reminds him and Nadja of when they used to sing as a duo. Colin Robinson hears them and offers to set them up with a gig, knowing they'll be awful and that he'll be able to absorb the audience's negative energy. Meanwhile, Benjy, Nandor's previous familiar, returns and goes with Guillermo to a familiar meet-up where Guillermo finds that one of the familiars, Celeste, has been turned into a vampire. He confronts Nandor, who waffles about when he will change Guillermo, so Guillermo leaves to join Celeste. He likes the inclusive atmosphere of her dwelling, but this comes to an end when her master and her clique return home and Celeste is revealed to be a fraud. Nadja and Laszlo play several songs to boos and catcalls, powering Colin Robinson, but they win the audience back with their version of \"<span>Kokomo</span>\", which they are surprised to find the audience already knows.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep19\" style=\"text-align:center\">19</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Witches\"</td><td style=\"text-align:center\">Kyle Newacheck</td><td style=\"text-align:center\">William Meny</td><td style=\"text-align:center\">June 3, 2020</td><td id=\"pcXWS02009\" rowspan=\"1\" style=\"text-align:center\">XWS02009</td><td style=\"text-align:center\">0.433</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6EBE8B\">When Laszlo and Nandor are captured by witches, Nadja, Colin Robinson, and Guillermo pursue and track the witches to a shop. Guillermo goes inside to investigate. Nadja and Colin Robinson are captured while waiting outside, and Guillermo is imprisoned with them. Laszlo and Nandor discover that the witches want their semen to make a youth potion. Laszlo is enthusiastic until he discovers how unpleasant the process actually is. Guillermo discovers the way out of the holding cell and he, Nadja, and Colin Robinson go to rescue Laszlo and Nandor, but are outmatched. Guillermo saves the day by striking a bargain with the witches, where he will provide them with an unlimited supply of vampire semen in exchange for a percentage of the witches' profits.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep20\" style=\"text-align:center\">20</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Nouveau Théâtre des Vampires\"</td><td style=\"text-align:center\">Kyle Newacheck</td><td style=\"text-align:center\">Sam Johnson &amp; Stefani Robinson &amp; Paul Simms</td><td style=\"text-align:center\">June 10, 2020</td><td id=\"pcXWS02010\" rowspan=\"1\" style=\"text-align:center\">XWS02010</td><td style=\"text-align:center\">0.406</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6EBE8B\">Nandor wants to get out of bed but Guillermo is nowhere to be found. Nandor looks for him and discovers a note in which Guillermo wrote \"Sorry\". Without Guillermo as a familiar, the vampires leave their residence a mess, with corpses and blood all over the place. The entire vampire residence receive a letter inviting them to the most prestigious vampire event in existence, the Nouveau Théâtre des Vampires. They go to the event with their finest clothing, while Guillermo struggles to live with his mom in the Bronx. Guillermo finally decides to visit the gang, only to find an empty house and the letter the vampires left behind. He immediately realizes that the invite was a trap set by the Vampiric Council and goes to the theater to save them. Nadia, Laszlo, Nandor, and Colin Robinson are restrained by the vampires at the theater, led by Vladislav, and are sentenced to death for the whole theater to watch, having been blamed for the deaths of all the vampires that Guillermo has killed since the death of the Baron. Guillermo comes to the rescue and slaughters most of the vampires in the theater, saving his group, but in the process shows his true colors as a vampire hunter.</td></tr></tbody></table><h4>Season 3 (2021)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section's plot summaries <b>may be <span>too long or excessively detailed</span>.</b><span class=\"hide-when-compact\"> Please <span class=\"external text\">help improve them</span> by removing unnecessary details and making them more concise.</span>  <span class=\"date-container\"><i>(<span class=\"date\">July 2022</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#6A36C3;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#6A36C3;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#6A36C3\">Title</th><th scope=\"col\" style=\"background:#6A36C3\">Directed by</th><th scope=\"col\" style=\"background:#6A36C3\">Written by</th><th scope=\"col\" style=\"background:#6A36C3\">Original air date</th><th scope=\"col\" style=\"background:#6A36C3;width:7%\"><abbr title=\"Production\">Prod.</abbr><br>code</th><th scope=\"col\" style=\"background:#6A36C3;width:10%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep21\" style=\"text-align:center\">21</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Prisoner\"</td><td style=\"text-align:center\"><span>Kyle Newacheck</span></td><td style=\"text-align:center\"><span>Paul Simms</span></td><td style=\"text-align:center\">September 2, 2021</td><td id=\"pcXWS03001\" rowspan=\"1\" style=\"text-align:center\">XWS03001</td><td style=\"text-align:center\">0.498</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6A36C3\">Twenty-nine days after the massacre, the vampires are trying to decide what to do about Guillermo, who is supposedly imprisoned in a cage in their basement but has actually been regularly sneaking out of the basement to perform his usual household duties. Nandor vouches for Guillermo as he saved their lives, while Laszlo, Nadja, and Nadja's ghost (still possessing a doll) are in favor of killing him to keep themselves safe. Guillermo reveals his freedom when he leaves the basement to protect the vampires from the arrival of a messenger from the Supreme Vampiric Council, the group who oversees all of the world's other Vampiric Councils. The messenger, referred to as \"The Guide,\" promises not to harm the vampires and delivers a video message from Viago, a member of the Supreme Council, who explains that since Guillermo has now killed almost 70% of the most powerful vampires in the New York area, the Supreme Council has been forced to appoint Nandor, Nadja, Laszlo and Colin Robinson as the new Vampiric Council for the American Eastern Seaboard. The vampires decide to make Guillermo their bodyguard, and perform a group hypnosis ritual on him that will prevent him from ever harming them: Guillermo privately reveals that vampire hypnosis no longer works on him, but plays along anyway. The Guide escorts the quartet and Guillermo to the Council headquarters, where Nandor, Nadja, and Colin Robinson all begin arguing over which of them should be the \"Supreme Leader\" of the new Council.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep22\" style=\"text-align:center\">22</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Cloak of Duplication\"</td><td style=\"text-align:center\"><span>Yana Gorskaya</span></td><td style=\"text-align:center\"><span>Sam Johnson &amp; Chris Marcil</span></td><td style=\"text-align:center\">September 2, 2021</td><td id=\"pcXWS03002\" rowspan=\"1\" style=\"text-align:center\">XWS03002</td><td style=\"text-align:center\">0.448</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6A36C3\">Nandor and Nadja reluctantly agree to be the co-leaders of the new Council, although they each plan to ultimately take the role entirely for themselves. The Guide gives the group a tour of the Council's facilities, including the \"Chamber of Curiosities,\" which houses many ancient mystical artifacts and keepsakes: it also houses the Sire, the world's first and most ancient vampire, who is kept locked up behind a sealed door. Nandor decides to use one of the magical artifacts, the Cloak of Duplication (which allows one person to take on the exact likeness of another) to win over a human woman named Meg, a receptionist at a gym where he sometimes works out, by having Laszlo use the Cloak to take on his appearance and woo Meg in his stead. Colin Robinson and Laszlo each try and fail to impress Meg using this method, although Laszlo hypnotizes her to forget those incidents afterwards; Guillermo then tries instead and seems to have more success, although Meg comes to the conclusion that Nandor and Guillermo have feelings for each other. Meanwhile, Nandor, Nadja and Colin Robinson visit a group of rebellious young vampires who have refused to obey the Council's orders, led by a vampire named Wes Blankenship. After they try and fail to negotiate peacefully with the rebellious group, Nadja kills Wes and thereby secures the others' obedience. Nandor then visits Meg at the gym and confesses his feelings for her, but she reveals that she is a lesbian and suggests that he pursue a relationship with Guillermo instead, causing him to erase her memories again and leave. Nandor and Nadja argue over her belief that he has grown soft during his time in America, and she uses the Cloak to play a prank on him.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep23\" style=\"text-align:center\">23</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Gail\"</td><td style=\"text-align:center\">Kyle Newacheck</td><td style=\"text-align:center\">Marika Sawyer</td><td style=\"text-align:center\">September 9, 2021</td><td id=\"pcXWS03003\" rowspan=\"1\" style=\"text-align:center\">XWS03003</td><td style=\"text-align:center\">0.311</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6A36C3\">Nandor begins leaving the vampires' house at odd hours. The others follow him one night and discover that he has been hooking up with a human woman named Gail, who has been his on-again, off-again partner for the past forty years. Nadja explains that Gail has always turned Nandor down every time he offers to turn her into a vampire and marry her, but Nandor decides to try again and obtains an engagement ring with the intent of proposing to her, which distresses Guillermo. However, Gail is revealed to have recently become a werewolf, which angers Nadja and Laszlo. Nandor convinces the other vampires to visit the rest of Gail's pack, which leads to a confrontation when it is revealed that Gail is also dating Anton, one of the werewolves. Guillermo proposes that the vampires and werewolves resolve their differences \"<i>Twilight</i>-style\" by playing a game of kickball, which ends badly when Nadja accidentally kills Gail by hitting her in the head with a ball. Nandor revives Gail by turning her into a vampire/werewolf hybrid and proposes to her, but she turns him down again. Meanwhile, Laszlo and Colin Robinson discover that Laszlo's old \"jalopy\" car, which had been confiscated and impounded by the previous Vampiric Council many years earlier, is stored in a secret room in the Council's library. Laszlo gets the car working again, and they move it out of the Council building by disassembling it and rebuilding it outside, although they damage several artifacts in the process. Laszlo and Colin Robinson then take the rest of the group on a drive around the neighborhood to lift Nandor's spirits.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep24\" style=\"text-align:center\">24</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Casino\"</td><td style=\"text-align:center\">Yana Gorskaya</td><td style=\"text-align:center\">Sarah Naftalis</td><td style=\"text-align:center\">September 16, 2021</td><td id=\"pcXWS03004\" rowspan=\"1\" style=\"text-align:center\">XWS03004</td><td style=\"text-align:center\">0.462</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6A36C3\">The vampires are all invited on a group vacation to Atlantic City by their neighbors Sean and Charmaine, while Nandor convinces the other vampires that they should start treating Guillermo as part of their group rather than as a familiar. The vampires spend their first night having fun in a casino, before returning to their hotel rooms to sleep through the day. However, Nandor, Nadja and Laszlo are horrified to discover that the hotel housekeeping staff have vacuumed up all of their ancestral soil (which they had brought with them and spread under their hotel beds), without which they will begin to lose their powers. Desperate for a solution, Nandor sends Guillermo on a mission to Europe, where he obtains bags of soil from England, Greece, and Iran, to replenish each of the vampires' supply of ancestral soil. Meanwhile, the vampires remain stuck in Atlantic City and begin to weaken as their powers slowly fade; Laszlo and Nadja try to help Sean when he relapses into his gambling addiction and loses a large amount of money, while Colin Robinson teaches Nandor about the origins of the universe after Nandor plays a casino game based on the TV series <i><span>The Big Bang Theory</span></i>, prompting Nandor to question what the title refers to, spiraling Nandor into an existential crisis when he learns his <span>religious assumptions of the universe</span> are <span>incorrect</span>. Eventually, Guillermo returns with the ancestral soil, and the vampires use it to restore their powers. The vampires and Guillermo then devise a plan to rig a boxing match so that they can win a large enough bet to earn back all of Sean's lost money (as well as a loan that Laszlo borrowed from Sean to pay for Guillermo's plane tickets), and are successful, although one of the two boxers is accidentally killed in the process. Sean thanks Laszlo for helping him, but then proceeds to gamble all of the newly-earned money away as well, before the group finally heads back home to New York.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep25\" style=\"text-align:center\">25</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Chamber of Judgement\"</td><td style=\"text-align:center\">Kyle Newacheck</td><td style=\"text-align:center\">William Meny</td><td style=\"text-align:center\">September 23, 2021</td><td id=\"pcXWS03005\" rowspan=\"1\" style=\"text-align:center\">XWS03005</td><td style=\"text-align:center\">0.399</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6A36C3\">Nandor and Nadja are excited to preside over their first Vampiric Council Tribunal, while Laszlo and Colin Robinson are invited to a \"boys' night\" with Sean and his friends. Nandor and Nadja cannot agree over which of them should sit on the Council leader's throne, so Guillermo convinces them to let him sit on it in disguise. Unfortunately, one of the vampires that they are charged with judging is Derek, a member of the Mosquito Club of amateur vampire hunters who was turned into a vampire during the group's first hunt and has been unknowingly breaking vampire rules of secrecy ever since, including the purchase of a hellhound (which looks like a normal dog, but can breathe fire). Nandor and Nadja sentence Derek to death, but Guillermo is plagued with guilt since he left Derek behind on the night that he was turned into a vampire, and helps him to escape from the execution chamber. Meanwhile, Sean confesses to Laszlo that he has become involved in a pyramid scheme focused on selling a special brand of pillows, and that he is being taken to small claims court by the man who sold him a large number of pillows after failing to repay him. Laszlo offers to help, and he and Colin Robinson become Sean's representatives in court: however, they are unsuccessful and Sean loses his case, prompting a despondent Laszlo to get drunk by feeding on a group of drunken businessmen. Guillermo recruits a drunken Laszlo to help him save Derek, convincing Laszlo to act as Derek's defense attorney and promising that Laszlo will help Derek to work off his sentence. Nandor and Nadja reluctantly agree, and Derek is put to work using hypnosis to sell Sean's pillows so that Sean can pay off his debt, while Guillermo adopts the hellhound.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep26\" style=\"text-align:center\">26</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Escape\"</td><td style=\"text-align:center\">Yana Gorskaya</td><td style=\"text-align:center\">Jake Bender &amp; Zach Dunn</td><td style=\"text-align:center\">September 30, 2021</td><td id=\"pcXWS03006\" rowspan=\"1\" style=\"text-align:center\">XWS03006</td><td style=\"text-align:center\">0.416</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6A36C3\">After Nadja forgets to put Nandor in charge of feeding the Sire, the ancient vampire becomes so hungry that it tunnels out of its cell and goes on a killing spree across the city. Nandor blames himself and holds a magical \"vampire press conference\" to explain the situation, but this only causes more panic due to the widely-held belief that if a vampire dies, so do all the vampires that they have created; therefore, if the Sire dies, all other vampires will die as well. Laszlo does not believe that theory, as it would mean that the Baron's death would have caused him and Nadja to die too, but he and Colin Robinson decide to confirm that by digging up the Baron's remains. Upon exhuming the body with Guillermo's help, they are surprised to discover that the Baron is actually still alive (although he has lost an arm and the lower half of his body), as he was revived by a bottle of blood that the vampires poured over his remains before burying him. However, Laszlo is alarmed by this, as it could mean that the theory is correct after all. As he is a vampire hunter, Guillermo offers to lead the hunt for the Sire. The Guide uses her network of \"Watchers” (living gargoyles) to trace the Sire to Queens, where the group are able to corner it inside a department store. Laszlo and Nandor each try to capture the Sire, but it easily overpowers them; however, the Baron then reveals that he can communicate with the Sire using an ancient vampire language. With the Baron acting as a translator, the vampires are able to pacify the Sire, and find a more comfortable home for it in <span>Nutley, New Jersey</span>, along with Guillermo's hellhound and the Baron.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep27\" style=\"text-align:center\">27</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Siren\"</td><td style=\"text-align:center\">Yana Gorskaya</td><td style=\"text-align:center\">Shana Gohd</td><td style=\"text-align:center\">October 7, 2021</td><td id=\"pcXWS03007\" rowspan=\"1\" style=\"text-align:center\">XWS03007</td><td style=\"text-align:center\">0.326</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6A36C3\">Nandor and Nadja decide to try a new approach to running the Council by leading on alternating days; however, this just creates more conflict between them. Due to the vampires' being much more busy, Nadja's ghost feels unappreciated and out of place due to their not spending any time with her, and ultimately decides to leave the house. Nadja is overcome with guilt when she finds out, and recruits Nandor and Guillermo to help track the ghost down. They trace her to a grocery store, where the ghost jumps from her old doll body into several new ones, before settling on an <span>inflatable union rat</span> and running off into the city. Meanwhile, Laszlo and Colin Robinson steal a boat to sail to <span>Plum Island</span>, after Colin Robinson finds an old map suggesting that information relating to his energy-vampire heritage can be found there. However, on the way there, they are drawn off-course by a strange song and run aground on a different island that is inhabited by a siren named Sheila, who captures them both and plans to eat them. Laszlo escapes by transforming into a bat, meets up with the other vampires, and convinces Guillermo to help him rescue Colin Robinson. After purchasing two pairs of noise-cancelling headphones at <span>Best Buy</span> with Guillermo's help, Laszlo returns to the island to find that Colin Robinson has apparently fallen in love with Sheila, but he rescues him anyway and escapes from the island; unfortunately, they leave some of the documentary crew behind. Back in the city, Nandor and Nadja track down Nadja's ghost and Nadja reconciles with the ghost, who transfers back into her doll body and agrees to return to the vampires' house.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep28\" style=\"text-align:center\">28</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Wellness Center\"</td><td style=\"text-align:center\">Yana Gorskaya</td><td style=\"text-align:center\"><span>Stefani Robinson</span></td><td style=\"text-align:center\">October 14, 2021</td><td id=\"pcXWS03008\" rowspan=\"1\" style=\"text-align:center\">XWS03008</td><td style=\"text-align:center\">0.287</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6A36C3\">The time comes for Nandor's annual \"Accession Day\" party, celebrating the anniversary of his becoming the Supreme Viceroy of his home country. Guillermo and the other vampires are all excited for the party, but they are dismayed to discover that Nandor has fallen into a bout of depression, which happens to many vampires due to the nature of their eternal lifespans. In an attempt to lift his spirits, Nadja convinces Nandor to get out of the house by sending him on a Vampiric Council errand to collect some overdue bills from a vampire named Jan, who runs a wellness center for other vampires. To Nandor's surprise, he learns that Jan and all the other vampires at the wellness center have removed their own fangs and claim to no longer be vampires. Jan claims that she and her followers (known as \"the Formerly Fanged\") are in the process of becoming human again, and offers to help Nandor do the same: he accepts, and decides to move out of the vampires' house. Guillermo pleads for Nandor to make him a vampire if he is going to leave, but Nandor reveals that he views vampirism as a curse and cares too much about Guillermo to subject him to it. One month later, Guillermo and the vampires are adjusting to life without Nandor, while Nandor is living as a human in the wellness center. Concerned about Nandor, Guillermo visits the wellness center to check on him; unfortunately, Jan discovers his presence and orders her followers to kill him. Guillermo is able to fight his way out and escapes with Nandor, taking him back to the vampires' house and locking him up in the basement so that Guillermo and the other vampires can \"deprogram\" him and undo Jan's brainwashing. Back at the wellness center, Jan's followers begin to lose faith in her due to Guillermo's attack, so she convinces them all to expose themselves to sunlight as the \"final step\" in rejecting vampirism, but the sunlight kills them all as Jan reveals that she still has her vampire powers and prepares to start recruiting again.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep29\" style=\"text-align:center\">29</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A Farewell\"</td><td style=\"text-align:center\">Tig Fong</td><td style=\"text-align:center\">Sam Johnson &amp; Stefani Robinson &amp; Marika Sawyer &amp; Paul Simms</td><td style=\"text-align:center\">October 21, 2021</td><td id=\"pcXWS03009\" rowspan=\"1\" style=\"text-align:center\">XWS03009</td><td style=\"text-align:center\">0.272</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6A36C3\">Nandor recovers from Jan's brainwashing, but is still furious at the others and berates them for the roles they have played in causing his depression. He then decides to enter a \"Super Slumber,\" the vampire equivalent of hibernation, which can last for hundreds of years. Nadja, Laszlo and Guillermo are horrified, while Colin Robinson is more upset because he believes Nandor is doing it to get out of attending his 100th birthday party. Nandor enters his Super Slumber shortly before the Guide arrives with a message from the Supreme Vampiric Council, informing the others that a delegation of vampires from the Old World will be arriving that night to inspect the progress that they have made. Since the delegates will be expecting to meet with both Nadja and Nandor, they are forced to awaken Nandor early, but he refuses to participate. When the delegates arrive, at Nandor's suggestion, Nadja claims that she killed him to become the sole leader of the local Council, but the delegates still insist on seeing Nandor's body for themselves. Guillermo is able to warn Nandor ahead of time, so he pretends to be dead when the delegates come in to examine him. Nandor goes back to sleep, while Laszlo annoys Nadja by insisting on making a lengthy speech for Colin Robinson's birthday. In private, Laszlo tells Nadja and Guillermo that the reason he has been so dedicated to celebrating Colin Robinson's birthday is because while he and Colin Robinson were researching energy vampires, he discovered that energy vampires have a life expectancy of exactly 100 years, meaning that Colin Robinson will die that night. Sure enough, Colin Robinson begins to feel sick and weak, so Guillermo, Laszlo and Nadja join him in the basement and wait for him to pass on. Guillermo wakes Nandor up again, wanting him to be present. Colin Robinson seemingly dies, but Nandor does not believe it, pointing out that Colin Robinson has faked his own death on numerous occasions. He tries to wake Colin Robinson up, but accidentally crushes his head in the process.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep30\" style=\"text-align:center\">30</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Portrait\"</td><td style=\"text-align:center\">Yana Gorskaya</td><td style=\"text-align:center\">Sam Johnson &amp; Stefani Robinson &amp; Paul Simms &amp; Lauren Wells</td><td style=\"text-align:center\">October 28, 2021</td><td id=\"pcXWS03010\" rowspan=\"1\" style=\"text-align:center\">XWS03010</td><td style=\"text-align:center\">0.375</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #6A36C3\">As part of their mourning process for Colin Robinson, the vampires commission a group portrait of Nandor, Nadja, Laszlo, Guillermo, Nadja's ghost, the Guide, the Baron, the Sire, and the hellhound. Guillermo tries to persuade the vampires to work through their grief in a healthier manner, but instead Nandor decides to leave Staten Island and travel the world in hopes of making a fresh start. Guillermo goes to Nadja for help, but she reveals that she has received an invitation from Viago to move to London and join the Supreme Vampiric Council, but she feels that while she wants to move there, she cannot go because Laszlo has vowed never to go back to England, due to his being expelled from a prestigious high-society group called the Sherwood Club. Laszlo reveals that the reason why he refuses to return to England is because he was expelled from the Sherwood Club for falling in love with Nadja, due to her perceived low social standing; however, he changes his mind upon discovering that Nadja could join the Supreme Vampiric Council, which would elevate them to the top of the social hierarchy. Guillermo is distraught and angrily confronts Nandor, resulting in a fight between them. Nandor reveals that the fight was a test, and offers to take Guillermo with him on his trip and to make him a vampire once they reach Nandor's ancestral homeland. Guillermo happily accepts and helps the vampires pack up their belongings. Nadja and Laszlo prepare to leave on a ship for England: Nadja is sealed into her coffin for the trip without incident, but Laszlo suddenly locks Guillermo in his coffin instead of entering it himself. Nandor waits at the train station for Guillermo, but is forced to depart alone when he does not show up, while Guillermo and Nadja are loaded onto the ship bound for London. In a letter to Nadja, Laszlo explains that he must stay behind on Staten Island for now, as he's discovered that a baby boy resembling Colin Robinson has burst out of Colin Robinson's dead body.</td></tr></tbody></table><h4>Season 4 (2022)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#A60F74;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#A60F74;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#A60F74\">Title</th><th scope=\"col\" style=\"background:#A60F74\">Directed by</th><th scope=\"col\" style=\"background:#A60F74\">Written by</th><th scope=\"col\" style=\"background:#A60F74\">Original air date</th><th scope=\"col\" style=\"background:#A60F74;width:7%\"><abbr title=\"Production\">Prod.</abbr><br>code</th><th scope=\"col\" style=\"background:#A60F74;width:10%\">U.S. viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep31\" style=\"text-align:center\">31</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Reunited\"</td><td style=\"text-align:center\"><span>Yana Gorskaya</span></td><td style=\"text-align:center\"><span>Stefani Robinson</span> &amp; <span>Paul Simms</span></td><td style=\"text-align:center\">July 12, 2022</td><td id=\"pcXWS04001\" rowspan=\"1\" style=\"text-align:center\">XWS04001</td><td style=\"text-align:center\">0.504</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #A60F74\">A year after the group has separated, Laszlo is revealed to be living with baby Colin (whom Laszlo refers to as Boy, as he does not see him as Colin Robinson), when he is reunited with Nadja and Nandor, both of whom have returned from their international trips. While the group talks about the house being in disrepair, Nadja is reminded that Guillermo is in one of the crates that she sent beforehand back to the U.S., which Guillermo has been stuck in for a week. Guillermo is upset, and has started to think he should prioritize himself above the vampires, but this plan is impeded when Nandor asks him to be his best man at his future wedding and he learns how unsafe the house is for Baby Colin. Nadja comes up with an idea to start a vampire nightclub to get the money to fix the house, while Guillermo decides to stay with the vampires until Nandor gets married and Baby Colin can be raised safely.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep32\" style=\"text-align:center\">32</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Lamp\"</td><td style=\"text-align:center\">Yana Gorskaya</td><td style=\"text-align:center\">Wally Baram &amp; Aasia LaShay Bullock</td><td style=\"text-align:center\">July 12, 2022</td><td id=\"pcXWS04002\" rowspan=\"1\" style=\"text-align:center\">XWS04002</td><td style=\"text-align:center\">0.385</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #A60F74\">Nandor reveals that he has been keeping treasures from his old village in the basement, which he hopes will impress future women. When Guillermo learns about the treasure, they discover a Djinn (<span>Anoop Desai</span>) in a genie lamp, who gives Nandor 52 wishes. Using the Djinn's power, Nandor decides to resurrect his 37 deceased wives so he can decide which he will remarry. Meanwhile, Nadja and Laszlo try to remake the old Vampiric Council facility into the nightclub, but the Guide is very resistant to their plans. Laszlo tries to use his psychology skills to discover why the Guide is afraid of change, and they discover that her current position is actually a punishment for her past reckless behavior as a vampire (including sleeping with Van Helsing, which explains her current attraction to Guillermo). Laszlo and Nadja ask Guillermo to seduce the Guide and convince her to support the nightclub's construction, which Guillermo agrees to as long as he gets to be the nightclub's accountant. The Guide ultimately agrees to help build the nightclub, but decides that she would rather just be friends with Guillermo. Meanwhile, Nandor has finally picked a wife for himself: Marwa (<span>Parisa Fakhri</span>).</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep33\" style=\"text-align:center\">33</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Grand Opening\"</td><td style=\"text-align:center\"><span>Kyle Newacheck</span></td><td style=\"text-align:center\"><span>Sam Johnson &amp; Chris Marcil</span></td><td style=\"text-align:center\">July 19, 2022</td><td id=\"pcXWS04003\" rowspan=\"1\" style=\"text-align:center\">XWS04003</td><td style=\"text-align:center\">0.234</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #A60F74\">The vampire nightclub is ready for its grand opening, and Nadja has invited famous vampire rapper Richie Suck (<span>Affion Crockett</span>) to perform for its first night, but Richie's controlling human familiar/manager Tom (<span>Fred Armisen</span>) refuses to let him perform. Baby Colin is rapidly growing and has now started his own Lego-based YouTube channel, while Guillermo and Laszlo bicker over his love of musical theatre until Laszlo accepts that he cannot change Baby Colin's interests. Meanwhile, Nandor worries that he may not be good enough for Marwa, so he decides to use one of his remaining wishes to obtain the world's largest penis. Guillermo helps him to work out the best possible phrasing of the wish, but due to Nandor's thanking Guillermo for his help while making the wish, the Djinn tricks them by adding an extra element to the wish that forces Nandor to think about Guillermo every time he engages in sex. At the nightclub opening, Nadja convinces Richie to kill Tom and return to his own style of performance, but this backfires when Richie reveals that he has recently developed a passion for stand-up comedy instead of singing. The attending crowd of vampires almost become violent, but Baby Colin defuses the situation by singing in Richie's place. Since Vampires share a love of child novelty acts, the nightclub opening is a massive success.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep34\" style=\"text-align:center\">34</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Night Market\"</td><td style=\"text-align:center\">Yana Gorskaya</td><td style=\"text-align:center\">William Meny &amp; Paul Simms</td><td style=\"text-align:center\">July 26, 2022</td><td id=\"pcXWS04004\" rowspan=\"1\" style=\"text-align:center\">XWS04004</td><td style=\"text-align:center\">0.339</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #A60F74\">Business at the vampire nightclub is going well thanks to Baby Colin's performances, but Nadja encounters a new problem when the nightclub's wraith workers decide to form a labor union. To try and solve the problem, she organizes a trip to the Night Market, a secret marketplace used by many types of supernatural creatures. While Nadja searches for a product that can help her deal with the wraiths, Laszlo takes the opportunity to educate Baby Colin on the ways of different supernatural cultures, and Nandor accidentally volunteers Guillermo to take part in a series of fights against other vampires' familiars. Guillermo wins all of the fights easily, but irritates the crowd by refusing to harm any of the other familiars. His last opponent is a powerful vampire, but Nandor steps in and volunteers to fight Guillermo himself instead, thereby protecting Guillermo from either dying or publicly killing a vampire. After a lengthy fight, Guillermo devises a plan for them to escape, and Nandor pretends to snap his neck so the match can end without either of them dying. Nadja succeeds in purchasing a substance known as \"water lily of the Nile,\" a powerful narcotic for wraiths, and uses it as leverage to bribe the wraiths' union leader, Xerxes; however, the other wraiths then kill him, so she reluctantly agrees to improve their working conditions.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep35\" style=\"text-align:center\">35</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Private School\"</td><td style=\"text-align:center\">Kyle Newacheck</td><td style=\"text-align:center\"><span>Ayo Edebiri</span> &amp; Shana Gohd</td><td style=\"text-align:center\">August 2, 2022</td><td id=\"pcXWS04005\" rowspan=\"1\" style=\"text-align:center\">XWS04005</td><td style=\"text-align:center\">0.391</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #A60F74\">Baby Colin is still growing quickly, and has begun wreaking havoc around the house. Guillermo suggests that they could solve the problem by enrolling him in school, so he can spend time with people his own age. The vampires' neighbor Sean recommends the private school that he went to, and arranges for them to have a meeting with the school's headmaster. After a lengthy interview process, in which the vampires repeatedly use their hypnosis to imitate a wide variety of family dynamics in the hopes of convincing the headmaster to accept Baby Colin into the school, they are ultimately successful. Guillermo is able to obtain a fake transcript for Baby Colin, but it's also revealed that he has been embezzling some of the nightclub's profits to help his family. The headmaster dies of a stroke due to having been hypnotized too many times, so Baby Colin is not accepted into the private school; instead, the vampires enroll him in a number of different local children's sports teams, as another way of giving him the social enrichment that he needs. Meanwhile, Nandor has been using some of the Djinn's wishes to try and improve his physical appearance so he can be more worthy of Marwa, but he ultimately decides that these alterations are pointless and uses another wish to revert his appearance back to normal.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep36\" style=\"text-align:center\">36</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Wedding\"</td><td style=\"text-align:center\">Tig Fong</td><td style=\"text-align:center\">Sam Johnson &amp; Sarah Naftalis &amp; Marika Sawyer &amp; Paul Simms</td><td style=\"text-align:center\">August 9, 2022</td><td id=\"pcXWS04009\" rowspan=\"1\" style=\"text-align:center\">XWS04009</td><td style=\"text-align:center\">0.372</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #A60F74\">Nandor and Marwa's wedding is approaching, but Nandor is nervous and convinced that somebody is trying to sabotage the wedding. Guillermo has tried to help as a best man, but has not slept for a week so Nadja and The Guide offer to help. They tell Nandor that his demands are too much so Nandor uses his three last wishes to fix the rest: restore the Baron's old body so that he can officiate the wedding; bring back a dodo bird to life so that the Wraiths can eat it at the wedding; and make Marwa like all the things that Nandor likes. Guillermo encounters his vampire friend Derek, who is now working at a convenience store, and invites him to the wedding. At the wedding, when the Baron starts his marriage liturgy, many people state reasons why they don't think Nandor and Marwa should get married. After an hour of this, Marwa admits that she had her own doubts and was thinking of cancelling the wedding, but decided to go through with it because she \"likes what Nandor likes.\" At the wedding reception, Nandor receives a miniature lamp from the Djinn as a gift, which only has three wishes. Nandor, uncomfortable with the fact that his wish changed Marwa's will, goes to see a sleeping Guillermo and covers him with a jacket.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep37\" style=\"text-align:center\">37</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Pine Barrens\"</td><td style=\"text-align:center\">Kyle Newacheck</td><td style=\"text-align:center\">Sarah Naftalis</td><td style=\"text-align:center\">August 16, 2022</td><td id=\"pcXWS04006\" rowspan=\"1\" style=\"text-align:center\">XWS04006</td><td style=\"text-align:center\">0.305</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #A60F74\">Sean invites Laszlo, Nandor, and Baby Colin to join him for a “guys’ weekend” at his hunting cabin in the New Jersey Pine Barrens. Unfortunately, this is complicated by the fact that Nandor and Laszlo have been bickering a lot recently. Their arguing eventually escalates to a fight, but they manage to reconcile after admitting that they’ve both missed spending time together. Sean is attacked by the <span>Jersey Devil</span>, but Baby Colin distracts it by playing Bon Jovi music, allowing Laszlo and Nandor to kill it. Meanwhile, Nadja and Guillermo plan to spend the weekend in their own ways: Nadja has a girls’ night with her doll, Marwa, and the Guide, while Guillermo invites his family over for dinner. Guillermo and Nadja pretend to be a couple to prevent his family from noticing anything odd, but things take a dangerous turn when Nadja’s presence awakens the vampire-hunting instincts in Guillermo’s relatives. While trying to protect Nadja, Guillermo admits that he wants to become a vampire and tells them that he is gay. Nadja hypnotizes Guillermo’s family to forget about everything relating to the vampires, but ensures that they remember Guillermo’s coming out, as they were fully supportive of him.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep38\" style=\"text-align:center\">38</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Go Flip Yourself\"</td><td style=\"text-align:center\">Yana Gorskaya</td><td style=\"text-align:center\">Marika Sawyer</td><td style=\"text-align:center\">August 23, 2022</td><td id=\"pcXWS04007\" rowspan=\"1\" style=\"text-align:center\">XWS04007</td><td style=\"text-align:center\">0.287</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #A60F74\">In an attempt to finally get the vampires’ mansion fixed, Laszlo signs the house up for an episode of <i>Go Flip Yourself</i>, a home-renovation show run by twin brothers Bran and Toby Daltry, in the hopes that they can rebuild the mansion. Nadja kills Toby when the brothers first enter the house, but the vampires hypnotize Bran and the rest of the crew to believe that he’s just sick. Despite Guillermo’s misgivings, the vampires agree to have the house renovated, and assist Bran’s crew with their work. When the time comes to reveal the results, however, the vampires are surprised and annoyed to discover that except for adding a couple of new rooms, Bran and his crew haven’t changed anything about the rest of the house. Bran then reveals himself as Simon the Devious, and explains that he and his vampire followers created <i>Go Flip Yourself</i> as a front just so he could eventually access the vampires’ house and steal Laszlo’s cursed witch-skin hat again, while Toby was just a regular human who Simon/Bran had been using as a cover. Simon and his crew escape with the hat, but the removal of the hat’s curse does slightly improve the conditions in the rest of the mansion. As Simon is filming his next episode at another house, the hat’s curse causes a gas explosion which destroys that house.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep39\" style=\"text-align:center\">39</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Freddie\"</td><td style=\"text-align:center\">DJ Stipsen</td><td style=\"text-align:center\">Jake Bender &amp; Zach Dunn</td><td style=\"text-align:center\">August 30, 2022</td><td id=\"pcXWS04009\" rowspan=\"1\" style=\"text-align:center\">XWS04009</td><td style=\"text-align:center\">0.356</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #A60F74\">The nightclub has continued to do well, even attracting some human celebrities as well as vampires. However, Nadja hits a snag when Laszlo insists on drawing up a contract for Baby Colin’s continued performances. When Nadja refuses to sign the contract, Laszlo removes Colin from the nightclub and takes him on tour, causing the club’s profits to drop. Nadja attempts to find a replacement for Colin, without success, while Colin’s tour ends badly when he suddenly grows into puberty. Meanwhile, Guillermo reveals that he started a relationship with a man named Freddie during his time in England, and invites Freddie to come and visit him for a weekend. Nandor develops a crush on Freddie, but he doesn’t want to cheat on Marwa, so he uses one of the Djinn’s three wishes to transform her into an exact copy of Freddie. Both couples spend the weekend wandering around New York, until Guillermo and the real Freddie discover what’s happened. Nandor uses hypnosis to calm the two Freddies down, but Guillermo is still angered by his trick. Freddie returns to England, leaving Guillermo downhearted. Remorseful over his actions, Nandor sends Marwa-Freddie off to follow his dream of traveling the world. Guillermo takes a trip to London so he can visit Freddie, but is heartbroken when he discovers that Freddie and Marwa-Freddie are now in a relationship.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep40\" style=\"text-align:center\">40</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Sunrise, Sunset\"</td><td style=\"text-align:center\">Kyle Newacheck</td><td style=\"text-align:center\">Paul Simms</td><td style=\"text-align:center\">September 6, 2022</td><td id=\"pcXWS04010\" rowspan=\"1\" style=\"text-align:center\">XWS04010</td><td style=\"text-align:center\">0.388</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"8\" style=\"border-bottom:solid 3px #A60F74\">Baby Colin has fully grown into an adult body, but he hasn't mentally matured yet and is behaving rebelliously, leaving Laszlo and Guillermo unsure of how to help him. They eventually deduce that he is an energy vampire like the original Colin Robinson, so Laszlo tells Colin about his origins and his true nature as an energy vampire. Meanwhile, Nadja and the Guide are struggling to keep the nightclub running, since Baby Colin was its main attraction. Running out of options, Nadja attempts to burn down the nightclub, but the club's blood sprinklers mean that only her office is burned, destroying the money that she had been hiding there, while it's also revealed that the club has no insurance. Colin continues smashing holes in the walls of his old room, until he finds a series of clues that lead him to a secret room hidden behind one of the walls, which is full of old diaries and clothes that were left behind by the original Colin. Colin reads all of the diaries, which causes him to regain the appearance and memories of the original Colin Robinson. Since the original Colin Robinson was in charge of the vampires' bank accounts, this means that they can finally get the money they need to repair the house; however, Colin has forgotten the year that he lived as \"Baby Colin,\" saddening Laszlo. With Marwa gone and Colin grown up, Guillermo finds himself disillusioned with his life as a familiar. After talking with Nandor and realizing that life in the vampires' house is never really going to change, he decides to leave, taking all the money that he had embezzled from the club. He visits Derek at the convenience store, gives him a suitcase full of money, and asks Derek to turn him into a vampire.</td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>On January 22, 2018, it was announced that FX had given the production a pilot order. The pilot was written by Jemaine Clement and directed by Taika Waititi, both of whom are also executive producers alongside Scott Rudin, Paul Simms, Garrett Basch, and Eli Bush. On May 3, 2018, it was announced that FX had given the production a series order for a first season consisting of ten episodes, which premiered on March 27, 2019.</p><p>According to Clement: \"We stay pretty basic '70s/'80s vampire rules, with a little bit of '30s. They can turn into bats. They can't go in the sunlight; they don't sparkle in the sun, they die. They have to be invited in; in a lot of literature vampires have to be invited into private buildings, but this is a documentary so it's the real rules which means they have to be invited into any building.\" Clement has also stated that the part of Laszlo was written specifically for Berry. The main influences on the series are Fright Night, Martin, The Lost Boys, Nosferatu, Interview with the Vampire, Vampire's Kiss, and Bram Stoker's Dracula. The character Nadja was named after the 1994 film of the same name.</p><p>The song used in the opening credits is \"You're Dead\" by Norma Tanega (1966), which was used during the opening credits sequence in the original film.</p><p>The second season premiered on April 15, 2020. On May 22, 2020, FX renewed the series for a third season, which premiered on September 2, 2021. On August 13, 2021, FX renewed the series for a fourth season, ahead of the third season premiere. Upon the fourth season's renewal, it was reported that Rudin would no longer be an executive producer, beginning with the third season, due to allegations of abusive behavior. On June 6, 2022, FX renewed the series for a fifth and sixth season, ahead of the fourth season premiere.</p><h4>Filming</h4><p>Principal photography for the first season took place from October 22 to December 18, 2018, in Toronto, Ontario. Filming for the third season began on February 8, 2021, and finished on May 3, 2021.</p><p>The writer/producer Paul Simms said that series does not use CGI effects: \"There's no fully digital characters or anything like that. One of the movies we really talked about a lot when we were conceiving the show was Francis Ford Coppola's Dracula where he went back to really doing as many effects as possible in camera and figuring out ways to do that. One of my favorite supernatural moments is completely in camera. It's where Beanie Feldstein's character is walking along in the park and Nadja appears walking next to her. That was all just done completely the old fashioned way where Natasia was hiding behind a tree and the camera was tracking along and at the right moment, she walked out from behind a tree. I think there's something about that old fashioned way that makes things more interesting than when you can tell it's digital and rubbery and fake looking\".</p><p>Among the cinematographers D.J. Stipsen and Christian Sprenger's influences for the series was the work of Michael Ballhaus and production designer Thomas E. Sanders on the Coppola-directed Bram Stoker's Dracula: \"We referenced that film for the general sumptuousness of the vampires' mansion, which was our main set. Our take, however, was that the Staten Island vampires have let their place go. The former glory is evident but now exists in a worn, faded and distressed state. Production designer Kate Bunch and I had a lot of conversations about striking the right balance between sumptuousness and neglect. There are strong reds, but also yellow that has faded to the point of being a warm brown.\"</p><br/><h3>Release</h3><h4>Marketing</h4><p>On October 31, 2018, a series of teaser trailers for the series were released. On January 10, 2019, another teaser trailer was released. On February 4, 2019, the official trailer for the series was released.</p><h4>Premiere</h4><p>On October 7, 2018, the series held a panel at the annual New York Comic Con moderated by Rolling Stone's Alan Sepinwall and featuring co-creators Taika Waititi and Jemaine Clement, along with fellow executive producer Paul Simms. Before the panel began, the first episode of the series was screened for the audience. The world premiere for the series was screened during the 2019 South by Southwest film festival in Austin, Texas as a part of the festival's \"Episodic Premieres\" series.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>The first season received acclaim from critics. On the review aggregator Rotten Tomatoes, the first season has an approval rating of 94%, based on 71 reviews, with an average rating of 7.8/10. The website's critical consensus reads, \"Delightfully absurd and ridiculously fun, What We Do in the Shadows expands on the film's vampiric lore and finds fresh perspective in its charming, off-kilter cast to create a mockumentary series worth sinking your teeth into.\" On Metacritic, it has a weighted average score of 80 out of 100, based on 30 critics, indicating \"generally favorable reviews\".</p><p>The second season also received critical acclaim. On Rotten Tomatoes, the second season has an approval rating of 98%, based on 44 reviews, with an average rating of 8.3/10. The website's critical consensus reads, \"Bat! What We Do In the Shadows loses no steam in a smashing second season that savvily expands its supernatural horizons while doubling down on the fast flying fun.\" On Metacritic, it has a weighted average score of 79 out of 100, based on 11 critics, indicating \"generally favorable reviews\".</p><p>The third season also received universal acclaim from critics. On Rotten Tomatoes, the third season has an approval rating of 100%, based on 28 reviews, with an average rating of 9/10. The website's critical consensus reads, \"Carried on the wings of its cast's incredible chemistry and the strongest writing of the series so far, What We Do in the Shadows' third season is scary good.\" On Metacritic, the third season has an average score of 96 out of 100, based on 11 critics, indicating \"universal acclaim\".</p><p>The fourth season also received universal acclaim from critics. On Rotten Tomatoes, the fourth season has an approval rating of 100%, based on 29 reviews, with an average rating of 8.7/10. The website's critical consensus reads, \"Aside from turning this demonic household into Three Vampires and a Baby, What We Do in the Shadows doubles down on what it does best without drastically changing the formula – and remains fang-tastic all the same.\" On Metacritic, the fourth season has an average score of 84 out of 100, based on 8 critics, indicating \"universal acclaim\". However, some critics complained of the reductive treatment of Nandor's wife, Marwa, in season 4. Comic Book Resources complained of the show \"stripping a woman of her identity – physically and mentally – for laughs\" and The Mary Sue stated that \"What We Do in the Shadows missed hard with its treatment of Marwa.\"</p><h4>Ratings</h4><h4>Season 1</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per episode of <i>What We Do in the Shadows</i></span></caption><tbody><tr><th scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\">Title</th><th scope=\"col\">Air date</th><th scope=\"col\" data-sort-type=\"number\"><span class=\"mw-redirect\">Rating</span><br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">DVR<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">DVR viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">Total<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Total viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\">1</th><td style=\"text-align:left\">\"<span>Pilot</span>\"</td><td style=\"text-align:left\">March 27, 2019</td><td>0.2</td><td>0.617</td><td>0.4</td><td>0.938</td><td>0.6</td><td>1.556</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">2</th><td style=\"text-align:left\">\"<span>City Council</span>\"</td><td style=\"text-align:left\">April 3, 2019</td><td>0.3</td><td>0.658</td><td>0.2</td><td>0.599</td><td>0.5</td><td>1.257</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">3</th><td style=\"text-align:left\">\"<span>Werewolf Feud</span>\"</td><td style=\"text-align:left\">April 10, 2019</td><td>0.1</td><td>0.305</td><td>0.3</td><td>0.637</td><td>0.4</td><td>0.943</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">4</th><td style=\"text-align:left\">\"<span>Manhattan Night Club</span>\"</td><td style=\"text-align:left\">April 17, 2019</td><td>0.2</td><td>0.439</td><td>0.3</td><td>0.699</td><td>0.5</td><td>1.139</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">5</th><td style=\"text-align:left\">\"<span>Animal Control</span>\"</td><td style=\"text-align:left\">April 24, 2019</td><td>0.1</td><td>0.320</td><td>0.3</td><td>0.700</td><td>0.4</td><td>1.021</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">6</th><td style=\"text-align:left\">\"<span>Baron's Night Out</span>\"</td><td style=\"text-align:left\">May 1, 2019</td><td>0.2</td><td>0.418</td><td>0.2</td><td>0.563</td><td>0.4</td><td>0.982</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">7</th><td style=\"text-align:left\">\"<span>The Trial</span>\"</td><td style=\"text-align:left\">May 8, 2019</td><td>0.2</td><td>0.527</td><td>0.4</td><td>0.709</td><td>0.6</td><td>1.237</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">8</th><td style=\"text-align:left\">\"<span>Citizenship</span>\"</td><td style=\"text-align:left\">May 15, 2019</td><td>0.2</td><td>0.522</td><td>0.3</td><td>0.636</td><td>0.5</td><td>1.159</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">9</th><td style=\"text-align:left\">\"<span>The Orgy</span>\"</td><td style=\"text-align:left\">May 22, 2019</td><td>0.2</td><td>0.434</td><td>0.3</td><td>0.727</td><td>0.5</td><td>1.162</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">10</th><td style=\"text-align:left\">\"<span>Ancestry</span>\"</td><td style=\"text-align:left\">May 29, 2019</td><td>0.2</td><td>0.427</td><td>0.3</td><td>0.676</td><td>0.5</td><td>1.104</td></tr></tbody></table><h4>Season 2</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per episode of <i>What We Do in the Shadows</i></span></caption><tbody><tr><th scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\">Title</th><th scope=\"col\">Air date</th><th scope=\"col\" data-sort-type=\"number\"><span class=\"mw-redirect\">Rating</span><br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">DVR<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">DVR viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">Total<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Total viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\">1</th><td style=\"text-align:left\">\"<span>Resurrection</span>\"</td><td style=\"text-align:left\">April 15, 2020</td><td>0.2</td><td>0.537</td><td>0.2</td><td>0.543</td><td>0.4</td><td>1.080</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">2</th><td style=\"text-align:left\">\"<span>Ghosts</span>\"</td><td style=\"text-align:left\">April 15, 2020</td><td>0.2</td><td>0.409</td><td>0.1</td><td>0.506</td><td>0.3</td><td>0.915</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">3</th><td style=\"text-align:left\">\"<span>Brain Scramblies</span>\"</td><td style=\"text-align:left\">April 22, 2020</td><td>0.2</td><td>0.566</td><td>0.2</td><td>0.520</td><td>0.4</td><td>1.086</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">4</th><td style=\"text-align:left\">\"<span>The Curse</span>\"</td><td style=\"text-align:left\">April 29, 2020</td><td>0.2</td><td>0.618</td><td>0.2</td><td>0.446</td><td>0.4</td><td>1.064</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">5</th><td style=\"text-align:left\">\"<span>Colin's Promotion</span>\"</td><td style=\"text-align:left\">May 6, 2020</td><td>0.2</td><td>0.378</td><td>0.2</td><td>0.545</td><td>0.4</td><td>0.923</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">6</th><td style=\"text-align:left\">\"<span>On the Run</span>\"</td><td style=\"text-align:left\">May 13, 2020</td><td>0.2</td><td>0.436</td><td>0.2</td><td>0.601</td><td>0.4</td><td>1.037</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">7</th><td style=\"text-align:left\">\"<span>The Return</span>\"</td><td style=\"text-align:left\">May 20, 2020</td><td>0.2</td><td>0.377</td><td>0.2</td><td>0.605</td><td>0.4</td><td>0.982</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">8</th><td style=\"text-align:left\">\"<span>Collaboration</span>\"</td><td style=\"text-align:left\">May 27, 2020</td><td>0.2</td><td>0.443</td><td>0.2</td><td>0.562</td><td>0.4</td><td>1.005</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">9</th><td style=\"text-align:left\">\"<span>Witches</span>\"</td><td style=\"text-align:left\">June 3, 2020</td><td>0.2</td><td>0.433</td><td>0.1</td><td>0.489</td><td>0.3</td><td>0.922</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">10</th><td style=\"text-align:left\">\"<span>Nouveau Théâtre des Vampires</span>\"</td><td style=\"text-align:left\">June 10, 2020</td><td>0.2</td><td>0.406</td><td>0.2</td><td>0.557</td><td>0.4</td><td>0.963</td></tr></tbody></table><h4>Season 3</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per episode of <i>What We Do in the Shadows</i></span></caption><tbody><tr><th scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\">Title</th><th scope=\"col\">Air date</th><th scope=\"col\" data-sort-type=\"number\"><span class=\"mw-redirect\">Rating</span><br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">DVR<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">DVR viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">Total<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Total viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\">1</th><td style=\"text-align:left\">\"<span>The Prisoner</span>\"</td><td style=\"text-align:left\">September 2, 2021</td><td>0.2</td><td>0.498</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">2</th><td style=\"text-align:left\">\"<span>The Cloak of Duplication</span>\"</td><td style=\"text-align:left\">September 2, 2021</td><td>0.2</td><td>0.448</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">3</th><td style=\"text-align:left\">\"<span>Gail</span>\"</td><td style=\"text-align:left\">September 9, 2021</td><td>0.1</td><td>0.311</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">4</th><td style=\"text-align:left\">\"<span>The Casino</span>\"</td><td style=\"text-align:left\">September 16, 2021</td><td>0.1</td><td>0.462</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">5</th><td style=\"text-align:left\">\"<span>The Chamber of Judgement</span>\"</td><td style=\"text-align:left\">September 23, 2021</td><td>0.1</td><td>0.399</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">6</th><td style=\"text-align:left\">\"<span>The Escape</span>\"</td><td style=\"text-align:left\">September 30, 2021</td><td>0.2</td><td>0.416</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">7</th><td style=\"text-align:left\">\"<span>The Siren</span>\"</td><td style=\"text-align:left\">October 7, 2021</td><td>0.2</td><td>0.326</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">8</th><td style=\"text-align:left\">\"<span>The Wellness Center</span>\"</td><td style=\"text-align:left\">October 14, 2021</td><td>0.1</td><td>0.287</td><td>0.2</td><td>0.490</td><td>0.3</td><td>0.777</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">9</th><td style=\"text-align:left\">\"<span>A Farewell</span>\"</td><td style=\"text-align:left\">October 21, 2021</td><td>0.1</td><td>0.272</td><td>0.2</td><td>0.540</td><td>0.3</td><td>0.812</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">10</th><td style=\"text-align:left\">\"<span>The Portrait</span>\"</td><td style=\"text-align:left\">October 28, 2021</td><td>0.2</td><td>0.375</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td></tr></tbody></table><h4>Season 4</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1152813436\"><span class=\"sr-only\">Viewership and ratings per episode of <i>What We Do in the Shadows</i></span></caption><tbody><tr><th scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\">Title</th><th scope=\"col\">Air date</th><th scope=\"col\" data-sort-type=\"number\"><span class=\"mw-redirect\">Rating</span><br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">DVR<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">DVR viewers<br>(millions)</th><th scope=\"col\" data-sort-type=\"number\">Total<br><span class=\"nowrap\">(18–49)</span></th><th scope=\"col\" data-sort-type=\"number\">Total viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\">1</th><td style=\"text-align:left\">\"<span>Reunited</span>\"</td><td style=\"text-align:left\">July 12, 2022</td><td>0.2</td><td>0.504</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">2</th><td style=\"text-align:left\">\"<span>The Lamp</span>\"</td><td style=\"text-align:left\">July 12, 2022</td><td>0.2</td><td>0.385</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">3</th><td style=\"text-align:left\">\"<span>The Grand Opening</span>\"</td><td style=\"text-align:left\">July 19, 2022</td><td>0.1</td><td>0.234</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">4</th><td style=\"text-align:left\">\"<span>The Night Market</span>\"</td><td style=\"text-align:left\">July 26, 2022</td><td>0.1</td><td>0.339</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">5</th><td style=\"text-align:left\">\"<span>Private School</span>\"</td><td style=\"text-align:left\">August 2, 2022</td><td>0.1</td><td>0.391</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">6</th><td style=\"text-align:left\">\"<span>The Wedding</span>\"</td><td style=\"text-align:left\">August 9, 2022</td><td>0.1</td><td>0.372</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">7</th><td style=\"text-align:left\">\"<span>Pine Barrens</span>\"</td><td style=\"text-align:left\">August 16, 2022</td><td>0.1</td><td>0.305</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">8</th><td style=\"text-align:left\">\"<span>Go Flip Yourself</span>\"</td><td style=\"text-align:left\">August 23, 2022</td><td>0.1</td><td>0.287</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">9</th><td style=\"text-align:left\">\"<span>Freddie</span>\"</td><td style=\"text-align:left\">August 30, 2022</td><td>0.1</td><td>0.356</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr><tr><th scope=\"row\" style=\"text-align:center;\">10</th><td style=\"text-align:left\">\"<span>Sunrise, Sunset</span>\"</td><td style=\"text-align:left\">September 6, 2022</td><td>0.1</td><td>0.388</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBD</td></tr></tbody></table><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Association</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th class=\"unsortable\"><abbr title=\"Reference(s)\">Ref.</abbr></th></tr><tr><td align=\"center\" rowspan=\"4\">2019</td><td rowspan=\"2\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span class=\"mw-redirect\">Outstanding Cinematography for a Single-Camera Series (Half-Hour)</span></td><td>DJ Stipsen <small>(for \"Manhattan Night Club\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Outstanding Sound Editing for a Comedy or Drama Series (Half-Hour)</span></td><td>David Barbee, Angelina Faulkner, Steve Griffen, Sam Lewis, John Guentner, and Ginger Geary <small>(for \"Werewolf Feud\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Saturn Awards</span></td><td><span>Best Horror Television Series</span></td><td rowspan=\"2\"><i>What We Do in the Shadows</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>TCA Awards</span></td><td><span>Outstanding New Program</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\" rowspan=\"11\">2020</td><td><span>Hollywood Critics Association Midseason Awards</span></td><td>Best Cable Network Series (New or Recurring)</td><td><i>What We Do in the Shadows</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"4\"><span>Primetime Emmy Awards</span></td><td><span>Outstanding Comedy Series</span></td><td><span>Jemaine Clement</span>, <span>Taika Waititi</span>, <span>Paul Simms</span>, <span>Scott Rudin</span>, <span>Garrett Basch</span>, <span>Eli Bush</span>, <span>Stefani Robinson</span>, Sam Johnson, and Derek S. Rappaport</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"8\" align=\"center\"></td></tr><tr><td rowspan=\"3\"><span>Outstanding Writing for a Comedy Series</span></td><td><span>Sam Johnson and Chris Marcil</span> <small>(for \"Collaboration\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Stefani Robinson <small>(for \"On the Run\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Paul Simms <small>(for \"Ghosts\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Casting for a Comedy Series</span></td><td>Gayle Keller, Jenny Lewis, and Sara Kay</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Single-Camera Picture Editing for a Comedy Series</span></td><td><span>Yana Gorskaya</span> and Dane McMaster <small>(for \"Resurrection\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Production Design for a Narrative Program (Half-Hour)</span></td><td>Kate Bunch, Aleks Cameron, and Shayne Fox <small>(for \"Resurrection\", \"Collaboration\", \"Witches\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Sound Editing for a Comedy or Drama Series (Half-Hour) and Animation</td><td>Steffan Falesitch, David Barbee, Angelina Faulkner, Steve Griffen, Sam C. Lewis, John Guentner, and Ellen Heuer <small>(for \"The Return\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>TCA Awards</span></td><td><span>Outstanding Achievement in Comedy</span></td><td><i>What We Do in the Shadows</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span class=\"mw-redirect\">Writers Guild of America Awards</span></td><td><span>New Series</span></td><td><span>Jesse Armstrong</span>, <span>Sam Bain</span>, Jemaine Clement, <span>Josh Lieb</span>, <span>Iain Morris</span>, Stefani Robinson, <span>Duncan Sarkies</span>, Marika Sawyer, <span>Tom Scharpling</span>, Paul Simms, and Taika Waititi</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"20\" align=\"center\">2021</td><td><span>AACTA International Awards</span></td><td>Best Comedy Series</td><td><i>What We Do in the Shadows</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\"><span>American Cinema Editors Awards</span></td><td rowspan=\"2\"><span>Best Edited Comedy Series for Commercial Television</span></td><td>Dane McMaster and Varun Viswanath <small>(for \"On the Run\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td>Yana Gorskaya and Dane McMaster <small>(for \"Resurrection\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Art Directors Guild Awards</span></td><td><span>Excellence in Production Design for a Half Hour Single-Camera Television Series</span></td><td>Kate Bunch <small>(for \"Resurrection\", \"Collaboration\" and \"Witches\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Casting Society of America</span></td><td>Television Series – Comedy</td><td>Gayle Keller, Jenny Lewis, Sara Kay, and Emer O'Callaghan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Costume Designers Guild Awards</span></td><td><span>Excellence in Sci-Fi/Fantasy Television</span></td><td>Amanda Neale <small>(for \"Nouveau Théâtre des Vampires\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"3\"><span>Critics' Choice Super Awards</span></td><td><span>Best Science Fiction/Fantasy Series</span></td><td><i>What We Do in the Shadows</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" align=\"center\"></td></tr><tr><td>Best Actor in a Science Fiction/Fantasy Series</td><td><span>Kayvan Novak</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress in a Science Fiction/Fantasy Series</span></td><td><span>Natasia Demetriou</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\"><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td><span>Best Comedy Series</span></td><td><i>What We Do in the Shadows</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"5\" align=\"center\"></td></tr><tr><td><span>Best Actor in a Comedy Series</span></td><td><span>Matt Berry</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress in a Comedy Series</span></td><td>Natasia Demetriou</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Best Supporting Actor in a Comedy Series</span></td><td><span>Harvey Guillén</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Mark Proksch</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Producers Guild of America Awards</span></td><td><span>Danny Thomas Award for Outstanding Producer of Episodic Television – Comedy</span></td><td>Jemaine Clement, Taika Waititi, Paul Simms, Scott Rudin, Garrett Basch, Eli Bush, Stefani Robinson, Sam Johnson, Marika Sawyer, and Derek S. Rappaport</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Satellite Awards</span></td><td><span>Best Television Series – Musical or Comedy</span></td><td><i>What We Do in the Shadows</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"3\"><span>Saturn Awards</span></td><td><span>Best Horror Television Series</span></td><td><i>What We Do in the Shadows</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" align=\"center\"></td></tr><tr><td><span>Best Supporting Actress on Television</span></td><td>Natasia Demetriou</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Guest Performance on a Television Series</span></td><td><span>Mark Hamill</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Comedy Series</span></td><td>Jake Bender, Jemaine Clement, Zach Dunn, <span>Joe Furey</span>, Shana Gohd, Sam Johnson, Chris Marcil, William Meny, Sarah Naftalis, Stefani Robinson, Marika Sawyer, and Paul Simms</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"27\" style=\"text-align:center;\">2022</td><td rowspan=\"3\"><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td><span>Best Comedy Series</span></td><td><i>What We Do in the Shadows</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" align=\"center\"></td></tr><tr><td><span>Best Actor in a Comedy Series</span></td><td>Kayvan Novak</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor in a Comedy Series</span></td><td>Harvey Guillén</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Comedy Series</span></td><td>Jake Bender, Jemaine Clement, Zach Dunn, Shana Gohd, Sam Johnson, Chris Marcil, William Meny, Sarah Naftalis, Stefani Robinson, Marika Sawyer, Paul Simms, and Lauren Well</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\"><span>Costume Designers Guild Awards</span></td><td><span>Excellence in Period Television</span></td><td>Laura Montgomery <small>(for \"The Wellness Centre\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" align=\"center\"></td></tr><tr><td><span>Excellence in Sci-Fi/Fantasy Television</span></td><td>Laura Montgomery <small>(for \"Gail\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Art Directors Guild Awards</span></td><td><span>Excellence in Production Design for a Half Hour Single-Camera Television Series</span></td><td>Kate Bunch <small>(for \"The Prisoner\", \"The Cloak of Duplication\", \"The Siren\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Golden Reel Awards</span></td><td>Outstanding Achievement in Sound Editing – 1/2 Hour – Comedy or Drama</td><td>Steffan Falesitch, David Barbee, Chris Kahwaty, John Guentner, Sam Lewis, Ellen Heuer, and Steve Griffen <small>(for \"The Escape\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Cinema Audio Society Awards</span></td><td><span>Outstanding Achievement in Sound Mixing for Television Series – Half Hour</span></td><td>Rob Beal, Diego Gat, Samuel Ejnes, Mike Tehrani, and Stacey Michaels <small>(for \"The Casino\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"8\"><span>Hollywood Critics Association TV Awards</span></td><td>Best Cable Series, Comedy</td><td><i>What We Do in the Shadows</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"8\" align=\"center\"></td></tr><tr><td rowspan=\"2\">Best Actor in a Broadcast Network or Cable Series, Comedy</td><td>Kayvan Novak</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Matt Berry</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Actress in a Broadcast Network or Cable Series, Comedy</td><td>Natasia Demetriou</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actor in a Broadcast Network or Cable Series, Comedy</td><td>Harvey Guillén</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actress in a Broadcast Network or Cable Series, Comedy</td><td><span>Kristen Schaal</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Directing in a Broadcast Network or Cable Series, Comedy</td><td><span>Yana Gorskaya</span> <span style=\"font-size:85%;\">(for \"The Wellness Center\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Writing in a Broadcast Network or Cable Series, Comedy</td><td>Stefani Robinson <span style=\"font-size:85%;\">(for \"The Wellness Center\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Primetime Emmy Awards</span></td><td>Outstanding Comedy Series</td><td>Jemaine Clement, Taika Waititi, Paul Simms, Garrett Basch, Eli Bush, Stefani Robinson, Sam Johnson, Yana Gorskaya, <span>Kyle Newacheck</span>, Marika Sawyer, Ingrid Lageder, and Derek S. Rappaport</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"7\" align=\"center\"></td></tr><tr><td rowspan=\"2\">Outstanding Writing for a Comedy Series</td><td>Sarah Naftalis <span style=\"font-size:85%;\">(for \"The Casino\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Stefani Robinson <span style=\"font-size:85%;\">(for \"The Wellness Center\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Fantasy/Sci-Fi Costumes</span></td><td>Laura Montgomery, Judy Laukkanen, and Barbara Cardoso</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Sound Editing for a Comedy or Drama Series (Half-Hour) and Animation</td><td>Steffan Falesitch, Chris Kahwaty, David Barbee, John Guentner, Sam Lewis, Steve Griffen, and Ellen Heuer <span style=\"font-size:85%;\">(for \"The Escape\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Sound Mixing for a Comedy or Drama Series (Half-Hour) and Animation</span></td><td>Diego Gat, Sam Ejnes, and Rob Beal <span style=\"font-size:85%;\">(for \"The Casino\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Stunt Coordination for a Comedy Series or Variety Program</span></td><td>Tig Fong and JF Lachapelle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Imagen Awards</span></td><td>Best Supporting Actor – Comedy (Television)</td><td>Harvey Guillén</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\"><span>Saturn Awards</span></td><td><span>Best Network or Cable Horror Television Series</span></td><td><i>What We Do in the Shadows</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td><span>Best Supporting Actor in a Network or Cable Television Series</span></td><td><span>Harvey Guillén</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\" align=\"center\">2023</td><td><span>Art Directors Guild Awards</span></td><td><span>Excellence in Production Design for a Half Hour Single-Camera Television Series</span></td><td>Shayne Fox <span style=\"font-size:85%;\">(for \"The Grand Opening\"; \"The Night Market\"; \"Pine Barrens\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Costume Designers Guild Awards</span></td><td><span>Excellence in Sci-Fi/Fantasy Television</span></td><td>Laura Montgomery <span style=\"font-size:85%;\">(for \"The Wedding\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Cinema Audio Society Awards</span></td><td><span>Outstanding Achievement in Sound Mixing for Television Series – Half Hour</span></td><td>Rob Beal, Sam Ejnes, Diego Gat, Marc Fishman, Stacey Michaels <span style=\"font-size:85%;\">(for \"Pine Barrens\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>GLAAD Media Awards</span></td><td><span>Outstanding Comedy Series</span></td><td><i>What We Do in the Shadows</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}